-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 opened on:   1 Mar 2021, 22:34:05

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   297,362      3,994 |   301,356 
             |     98.67       1.33 |    100.00 
-------------+----------------------+----------
warfarin use |    93,125        778 |    93,903 
             |     99.17       0.83 |    100.00 
-------------+----------------------+----------
       Total |   390,487      4,772 |   395,259 
             |     98.79       1.21 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood = -61107.184
Iteration 1:   log likelihood = -61054.986
Iteration 2:   log likelihood = -61054.431
Iteration 3:   log likelihood = -61054.431
Refining estimates:
Iteration 0:   log likelihood = -61054.431

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,254
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(1)       =      105.51
Log likelihood  =   -61054.431                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6797823   .0266493    -9.85   0.000     .6295069    .7340729
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_univ
> ar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood = -61107.184
Iteration 1:   log likelihood = -60456.571
Iteration 2:   log likelihood = -60329.425
Iteration 3:   log likelihood =  -60327.13
Iteration 4:   log likelihood = -60327.129
Refining estimates:
Iteration 0:   log likelihood = -60327.129

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,254
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(5)       =     1560.11
Log likelihood  =   -60327.129                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6521064   .0256369   -10.88   0.000     .6037462    .7043403
      1.male |   1.149077   .0342212     4.67   0.000     1.083924    1.218145
        age1 |   .9705302   .0056477    -5.14   0.000     .9595238    .9816628
        age2 |   1.121121   .0116185    11.03   0.000     1.098579    1.144125
        age3 |   .6369216   .0406701    -7.06   0.000      .561996    .7218362
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood = -24673.068
Iteration 1:   log likelihood = -23382.236
Iteration 2:   log likelihood = -22803.772
Iteration 3:   log likelihood = -22800.007
Iteration 4:   log likelihood = -22800.006
Refining estimates:
Iteration 0:   log likelihood = -22800.006

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,254
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(27)      =     3746.12
Log likelihood  =   -22800.006                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7103024   .0288559    -8.42   0.000     .6559389    .7691715
      1.male |   1.229729   .0390597     6.51   0.000     1.155507    1.308717
        age1 |   .9755547   .0059181    -4.08   0.000      .964024    .9872232
        age2 |   1.118452   .0119283    10.50   0.000     1.095315    1.142077
        age3 |   .5726475    .037343    -8.55   0.000     .5039408    .6507216
             |
         imd |
          2  |   1.108922   .0609598     1.88   0.060     .9956539    1.235075
          3  |   1.202987   .0671021     3.31   0.001     1.078403    1.341963
          4  |   1.297581    .074805     4.52   0.000     1.158946      1.4528
5 most de..  |   1.478881   .0865074     6.69   0.000     1.318688    1.658534
             |
   obese4cat |
Obese I ..)  |   .9861846   .0392286    -0.35   0.727     .9122188    1.066148
Obese II..)  |   1.195727   .0670251     3.19   0.001     1.071319    1.334581
Obese II..)  |   1.340524   .1015954     3.87   0.000     1.155484    1.555197
             |
smoke_nomiss |
     Former  |   1.193794   .0392782     5.38   0.000      1.11924    1.273315
    Current  |    1.00064   .0763759     0.01   0.993     .8616054    1.162111
             |
     diabcat |
Controlle..  |   1.206774    .042806     5.30   0.000     1.125726    1.293658
Uncontrol..  |   1.564071   .0755451     9.26   0.000     1.422798    1.719372
Diabetes,..  |   .8852872   .2325056    -0.46   0.643     .5290913    1.481282
             |
1.myocardi~t |   1.105555   .0476976     2.33   0.020     1.015913    1.203107
       1.pad |    1.33561   .0711811     5.43   0.000     1.203136    1.482669
1.hyperten~n |   1.031169   .0365255     0.87   0.386     .9620086    1.105301
1.heart_f~re |   1.280118   .0404847     7.81   0.000     1.203179    1.361978
1.stroke_tia |   1.179503   .0389112     5.00   0.000     1.105652    1.258287
       1.vte |   1.400633    .065152     7.24   0.000     1.278585     1.53433
 1.oestrogen |   1.049219   .2385187     0.21   0.833     .6719895     1.63821
1.flu_vac~ne |   .8169505   .0302957    -5.45   0.000     .7596786    .8785401
1.antiplat~t |   1.014716   .0617501     0.24   0.810     .9006276    1.143258
1.care_ho~ce |   6.819807   .2936618    44.58   0.000     6.267859    7.420359
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood = -24673.068
Iteration 1:   log likelihood = -23091.324
Iteration 2:   log likelihood = -22444.375
Iteration 3:   log likelihood = -22440.437
Iteration 4:   log likelihood = -22440.436
Refining estimates:
Iteration 0:   log likelihood = -22440.436

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,254
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(34)      =     4465.26
Log likelihood  =   -22440.436                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7786613   .0317744    -6.13   0.000       .71881    .8434962
      1.male |   1.254784   .0398514     7.15   0.000     1.179058    1.335374
        age1 |   .9782193   .0059141    -3.64   0.000     .9666962    .9898797
        age2 |   1.102357   .0117585     9.14   0.000      1.07955    1.125646
        age3 |   .6211274   .0405835    -7.29   0.000     .5464678    .7059872
             |
         imd |
          2  |   1.099809   .0605267     1.73   0.084     .9873531    1.225074
          3  |   1.183849   .0660683     3.02   0.002     1.061188    1.320688
          4  |   1.258167   .0726739     3.98   0.000     1.123496    1.408981
5 most de..  |   1.403382   .0822941     5.78   0.000     1.251013     1.57431
             |
   obese4cat |
Obese I ..)  |   .9973579   .0397722    -0.07   0.947     .9223743    1.078437
Obese II..)  |   1.205239   .0676775     3.32   0.001     1.079633    1.345459
Obese II..)  |   1.329267   .1008966     3.75   0.000      1.14552    1.542488
             |
smoke_nomiss |
     Former  |   1.129688   .0378642     3.64   0.000      1.05786    1.206392
    Current  |   .9021051   .0700495    -1.33   0.185     .7747479    1.050398
             |
     diabcat |
Controlle..  |   1.189185   .0423382     4.87   0.000     1.109033     1.27513
Uncontrol..  |   1.488495   .0723896     8.18   0.000     1.353166    1.637358
Diabetes,..  |   .8658388   .2274957    -0.55   0.584     .5173533    1.449062
             |
1.myocardi~t |   1.065475   .0459635     1.47   0.142     .9790919     1.15948
       1.pad |   1.273998   .0680124     4.54   0.000     1.147433    1.414523
1.hyperten~n |   1.024818   .0364474     0.69   0.491     .9558152    1.098802
1.heart_f~re |   1.177145   .0378636     5.07   0.000     1.105224    1.253745
1.stroke_tia |   1.129351   .0373207     3.68   0.000     1.058522    1.204919
       1.vte |   1.297804   .0606214     5.58   0.000     1.184265    1.422229
 1.oestrogen |   1.021173   .2330438     0.09   0.927     .6528973    1.597179
1.flu_vac~ne |   .8212896   .0306084    -5.28   0.000     .7634369    .8835263
             |
         ckd |
        CKD  |   1.133404    .036557     3.88   0.000     1.063972    1.207368
      1.copd |   1.237394   .0531376     4.96   0.000     1.137509     1.34605
1.other_re~y |   1.320653   .0695038     5.28   0.000     1.191218    1.464152
1.immunode~y |   1.149009   .2131729     0.75   0.454     .7987337    1.652893
    1.cancer |   1.040331   .0390052     1.05   0.292     .9666232    1.119659
1.ae_atten~r |   2.119913   .0665274    23.94   0.000     1.993451    2.254398
1.gp_consult |   .7137387   .0582123    -4.13   0.000     .6082969    .8374578
1.antiplat~t |   .9246437   .0563442    -1.29   0.199     .8205509    1.041941
1.care_ho~ce |   6.230783   .2725426    41.83   0.000     5.718866    6.788523
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table2_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6797823   .0266493    -9.85   0.000     .6295069    .7340729
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6521064   .0256369   -10.88   0.000     .6037462    .7043403
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7103024   .0288559    -8.42   0.000     .6559389    .7691715
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7786613   .0317744    -6.13   0.000       .71881    .8434962
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 closed on:   1 Mar 2021, 22:36:04
-------------------------------------------------------------------------------
