-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_onsco
> viddeath.log
  log type:  text
 opened on:   1 Mar 2021, 22:14:49

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   299,665      1,888 |   301,553 
             |     99.37       0.63 |    100.00 
-------------+----------------------+----------
warfarin use |    93,548        370 |    93,918 
             |     99.61       0.39 |    100.00 
-------------+----------------------+----------
       Total |   393,213      2,258 |   395,471 
             |     99.43       0.57 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood =  -28925.69
Iteration 1:   log likelihood = -28902.184
Iteration 2:   log likelihood = -28901.945
Iteration 3:   log likelihood = -28901.945
Refining estimates:
Iteration 0:   log likelihood = -28901.945

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,466
No. of failures =        2,258
Time at risk    =   76409267.5
                                                LR chi2(1)       =       47.49
Log likelihood  =   -28901.945                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6865446    .039042    -6.61   0.000     .6141341    .7674929
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_u
> nivar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_univar.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood =  -28925.69
Iteration 1:   log likelihood = -28398.124
Iteration 2:   log likelihood = -28218.264
Iteration 3:   log likelihood = -28214.076
Iteration 4:   log likelihood = -28214.071
Refining estimates:
Iteration 0:   log likelihood = -28214.071

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,466
No. of failures =        2,258
Time at risk    =   76409267.5
                                                LR chi2(5)       =     1423.24
Log likelihood  =   -28214.071                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6345204   .0361673    -7.98   0.000       .56745    .7095183
      1.male |   1.480827   .0645653     9.00   0.000     1.359538    1.612937
        age1 |   1.048271    .018641     2.65   0.008     1.012365    1.085451
        age2 |   1.073434   .0266269     2.86   0.004     1.022494    1.126911
        age3 |   .6975374   .0893418    -2.81   0.005     .5426804    .8965836
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -11680.368
Iteration 1:   log likelihood = -10787.328
Iteration 2:   log likelihood = -10351.909
Iteration 3:   log likelihood = -10348.774
Iteration 4:   log likelihood = -10348.695
Iteration 5:   log likelihood = -10348.694
Refining estimates:
Iteration 0:   log likelihood = -10348.694

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,466
No. of failures =        2,258
Time at risk    =   76409267.5
                                                LR chi2(27)      =     2663.35
Log likelihood  =   -10348.694                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7012586   .0415015    -6.00   0.000     .6244575    .7875054
      1.male |    1.53343   .0716889     9.14   0.000     1.399168    1.680577
        age1 |   1.055988   .0190821     3.01   0.003     1.019243    1.094059
        age2 |   1.065569    .026846     2.52   0.012      1.01423    1.119507
        age3 |   .6476583     .08421    -3.34   0.001     .5019619    .8356436
             |
         imd |
          2  |   1.014869   .0806918     0.19   0.853     .8684227    1.186011
          3  |   1.209753    .096688     2.38   0.017     1.034345    1.414907
          4  |   1.161359   .0977853     1.78   0.076     .9846827    1.369736
5 most de..  |   1.367856   .1174224     3.65   0.000     1.156031    1.618494
             |
   obese4cat |
Obese I ..)  |   .9646133   .0571588    -0.61   0.543     .8588449    1.083407
Obese II..)  |   1.205715   .1040531     2.17   0.030      1.01809    1.427918
Obese II..)  |   1.356256   .1701455     2.43   0.015     1.060612    1.734311
             |
smoke_nomiss |
     Former  |   1.375966    .068155     6.44   0.000     1.248664    1.516247
    Current  |   1.353809    .152561     2.69   0.007     1.085513    1.688416
             |
     diabcat |
Controlle..  |   1.245022    .063595     4.29   0.000     1.126414    1.376118
Uncontrol..  |   1.473753   .1074205     5.32   0.000      1.27756    1.700075
Diabetes,..  |   .5417962   .2455995    -1.35   0.176     .2228339    1.317318
             |
1.myocardi~t |   1.326323   .0765813     4.89   0.000     1.184408    1.485242
       1.pad |   1.433733   .1040539     4.96   0.000     1.243632    1.652892
1.hyperten~n |   1.019077   .0529187     0.36   0.716     .9204617    1.128258
1.heart_f~re |    1.48761   .0671327     8.80   0.000     1.361684    1.625182
1.stroke_tia |   1.199015   .0565421     3.85   0.000     1.093162    1.315118
       1.vte |   1.401444   .0940467     5.03   0.000     1.228724    1.598444
 1.oestrogen |   .6240343   .2828769    -1.04   0.298     .2566586    1.517264
1.flu_vac~ne |   .8075428   .0444356    -3.88   0.000     .7249827    .8995048
1.antiplat~t |   .9102129   .0813055    -1.05   0.292     .7640271    1.084369
1.care_ho~ce |   6.867971   .4155108    31.85   0.000     6.100016    7.732608
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -11680.368
Iteration 1:   log likelihood = -10616.665
Iteration 2:   log likelihood = -10151.956
Iteration 3:   log likelihood = -10148.702
Iteration 4:   log likelihood = -10148.631
Iteration 5:   log likelihood = -10148.631
Refining estimates:
Iteration 0:   log likelihood = -10148.631

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     395,466
No. of failures =        2,258
Time at risk    =   76409267.5
                                                LR chi2(34)      =     3063.47
Log likelihood  =   -10148.631                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7729575   .0459772    -4.33   0.000     .6878984    .8685343
      1.male |    1.55772   .0728302     9.48   0.000      1.42132    1.707209
        age1 |   1.056968   .0190699     3.07   0.002     1.020245    1.095014
        age2 |      1.048   .0263925     1.86   0.063     .9975278    1.101027
        age3 |   .7151906   .0931087    -2.57   0.010     .5541231    .9230758
             |
         imd |
          2  |   1.014103   .0807735     0.18   0.860     .8675288    1.185443
          3  |   1.195644    .095699     2.23   0.026      1.02205    1.398723
          4  |   1.123074   .0948866     1.37   0.170     .9516815    1.325332
5 most de..  |   1.301139   .1121119     3.06   0.002     1.098956    1.540519
             |
   obese4cat |
Obese I ..)  |   .9709642   .0577323    -0.50   0.620     .8641554    1.090974
Obese II..)  |   1.201897   .1039314     2.13   0.033     1.014522    1.423879
Obese II..)  |   1.323947   .1665961     2.23   0.026     1.034574    1.694259
             |
smoke_nomiss |
     Former  |   1.290586   .0650205     5.06   0.000     1.169238    1.424528
    Current  |   1.208505   .1388447     1.65   0.099     .9648374     1.51371
             |
     diabcat |
Controlle..  |   1.212915   .0622516     3.76   0.000      1.09684    1.341274
Uncontrol..  |   1.365917   .1003851     4.24   0.000     1.182679    1.577544
Diabetes,..  |   .5442139   .2467526    -1.34   0.180     .2237821    1.323469
             |
1.myocardi~t |   1.268456   .0732421     4.12   0.000     1.132729    1.420446
       1.pad |   1.353473   .0985499     4.16   0.000     1.173468    1.561089
1.hyperten~n |    .997316   .0520567    -0.05   0.959     .9003323    1.104747
1.heart_f~re |   1.335591   .0612966     6.31   0.000     1.220697      1.4613
1.stroke_tia |   1.148534   .0542551     2.93   0.003      1.04697     1.25995
       1.vte |   1.298041   .0873318     3.88   0.000     1.137679    1.481006
 1.oestrogen |   .6141056   .2792574    -1.07   0.284     .2518657    1.497329
1.flu_vac~ne |   .8078514   .0446588    -3.86   0.000     .7248969    .9002989
             |
         ckd |
        CKD  |   1.282492   .0596081     5.35   0.000     1.170826    1.404808
      1.copd |   1.244912    .075528     3.61   0.000     1.105343    1.402105
1.other_re~y |   1.502085   .1077702     5.67   0.000     1.305038    1.728883
1.immunode~y |   1.615264   .3797494     2.04   0.041     1.018886    2.560717
    1.cancer |   1.022325   .0549266     0.41   0.681     .9201452    1.135852
1.ae_atten~r |   2.143489   .0988694    16.53   0.000     1.958209    2.346298
1.gp_consult |   .7508394   .0876794    -2.45   0.014     .5972385    .9439441
1.antiplat~t |   .8332315   .0745578    -2.04   0.041     .6991976    .9929592
1.care_ho~ce |    6.37139   .3921827    30.08   0.000     5.647283    7.188343
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table2_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6865446    .039042    -6.61   0.000     .6141341    .7674929
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6345204   .0361673    -7.98   0.000       .56745    .7095183
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7012586   .0415015    -6.00   0.000     .6244575    .7875054
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7729575   .0459772    -4.33   0.000     .6878984    .8685343
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_onsco
> viddeath.log
  log type:  text
 closed on:   1 Mar 2021, 22:16:53
-------------------------------------------------------------------------------
