-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 22:21:39

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(102,445 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   222,250      1,395 |   223,645 
             |     99.38       0.62 |    100.00 
-------------+----------------------+----------
warfarin use |    69,113        268 |    69,381 
             |     99.61       0.39 |    100.00 
-------------+----------------------+----------
       Total |   291,363      1,663 |   293,026 
             |     99.43       0.57 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -20805.963
Iteration 1:   log likelihood = -20787.178
Iteration 2:   log likelihood =  -20786.97
Iteration 3:   log likelihood =  -20786.97
Refining estimates:
Iteration 0:   log likelihood =  -20786.97

Cox regression -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     293,022
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(1)       =       37.99
Log likelihood  =    -20786.97                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6745669   .0450013    -5.90   0.000     .5918888    .7687938
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_u
> nivar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_univar_e
> thn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -20805.963
Iteration 1:   log likelihood = -20417.251
Iteration 2:   log likelihood = -20256.712
Iteration 3:   log likelihood = -20252.317
Iteration 4:   log likelihood = -20252.309
Refining estimates:
Iteration 0:   log likelihood = -20252.309

Cox regression -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     293,022
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(5)       =     1107.31
Log likelihood  =   -20252.309                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6187582   .0413763    -7.18   0.000     .5427517    .7054086
      1.male |   1.491434   .0758106     7.86   0.000      1.35001    1.647673
        age1 |   1.043087   .0209564     2.10   0.036     1.002811     1.08498
        age2 |   1.084112   .0306108     2.86   0.004     1.025746    1.145799
        age3 |   .6672966    .098025    -2.75   0.006     .5003553    .8899371
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood = -7416.4305
Iteration 2:   log likelihood = -7138.4226
Iteration 3:   log likelihood = -7135.8933
Iteration 4:   log likelihood = -7135.8077
Iteration 5:   log likelihood = -7135.8076
Refining estimates:
Iteration 0:   log likelihood = -7135.8076

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     293,022
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(31)      =     1996.64
Log likelihood  =   -7135.8076                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .681389   .0474927    -5.50   0.000     .5943831    .7811308
      1.male |   1.547402   .0846541     7.98   0.000     1.390069    1.722543
        age1 |   1.053863   .0218312     2.53   0.011     1.011931    1.097532
        age2 |   1.071317   .0310926     2.37   0.018     1.012077    1.134024
        age3 |   .6330833   .0953456    -3.04   0.002     .4712654    .8504645
             |
         imd |
          2  |   1.008444   .0977836     0.09   0.931     .8339021    1.219518
          3  |   1.223054   .1177694     2.09   0.037     1.012704    1.477097
          4  |   1.201894   .1212933     1.82   0.068     .9861977    1.464765
5 most de..  |    1.38165   .1407393     3.17   0.002     1.131597    1.686957
             |
   obese4cat |
Obese I ..)  |   1.004965   .0687839     0.07   0.942     .8788026     1.14924
Obese II..)  |   1.347404   .1309777     3.07   0.002     1.113665      1.6302
Obese II..)  |   1.203593   .1892274     1.18   0.239     .8844118    1.637964
             |
smoke_nomiss |
     Former  |   1.415598   .0831537     5.92   0.000     1.261652    1.588329
    Current  |   1.361391    .179777     2.34   0.019     1.050941    1.763548
             |
     diabcat |
Controlle..  |   1.240589   .0736443     3.63   0.000      1.10433    1.393662
Uncontrol..  |   1.353239   .1172406     3.49   0.000     1.141902    1.603688
Diabetes,..  |    .741142   .3389267    -0.66   0.512     .3024434    1.816179
             |
1.myocardi~t |   1.339236   .0896075     4.37   0.000     1.174638      1.5269
       1.pad |   1.596377   .1313929     5.68   0.000      1.35855    1.875838
1.hyperten~n |   1.012109   .0624615     0.20   0.845     .8968009    1.142243
1.heart_f~re |   1.422529   .0753519     6.65   0.000      1.28225    1.578155
1.stroke_tia |   1.252102    .068504     4.11   0.000     1.124785    1.393831
       1.vte |   1.339412   .1066382     3.67   0.000     1.145896    1.565609
 1.oestrogen |    .355366   .2538256    -1.45   0.147     .0876379    1.440985
1.flu_vac~ne |   .7411254   .0473737    -4.69   0.000     .6538554    .8400432
1.antiplat~t |   .9336321   .0951622    -0.67   0.500     .7645669    1.140082
1.care_ho~ce |   6.769576   .4846024    26.72   0.000     5.883394    7.789239
             |
   ethnicity |
      Mixed  |   1.204456   .5157483     0.43   0.664     .5203627     2.78789
Asian or ..  |   1.385441   .2649768     1.70   0.088     .9523328     2.01552
      Black  |   1.132419   .3097453     0.45   0.649     .6624944    1.935675
      Other  |   1.328524   .4221706     0.89   0.371     .7126556    2.476619
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood =  -7417.756
Iteration 2:   log likelihood = -7140.1497
Iteration 3:   log likelihood = -7137.6286
Iteration 4:   log likelihood = -7137.5433
Iteration 5:   log likelihood = -7137.5432
Refining estimates:
Iteration 0:   log likelihood = -7137.5432

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     293,022
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(27)      =     1993.16
Log likelihood  =   -7137.5432                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6798315   .0473649    -5.54   0.000     .5930574     .779302
      1.male |    1.54656   .0845953     7.97   0.000     1.389335    1.721578
        age1 |   1.053235   .0218126     2.50   0.012     1.011339    1.096866
        age2 |   1.072031   .0311046     2.40   0.017     1.012768    1.134761
        age3 |   .6307784   .0949698    -3.06   0.002     .4695914    .8472928
             |
         imd |
          2  |   1.007993   .0977388     0.08   0.935     .8335313    1.218971
          3  |   1.223114   .1177664     2.09   0.036     1.012768    1.477148
          4  |    1.20291   .1213606     1.83   0.067     .9870886     1.46592
5 most de..  |   1.383794   .1409211     3.19   0.001     1.133413    1.689488
             |
   obese4cat |
Obese I ..)  |   1.003629    .068687     0.05   0.958     .8776438      1.1477
Obese II..)  |   1.343169    .130537     3.04   0.002     1.110212    1.625008
Obese II..)  |   1.194896   .1877996     1.13   0.257     .8781085    1.625967
             |
smoke_nomiss |
     Former  |    1.40375   .0821103     5.80   0.000     1.251699    1.574272
    Current  |   1.349585   .1780704     2.27   0.023      1.04205     1.74788
             |
     diabcat |
Controlle..  |   1.248101   .0739127     3.74   0.000     1.111326    1.401709
Uncontrol..  |   1.368553   .1181403     3.63   0.000     1.155531    1.620845
Diabetes,..  |   .7430143   .3397851    -0.65   0.516     .3032057    1.820778
             |
1.myocardi~t |   1.345515   .0899284     4.44   0.000     1.180315    1.533836
       1.pad |   1.592596   .1310406     5.66   0.000     1.355401      1.8713
1.hyperten~n |   1.012393   .0624615     0.20   0.842     .8970833    1.142525
1.heart_f~re |   1.424043    .075408     6.68   0.000     1.283658    1.579782
1.stroke_tia |   1.253011   .0685536     4.12   0.000     1.125602    1.394842
       1.vte |   1.336145   .1063611     3.64   0.000      1.14313    1.561751
 1.oestrogen |   .3539989   .2528365    -1.45   0.146     .0873069    1.435341
1.flu_vac~ne |   .7419096   .0474071    -4.67   0.000     .6545764    .8408948
1.antiplat~t |    .936732   .0954593    -0.64   0.521     .7671357    1.143822
1.care_ho~ce |   6.751736   .4832803    26.68   0.000     5.867966     7.76861
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood = -7285.4522
Iteration 2:   log likelihood =  -6983.371
Iteration 3:   log likelihood = -6980.8153
Iteration 4:   log likelihood = -6980.7373
Iteration 5:   log likelihood = -6980.7372
Refining estimates:
Iteration 0:   log likelihood = -6980.7372

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     293,022
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(38)      =     2306.78
Log likelihood  =   -6980.7372                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .757636    .053153    -3.96   0.000     .6603031    .8693164
      1.male |   1.581493    .086616     8.37   0.000     1.420523    1.760704
        age1 |   1.054527   .0218224     2.57   0.010     1.012612    1.098178
        age2 |   1.052704   .0305381     1.77   0.077     .9945198    1.114291
        age3 |   .7042847   .1061737    -2.33   0.020     .5241146    .9463903
             |
         imd |
          2  |   1.007439   .0979684     0.08   0.939     .8326143    1.218973
          3  |   1.206418   .1164324     1.94   0.052     .9984992    1.457632
          4  |   1.155931   .1171511     1.43   0.153     .9476861    1.409936
5 most de..  |   1.302431   .1332154     2.58   0.010      1.06584    1.591539
             |
   obese4cat |
Obese I ..)  |   1.013725   .0696986     0.20   0.843     .8859224    1.159963
Obese II..)  |   1.352941   .1319031     3.10   0.002     1.117615    1.637818
Obese II..)  |   1.161334   .1834427     0.95   0.344     .8521237    1.582748
             |
smoke_nomiss |
     Former  |   1.312831   .0786021     4.55   0.000      1.16747    1.476292
    Current  |   1.193109   .1608075     1.31   0.190     .9161257    1.553837
             |
     diabcat |
Controlle..  |    1.20841   .0721837     3.17   0.002       1.0749    1.358502
Uncontrol..  |   1.237715   .1083511     2.44   0.015     1.042571    1.469386
Diabetes,..  |   .7481351   .3420812    -0.63   0.526     .3053319    1.833107
             |
1.myocardi~t |   1.275175   .0854012     3.63   0.000     1.118312     1.45404
       1.pad |   1.493868   .1234317     4.86   0.000     1.270519     1.75648
1.hyperten~n |    .987016   .0612874    -0.21   0.833     .8739166    1.114752
1.heart_f~re |   1.265118   .0682239     4.36   0.000     1.138226    1.406157
1.stroke_tia |   1.196716   .0656716     3.27   0.001     1.074682    1.332607
       1.vte |   1.235763   .0988506     2.65   0.008     1.056444     1.44552
 1.oestrogen |   .3575329   .2556569    -1.44   0.150     .0880353    1.452028
1.flu_vac~ne |   .7374802   .0474599    -4.73   0.000     .6500878     .836621
             |
         ckd |
        CKD  |    1.33812   .0731327     5.33   0.000     1.202192    1.489416
      1.copd |   1.327076    .091944     4.08   0.000     1.158569    1.520091
1.other_re~y |   1.442886   .1198494     4.41   0.000      1.22611    1.697989
1.immunode~y |   1.751799   .4700727     2.09   0.037     1.035321    2.964102
    1.cancer |   .9937487   .0633941    -0.10   0.922     .8769523      1.1261
1.ae_atten~r |   2.163987   .1172409    14.25   0.000     1.945979    2.406419
1.gp_consult |   .7534588   .1040096    -2.05   0.040     .5748536    .9875562
1.antiplat~t |   .8566382   .0875384    -1.51   0.130     .7011559    1.046599
1.care_ho~ce |   6.266015   .4572531    25.15   0.000     5.430955    7.229472
             |
   ethnicity |
      Mixed  |   1.197595   .5113958     0.42   0.673      .518598    2.765599
Asian or ..  |   1.368004    .263202     1.63   0.103     .9382477    1.994607
      Black  |   1.106882   .3047252     0.37   0.712     .6453052    1.898618
      Other  |     1.2741   .4084321     0.76   0.450     .6797324    2.388191
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood = -7286.6677
Iteration 2:   log likelihood = -6984.8805
Iteration 3:   log likelihood =   -6982.34
Iteration 4:   log likelihood = -6982.2624
Iteration 5:   log likelihood = -6982.2623
Refining estimates:
Iteration 0:   log likelihood = -6982.2623

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     293,022
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(34)      =     2303.73
Log likelihood  =   -6982.2623                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7559984   .0530152    -3.99   0.000     .6589151    .8673857
      1.male |   1.581141   .0865778     8.37   0.000      1.42024     1.76027
        age1 |   1.054011   .0218151     2.54   0.011      1.01211    1.097647
        age2 |   1.053192   .0305571     1.79   0.074     .9949725    1.114819
        age3 |   .7025667   .1059235    -2.34   0.019     .5228233    .9441048
             |
         imd |
          2  |    1.00676   .0979007     0.07   0.945     .8320554    1.218147
          3  |   1.206099   .1163898     1.94   0.052     .9982541    1.457219
          4  |   1.156344   .1171604     1.43   0.152     .9480766    1.410361
5 most de..  |   1.303511   .1332958     2.59   0.010     1.066772    1.592787
             |
   obese4cat |
Obese I ..)  |    1.01237   .0696021     0.18   0.858     .8847444    1.158406
Obese II..)  |   1.348798   .1314669     3.07   0.002     1.114244    1.632726
Obese II..)  |   1.153881   .1821997     0.91   0.365     .8467491    1.572415
             |
smoke_nomiss |
     Former  |   1.302652   .0776962     4.43   0.000     1.158934    1.464192
    Current  |   1.183665   .1594201     1.25   0.211     .9090459    1.541244
             |
     diabcat |
Controlle..  |    1.21455   .0724046     3.26   0.001     1.080616    1.365083
Uncontrol..  |   1.251517   .1091215     2.57   0.010      1.05492    1.484753
Diabetes,..  |   .7490173   .3424992    -0.63   0.527     .3056802    1.835339
             |
1.myocardi~t |   1.280499   .0856756     3.70   0.000     1.123123    1.459928
       1.pad |   1.491248   .1231584     4.84   0.000     1.268386    1.753269
1.hyperten~n |   .9874279   .0612951    -0.20   0.838     .8743124    1.115178
1.heart_f~re |   1.266674   .0682763     4.39   0.000     1.139681    1.407817
1.stroke_tia |   1.197867   .0657267     3.29   0.001      1.07573    1.333871
       1.vte |   1.233162   .0986238     2.62   0.009     1.054252    1.442435
 1.oestrogen |   .3563573   .2548041    -1.44   0.149     .0877518    1.447156
1.flu_vac~ne |   .7385124   .0475086    -4.71   0.000     .6510284    .8377524
             |
         ckd |
        CKD  |   1.339035   .0731743     5.34   0.000      1.20303    1.490416
      1.copd |   1.326318   .0918901     4.08   0.000      1.15791    1.519221
1.other_re~y |   1.442611   .1198208     4.41   0.000     1.225885    1.697651
1.immunode~y |    1.74756   .4689598     2.08   0.038     1.032788    2.957011
    1.cancer |   .9910313   .0631899    -0.14   0.888     .8746076    1.122953
1.ae_atten~r |   2.166144   .1173497    14.27   0.000     1.947932    2.408799
1.gp_consult |     .75466   .1041678    -2.04   0.041     .5757815    .9891109
1.antiplat~t |   .8594416   .0878085    -1.48   0.138     .7034768    1.049985
1.care_ho~ce |   6.249294   .4558837    25.12   0.000     5.416717    7.209843
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table3_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    223,645    4.57e+07           0   4.57e+07   4.57e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     69,381    1.22e+07           0   1.22e+07   1.22e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6745669   .0450013    -5.90   0.000     .5918888    .7687938
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6187582   .0413763    -7.18   0.000     .5427517    .7054086
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .681389   .0474927    -5.50   0.000     .5943831    .7811308
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6798315   .0473649    -5.54   0.000     .5930574     .779302
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .757636    .053153    -3.96   0.000     .6603031    .8693164
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7559984   .0530152    -3.99   0.000     .6589151    .8673857
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 22:24:40
-------------------------------------------------------------------------------
