-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/SA5_03b_an_checks_o
> nsnoncoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 22:32:20

. 
. /* Use the dataset we derived from the S5-02b program========================
> =====*/ 
. 
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. bysort patient_id: gen switch_count = _N

. 
. sort patient_id _t0

. 
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(22,725 observations deleted)

. 
. safetab switch_count exposure, m
22

**TABLE OF switch_count exposure REDACTED DUE TO SMALL N**


. 
. * warfarin switched to DOACs
. safecount if exposure == 1 & switch_count > 1
  20,816

. 
. * DOAC switched to warfarin
. safecount if exposure == 0 & switch_count > 1
  478

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/time_updated_`outcome'.txt, write tex
> t replace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/time_updated_onsn
> oncoviddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Time updated exposure Association between 
> current anticoagulant use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.         gen _time = _t - _t0
( [redacted] missing values generated)

.     bysort exposure: egen total_follow_up = total(_time)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .739512   .0165906   -13.45   0.000     .7076996    .7727544
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7013159   .0157729   -15.78   0.000      .671073    .7329218
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7282973   .0169245   -13.64   0.000     .6958699    .7622357
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8106498   .0189445    -8.98   0.000     .7743568    .8486437
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/SA5_03b_an_checks_o
> nsnoncoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 22:32:25
-------------------------------------------------------------------------------
