-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/05a_an_models_covidtest.
> log
  log type:  text
 opened on:  31 Dec 2020, 03:07:35

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt | outcome: first covid
  Treatment |         test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    13,140        903 |    14,043 
            |     93.57       6.43 |    100.00 
------------+----------------------+----------
current use |    46,888      3,111 |    49,999 
            |     93.78       6.22 |    100.00 
------------+----------------------+----------
      Total |    60,028      4,014 |    64,042 
            |     93.73       6.27 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44243.487
Iteration 1:   log likelihood = -44242.695
Iteration 2:   log likelihood = -44242.695
Refining estimates:
Iteration 0:   log likelihood = -44242.695

Cox regression -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =        4,014
Time at risk    =   13004812.5
                                                LR chi2(1)       =        1.58
Log likelihood  =   -44242.695                  Prob > chi2      =      0.2083

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |     .95335   .0360369    -1.26   0.206     .8852719    1.026663
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_univar.ste
> r not found)
file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44243.487
Iteration 1:   log likelihood = -44166.558
Iteration 2:   log likelihood = -44129.161
Iteration 3:   log likelihood = -44127.746
Iteration 4:   log likelihood = -44127.743
Refining estimates:
Iteration 0:   log likelihood = -44127.743

Cox regression -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =        4,014
Time at risk    =   13004812.5
                                                LR chi2(5)       =      231.49
Log likelihood  =   -44127.743                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9822015   .0377731    -0.47   0.641      .910889    1.059097
      1.male |   .9840913   .0396763    -0.40   0.691     .9093203    1.065011
        age1 |   .9799373   .0034217    -5.80   0.000     .9732538    .9866667
        age2 |   1.035527   .0089779     4.03   0.000     1.018079    1.053273
        age3 |   1.097524   .0774216     1.32   0.187     .9558034    1.260258
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_multivar1.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_multivar1.ster sa
> ved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44243.487
Iteration 1:   log likelihood = -44127.123
Iteration 2:   log likelihood = -44090.583
Iteration 3:   log likelihood = -44089.183
Iteration 4:   log likelihood =  -44089.18
Iteration 5:   log likelihood =  -44089.18
Refining estimates:
Iteration 0:   log likelihood =  -44089.18

Cox regression -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =        4,014
Time at risk    =   13004812.5
                                                LR chi2(25)      =      308.61
Log likelihood  =    -44089.18                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9724582   .0380047    -0.71   0.475     .9007517    1.049873
      1.male |   .9093989   .0627239    -1.38   0.169     .7944098    1.041032
        age1 |    .987086   .0041588    -3.09   0.002     .9789684     .995271
        age2 |   1.035317   .0111264     3.23   0.001     1.013738    1.057356
        age3 |   1.065892   .0955792     0.71   0.477      .894099    1.270694
             |
         imd |
          2  |   1.062979   .0534915     1.21   0.225     .9631417    1.173165
          3  |   1.056619   .0536016     1.09   0.278     .9566155    1.167076
          4  |   1.224756   .0614052     4.04   0.000     1.110128     1.35122
5 most de..  |   1.266423   .0648248     4.61   0.000     1.145534    1.400069
             |
   obese4cat |
Obese I ..)  |   .9574143   .0407786    -1.02   0.307     .8807348     1.04077
Obese II..)  |   .9711246   .0588986    -0.48   0.629     .8622828    1.093705
Obese II..)  |   .9723596   .0738255    -0.37   0.712     .8379155    1.128375
             |
smoke_nomiss |
     Former  |   1.083222    .037355     2.32   0.020     1.012428    1.158968
    Current  |   1.236895   .0744251     3.53   0.000     1.099297    1.391715
             |
     diabcat |
Controlle..  |   1.098284    .086407     1.19   0.233     .9413409    1.281394
Uncontrol..  |   1.280847   .1212101     2.62   0.009      1.06401    1.541874
Diabetes,..  |   .9702738   .3718186    -0.08   0.937     .4578312    2.056285
             |
1.myocardi~t |    1.12358   .1373946     0.95   0.341     .8841305    1.427878
       1.pad |   1.428715   .2465773     2.07   0.039     1.018684    2.003788
1.hyperten~n |    .987026   .0642247    -0.20   0.841     .8688441    1.121283
1.heart_f~re |   1.114949   .0858662     1.41   0.158     .9587403    1.296609
1.stroke_tia |   1.247593   .1879318     1.47   0.142     .9286497    1.676078
       1.vte |   1.402737   .2290246     2.07   0.038     1.018593    1.931754
 1.oestrogen |   1.155148   .1865221     0.89   0.372     .8417704     1.58519
1.flu_vac~ne |   1.042423   .0386249     1.12   0.262     .9694031    1.120943
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_multivar2.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_multivar2.ster sa
> ved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -13792.69
Iteration 1:   log likelihood = -13446.733
Iteration 2:   log likelihood = -13412.522
Iteration 3:   log likelihood = -13412.073
Iteration 4:   log likelihood = -13412.073
Refining estimates:
Iteration 0:   log likelihood = -13412.073

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =        4,014
Time at risk    =   13004812.5
                                                LR chi2(32)      =      761.23
Log likelihood  =   -13412.073                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9848596   .0402173    -0.37   0.709     .9091071    1.066924
      1.male |   .9589989   .0679007    -0.59   0.554     .8347374    1.101758
        age1 |   .9887095   .0043921    -2.56   0.011     .9801385    .9973555
        age2 |   1.026748   .0114651     2.36   0.018     1.004521    1.049467
        age3 |   1.082156    .100716     0.85   0.396     .9017137    1.298706
             |
         imd |
          2  |   1.068381    .059386     1.19   0.234     .9581023    1.191352
          3  |   1.051213   .0609631     0.86   0.389     .9382675    1.177753
          4  |   1.136036   .0689888     2.10   0.036     1.008557    1.279627
5 most de..  |   1.167902   .0756679     2.40   0.017     1.028626    1.326036
             |
   obese4cat |
Obese I ..)  |   .9604218   .0420564    -0.92   0.356     .8814309    1.046492
Obese II..)  |   .9970997   .0621998    -0.05   0.963     .8823482    1.126775
Obese II..)  |   .9771116   .0765455    -0.30   0.768     .8380353    1.139268
             |
smoke_nomiss |
     Former  |    1.03572   .0374693     0.97   0.332     .9648252    1.111825
    Current  |   1.137705   .0727143     2.02   0.044     1.003753    1.289534
             |
     diabcat |
Controlle..  |   1.065468   .0872041     0.77   0.438     .9075554    1.250857
Uncontrol..  |   1.226143    .119916     2.08   0.037     1.012265    1.485211
Diabetes,..  |   .9064266   .3589278    -0.25   0.804     .4171314    1.969665
             |
1.myocardi~t |   1.030002   .1298942     0.23   0.815     .8044376    1.318814
       1.pad |   1.416645   .2526433     1.95   0.051     .9987537    2.009387
1.hyperten~n |   1.002822   .0670089     0.04   0.966     .8797238    1.143145
1.heart_f~re |   1.078718   .0858687     0.95   0.341     .9228907    1.260857
1.stroke_tia |   1.252147   .1944138     1.45   0.148     .9236218    1.697527
       1.vte |   1.307564   .2215418     1.58   0.113     .9380869    1.822564
 1.oestrogen |   1.244059    .207139     1.31   0.190     .8976636    1.724123
1.flu_vac~ne |   .9825259   .0382234    -0.45   0.650     .9103943    1.060373
             |
         ckd |
        CKD  |   1.184964   .0521893     3.85   0.000     1.086965    1.291798
      1.copd |   1.256868   .0672431     4.27   0.000     1.131748     1.39582
1.other_re~y |   1.335559   .0966182     4.00   0.000     1.159003     1.53901
1.immunode~y |   1.321546   .1907767     1.93   0.053     .9958728    1.753721
    1.cancer |   1.353978   .0570201     7.20   0.000     1.246709    1.470477
1.ae_atten~r |   1.929632   .0678431    18.70   0.000      1.80114     2.06729
1.gp_consult |   1.097838   .1219672     0.84   0.401     .8830222    1.364912
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_multivar3.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/covidtest_multivar3.ster sa
> ved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_1/table2_covidtest.txt n
> ot found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .95335   .0360369    -1.26   0.206     .8852719    1.026663
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9822015   .0377731    -0.47   0.641      .910889    1.059097
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9724582   .0380047    -0.71   0.475     .9007517    1.049873
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9848596   .0402173    -0.37   0.709     .9091071    1.066924
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/05a_an_models_covidtest.
> log
  log type:  text
 closed on:  31 Dec 2020, 03:07:57
-------------------------------------------------------------------------------
