-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/06a_an_models_ethnicity_
> positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:13:58

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(16,520 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |    outcome: first
  Treatment |  positive covid test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    10,311         85 |    10,396 
            |     99.18       0.82 |    100.00 
------------+----------------------+----------
current use |    36,882        244 |    37,126 
            |     99.34       0.66 |    100.00 
------------+----------------------+----------
      Total |    47,193        329 |    47,522 
            |     99.31       0.69 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3539.0573
Iteration 1:   log likelihood = -3537.5217
Iteration 2:   log likelihood = -3537.5153
Iteration 3:   log likelihood = -3537.5153
Refining estimates:
Iteration 0:   log likelihood = -3537.5153

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          329
Time at risk    =      9869322
                                                LR chi2(1)       =        3.08
Log likelihood  =   -3537.5153                  Prob > chi2      =      0.0791

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7982172   .1005346    -1.79   0.074     .6236102    1.021713
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_un
> ivar_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_univar_et
> hn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3539.0573
Iteration 1:   log likelihood = -3488.6066
Iteration 2:   log likelihood = -3478.7071
Iteration 3:   log likelihood = -3478.4047
Iteration 4:   log likelihood = -3478.4042
Refining estimates:
Iteration 0:   log likelihood = -3478.4042

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          329
Time at risk    =      9869322
                                                LR chi2(5)       =      121.31
Log likelihood  =   -3478.4042                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8132403   .1044155    -1.61   0.107      .632309    1.045944
      1.male |   1.373953   .2211134     1.97   0.048     1.002273    1.883465
        age1 |   .9605076   .0108525    -3.57   0.000     .9394709    .9820153
        age2 |   1.098044   .0304351     3.37   0.001     1.039983    1.159345
        age3 |   .9244692   .1958767    -0.37   0.711     .6102949    1.400378
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_mu
> ltivar1_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_multivar1
> _ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3539.0573
Iteration 1:   log likelihood = -3464.8653
Iteration 2:   log likelihood = -3449.4827
Iteration 3:   log likelihood = -3449.0569
Iteration 4:   log likelihood = -3449.0288
Iteration 5:   log likelihood = -3449.0186
Iteration 6:   log likelihood = -3449.0149
Iteration 7:   log likelihood = -3449.0135
Iteration 8:   log likelihood =  -3449.013
Iteration 9:   log likelihood = -3449.0128
Iteration 10:  log likelihood = -3449.0127
Iteration 11:  log likelihood = -3449.0127
Iteration 12:  log likelihood = -3449.0127
Iteration 13:  log likelihood = -3449.0127
Iteration 14:  log likelihood = -3449.0127
Iteration 15:  log likelihood = -3449.0127
Iteration 16:  log likelihood = -3449.0127
Iteration 17:  log likelihood = -3449.0127
Iteration 18:  log likelihood = -3449.0127
Iteration 19:  log likelihood = -3449.0127
Iteration 20:  log likelihood = -3449.0127
Iteration 21:  log likelihood = -3449.0127
Iteration 22:  log likelihood = -3449.0127
Iteration 23:  log likelihood = -3449.0127
Iteration 24:  log likelihood = -3449.0127
Iteration 25:  log likelihood = -3449.0127
Iteration 26:  log likelihood = -3449.0127
Iteration 27:  log likelihood = -3449.0127
Iteration 28:  log likelihood = -3449.0127
Iteration 29:  log likelihood = -3449.0127
Iteration 30:  log likelihood = -3449.0127
Iteration 31:  log likelihood = -3449.0127
Iteration 32:  log likelihood = -3449.0127
Iteration 33:  log likelihood = -3449.0127
Iteration 34:  log likelihood = -3449.0127
Iteration 35:  log likelihood = -3449.0127
Iteration 36:  log likelihood = -3449.0127
Refining estimates:
Iteration 0:   log likelihood = -3449.0127
Iteration 1:   log likelihood = -3449.0127
Iteration 2:   log likelihood = -3449.0127

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          329
Time at risk    =      9869322
                                                LR chi2(29)      =      180.09
Log likelihood  =   -3449.0127                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7772179   .1012703    -1.93   0.053     .6020499    1.003351
      1.male |   .8906313   .2270159    -0.45   0.650     .5404212    1.467789
        age1 |   .9855824    .014183    -1.01   0.313     .9581726    1.013776
        age2 |   1.132766   .0418922     3.37   0.001     1.053564    1.217922
        age3 |   .6589551    .191592    -1.43   0.151     .3727073    1.165048
             |
         imd |
          2  |   1.189312   .2275276     0.91   0.365     .8174333    1.730372
          3  |   1.246439   .2371852     1.16   0.247     .8584122    1.809866
          4  |   1.283009   .2477917     1.29   0.197      .878687    1.873376
5 most de..  |   2.209274   .3899238     4.49   0.000     1.563211    3.122351
             |
   obese4cat |
Obese I ..)  |   1.117603   .1657991     0.75   0.454     .8356217    1.494739
Obese II..)  |   .8547123   .2086135    -0.64   0.520     .5297407    1.379039
Obese II..)  |    1.54102   .3733848     1.78   0.074     .9584395    2.477719
             |
smoke_nomiss |
     Former  |   1.157601   .1430677     1.18   0.236     .9085713    1.474887
    Current  |   1.270302   .2711061     1.12   0.262     .8360738    1.930053
             |
     diabcat |
Controlle..  |   1.109178   .3302523     0.35   0.728     .6188137    1.988118
Uncontrol..  |   2.039461   .6328951     2.30   0.022     1.110111    3.746832
Diabetes,..  |   6.31e-17   1.20e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   1.970211   .8002113     1.67   0.095     .8887769    4.367497
       1.pad |   1.215175   .8870837     0.27   0.789     .2905746    5.081829
1.hyperten~n |   1.385506     .32767     1.38   0.168     .8715666    2.202501
1.heart_f~re |   1.275478   .3670439     0.85   0.398     .7256426    2.241934
1.stroke_tia |   3.783869   1.766352     2.85   0.004     1.515605    9.446835
       1.vte |   2.425155   1.296869     1.66   0.098     .8502631    6.917124
 1.oestrogen |   .4745267   .4786906    -0.74   0.460     .0657037    3.427136
1.flu_vac~ne |   1.014377   .1324769     0.11   0.913     .7852958    1.310285
             |
   ethnicity |
      Mixed  |   3.550418   2.078086     2.16   0.030     1.127366    11.18134
Asian or ..  |   1.793986   .6619583     1.58   0.113     .8704351    3.697445
      Black  |   .4475732   .4500059    -0.80   0.424     .0623786    3.211383
      Other  |   2.553724   1.293326     1.85   0.064     .9464234    6.890685
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_mu
> ltivar2_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_multivar2
> _ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist      

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3539.0573
Iteration 1:   log likelihood =  -3468.867
Iteration 2:   log likelihood = -3453.8194
Iteration 3:   log likelihood = -3453.3989
Iteration 4:   log likelihood = -3453.3709
Iteration 5:   log likelihood = -3453.3609
Iteration 6:   log likelihood = -3453.3571
Iteration 7:   log likelihood = -3453.3558
Iteration 8:   log likelihood = -3453.3553
Iteration 9:   log likelihood = -3453.3551
Iteration 10:  log likelihood =  -3453.355
Iteration 11:  log likelihood =  -3453.355
Iteration 12:  log likelihood =  -3453.355
Iteration 13:  log likelihood =  -3453.355
Iteration 14:  log likelihood =  -3453.355
Iteration 15:  log likelihood =  -3453.355
Iteration 16:  log likelihood =  -3453.355
Iteration 17:  log likelihood =  -3453.355
Iteration 18:  log likelihood =  -3453.355
Iteration 19:  log likelihood =  -3453.355
Iteration 20:  log likelihood =  -3453.355
Iteration 21:  log likelihood =  -3453.355
Iteration 22:  log likelihood =  -3453.355
Iteration 23:  log likelihood =  -3453.355
Iteration 24:  log likelihood =  -3453.355
Iteration 25:  log likelihood =  -3453.355
Iteration 26:  log likelihood =  -3453.355
Iteration 27:  log likelihood =  -3453.355
Iteration 28:  log likelihood =  -3453.355
Iteration 29:  log likelihood =  -3453.355
Iteration 30:  log likelihood =  -3453.355
Iteration 31:  log likelihood =  -3453.355
Iteration 32:  log likelihood =  -3453.355
Iteration 33:  log likelihood =  -3453.355
Iteration 34:  log likelihood =  -3453.355
Iteration 35:  log likelihood =  -3453.355
Refining estimates:
Iteration 0:   log likelihood =  -3453.355
Iteration 1:   log likelihood =  -3453.355
Iteration 2:   log likelihood =  -3453.355

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          329
Time at risk    =      9869322
                                                LR chi2(25)      =      171.40
Log likelihood  =    -3453.355                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7794592   .1015635    -1.91   0.056     .6037844    1.006248
      1.male |   .8906373   .2274394    -0.45   0.650     .5399233    1.469162
        age1 |   .9822769   .0140503    -1.25   0.211     .9551212    1.010205
        age2 |   1.135059   .0419573     3.43   0.001     1.055733    1.220346
        age3 |   .6560291   .1908022    -1.45   0.147     .3709849    1.160085
             |
         imd |
          2  |   1.189766   .2276076     0.91   0.364     .8177541    1.731012
          3  |   1.250597    .237896     1.18   0.240     .8613836    1.815674
          4  |   1.287664   .2485349     1.31   0.190     .8820848    1.879728
5 most de..  |   2.234585   .3936661     4.56   0.000     1.582126    3.156114
             |
   obese4cat |
Obese I ..)  |   1.109289   .1645933     0.70   0.485     .8293654    1.483692
Obese II..)  |   .8332346   .2032554    -0.75   0.455     .5165699    1.344019
Obese II..)  |   1.496065   .3622201     1.66   0.096     .9308116    2.404581
             |
smoke_nomiss |
     Former  |   1.144769    .140951     1.10   0.272     .8993172    1.457213
    Current  |   1.251591    .266696     1.05   0.292     .8242969    1.900383
             |
     diabcat |
Controlle..  |   1.144274   .3399703     0.45   0.650     .6391949    2.048457
Uncontrol..  |   2.075425   .6444305     2.35   0.019     1.129288    3.814255
Diabetes,..  |   1.71e-16   1.98e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   1.949375   .7916721     1.64   0.100     .8794455    4.320976
       1.pad |   1.196302   .8735815     0.25   0.806     .2859326     5.00516
1.hyperten~n |    1.37413   .3254591     1.34   0.180     .8638192    2.185912
1.heart_f~re |   1.255087   .3617972     0.79   0.431     .7133501    2.208234
1.stroke_tia |   3.698097   1.733202     2.79   0.005      1.47585    9.266472
       1.vte |   2.356787   1.264619     1.60   0.110     .8233364    6.746264
 1.oestrogen |   .4698028   .4737753    -0.75   0.454     .0650903    3.390897
1.flu_vac~ne |   1.012681    .132258     0.10   0.923     .7839789    1.308101
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_mu
> ltivar2_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_multivar2
> _withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1030.4671
Iteration 1:   log likelihood = -979.30119
Iteration 2:   log likelihood = -934.68707
Iteration 3:   log likelihood = -934.08789
Iteration 4:   log likelihood = -934.06801
Iteration 5:   log likelihood = -934.06079
Iteration 6:   log likelihood = -934.05813
Iteration 7:   log likelihood = -934.05716
Iteration 8:   log likelihood =  -934.0568
Iteration 9:   log likelihood = -934.05667
Iteration 10:  log likelihood = -934.05662
Iteration 11:  log likelihood =  -934.0566
Iteration 12:  log likelihood = -934.05659
Iteration 13:  log likelihood = -934.05659
Iteration 14:  log likelihood = -934.05659
Iteration 15:  log likelihood = -934.05659
Iteration 16:  log likelihood = -934.05659
Iteration 17:  log likelihood = -934.05659
Iteration 18:  log likelihood = -934.05659
Iteration 19:  log likelihood = -934.05659
Iteration 20:  log likelihood = -934.05659
Iteration 21:  log likelihood = -934.05659
Iteration 22:  log likelihood = -934.05659
Iteration 23:  log likelihood = -934.05659
Iteration 24:  log likelihood = -934.05659
Iteration 25:  log likelihood = -934.05659
Iteration 26:  log likelihood = -934.05659
Iteration 27:  log likelihood = -934.05659
Iteration 28:  log likelihood = -934.05659
Iteration 29:  log likelihood = -934.05659
Iteration 30:  log likelihood = -934.05659
Iteration 31:  log likelihood = -934.05659
Iteration 32:  log likelihood = -934.05659
Refining estimates:
Iteration 0:   log likelihood = -934.05659
Iteration 1:   log likelihood = -934.05659
Iteration 2:   log likelihood = -934.05659

Stratified Cox regr. -- no ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          329
Time at risk    =      9869322
                                                LR chi2(36)      =      192.82
Log likelihood  =   -934.05659                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7901619    .112612    -1.65   0.098     .5975921    1.044786
      1.male |   .8917653    .238494    -0.43   0.668     .5279648    1.506247
        age1 |   .9927573   .0147838    -0.49   0.625     .9642003     1.02216
        age2 |   1.125842   .0445304     3.00   0.003     1.041861    1.216592
        age3 |   .6434495   .2017608    -1.41   0.160     .3480252    1.189647
             |
         imd |
          2  |    1.13242   .2453342     0.57   0.566      .740625    1.731478
          3  |   1.255362   .2739049     1.04   0.297     .8185537    1.925267
          4  |   1.163754   .2730089     0.65   0.518     .7348095    1.843093
5 most de..  |   1.800851   .4177042     2.54   0.011     1.142992    2.837347
             |
   obese4cat |
Obese I ..)  |   1.177714   .1847621     1.04   0.297      .865968    1.601689
Obese II..)  |   .8243883   .2110246    -0.75   0.451     .4991644    1.361507
Obese II..)  |   1.601805   .4147147     1.82   0.069     .9643389    2.660662
             |
smoke_nomiss |
     Former  |   1.085746   .1461355     0.61   0.541     .8339901    1.413498
    Current  |   1.109047   .2576925     0.45   0.656     .7033461    1.748762
             |
     diabcat |
Controlle..  |   1.168238   .3697031     0.49   0.623     .6282869    2.172223
Uncontrol..  |   1.777921   .5908123     1.73   0.083     .9269449    3.410132
Diabetes,..  |   1.42e-15   4.35e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   2.456012   1.044533     2.11   0.035     1.067131    5.652535
       1.pad |   1.000695   .7586576     0.00   0.999     .2264538    4.422051
1.hyperten~n |   1.465341    .360868     1.55   0.121     .9043037    2.374451
1.heart_f~re |   1.242851   .3673495     0.74   0.462     .6963529    2.218241
1.stroke_tia |   4.743898    2.37669     3.11   0.002     1.776986    12.66446
       1.vte |   2.685583   1.493624     1.78   0.076     .9028822    7.988148
 1.oestrogen |    .491378   .5070044    -0.69   0.491     .0650347    3.712671
1.flu_vac~ne |    .958183   .1353751    -0.30   0.762     .7264205    1.263889
             |
         ckd |
        CKD  |   1.344021    .204791     1.94   0.052     .9970269    1.811779
      1.copd |    1.62282   .2819595     2.79   0.005     1.154455    2.281202
1.other_re~y |     .63147   .1939766    -1.50   0.135     .3458426    1.152994
1.immunode~y |     .66894   .4913494    -0.55   0.584     .1585488    2.822353
    1.cancer |   .9594512   .1590556    -0.25   0.803     .6932864    1.327801
1.ae_atten~r |   1.900148    .232317     5.25   0.000     1.495262    2.414668
1.gp_consult |   .9528524   .3237363    -0.14   0.887     .4895823    1.854495
             |
   ethnicity |
      Mixed  |   4.070007   3.137277     1.82   0.069     .8983899    18.43849
Asian or ..  |   2.459081   1.141897     1.94   0.053      .989713    6.109931
      Black  |   .5346421    .560449    -0.60   0.550     .0685133    4.172071
      Other  |   3.562536   2.120798     2.13   0.033     1.109262    11.44154
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_mu
> ltivar3_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_multivar3
> _ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1030.4671
Iteration 1:   log likelihood = -984.61976
Iteration 2:   log likelihood = -939.21952
Iteration 3:   log likelihood =  -938.6305
Iteration 4:   log likelihood = -938.60815
Iteration 5:   log likelihood = -938.60002
Iteration 6:   log likelihood = -938.59703
Iteration 7:   log likelihood = -938.59593
Iteration 8:   log likelihood = -938.59552
Iteration 9:   log likelihood = -938.59537
Iteration 10:  log likelihood = -938.59532
Iteration 11:  log likelihood =  -938.5953
Iteration 12:  log likelihood = -938.59529
Iteration 13:  log likelihood = -938.59529
Iteration 14:  log likelihood = -938.59529
Iteration 15:  log likelihood = -938.59529
Iteration 16:  log likelihood = -938.59529
Iteration 17:  log likelihood = -938.59529
Iteration 18:  log likelihood = -938.59529
Iteration 19:  log likelihood = -938.59529
Iteration 20:  log likelihood = -938.59529
Iteration 21:  log likelihood = -938.59529
Iteration 22:  log likelihood = -938.59529
Iteration 23:  log likelihood = -938.59529
Iteration 24:  log likelihood = -938.59529
Iteration 25:  log likelihood = -938.59529
Iteration 26:  log likelihood = -938.59529
Iteration 27:  log likelihood = -938.59529
Iteration 28:  log likelihood = -938.59529
Iteration 29:  log likelihood = -938.59529
Iteration 30:  log likelihood = -938.59529
Refining estimates:
Iteration 0:   log likelihood = -938.59529
Iteration 1:   log likelihood = -938.59529
Iteration 2:   log likelihood = -938.59529

Stratified Cox regr. -- no ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          329
Time at risk    =      9869322
                                                LR chi2(32)      =      183.74
Log likelihood  =   -938.59529                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7942679   .1128439    -1.62   0.105     .6012214      1.0493
      1.male |   .8857241   .2362923    -0.45   0.649     .5250686    1.494104
        age1 |   .9913264   .0147108    -0.59   0.557     .9629091    1.020582
        age2 |   1.125454   .0444879     2.99   0.003     1.041552    1.216115
        age3 |   .6456964   .2023034    -1.40   0.163     .3494122    1.193215
             |
         imd |
          2  |    1.15146   .2484257     0.65   0.513     .7544034    1.757496
          3  |   1.253831   .2730035     1.04   0.299     .8182808    1.921214
          4  |   1.150457   .2697417     0.60   0.550     .7265973    1.821576
5 most de..  |   1.804957   .4180033     2.55   0.011     1.146411      2.8418
             |
   obese4cat |
Obese I ..)  |   1.163149   .1821154     0.97   0.334     .8557793    1.580916
Obese II..)  |   .7965626   .2036401    -0.89   0.374     .4826268    1.314705
Obese II..)  |   1.545422   .3976087     1.69   0.091     .9333588    2.558855
             |
smoke_nomiss |
     Former  |   1.062844   .1418376     0.46   0.648     .8182312    1.380586
    Current  |   1.080037   .2503425     0.33   0.740     .6857063    1.701137
             |
     diabcat |
Controlle..  |   1.208052   .3808983     0.60   0.549     .6511818    2.241141
Uncontrol..  |   1.888315   .6246774     1.92   0.055     .9873853    3.611288
Diabetes,..  |   1.13e-14   1.20e-07    -0.00   1.000            0           .
             |
1.myocardi~t |    2.44731   1.040983     2.10   0.035     1.063221    5.633189
       1.pad |   .9939999   .7532311    -0.01   0.994     .2250944    4.389428
1.hyperten~n |   1.480388   .3646722     1.59   0.111     .9134697    2.399146
1.heart_f~re |   1.230413   .3642108     0.70   0.484     .6887943    2.197923
1.stroke_tia |   4.571841   2.294729     3.03   0.002     1.709426    12.22734
       1.vte |   2.557547   1.429531     1.68   0.093     .8551613    7.648906
 1.oestrogen |   .4740951   .4890158    -0.72   0.469     .0627877    3.579777
1.flu_vac~ne |   .9608947   .1354273    -0.28   0.777      .728968    1.266611
             |
         ckd |
        CKD  |   1.349659    .204674     1.98   0.048      1.00263    1.816803
      1.copd |   1.606898   .2785095     2.74   0.006     1.144082    2.256938
1.other_re~y |    .634198   .1942372    -1.49   0.137     .3479569    1.155911
1.immunode~y |   .6995994   .5111619    -0.49   0.625     .1670781    2.929405
    1.cancer |    .956964   .1581134    -0.27   0.790       .69224    1.322923
1.ae_atten~r |   1.910169   .2331586     5.30   0.000     1.503739    2.426447
1.gp_consult |   .9277253   .3144476    -0.22   0.825     .4774294    1.802726
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_mu
> ltivar3_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/positivecovidtest_multivar3
> _withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_1/table3_positivecovidte
> st.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     10,396     2143609           0    2143609    2143609

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     37,126     7725714           0    7725714    7725714

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7982172   .1005346    -1.79   0.074     .6236102    1.021713
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8132403   .1044155    -1.61   0.107      .632309    1.045944
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7772179   .1012703    -1.93   0.053     .6020499    1.003351
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7794592   .1015635    -1.91   0.056     .6037844    1.006248
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7901619    .112612    -1.65   0.098     .5975921    1.044786
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7942679   .1128439    -1.62   0.105     .6012214      1.0493
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/06a_an_models_ethnicity_
> positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:15:26
-------------------------------------------------------------------------------
