-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/SA1_02a_cr_create_popula
> tion_onscoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:21:01

. 
. /* Use the dataset we derived from the 02a program===========================
> */ 
. 
. use $tempdir_main_analysis/analysis_dataset_`outcome' , clear

. 
. noi di "PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS

. drop if antiplatelet_date != .
(6,247 observations deleted)

. 
. /* SAVE DATA=================================================================
> =*/                
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_ons
> coviddeath.dta not found)
file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_onscovidde
> ath.dta saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     64,217  total observations
          0  exclusions
------------------------------------------------------------------------------
     64,217  observations remaining, representing
     64,217  subjects
        172  failures in single-failure-per-subject data
   13358548  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_STS
> ET_onscoviddeath.dta not found)
file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_STSET_onsc
> oviddeath.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/SA1_02a_cr_create_popula
> tion_onscoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 21:21:07
-------------------------------------------------------------------------------
