-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_admit
> covid.log
  log type:  text
 opened on:  31 Dec 2020, 03:34:13

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
 warfarin vs |  outcome: SUS covid
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   298,413      1,969 |   300,382 
             |     99.34       0.66 |    100.00 
-------------+----------------------+----------
warfarin use |    93,215        438 |    93,653 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   391,628      2,407 |   394,035 
             |     99.39       0.61 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_admitcovid
                 id:  patient_id

Iteration 0:   log likelihood = -30827.269
Iteration 1:   log likelihood =  -30812.92
Iteration 2:   log likelihood = -30812.842
Iteration 3:   log likelihood = -30812.842
Refining estimates:
Iteration 0:   log likelihood = -30812.842

Cox regression -- Breslow method for ties

No. of subjects =      371,489                  Number of obs    =     394,030
No. of failures =        2,407
Time at risk    =   75963963.5
                                                LR chi2(1)       =       28.85
Log likelihood  =   -30812.842                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .758909   .0401074    -5.22   0.000     .6842342    .8417335
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_univ
> ar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_univar.ster
>  saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_admitcovid
                 id:  patient_id

Iteration 0:   log likelihood = -30827.269
Iteration 1:   log likelihood = -30545.462
Iteration 2:   log likelihood = -30532.576
Iteration 3:   log likelihood =  -30532.52
Iteration 4:   log likelihood =  -30532.52
Refining estimates:
Iteration 0:   log likelihood =  -30532.52

Cox regression -- Breslow method for ties

No. of subjects =      371,489                  Number of obs    =     394,030
No. of failures =        2,407
Time at risk    =   75963963.5
                                                LR chi2(5)       =      589.50
Log likelihood  =    -30532.52                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7117579   .0377285    -6.41   0.000     .6415231    .7896822
      1.male |   1.416054   .0603559     8.16   0.000     1.302565    1.539431
        age1 |   .9891344   .0090927    -1.19   0.235     .9714726    1.007117
        age2 |   1.103746   .0171713     6.34   0.000     1.070599     1.13792
        age3 |   .6045777   .0571883    -5.32   0.000     .5022676    .7277279
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_mult
> ivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_multivar1.s
> ter saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_admitcovid
                 id:  patient_id

Iteration 0:   log likelihood = -12372.244
Iteration 1:   log likelihood =  -11808.93
Iteration 2:   log likelihood = -11696.136
Iteration 3:   log likelihood = -11695.725
Iteration 4:   log likelihood = -11695.725
Refining estimates:
Iteration 0:   log likelihood = -11695.725

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,489                  Number of obs    =     394,030
No. of failures =        2,407
Time at risk    =   75963963.5
                                                LR chi2(27)      =     1353.04
Log likelihood  =   -11695.725                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7311031   .0399797    -5.73   0.000     .6567974    .8138153
      1.male |   1.406691   .0633809     7.57   0.000     1.287794    1.536565
        age1 |   .9945479   .0095633    -0.57   0.570     .9759797    1.013469
        age2 |   1.100626   .0176777     5.97   0.000     1.066518    1.135825
        age3 |   .5810585   .0562443    -5.61   0.000     .4806476    .7024461
             |
         imd |
          2  |   1.032098   .0818079     0.40   0.690     .8835913    1.205564
          3  |   1.240942   .0976557     2.74   0.006      1.06357    1.447893
          4  |   1.343214   .1082156     3.66   0.000     1.147013    1.572976
5 most de..  |    1.43582     .11794     4.40   0.000      1.22231    1.686626
             |
   obese4cat |
Obese I ..)  |    .990922   .0546415    -0.17   0.869     .8894109    1.104019
Obese II..)  |   1.331097   .0985807     3.86   0.000     1.151251    1.539039
Obese II..)  |   1.316316   .1387601     2.61   0.009     1.070608    1.618415
             |
smoke_nomiss |
     Former  |   1.351624   .0648638     6.28   0.000     1.230289    1.484926
    Current  |    1.11248   .1167229     1.02   0.310     .9056968    1.366474
             |
     diabcat |
Controlle..  |    1.22133   .0606319     4.03   0.000     1.108092     1.34614
Uncontrol..  |    1.76149   .1134634     8.79   0.000     1.552571    1.998522
Diabetes,..  |    .670471   .3031372    -0.88   0.377     .2763948     1.62641
             |
1.myocardi~t |   1.216061   .0700632     3.40   0.001     1.086209    1.361436
       1.pad |    1.43053    .102085     5.02   0.000     1.243809    1.645281
1.hyperten~n |   1.009232   .0501741     0.18   0.853     .9155316    1.112522
1.heart_f~re |   1.350332   .0594505     6.82   0.000     1.238697    1.472028
1.stroke_tia |   1.141781   .0537227     2.82   0.005     1.041196    1.252083
       1.vte |   1.462153   .0953604     5.83   0.000     1.286702    1.661527
 1.oestrogen |   .9736648   .3480709    -0.07   0.940     .4831894    1.962012
1.flu_vac~ne |   .8969831   .0480409    -2.03   0.042     .8075983    .9962611
1.antiplat~t |   1.137265   .0889568     1.64   0.100     .9756201    1.325692
1.care_ho~ce |   3.886785   .2781082    18.97   0.000     3.378198    4.471939
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_mult
> ivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_multivar2.s
> ter saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_admitcovid
                 id:  patient_id

Iteration 0:   log likelihood = -12372.244
Iteration 1:   log likelihood = -12130.236
Iteration 2:   log likelihood = -11446.975
Iteration 3:   log likelihood = -11434.439
Iteration 4:   log likelihood =  -11434.37
Iteration 5:   log likelihood =  -11434.37
Refining estimates:
Iteration 0:   log likelihood =  -11434.37

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,489                  Number of obs    =     394,030
No. of failures =        2,407
Time at risk    =   75963963.5
                                                LR chi2(34)      =     1875.75
Log likelihood  =    -11434.37                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8117215   .0446322    -3.79   0.000     .7287927    .9040868
      1.male |   1.447504   .0652721     8.20   0.000     1.325064    1.581259
        age1 |   .9946066   .0094889    -0.57   0.571     .9761815     1.01338
        age2 |   1.082949    .017328     4.98   0.000     1.049514     1.11745
        age3 |   .6416648   .0620803    -4.59   0.000       .53083    .7756413
             |
         imd |
          2  |   1.015656   .0806361     0.20   0.845     .8692947    1.186659
          3  |   1.216382   .0957849     2.49   0.013     1.042417    1.419379
          4  |   1.277729   .1032468     3.03   0.002      1.09058    1.496994
5 most de..  |   1.332193   .1097738     3.48   0.000     1.133516    1.565694
             |
   obese4cat |
Obese I ..)  |   .9956532   .0550753    -0.08   0.937     .8933534    1.109668
Obese II..)  |   1.321053   .0981165     3.75   0.000      1.14209    1.528059
Obese II..)  |    1.28317   .1356176     2.36   0.018     1.043088     1.57851
             |
smoke_nomiss |
     Former  |   1.227332   .0602127     4.18   0.000     1.114814    1.351207
    Current  |   .9224244   .0987696    -0.75   0.451     .7478035    1.137821
             |
     diabcat |
Controlle..  |   1.183345   .0590184     3.38   0.001     1.073145    1.304861
Uncontrol..  |   1.642655   .1067319     7.64   0.000     1.446237     1.86575
Diabetes,..  |   .6514893   .2947733    -0.95   0.344     .2683936    1.581403
             |
1.myocardi~t |   1.154479   .0665221     2.49   0.013     1.031191    1.292507
       1.pad |   1.333134   .0954576     4.02   0.000     1.158575    1.533992
1.hyperten~n |   1.002912   .0500941     0.06   0.954     .9093828    1.106062
1.heart_f~re |   1.197157   .0536519     4.02   0.000     1.096487     1.30707
1.stroke_tia |   1.086991   .0512804     1.77   0.077     .9909896    1.192292
       1.vte |   1.330705   .0872061     4.36   0.000     1.170306    1.513089
 1.oestrogen |   .9548184   .3422878    -0.13   0.897     .4729095    1.927807
1.flu_vac~ne |   .8921959   .0480586    -2.12   0.034     .8028046    .9915408
             |
         ckd |
        CKD  |   1.253156   .0567384     4.98   0.000     1.146742    1.369445
      1.copd |   1.506608   .0837271     7.38   0.000     1.351127     1.67998
1.other_re~y |   1.415513   .0973607     5.05   0.000     1.236993    1.619797
1.immunode~y |   .9903312   .2677393    -0.04   0.971     .5829823    1.682308
    1.cancer |   1.036228   .0542276     0.68   0.496     .9352129    1.148154
1.ae_atten~r |   2.258509   .0999465    18.41   0.000     2.070873    2.463147
1.gp_consult |   .7589252   .1011285    -2.07   0.038     .5844865    .9854248
1.antiplat~t |    1.03525   .0811356     0.44   0.658     .8878385    1.207136
1.care_ho~ce |   3.555193    .257548    17.51   0.000     3.084607    4.097572
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_mult
> ivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/admitcovid_multivar3.s
> ter saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table2_admitcovid
> .txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .758909   .0401074    -5.22   0.000     .6842342    .8417335
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7117579   .0377285    -6.41   0.000     .6415231    .7896822
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7311031   .0399797    -5.73   0.000     .6567974    .8138153
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8117215   .0446322    -3.79   0.000     .7287927    .9040868
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_admit
> covid.log
  log type:  text
 closed on:  31 Dec 2020, 03:35:58
-------------------------------------------------------------------------------
