-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:34:36

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   288,819     11,690 |   300,509 
             |     96.11       3.89 |    100.00 
-------------+----------------------+----------
warfarin use |    91,296      2,367 |    93,663 
             |     97.47       2.53 |    100.00 
-------------+----------------------+----------
       Total |   380,115     14,057 |   394,172 
             |     96.43       3.57 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -179902.11
Iteration 1:   log likelihood = -179805.77
Iteration 2:   log likelihood =  -179805.1
Iteration 3:   log likelihood =  -179805.1
Refining estimates:
Iteration 0:   log likelihood =  -179805.1

Cox regression -- Breslow method for ties

No. of subjects =      371,497                  Number of obs    =     394,167
No. of failures =       14,057
Time at risk    =   76155355.5
                                                LR chi2(1)       =      194.03
Log likelihood  =    -179805.1                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7378538   .0166421   -13.48   0.000     .7059464    .7712033
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_univa
> r.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -179902.11
Iteration 1:   log likelihood = -177552.85
Iteration 2:   log likelihood = -175521.06
Iteration 3:   log likelihood = -175458.38
Iteration 4:   log likelihood =  -175458.2
Refining estimates:
Iteration 0:   log likelihood =  -175458.2

Cox regression -- Breslow method for ties

No. of subjects =      371,497                  Number of obs    =     394,167
No. of failures =       14,057
Time at risk    =   76155355.5
                                                LR chi2(5)       =     8887.83
Log likelihood  =    -175458.2                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6995101   .0158166   -15.81   0.000      .669187    .7312073
      1.male |   1.208878   .0208967    10.97   0.000     1.168607    1.250536
        age1 |   1.036394   .0065899     5.62   0.000     1.023558    1.049391
        age2 |   1.061487   .0097117     6.52   0.000     1.042622    1.080693
        age3 |    .835743   .0402778    -3.72   0.000     .7604138    .9185346
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -74022.119
Iteration 1:   log likelihood = -68821.425
Iteration 2:   log likelihood = -67677.299
Iteration 3:   log likelihood =  -67653.57
Iteration 4:   log likelihood = -67652.943
Iteration 5:   log likelihood = -67652.942
Refining estimates:
Iteration 0:   log likelihood = -67652.942

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,497                  Number of obs    =     394,167
No. of failures =       14,057
Time at risk    =   76155355.5
                                                LR chi2(27)      =    12738.35
Log likelihood  =   -67652.942                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .727358   .0169943   -13.62   0.000     .6948008    .7614407
      1.male |   1.193489   .0219328     9.63   0.000     1.151267     1.23726
        age1 |   1.046103   .0068145     6.92   0.000     1.032832    1.059545
        age2 |   1.049546   .0098073     5.18   0.000     1.030499    1.068945
        age3 |   .8255734   .0406012    -3.90   0.000     .7497114    .9091118
             |
         imd |
          2  |   1.010064   .0309858     0.33   0.744     .9511227    1.072658
          3  |   1.071736   .0330557     2.25   0.025     1.008868    1.138522
          4  |   1.135753   .0367012     3.94   0.000     1.066051    1.210013
5 most de..  |   1.313989   .0446224     8.04   0.000     1.229377    1.404423
             |
   obese4cat |
Obese I ..)  |    .768035    .019314   -10.49   0.000      .731098     .806838
Obese II..)  |   .8978511   .0337659    -2.87   0.004     .8340514    .9665311
Obese II..)  |    1.16796     .05914     3.07   0.002     1.057614     1.28982
             |
smoke_nomiss |
     Former  |   1.222913   .0237698    10.35   0.000     1.177202      1.2704
    Current  |   1.987707   .0757376    18.03   0.000     1.844671    2.141833
             |
     diabcat |
Controlle..  |   1.188572   .0246746     8.32   0.000     1.141182    1.237931
Uncontrol..  |   1.429524   .0424208    12.04   0.000     1.348753    1.515133
Diabetes,..  |   1.154174   .1610056     1.03   0.304     .8780716    1.517095
             |
1.myocardi~t |   1.154926   .0278782     5.97   0.000     1.101558    1.210879
       1.pad |   1.444669   .0422185    12.59   0.000     1.364248    1.529832
1.hyperten~n |   1.104225   .0230668     4.75   0.000     1.059928    1.150373
1.heart_f~re |   1.673453   .0299102    28.81   0.000     1.615845    1.733115
1.stroke_tia |   1.207682   .0228298     9.98   0.000     1.163756    1.253267
       1.vte |   1.281486   .0357307     8.90   0.000     1.213334    1.353466
 1.oestrogen |   1.303469   .1595705     2.16   0.030     1.025408    1.656932
1.flu_vac~ne |   .7724678   .0167115   -11.93   0.000     .7403985    .8059262
1.antiplat~t |   1.089697   .0371604     2.52   0.012     1.019245     1.16502
1.care_ho~ce |   3.173309   .0899478    40.74   0.000     3.001822    3.354593
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -74022.119
Iteration 1:   log likelihood = -67605.437
Iteration 2:   log likelihood = -66243.661
Iteration 3:   log likelihood = -66220.691
Iteration 4:   log likelihood = -66220.153
Iteration 5:   log likelihood = -66220.152
Refining estimates:
Iteration 0:   log likelihood = -66220.152

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,497                  Number of obs    =     394,167
No. of failures =       14,057
Time at risk    =   76155355.5
                                                LR chi2(34)      =    15603.93
Log likelihood  =   -66220.152                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8099303   .0190301    -8.97   0.000     .7734777    .8481008
      1.male |   1.186833   .0218035     9.32   0.000     1.144859    1.230345
        age1 |   1.043877   .0067631     6.63   0.000     1.030705    1.057217
        age2 |   1.035751   .0096468     3.77   0.000     1.017016    1.054832
        age3 |   .9074637   .0445859    -1.98   0.048     .8241526    .9991965
             |
         imd |
          2  |   1.007587   .0309677     0.25   0.806     .9486833    1.070148
          3  |   1.056248   .0326227     1.77   0.076     .9942056    1.122163
          4  |   1.107603   .0358477     3.16   0.002     1.039525    1.180139
5 most de..  |   1.255221   .0428086     6.67   0.000      1.17406    1.341992
             |
   obese4cat |
Obese I ..)  |    .780029   .0196562    -9.86   0.000     .7424395    .8195216
Obese II..)  |   .9031274   .0340151    -2.71   0.007     .8388603    .9723181
Obese II..)  |   1.156962   .0586835     2.87   0.004     1.047477    1.277891
             |
smoke_nomiss |
     Former  |   1.135256   .0224755     6.41   0.000     1.092049    1.180173
    Current  |   1.753511    .068526    14.37   0.000     1.624217    1.893097
             |
     diabcat |
Controlle..  |   1.157346   .0241099     7.01   0.000     1.111043    1.205578
Uncontrol..  |   1.362397   .0406375    10.37   0.000     1.285033    1.444419
Diabetes,..  |   1.139668   .1590247     0.94   0.349     .8669719    1.498137
             |
1.myocardi~t |   1.116255   .0269723     4.55   0.000     1.064622    1.170391
       1.pad |   1.369337   .0401346    10.72   0.000     1.292891    1.450303
1.hyperten~n |   1.103161   .0231171     4.69   0.000      1.05877    1.149413
1.heart_f~re |   1.537424   .0279643    23.65   0.000      1.48358    1.593221
1.stroke_tia |   1.159122   .0219728     7.79   0.000     1.116846    1.202998
       1.vte |   1.156773   .0324061     5.20   0.000     1.094971    1.222064
 1.oestrogen |   1.052864   .1294532     0.42   0.675     .8273979    1.339771
1.flu_vac~ne |   .7628672   .0165948   -12.44   0.000     .7310256    .7960958
             |
         ckd |
        CKD  |   1.122465   .0208622     6.22   0.000     1.082311    1.164108
      1.copd |   1.325811   .0321495    11.63   0.000     1.264273    1.390345
1.other_re~y |   1.430206    .042137    12.14   0.000     1.349958    1.515224
1.immunode~y |   1.606458   .1438174     5.29   0.000     1.347926    1.914577
    1.cancer |   1.602964   .0308503    24.52   0.000     1.543625    1.664584
1.ae_atten~r |   2.075291    .038004    39.87   0.000     2.002125     2.15113
1.gp_consult |   .7685091   .0392879    -5.15   0.000     .6952382    .8495019
1.antiplat~t |   1.004196    .034323     0.12   0.903     .9391275    1.073772
1.care_ho~ce |   2.983716   .0856544    38.08   0.000     2.820472    3.156408
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table2_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7378538   .0166421   -13.48   0.000     .7059464    .7712033
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6995101   .0158166   -15.81   0.000      .669187    .7312073
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .727358   .0169943   -13.62   0.000     .6948008    .7614407
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8099303   .0190301    -8.97   0.000     .7734777    .8481008
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:36:29
-------------------------------------------------------------------------------
