-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:37:31

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(103,862 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   220,180      1,393 |   221,573 
             |     99.37       0.63 |    100.00 
-------------+----------------------+----------
warfarin use |    68,471        266 |    68,737 
             |     99.61       0.39 |    100.00 
-------------+----------------------+----------
       Total |   288,651      1,659 |   290,310 
             |     99.43       0.57 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -20740.178
Iteration 1:   log likelihood = -20720.967
Iteration 2:   log likelihood = -20720.748
Iteration 3:   log likelihood = -20720.748
Refining estimates:
Iteration 0:   log likelihood = -20720.748

Cox regression -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        1,659
Time at risk    =     56140048
                                                LR chi2(1)       =       38.86
Log likelihood  =   -20720.748                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6708552   .0448997    -5.96   0.000      .588381    .7648899
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_u
> nivar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_univar_e
> thn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -20740.178
Iteration 1:   log likelihood = -20351.135
Iteration 2:   log likelihood = -20186.696
Iteration 3:   log likelihood = -20182.147
Iteration 4:   log likelihood = -20182.139
Refining estimates:
Iteration 0:   log likelihood = -20182.139

Cox regression -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        1,659
Time at risk    =     56140048
                                                LR chi2(5)       =     1116.08
Log likelihood  =   -20182.139                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6146946   .0412386    -7.25   0.000     .5389569    .7010754
      1.male |   1.496904   .0761882     7.93   0.000     1.354784    1.653932
        age1 |   1.044135   .0212196     2.13   0.034     1.003363    1.086564
        age2 |   1.083533   .0308613     2.82   0.005     1.024703     1.14574
        age3 |   .6687681   .0988484    -2.72   0.006     .5005671    .8934882
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8109.2212
Iteration 1:   log likelihood = -7388.8787
Iteration 2:   log likelihood = -7112.0574
Iteration 3:   log likelihood = -7109.5106
Iteration 4:   log likelihood = -7109.4204
Iteration 5:   log likelihood = -7109.4202
Refining estimates:
Iteration 0:   log likelihood = -7109.4202

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        1,659
Time at risk    =     56140048
                                                LR chi2(31)      =     1999.60
Log likelihood  =   -7109.4202                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6762403   .0472798    -5.60   0.000     .5896425    .7755564
      1.male |   1.554461   .0851699     8.05   0.000     1.396181    1.730683
        age1 |   1.054996   .0221029     2.56   0.011     1.012552    1.099218
        age2 |   1.070258   .0313317     2.32   0.020     1.010577    1.133463
        age3 |   .6360755   .0964064    -2.99   0.003     .4726033    .8560923
             |
         imd |
          2  |   1.000532   .0969672     0.01   0.996     .8274395    1.209834
          3  |   1.192129   .1142624     1.83   0.067      .987957    1.438497
          4  |   1.183172   .1191294     1.67   0.095     .9712775    1.441293
5 most de..  |   1.349377   .1372419     2.95   0.003     1.105503    1.647051
             |
   obese4cat |
Obese I ..)  |   1.006468   .0688246     0.09   0.925     .8802231    1.150819
Obese II..)  |   1.321525   .1292327     2.85   0.004     1.091028    1.600718
Obese II..)  |   1.213998   .1908559     1.23   0.217      .892069    1.652106
             |
smoke_nomiss |
     Former  |    1.41298   .0831054     5.88   0.000     1.259134    1.585623
    Current  |   1.365616   .1804543     2.36   0.018     1.054022    1.769325
             |
     diabcat |
Controlle..  |   1.247397   .0740248     3.73   0.000      1.11043    1.401257
Uncontrol..  |    1.33283   .1162696     3.29   0.001     1.123362    1.581355
Diabetes,..  |   .8065781   .3690307    -0.47   0.638     .3290026    1.977395
             |
1.myocardi~t |   1.345511   .0900602     4.43   0.000     1.180084    1.534127
       1.pad |   1.606609   .1322252     5.76   0.000     1.367274    1.887838
1.hyperten~n |   1.026817   .0636263     0.43   0.669     .9093866    1.159411
1.heart_f~re |   1.420803   .0753482     6.62   0.000     1.280539     1.57643
1.stroke_tia |   1.252143   .0685783     4.11   0.000     1.124695    1.394033
       1.vte |   1.346492   .1072244     3.74   0.000     1.151915    1.573935
 1.oestrogen |   .3638266   .2600014    -1.41   0.157     .0896603    1.476347
1.flu_vac~ne |   .7390097   .0472571    -4.73   0.000     .6519567    .8376865
1.antiplat~t |   .9141827   .0939024    -0.87   0.382     .7474805    1.118063
1.care_ho~ce |   6.727784   .4816803    26.63   0.000     5.846954    7.741309
             |
   ethnicity |
      Mixed  |   1.208813   .5175305     0.44   0.658     .5223159    2.797596
Asian or ..  |   1.396377   .2668048     1.75   0.081     .9602058    2.030679
      Black  |   1.223782    .335314     0.74   0.461     .7152804    2.093783
      Other  |   1.363904   .4343772     0.97   0.330     .7306219    2.546098
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8109.2212
Iteration 1:   log likelihood = -7390.3256
Iteration 2:   log likelihood = -7114.0105
Iteration 3:   log likelihood = -7111.4727
Iteration 4:   log likelihood = -7111.3829
Iteration 5:   log likelihood = -7111.3827
Refining estimates:
Iteration 0:   log likelihood = -7111.3827

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        1,659
Time at risk    =     56140048
                                                LR chi2(27)      =     1995.68
Log likelihood  =   -7111.3827                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6745085   .0471387    -5.63   0.000     .5881665    .7735253
      1.male |    1.55336   .0850924     8.04   0.000     1.395223     1.72942
        age1 |    1.05426   .0220827     2.52   0.012     1.011855    1.098442
        age2 |   1.071143   .0313513     2.35   0.019     1.011425    1.134387
        age3 |   .6331968   .0959522    -3.02   0.003     .4704906    .8521706
             |
         imd |
          2  |   1.000111   .0969262     0.00   0.999     .8270912    1.209324
          3  |   1.192344   .1142702     1.84   0.066     .9881558    1.438726
          4  |   1.184258   .1192062     1.68   0.093     .9722215    1.442539
5 most de..  |   1.352523   .1375124     2.97   0.003     1.108159    1.650772
             |
   obese4cat |
Obese I ..)  |   1.005427   .0687478     0.08   0.937     .8793221    1.149616
Obese II..)  |   1.317266   .1287882     2.82   0.005     1.087557    1.595493
Obese II..)  |   1.205718   .1895039     1.19   0.234     .8860568    1.640703
             |
smoke_nomiss |
     Former  |   1.400417    .082012     5.75   0.000     1.248559    1.570746
    Current  |   1.353105   .1786526     2.29   0.022     1.044591    1.752738
             |
     diabcat |
Controlle..  |   1.255651   .0743389     3.85   0.000     1.118085    1.410142
Uncontrol..  |   1.349127   .1172624     3.45   0.001     1.137807    1.599693
Diabetes,..  |   .8094351   .3703638    -0.46   0.644     .3301473    1.984524
             |
1.myocardi~t |   1.351841   .0903823     4.51   0.000     1.185811    1.541118
       1.pad |   1.602697   .1318594     5.73   0.000     1.364019    1.883141
1.hyperten~n |   1.027299   .0636379     0.43   0.664     .9098456    1.159915
1.heart_f~re |   1.421953   .0753859     6.64   0.000     1.281616    1.577656
1.stroke_tia |   1.253025   .0686297     4.12   0.000     1.125482    1.395022
       1.vte |   1.343171    .106942     3.71   0.000     1.149104    1.570013
 1.oestrogen |   .3622009   .2588243    -1.42   0.155     .0892671    1.469628
1.flu_vac~ne |   .7396872   .0472824    -4.72   0.000     .6525856    .8384144
1.antiplat~t |   .9173447     .09421    -0.84   0.401     .7500935    1.121889
1.care_ho~ce |   6.708171   .4802324    26.59   0.000     5.829984    7.718643
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8109.2212
Iteration 1:   log likelihood = -7258.0184
Iteration 2:   log likelihood = -6957.9953
Iteration 3:   log likelihood = -6955.4222
Iteration 4:   log likelihood = -6955.3401
Iteration 5:   log likelihood = -6955.3399
Refining estimates:
Iteration 0:   log likelihood = -6955.3399

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        1,659
Time at risk    =     56140048
                                                LR chi2(38)      =     2307.76
Log likelihood  =   -6955.3399                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .752158   .0529271    -4.05   0.000     .6552584     .863387
      1.male |   1.585759   .0869696     8.41   0.000     1.424144    1.765716
        age1 |   1.055442   .0220734     2.58   0.010     1.013054    1.099604
        age2 |   1.052095   .0307672     1.74   0.082     .9934877    1.114159
        age3 |   .7060466   .1070651    -2.30   0.022     .5245138    .9504073
             |
         imd |
          2  |   1.000247   .0972283     0.00   0.998      .826736    1.210174
          3  |    1.17369   .1127477     1.67   0.095     .9722654    1.416844
          4  |     1.1366   .1149501     1.27   0.205     .9322265    1.385779
5 most de..  |   1.273217    .130053     2.36   0.018     1.042212    1.555423
             |
   obese4cat |
Obese I ..)  |   1.013461   .0696214     0.19   0.846     .8857931    1.159529
Obese II..)  |   1.321053   .1296048     2.84   0.005     1.089962     1.60114
Obese II..)  |    1.17279   .1852538     1.01   0.313     .8605275    1.598365
             |
smoke_nomiss |
     Former  |   1.312099   .0786391     4.53   0.000     1.166678    1.475647
    Current  |   1.198455   .1616205     1.34   0.179     .9200914    1.561035
             |
     diabcat |
Controlle..  |   1.215363   .0725841     3.27   0.001     1.081112    1.366286
Uncontrol..  |   1.222382   .1077158     2.28   0.023     1.028489    1.452829
Diabetes,..  |   .8378571   .3829553    -0.39   0.699     .3420703    2.052223
             |
1.myocardi~t |   1.282946   .0859482     3.72   0.000     1.125082    1.462962
       1.pad |   1.505148   .1243464     4.95   0.000     1.280141    1.769703
1.hyperten~n |    1.00224    .062489     0.04   0.971     .8869514    1.132514
1.heart_f~re |   1.262585   .0681805     4.32   0.000     1.135782    1.403544
1.stroke_tia |   1.196697   .0657401     3.27   0.001     1.074543    1.332738
       1.vte |   1.241885    .099378     2.71   0.007     1.061614    1.452768
 1.oestrogen |   .3671979   .2627189    -1.40   0.161     .0903423    1.492482
1.flu_vac~ne |   .7360401   .0473885    -4.76   0.000     .6487816    .8350345
             |
         ckd |
        CKD  |    1.33141   .0728545     5.23   0.000     1.196008     1.48214
      1.copd |   1.323943   .0919394     4.04   0.000      1.15547     1.51698
1.other_re~y |   1.459515   .1211222     4.56   0.000     1.240421    1.717307
1.immunode~y |    1.74769   .4691908     2.08   0.038     1.032637    2.957882
    1.cancer |   .9872102   .0631553    -0.20   0.841     .8708739    1.119087
1.ae_atten~r |   2.153697   .1167592    14.15   0.000     1.936592    2.395141
1.gp_consult |   .7275388   .0996308    -2.32   0.020     .5562764    .9515282
1.antiplat~t |   .8393086   .0864382    -1.70   0.089     .6858966    1.027034
1.care_ho~ce |   6.208045   .4531835    25.01   0.000     5.380439    7.162953
             |
   ethnicity |
      Mixed  |   1.202766   .5135476     0.43   0.665     .5208852    2.777285
Asian or ..  |   1.380427   .2654206     1.68   0.094     .9469981     2.01223
      Black  |   1.175787   .3242284     0.59   0.557     .6848664    2.018604
      Other  |   1.304786   .4190709     0.83   0.407     .6952649    2.448657
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -8109.2212
Iteration 1:   log likelihood = -7259.3323
Iteration 2:   log likelihood = -6959.6812
Iteration 3:   log likelihood = -6957.1242
Iteration 4:   log likelihood = -6957.0427
Iteration 5:   log likelihood = -6957.0425
Refining estimates:
Iteration 0:   log likelihood = -6957.0425

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        1,659
Time at risk    =     56140048
                                                LR chi2(34)      =     2304.36
Log likelihood  =   -6957.0425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7503455   .0527762    -4.08   0.000     .6537193     .861254
      1.male |   1.585317   .0869231     8.40   0.000     1.423786    1.765174
        age1 |   1.054838   .0220659     2.55   0.011     1.012464    1.098985
        age2 |   1.052711   .0307927     1.76   0.079     .9940558    1.114827
        age3 |   .7038541    .106751    -2.32   0.021     .5228583    .9475044
             |
         imd |
          2  |   .9995632   .0971611    -0.00   0.996     .8261719    1.209345
          3  |   1.173536   .1127183     1.67   0.096     .9721618    1.416624
          4  |   1.136993   .1149585     1.27   0.204      .932599    1.386183
5 most de..  |   1.274993   .1301967     2.38   0.017     1.043727    1.557503
             |
   obese4cat |
Obese I ..)  |   1.012432   .0695463     0.18   0.857      .884901    1.158342
Obese II..)  |   1.316732   .1291484     2.81   0.005     1.086449    1.595825
Obese II..)  |   1.165745   .1840847     0.97   0.331     .8554387    1.588613
             |
smoke_nomiss |
     Former  |   1.301392   .0776992     4.41   0.000     1.157677    1.462948
    Current  |   1.188549   .1601704     1.28   0.200     .9126583    1.547841
             |
     diabcat |
Controlle..  |   1.222143   .0728416     3.37   0.001     1.087399    1.373583
Uncontrol..  |   1.236959   .1085638     2.42   0.015     1.041473    1.469137
Diabetes,..  |   .8400596   .3839814    -0.38   0.703     .3429539    2.057711
             |
1.myocardi~t |   1.288342   .0862246     3.79   0.000      1.12996    1.468925
       1.pad |   1.502432    .124061     4.93   0.000     1.277934     1.76637
1.hyperten~n |   1.002784   .0625044     0.04   0.964      .887465    1.133088
1.heart_f~re |   1.263918   .0682204     4.34   0.000     1.137038    1.404956
1.stroke_tia |   1.197826   .0657952     3.29   0.001     1.075569     1.33398
       1.vte |   1.239227   .0991443     2.68   0.007     1.059377     1.44961
 1.oestrogen |   .3657108   .2616406    -1.41   0.160     .0899834    1.486323
1.flu_vac~ne |   .7369758   .0474302    -4.74   0.000     .6496384    .8360548
             |
         ckd |
        CKD  |   1.332572   .0729099     5.25   0.000     1.197067    1.483416
      1.copd |   1.323195   .0918862     4.03   0.000      1.15482     1.51612
1.other_re~y |   1.458876   .1210602     4.55   0.000     1.239892    1.716535
1.immunode~y |   1.743862    .468195     2.07   0.038     1.030338    2.951509
    1.cancer |   .9845799   .0629554    -0.24   0.808     .8686083    1.116035
1.ae_atten~r |   2.156141   .1168821    14.17   0.000     1.938806    2.397838
1.gp_consult |   .7288239   .0998024    -2.31   0.021     .5572657    .9531975
1.antiplat~t |   .8421531    .086717    -1.67   0.095     .6882438     1.03048
1.care_ho~ce |   6.190301   .4517364    24.98   0.000     5.365318    7.142135
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_m
> ultivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onscoviddeath_multivar
> 3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table3_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    221,573    4.53e+07           0   4.53e+07   4.53e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,737    1.20e+07           0   1.20e+07   1.20e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6708552   .0448997    -5.96   0.000      .588381    .7648899
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6146946   .0412386    -7.25   0.000     .5389569    .7010754
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6762403   .0472798    -5.60   0.000     .5896425    .7755564
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6745085   .0471387    -5.63   0.000     .5881665    .7735253
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .752158   .0529271    -4.05   0.000     .6552584     .863387
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7503455   .0527762    -4.08   0.000     .6537193     .861254
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:40:11
-------------------------------------------------------------------------------
