-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:41:37

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(103,818 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   218,377      3,030 |   221,407 
             |     98.63       1.37 |    100.00 
-------------+----------------------+----------
warfarin use |    68,133        593 |    68,726 
             |     99.14       0.86 |    100.00 
-------------+----------------------+----------
       Total |   286,510      3,623 |   290,133 
             |     98.75       1.25 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood = -45274.366
Iteration 1:   log likelihood = -45236.376
Iteration 2:   log likelihood = -45235.988
Iteration 3:   log likelihood = -45235.988
Refining estimates:
Iteration 0:   log likelihood = -45235.988

Cox regression -- Breslow method for ties

No. of subjects =      273,517                  Number of obs    =     290,129
No. of failures =        3,623
Time at risk    =   55822140.5
                                                LR chi2(1)       =       76.76
Log likelihood  =   -45235.988                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6854906   .0307932    -8.41   0.000     .6277176    .7485807
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_univar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_univ
> ar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood = -45274.366
Iteration 1:   log likelihood = -44746.779
Iteration 2:   log likelihood = -44648.826
Iteration 3:   log likelihood = -44646.947
Iteration 4:   log likelihood = -44646.945
Refining estimates:
Iteration 0:   log likelihood = -44646.945

Cox regression -- Breslow method for ties

No. of subjects =      273,517                  Number of obs    =     290,129
No. of failures =        3,623
Time at risk    =   55822140.5
                                                LR chi2(5)       =     1254.84
Log likelihood  =   -44646.945                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6504576   .0293066    -9.55   0.000     .5954809    .7105098
      1.male |   1.183928   .0404966     4.94   0.000     1.107158    1.266021
        age1 |    .967085   .0063033    -5.13   0.000     .9548094    .9795184
        age2 |   1.137902   .0133586    11.00   0.000     1.112019    1.164388
        age3 |   .5740919   .0419212    -7.60   0.000     .4975368    .6624264
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood =  -17704.27
Iteration 1:   log likelihood = -16635.162
Iteration 2:   log likelihood = -16251.453
Iteration 3:   log likelihood =  -16249.66
Iteration 4:   log likelihood = -16249.659
Refining estimates:
Iteration 0:   log likelihood = -16249.659

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,517                  Number of obs    =     290,129
No. of failures =        3,623
Time at risk    =   55822140.5
                                                LR chi2(31)      =     2909.22
Log likelihood  =   -16249.659                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7175354   .0335362    -7.10   0.000     .6547264    .7863698
      1.male |   1.267833   .0464141     6.48   0.000      1.18005    1.362146
        age1 |   .9728072   .0066645    -4.02   0.000     .9598323    .9859575
        age2 |   1.132283   .0137697    10.22   0.000     1.105614    1.159595
        age3 |   .5241786   .0393505    -8.60   0.000     .4524587    .6072669
             |
         imd |
          2  |   1.114844   .0731036     1.66   0.097     .9803882    1.267739
          3  |   1.241555   .0808836     3.32   0.001      1.09273     1.41065
          4  |   1.297258   .0879038     3.84   0.000      1.13592    1.481511
5 most de..  |   1.449632   .0991103     5.43   0.000     1.267832    1.657501
             |
   obese4cat |
Obese I ..)  |   .9972323   .0452333    -0.06   0.951     .9124032    1.089948
Obese II..)  |   1.259293   .0792501     3.66   0.000     1.113163    1.424606
Obese II..)  |    1.30312    .115854     2.98   0.003     1.094734    1.551175
             |
smoke_nomiss |
     Former  |   1.212373    .046378     5.03   0.000     1.124798    1.306766
    Current  |   .9917125   .0880879    -0.09   0.925     .8332564    1.180302
             |
     diabcat |
Controlle..  |   1.213824   .0493291     4.77   0.000     1.120891    1.314462
Uncontrol..  |   1.549058   .0857041     7.91   0.000     1.389869    1.726481
Diabetes,..  |   .9398533    .289089    -0.20   0.840     .5143271    1.717437
             |
1.myocardi~t |   1.106347   .0542898     2.06   0.039     1.004897    1.218038
       1.pad |   1.419386     .08554     5.81   0.000     1.261254    1.597344
1.hyperten~n |   1.020218   .0422054     0.48   0.628     .9407614    1.106385
1.heart_f~re |    1.23844   .0452016     5.86   0.000     1.152941    1.330279
1.stroke_tia |   1.203209   .0455397     4.89   0.000     1.117183    1.295859
       1.vte |   1.368622   .0737123     5.83   0.000     1.231513    1.520996
 1.oestrogen |     1.0225   .2786787     0.08   0.935     .5993371    1.744437
1.flu_vac~ne |   .8088558   .0350031    -4.90   0.000     .7430799    .8804541
1.antiplat~t |   1.029412   .0710084     0.42   0.674     .8992358    1.178432
1.care_ho~ce |   6.891723   .3431544    38.77   0.000     6.250929    7.598206
             |
   ethnicity |
      Mixed  |   1.064662   .3199414     0.21   0.835     .5907682    1.918696
Asian or ..  |   1.390288   .1738089     2.64   0.008     1.088154    1.776311
      Black  |   1.380426    .247353     1.80   0.072     .9716048    1.961266
      Other  |   1.329739   .2865766     1.32   0.186     .8716081    2.028672
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood =  -17704.27
Iteration 1:   log likelihood = -16638.662
Iteration 2:   log likelihood = -16256.334
Iteration 3:   log likelihood = -16254.564
Iteration 4:   log likelihood = -16254.564
Refining estimates:
Iteration 0:   log likelihood = -16254.564

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,517                  Number of obs    =     290,129
No. of failures =        3,623
Time at risk    =   55822140.5
                                                LR chi2(27)      =     2899.41
Log likelihood  =   -16254.564                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7159149   .0334539    -7.15   0.000     .6532596    .7845797
      1.male |    1.26641   .0463546     6.45   0.000     1.178739    1.360602
        age1 |   .9719915   .0066559    -4.15   0.000     .9590333    .9851248
        age2 |   1.133359   .0137822    10.29   0.000     1.106666    1.160696
        age3 |   .5216484   .0391624    -8.67   0.000     .4502716    .6043398
             |
         imd |
          2  |   1.114842   .0730971     1.66   0.097     .9803975    1.267722
          3  |   1.242049   .0808982     3.33   0.001     1.093195    1.411172
          4  |    1.29825   .0879547     3.85   0.000     1.136817    1.482607
5 most de..  |   1.453439   .0993315     5.47   0.000     1.271229    1.661767
             |
   obese4cat |
Obese I ..)  |   .9963289   .0451887    -0.08   0.935     .9115833    1.088953
Obese II..)  |   1.255575   .0790055     3.62   0.000     1.109895    1.420377
Obese II..)  |   1.293025   .1149029     2.89   0.004     1.086341    1.539033
             |
smoke_nomiss |
     Former  |   1.201854   .0457859     4.83   0.000     1.115383    1.295028
    Current  |   .9795091   .0868991    -0.23   0.815     .8231756    1.165533
             |
     diabcat |
Controlle..  |    1.22271   .0495744     4.96   0.000     1.129306    1.323839
Uncontrol..  |   1.565306   .0863902     8.12   0.000     1.404821    1.744125
Diabetes,..  |   .9485857   .2917781    -0.17   0.864     .5191026    1.733405
             |
1.myocardi~t |   1.111175   .0544713     2.15   0.032     1.009382    1.223234
       1.pad |    1.41727   .0854067     5.79   0.000     1.259383     1.59495
1.hyperten~n |   1.022194    .042275     0.53   0.596     .9426062    1.108503
1.heart_f~re |    1.23936   .0452257     5.88   0.000     1.153815    1.331248
1.stroke_tia |   1.205165   .0456105     4.93   0.000     1.119005    1.297959
       1.vte |   1.366819   .0735978     5.80   0.000     1.229921    1.518955
 1.oestrogen |   1.017403   .2772693     0.06   0.950     .5963726    1.735673
1.flu_vac~ne |   .8085326   .0349755    -4.91   0.000     .7428074    .8800733
1.antiplat~t |    1.03278   .0712378     0.47   0.640     .9021833    1.182282
1.care_ho~ce |   6.857108      .3413    38.68   0.000     6.219765     7.55976
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood =  -17704.27
Iteration 1:   log likelihood = -16416.278
Iteration 2:   log likelihood = -15979.189
Iteration 3:   log likelihood = -15977.282
Iteration 4:   log likelihood = -15977.281
Refining estimates:
Iteration 0:   log likelihood = -15977.281

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,517                  Number of obs    =     290,129
No. of failures =        3,623
Time at risk    =   55822140.5
                                                LR chi2(38)      =     3453.98
Log likelihood  =   -15977.281                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7891582   .0370681    -5.04   0.000       .71975    .8652596
      1.male |   1.294126   .0473964     7.04   0.000     1.204486    1.390436
        age1 |   .9752079   .0066688    -3.67   0.000     .9622244    .9883665
        age2 |   1.115914   .0135896     9.01   0.000     1.089595     1.14287
        age3 |   .5689502   .0428503    -7.49   0.000     .4908697    .6594506
             |
         imd |
          2  |   1.104014   .0724948     1.51   0.132     .9706903     1.25565
          3  |   1.220948   .0795992     3.06   0.002     1.074492    1.387365
          4  |   1.255255   .0852159     3.35   0.001      1.09887    1.433897
5 most de..  |   1.369927    .093908     4.59   0.000       1.1977    1.566921
             |
   obese4cat |
Obese I ..)  |   1.005452    .045739     0.12   0.905     .9196851    1.099216
Obese II..)  |   1.260736   .0795384     3.67   0.000     1.114097    1.426677
Obese II..)  |   1.276338   .1136604     2.74   0.006     1.071925    1.519732
             |
smoke_nomiss |
     Former  |   1.146513   .0446925     3.51   0.000      1.06218    1.237542
    Current  |    .887489   .0801836    -1.32   0.186     .7434606     1.05942
             |
     diabcat |
Controlle..  |   1.198796   .0489421     4.44   0.000     1.106608    1.298663
Uncontrol..  |    1.47957   .0824577     7.03   0.000     1.326469    1.650341
Diabetes,..  |   .9328587   .2868834    -0.23   0.821     .5105574    1.704461
             |
1.myocardi~t |   1.067666   .0524001     1.33   0.182     .9697492    1.175471
       1.pad |   1.354322    .081736     5.03   0.000     1.203234    1.524381
1.hyperten~n |    1.01605   .0422465     0.38   0.702     .9365324    1.102319
1.heart_f~re |   1.137872   .0422516     3.48   0.001     1.058002    1.223771
1.stroke_tia |   1.150913   .0436312     3.71   0.000     1.068497    1.239685
       1.vte |   1.264323   .0684526     4.33   0.000     1.137031    1.405864
 1.oestrogen |   .9814844   .2684119    -0.07   0.946     .5742496    1.677514
1.flu_vac~ne |   .8157831    .035525    -4.68   0.000      .749044    .8884686
             |
         ckd |
        CKD  |   1.143632   .0425372     3.61   0.000     1.063227    1.230118
      1.copd |   1.264297   .0615054     4.82   0.000     1.149317    1.390779
1.other_re~y |   1.232511   .0748807     3.44   0.001     1.094149     1.38837
1.immunode~y |   1.105936   .2356601     0.47   0.637     .7283675    1.679228
    1.cancer |   1.053317   .0455179     1.20   0.229     .9677768    1.146417
1.ae_atten~r |   2.136955   .0774375    20.96   0.000     1.990444    2.294249
1.gp_consult |   .6821663   .0645588    -4.04   0.000     .5666754    .8211948
1.antiplat~t |    .939815   .0649541    -0.90   0.369     .8207533    1.076148
1.care_ho~ce |    6.24732   .3166541    36.15   0.000     5.656521    6.899825
             |
   ethnicity |
      Mixed  |   1.078617    .323891     0.25   0.801     .5987774    1.942984
Asian or ..  |   1.365397   .1715394     2.48   0.013     1.067381    1.746619
      Black  |   1.367022   .2447153     1.75   0.081     .9624965    1.941566
      Other  |     1.2754   .2761763     1.12   0.261     .8343082    1.949694
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  positivecovidtest
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_positivecovidtest
                 id:  patient_id

Iteration 0:   log likelihood =  -17704.27
Iteration 1:   log likelihood = -16419.335
Iteration 2:   log likelihood = -15983.505
Iteration 3:   log likelihood = -15981.627
Iteration 4:   log likelihood = -15981.627
Refining estimates:
Iteration 0:   log likelihood = -15981.627

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,517                  Number of obs    =     290,129
No. of failures =        3,623
Time at risk    =   55822140.5
                                                LR chi2(34)      =     3445.29
Log likelihood  =   -15981.627                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7875326   .0369851    -5.09   0.000     .7182793    .8634631
      1.male |   1.293392   .0473632     7.03   0.000     1.203815    1.389635
        age1 |   .9744456   .0066607    -3.79   0.000      .961478    .9875882
        age2 |    1.11687   .0136012     9.08   0.000     1.090528    1.143849
        age3 |   .5664701   .0426655    -7.55   0.000     .4887266    .6565805
             |
         imd |
          2  |   1.103593   .0724584     1.50   0.133     .9703351    1.255151
          3  |   1.221237   .0795986     3.07   0.002     1.074781    1.387651
          4  |   1.255582   .0852234     3.35   0.001     1.099181    1.434237
5 most de..  |   1.372843   .0940714     4.62   0.000     1.200311    1.570174
             |
   obese4cat |
Obese I ..)  |   1.004736   .0457024     0.10   0.917     .9190383    1.098426
Obese II..)  |   1.256894   .0792859     3.62   0.000     1.110719    1.422306
Obese II..)  |   1.267404   .1128103     2.66   0.008     1.064511    1.508966
             |
smoke_nomiss |
     Former  |   1.137001    .044149     3.31   0.001     1.053681    1.226909
    Current  |   .8770801   .0791591    -1.45   0.146     .7348789    1.046798
             |
     diabcat |
Controlle..  |   1.206761   .0491629     4.61   0.000      1.11415     1.30707
Uncontrol..  |   1.494301   .0830673     7.23   0.000     1.340048     1.66631
Diabetes,..  |   .9411289   .2893944    -0.20   0.844     .5151185    1.719456
             |
1.myocardi~t |    1.07162   .0525436     1.41   0.158     .9734301    1.179715
       1.pad |   1.352731   .0816275     5.01   0.000     1.201843    1.522563
1.hyperten~n |   1.017872   .0423109     0.43   0.670     .9382325    1.104272
1.heart_f~re |   1.138601   .0422668     3.50   0.000     1.058701     1.22453
1.stroke_tia |   1.152696   .0436943     3.75   0.000     1.070161    1.241597
       1.vte |   1.263158   .0683699     4.32   0.000     1.136019    1.404527
 1.oestrogen |   .9770568   .2671847    -0.08   0.932     .5716778    1.669892
1.flu_vac~ne |   .8154349   .0354935    -4.69   0.000     .7487537    .8880545
             |
         ckd |
        CKD  |   1.145051   .0425881     3.64   0.000      1.06455     1.23164
      1.copd |   1.262258   .0614008     4.79   0.000     1.147473    1.388524
1.other_re~y |   1.232863    .074891     3.45   0.001     1.094481    1.388742
1.immunode~y |   1.103255    .235131     0.46   0.645     .7265474    1.675283
    1.cancer |   1.050353   .0453675     1.14   0.255     .9650937    1.143144
1.ae_atten~r |   2.139942   .0775363    21.00   0.000     1.993244    2.297436
1.gp_consult |   .6840635   .0647582    -4.01   0.000      .568219    .8235254
1.antiplat~t |   .9425492   .0651415    -0.86   0.392     .8231439    1.079275
1.care_ho~ce |   6.217345   .3149997    36.07   0.000     5.629621    6.866427
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidte
> st_multivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/positivecovidtest_mult
> ivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table3_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    221,407    4.50e+07           0   4.50e+07   4.50e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,726    1.20e+07           0   1.20e+07   1.20e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6854906   .0307932    -8.41   0.000     .6277176    .7485807
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6504576   .0293066    -9.55   0.000     .5954809    .7105098
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7175354   .0335362    -7.10   0.000     .6547264    .7863698
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7159149   .0334539    -7.15   0.000     .6532596    .7845797
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7891582   .0370681    -5.04   0.000       .71975    .8652596
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7875326   .0369851    -5.09   0.000     .7182793    .8634631
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:43:57
-------------------------------------------------------------------------------
