-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_onsnoncoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:38:18

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(103,862 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   213,433      8,140 |   221,573 
             |     96.33       3.67 |    100.00 
-------------+----------------------+----------
warfarin use |    67,073      1,664 |    68,737 
             |     97.58       2.42 |    100.00 
-------------+----------------------+----------
       Total |   280,506      9,804 |   290,310 
             |     96.62       3.38 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -122481.92
Iteration 1:   log likelihood = -122421.01
Iteration 2:   log likelihood = -122420.62
Iteration 3:   log likelihood = -122420.62
Refining estimates:
Iteration 0:   log likelihood = -122420.62

Cox regression -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        9,804
Time at risk    =     56140048
                                                LR chi2(1)       =      122.61
Log likelihood  =   -122420.62                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7490326   .0201662   -10.73   0.000     .7105324     .789619
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_univar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_univa
> r_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -122481.92
Iteration 1:   log likelihood =  -120894.2
Iteration 2:   log likelihood =  -119421.6
Iteration 3:   log likelihood = -119370.86
Iteration 4:   log likelihood = -119370.68
Iteration 5:   log likelihood = -119370.68
Refining estimates:
Iteration 0:   log likelihood = -119370.68

Cox regression -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        9,804
Time at risk    =     56140048
                                                LR chi2(5)       =     6222.48
Log likelihood  =   -119370.68                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .703845   .0189984   -13.01   0.000     .6675766    .7420837
      1.male |   1.213179   .0251128     9.34   0.000     1.164944    1.263411
        age1 |   1.033303   .0076189     4.44   0.000     1.018477    1.048344
        age2 |   1.068946    .011422     6.24   0.000     1.046792    1.091569
        age3 |   .7998545   .0454078    -3.93   0.000     .7156294    .8939923
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -48854.137
Iteration 1:   log likelihood = -45181.163
Iteration 2:   log likelihood = -44394.375
Iteration 3:   log likelihood = -44377.074
Iteration 4:   log likelihood = -44376.628
Iteration 5:   log likelihood = -44376.627
Refining estimates:
Iteration 0:   log likelihood = -44376.627

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        9,804
Time at risk    =     56140048
                                                LR chi2(31)      =     8955.02
Log likelihood  =   -44376.627                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7293992   .0203997   -11.28   0.000     .6904926     .770498
      1.male |   1.191871   .0262819     7.96   0.000     1.141457    1.244512
        age1 |   1.044499   .0079543     5.72   0.000     1.029024    1.060206
        age2 |    1.05297   .0115732     4.70   0.000     1.030529    1.075899
        age3 |   .8068817   .0470292    -3.68   0.000     .7197763    .9045284
             |
         imd |
          2  |   1.051496   .0396807     1.33   0.183     .9765304    1.132218
          3  |   1.094717   .0415035     2.39   0.017      1.01632     1.17916
          4  |   1.131742   .0449098     3.12   0.002     1.047056    1.223277
5 most de..  |   1.335287   .0549057     7.03   0.000     1.231896    1.447356
             |
   obese4cat |
Obese I ..)  |   .7533455   .0225861    -9.45   0.000     .7103532    .7989399
Obese II..)  |   .9045823    .039962    -2.27   0.023     .8295533    .9863973
Obese II..)  |   1.163148   .0698139     2.52   0.012     1.034057    1.308354
             |
smoke_nomiss |
     Former  |   1.229532   .0289845     8.77   0.000     1.174016    1.287673
    Current  |   2.013653   .0911803    15.46   0.000     1.842643    2.200533
             |
     diabcat |
Controlle..  |      1.217   .0300213     7.96   0.000     1.159559    1.277286
Uncontrol..  |   1.449644   .0508928    10.58   0.000      1.35325    1.552904
Diabetes,..  |    1.30878   .2109263     1.67   0.095     .9542999    1.794934
             |
1.myocardi~t |   1.167442    .033276     5.43   0.000      1.10401    1.234518
       1.pad |   1.462438   .0507863    10.95   0.000      1.36621    1.565443
1.hyperten~n |   1.140908   .0293269     5.13   0.000     1.084852     1.19986
1.heart_f~re |   1.691418   .0362656    24.51   0.000     1.621812    1.764012
1.stroke_tia |   1.239655   .0280399     9.50   0.000     1.185898    1.295849
       1.vte |   1.305683   .0432338     8.06   0.000     1.223638     1.39323
 1.oestrogen |   1.141916   .1818087     0.83   0.405      .835817    1.560117
1.flu_vac~ne |   .7551202   .0198183   -10.70   0.000     .7172592    .7949797
1.antiplat~t |   1.084434    .044057     2.00   0.046     1.001432    1.174315
1.care_ho~ce |   3.062317   .1055054    32.48   0.000     2.862357    3.276245
             |
   ethnicity |
      Mixed  |   .8998839   .2119433    -0.45   0.654     .5671644    1.427789
Asian or ..  |   1.008837    .100966     0.09   0.930     .8291468    1.227469
      Black  |   .9370899   .1413213    -0.43   0.667     .6972887     1.25936
      Other  |   .8265237   .1563875    -1.01   0.314     .5704248    1.197601
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -48854.137
Iteration 1:   log likelihood = -45181.616
Iteration 2:   log likelihood = -44395.095
Iteration 3:   log likelihood = -44377.801
Iteration 4:   log likelihood = -44377.355
Iteration 5:   log likelihood = -44377.354
Refining estimates:
Iteration 0:   log likelihood = -44377.354

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        9,804
Time at risk    =     56140048
                                                LR chi2(27)      =     8953.56
Log likelihood  =   -44377.354                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7294304   .0203968   -11.28   0.000     .6905291    .7705232
      1.male |   1.191786   .0262786     7.96   0.000     1.141378    1.244421
        age1 |   1.044626   .0079538     5.73   0.000     1.029153    1.060332
        age2 |   1.052831   .0115697     4.68   0.000     1.030398    1.075753
        age3 |   .8073658   .0470489    -3.67   0.000     .7202229    .9050525
             |
         imd |
          2  |   1.051617   .0396843     1.33   0.182     .9766442    1.132346
          3  |   1.094863   .0415077     2.39   0.017     1.016458    1.179315
          4  |   1.131833   .0449098     3.12   0.002     1.047147    1.223368
5 most de..  |   1.334779   .0548704     7.02   0.000     1.231453    1.446774
             |
   obese4cat |
Obese I ..)  |    .753329   .0225836    -9.45   0.000     .7103412    .7989183
Obese II..)  |   .9046743   .0399605    -2.27   0.023     .8296478    .9864857
Obese II..)  |   1.163219   .0698014     2.52   0.012     1.034149    1.308397
             |
smoke_nomiss |
     Former  |   1.229837   .0289219     8.80   0.000     1.174438     1.28785
    Current  |   2.014393   .0910936    15.49   0.000     1.843536    2.201084
             |
     diabcat |
Controlle..  |   1.216526   .0299826     7.95   0.000     1.159158    1.276733
Uncontrol..  |   1.449045   .0508107    10.58   0.000     1.352803    1.552134
Diabetes,..  |   1.308843   .2109231     1.67   0.095      .954365    1.794985
             |
1.myocardi~t |   1.167529   .0332676     5.44   0.000     1.104114    1.234588
       1.pad |   1.462576   .0507833    10.95   0.000     1.366354    1.565575
1.hyperten~n |   1.140686   .0293177     5.12   0.000     1.084648     1.19962
1.heart_f~re |   1.691511   .0362648    24.52   0.000     1.621906    1.764104
1.stroke_tia |   1.239539   .0280363     9.49   0.000     1.185789    1.295725
       1.vte |    1.30588   .0432358     8.06   0.000      1.22383     1.39343
 1.oestrogen |   1.141366   .1817226     0.83   0.406      .835412    1.559369
1.flu_vac~ne |   .7553329   .0198227   -10.69   0.000     .7174635    .7952012
1.antiplat~t |   1.084186    .044044     1.99   0.047     1.001209    1.174041
1.care_ho~ce |   3.062197   .1054679    32.49   0.000     2.862306    3.276047
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -48854.137
Iteration 1:   log likelihood = -48108.362
Iteration 2:   log likelihood = -43472.909
Iteration 3:   log likelihood = -43388.247
Iteration 4:   log likelihood = -43388.152
Iteration 5:   log likelihood = -43388.152
Refining estimates:
Iteration 0:   log likelihood = -43388.152

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        9,804
Time at risk    =     56140048
                                                LR chi2(38)      =    10931.97
Log likelihood  =   -43388.152                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8146526   .0229259    -7.28   0.000     .7709353    .8608489
      1.male |   1.188354    .026207     7.83   0.000     1.138084    1.240845
        age1 |   1.041669   .0078826     5.39   0.000     1.026333    1.057234
        age2 |    1.03956   .0113833     3.54   0.000     1.017486    1.062112
        age3 |   .8876486   .0516872    -2.05   0.041     .7919106    .9949608
             |
         imd |
          2  |   1.048008   .0396401     1.24   0.215     .9731249    1.128654
          3  |   1.082279   .0411041     2.08   0.037     1.004642    1.165916
          4  |   1.106742   .0440226     2.55   0.011     1.023737    1.196477
5 most de..  |   1.271909   .0525472     5.82   0.000     1.172978    1.379184
             |
   obese4cat |
Obese I ..)  |   .7665391   .0230355    -8.85   0.000     .7226941     .813044
Obese II..)  |   .9112627   .0403411    -2.10   0.036     .8355286    .9938614
Obese II..)  |   1.147232    .068987     2.28   0.022     1.019684    1.290735
             |
smoke_nomiss |
     Former  |   1.136785   .0273168     5.34   0.000     1.084486    1.191606
    Current  |   1.754372   .0816035    12.08   0.000     1.601506    1.921829
             |
     diabcat |
Controlle..  |   1.185052    .029354     6.85   0.000     1.128894    1.244004
Uncontrol..  |   1.386861   .0489546     9.26   0.000     1.294156    1.486207
Diabetes,..  |   1.300499   .2096276     1.63   0.103     .9482103    1.783673
             |
1.myocardi~t |   1.129314   .0322283     4.26   0.000     1.067882     1.19428
       1.pad |   1.387374   .0483217     9.40   0.000     1.295826     1.48539
1.hyperten~n |   1.141321   .0294336     5.13   0.000     1.085066    1.200493
1.heart_f~re |   1.552573   .0339107    20.14   0.000     1.487512     1.62048
1.stroke_tia |    1.18808   .0269608     7.59   0.000     1.136396    1.242115
       1.vte |   1.177513   .0392035     4.91   0.000     1.103129    1.256913
 1.oestrogen |    .927001   .1481531    -0.47   0.635      .677706    1.267999
1.flu_vac~ne |   .7453053   .0196823   -11.13   0.000     .7077101    .7848976
             |
         ckd |
        CKD  |   1.126407   .0251999     5.32   0.000     1.078084    1.176897
      1.copd |    1.34218   .0384526    10.27   0.000     1.268891    1.419702
1.other_re~y |   1.412904   .0494908     9.87   0.000     1.319158    1.513311
1.immunode~y |   1.405383   .1578202     3.03   0.002     1.127736    1.751387
    1.cancer |   1.613169   .0373887    20.63   0.000     1.541528     1.68814
1.ae_atten~r |   2.067521   .0455533    32.97   0.000     1.980139     2.15876
1.gp_consult |   .7950637   .0500525    -3.64   0.000     .7027734    .8994739
1.antiplat~t |   1.001893   .0408138     0.05   0.963     .9250101    1.085167
1.care_ho~ce |   2.888618   .1008476    30.38   0.000     2.697571    3.093195
             |
   ethnicity |
      Mixed  |   .9169786   .2163051    -0.37   0.713     .5775242    1.455956
Asian or ..  |   1.028477   .1035496     0.28   0.780     .8442937     1.25284
      Black  |   .9519372   .1436693    -0.33   0.744     .7081779      1.2796
      Other  |   .8438597   .1602144    -0.89   0.371     .5816502    1.224274
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onsnoncoviddeath
   analysis time _t:  (oac_date_after_mar-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
  exit on or before:  time stime_onsnoncoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -48854.137
Iteration 1:   log likelihood = -48108.303
Iteration 2:   log likelihood = -43473.492
Iteration 3:   log likelihood =  -43388.84
Iteration 4:   log likelihood = -43388.745
Iteration 5:   log likelihood = -43388.745
Refining estimates:
Iteration 0:   log likelihood = -43388.745

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,524                  Number of obs    =     290,306
No. of failures =        9,804
Time at risk    =     56140048
                                                LR chi2(34)      =    10930.78
Log likelihood  =   -43388.745                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8146142   .0229209    -7.29   0.000     .7709064       .8608
      1.male |   1.188286   .0262027     7.82   0.000     1.138024    1.240768
        age1 |   1.041758   .0078815     5.41   0.000     1.026425    1.057321
        age2 |   1.039459   .0113801     3.53   0.000     1.017393    1.062005
        age3 |    .888025   .0516995    -2.04   0.041     .7922633    .9953615
             |
         imd |
          2  |     1.0481   .0396429     1.24   0.214     .9732116    1.128751
          3  |   1.082313   .0411043     2.08   0.037     1.004676     1.16595
          4  |   1.106775   .0440207     2.55   0.011     1.023773    1.196506
5 most de..  |   1.271422   .0525139     5.81   0.000     1.172552    1.378628
             |
   obese4cat |
Obese I ..)  |   .7664326   .0230311    -8.85   0.000     .7225961    .8129285
Obese II..)  |    .911191   .0403338    -2.10   0.036     .8354703    .9937744
Obese II..)  |   1.146883   .0689526     2.28   0.023     1.019397    1.290312
             |
smoke_nomiss |
     Former  |   1.136643    .027253     5.34   0.000     1.084463    1.191332
    Current  |   1.753897   .0814823    12.09   0.000      1.60125    1.921096
             |
     diabcat |
Controlle..  |   1.184899   .0293238     6.86   0.000     1.128797     1.24379
Uncontrol..  |   1.386925   .0488971     9.28   0.000     1.294325     1.48615
Diabetes,..  |   1.301121   .2097188     1.63   0.102     .9486773    1.784503
             |
1.myocardi~t |   1.129531   .0322263     4.27   0.000     1.068102    1.194493
       1.pad |   1.387251   .0483121     9.40   0.000      1.29572    1.485247
1.hyperten~n |    1.14129   .0294293     5.13   0.000     1.085043    1.200453
1.heart_f~re |   1.552767   .0339128    20.15   0.000     1.487702    1.620678
1.stroke_tia |   1.188049   .0269591     7.59   0.000     1.136368    1.242081
       1.vte |   1.177611   .0392046     4.91   0.000     1.103225    1.257013
 1.oestrogen |   .9267661   .1481123    -0.48   0.634      .677539    1.267669
1.flu_vac~ne |   .7455329   .0196865   -11.12   0.000     .7079295    .7851336
             |
         ckd |
        CKD  |    1.12625   .0251938     5.31   0.000     1.077937    1.176727
      1.copd |   1.342418   .0384551    10.28   0.000     1.269124    1.419944
1.other_re~y |   1.412911   .0494891     9.87   0.000     1.319168    1.513315
1.immunode~y |   1.405583   .1578203     3.03   0.002     1.127931    1.751581
    1.cancer |   1.613156   .0373761    20.64   0.000     1.541539    1.688101
1.ae_atten~r |   2.067497   .0455491    32.97   0.000     1.980122    2.158727
1.gp_consult |   .7949135   .0500435    -3.65   0.000     .7026399    .8993049
1.antiplat~t |   1.001661   .0408012     0.04   0.968     .9248008    1.084908
1.care_ho~ce |   2.887989   .1007923    30.39   0.000     2.697045    3.092452
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeat
> h_multivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_5/onsnoncoviddeath_multi
> var3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_5/table3_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    221,573    4.53e+07           0   4.53e+07   4.53e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,737    1.20e+07           0   1.20e+07   1.20e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7490326   .0201662   -10.73   0.000     .7105324     .789619
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .703845   .0189984   -13.01   0.000     .6675766    .7420837
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7293992   .0203997   -11.28   0.000     .6904926     .770498
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7294304   .0203968   -11.28   0.000     .6905291    .7705232
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8146526   .0229259    -7.28   0.000     .7709353    .8608489
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8146142   .0229209    -7.29   0.000     .7709064       .8608
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_5/06b_an_models_ethni
> city_onsnoncoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:40:52
-------------------------------------------------------------------------------
