-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/post_hoc_3_af_warfarin_log/05b_an_models_onscovi
> ddeath.log
  log type:  text
 opened on:  28 Jul 2021, 13:43:16

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |     2,584      1,412 |     3,996 
             |     64.66      35.34 |    100.00 
-------------+----------------------+----------
warfarin use |       493        283 |       776 
             |     63.53      36.47 |    100.00 
-------------+----------------------+----------
       Total |     3,077      1,695 |     4,772 
             |     64.48      35.52 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time first_positive_test_date
  enter on or after:  time first_positive_test_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -13430.441
Iteration 1:   log likelihood = -13430.331
Iteration 2:   log likelihood = -13430.331
Refining estimates:
Iteration 0:   log likelihood = -13430.331

Cox regression -- Breslow method for ties

No. of subjects =        4,670                  Number of obs    =       4,670
No. of failures =        1,635
Time at risk    =     405445.5
                                                LR chi2(1)       =        0.22
Log likelihood  =   -13430.331                  Prob > chi2      =      0.6390

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   1.031951   .0689404     0.47   0.638     .9053027    1.176317
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_uni
> var.ster not found)
file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_univar.ste
> r saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time first_positive_test_date
  enter on or after:  time first_positive_test_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -13430.441
Iteration 1:   log likelihood = -13344.095
Iteration 2:   log likelihood = -13335.188
Iteration 3:   log likelihood = -13334.065
Iteration 4:   log likelihood = -13334.042
Iteration 5:   log likelihood = -13334.042
Refining estimates:
Iteration 0:   log likelihood = -13334.042

Cox regression -- Breslow method for ties

No. of subjects =        4,670                  Number of obs    =       4,670
No. of failures =        1,635
Time at risk    =     405445.5
                                                LR chi2(5)       =      192.80
Log likelihood  =   -13334.042                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .9904835   .0662915    -0.14   0.886     .8687156     1.12932
      1.male |   1.494795   .0775701     7.75   0.000     1.350236     1.65483
        age1 |   1.124138   .0266755     4.93   0.000     1.073052    1.177656
        age2 |    .915625   .0295892    -2.73   0.006     .8594297    .9754948
        age3 |   1.296895   .2111573     1.60   0.110     .9425714    1.784413
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_mul
> tivar1.ster not found)
file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_multivar1.
> ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time first_positive_test_date
  enter on or after:  time first_positive_test_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -1735.5627
Iteration 1:   log likelihood = -1655.5169
Iteration 2:   log likelihood = -1652.2779
Iteration 3:   log likelihood = -1652.1308
Iteration 4:   log likelihood = -1652.1303
Refining estimates:
Iteration 0:   log likelihood = -1652.1303

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        4,670                  Number of obs    =       4,670
No. of failures =        1,635
Time at risk    =     405445.5
                                                LR chi2(27)      =      166.86
Log likelihood  =   -1652.1303                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   1.154905   .1089029     1.53   0.127     .9600227    1.389349
      1.male |    1.35368   .0994681     4.12   0.000     1.172114    1.563371
        age1 |   1.117978   .0327951     3.80   0.000     1.055514    1.184139
        age2 |   .9271583    .038239    -1.83   0.067     .8551604    1.005218
        age3 |   1.213957    .258839     0.91   0.363     .7993017    1.843724
             |
         imd |
          2  |   1.000668   .1290187     0.01   0.996     .7772173    1.288361
          3  |   1.209758   .1590764     1.45   0.148     .9349106    1.565404
          4  |   .9906198   .1376535    -0.07   0.946     .7544434    1.300731
5 most de..  |   1.106713   .1541267     0.73   0.467     .8423492    1.454045
             |
   obese4cat |
Obese I ..)  |   1.131145   .1056618     1.32   0.187     .9419034    1.358408
Obese II..)  |   1.101415   .1483392     0.72   0.473     .8458837    1.434139
Obese II..)  |   1.084671   .2018248     0.44   0.662     .7532084    1.562001
             |
smoke_nomiss |
     Former  |   1.147253   .0903643     1.74   0.081     .9831365    1.338767
    Current  |   1.204886   .2110165     1.06   0.287     .8548138    1.698323
             |
     diabcat |
Controlle..  |   1.181236   .0952018     2.07   0.039     1.008635    1.383374
Uncontrol..  |   .9609065   .1096149    -0.35   0.727     .7683883     1.20166
Diabetes,..  |   .4663218   .3706063    -0.96   0.337     .0982197    2.213975
             |
1.myocardi~t |   1.273439   .1181208     2.61   0.009     1.061752    1.527332
       1.pad |   1.214809   .1367067     1.73   0.084     .9743601    1.514596
1.hyperten~n |   .9724245   .0793526    -0.34   0.732     .8286964    1.141081
1.heart_f~re |   1.312447   .0952544     3.75   0.000     1.138423    1.513074
1.stroke_tia |   1.007011   .0766273     0.09   0.927     .8674876    1.168976
       1.vte |   1.151114    .122002     1.33   0.184     .9351968    1.416882
 1.oestrogen |   .9281495   .5241987    -0.13   0.895     .3068158    2.807748
1.antiplat~t |   .9541694   .1356723    -0.33   0.741     .7220946    1.260831
1.flu_vac~ne |   .9445549   .0812354    -0.66   0.507     .7980325    1.117979
1.care_ho~ce |   .9109982    .086905    -0.98   0.329     .7556434    1.098293
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_mul
> tivar2.ster not found)
file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_multivar2.
> ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time first_positive_test_date
  enter on or after:  time first_positive_test_date
  exit on or before:  time stime_onscoviddeath
                 id:  patient_id

Iteration 0:   log likelihood = -1735.5627
Iteration 1:   log likelihood = -1645.8223
Iteration 2:   log likelihood =   -1642.74
Iteration 3:   log likelihood = -1642.6034
Iteration 4:   log likelihood =  -1642.603
Refining estimates:
Iteration 0:   log likelihood =  -1642.603

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        4,670                  Number of obs    =       4,670
No. of failures =        1,635
Time at risk    =     405445.5
                                                LR chi2(34)      =      185.92
Log likelihood  =    -1642.603                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   1.183089   .1124771     1.77   0.077     .9819582    1.425416
      1.male |   1.371178   .1015416     4.26   0.000     1.185929    1.585364
        age1 |   1.109609   .0326252     3.54   0.000     1.047472    1.175432
        age2 |   .9304936   .0384246    -1.74   0.081     .8581498    1.008936
        age3 |   1.206407   .2575289     0.88   0.379     .7939436    1.833149
             |
         imd |
          2  |   .9876111   .1279072    -0.10   0.923     .7662057    1.272995
          3  |   1.214789   .1600529     1.48   0.140     .9383217    1.572714
          4  |   .9822563   .1372657    -0.13   0.898     .7469187    1.291743
5 most de..  |    1.09322   .1529967     0.64   0.524     .8309622    1.438247
             |
   obese4cat |
Obese I ..)  |   1.128144   .1058819     1.28   0.199      .938588    1.355982
Obese II..)  |   1.098397   .1478359     0.70   0.486     .8437116    1.429962
Obese II..)  |    1.09668   .2051735     0.49   0.622     .7600322    1.582442
             |
smoke_nomiss |
     Former  |   1.109844   .0889164     1.30   0.193      .948565    1.298545
    Current  |   1.182549   .2131492     0.93   0.352     .8306033    1.683621
             |
     diabcat |
Controlle..  |    1.15793   .0939014     1.81   0.071     .9877675    1.357406
Uncontrol..  |   .9167906   .1055882    -0.75   0.451     .7315365    1.148959
Diabetes,..  |   .4594837    .365847    -0.98   0.329     .0965011    2.187802
             |
1.myocardi~t |   1.250607   .1165378     2.40   0.016     1.041842    1.501205
       1.pad |    1.19998   .1362229     1.61   0.108     .9606047    1.499006
1.hyperten~n |   .9659747   .0793617    -0.42   0.673      .822306    1.134744
1.heart_f~re |   1.253871   .0925173     3.07   0.002     1.085042    1.448968
1.stroke_tia |    .997466   .0763532    -0.03   0.974     .8585015    1.158925
       1.vte |   1.119117   .1192783     1.06   0.291     .9081393     1.37911
 1.oestrogen |   .9377264   .5343914    -0.11   0.910     .3068977    2.865225
1.antiplat~t |   .9555117   .1372633    -0.32   0.751     .7210365    1.266236
1.flu_vac~ne |    .939793   .0813442    -0.72   0.473     .7931513    1.113546
             |
         ckd |
        CKD  |   1.255588   .0926038     3.09   0.002     1.086596    1.450862
      1.copd |   1.029228    .102645     0.29   0.773     .8464891    1.251417
1.other_re~y |    1.27356   .1498924     2.05   0.040     1.011199    1.603991
1.immunode~y |    1.48098   .5756657     1.01   0.312     .6913244    3.172607
    1.cancer |   .9953145   .0857926    -0.05   0.957     .8406007    1.178504
1.ae_atten~r |      1.127   .0824558     1.63   0.102     .9764419    1.300772
1.gp_consult |   1.137516   .2051261     0.71   0.475     .7988438    1.619769
1.care_ho~ce |   .9444631   .0916059    -0.59   0.556     .7809527    1.142208
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_mul
> tivar3.ster not found)
file /workspace/output/post_hoc_3_af_warfarin_tempdata/onscoviddeath_multivar3.
> ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/post_hoc_3_af_warfarin_tabfig/table2_onscoviddeat
> h.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.031951   .0689404     0.47   0.638     .9053027    1.176317
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9904835   .0662915    -0.14   0.886     .8687156     1.12932
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.154905   .1089029     1.53   0.127     .9600227    1.389349
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.183089   .1124771     1.77   0.077     .9819582    1.425416
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/post_hoc_3_af_warfarin_log/05b_an_models_onscovi
> ddeath.log
  log type:  text
 closed on:  28 Jul 2021, 13:43:18
-------------------------------------------------------------------------------
