-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/05a_an_models_admitcovid
> .log
  log type:  text
 opened on:  31 Dec 2020, 03:06:02

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |
anticoagula |   Failure/censoring
         nt |     indicator for
  Treatment |  outcome: SUS covid
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    13,999         44 |    14,043 
            |     99.69       0.31 |    100.00 
------------+----------------------+----------
current use |    49,838        161 |    49,999 
            |     99.68       0.32 |    100.00 
------------+----------------------+----------
      Total |    63,837        205 |    64,042 
            |     99.68       0.32 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -2266.959
Iteration 1:   log likelihood = -2266.9511
Iteration 2:   log likelihood = -2266.9511
Refining estimates:
Iteration 0:   log likelihood = -2266.9511

Cox regression -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =          205
Time at risk    =     13303449
                                                LR chi2(1)       =        0.02
Log likelihood  =   -2266.9511                  Prob > chi2      =      0.9003

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.021502   .1737709     0.13   0.900     .7318776    1.425738
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_univar.st
> er not found)
file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_univar.ster save
> d

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -2266.959
Iteration 1:   log likelihood = -2223.9691
Iteration 2:   log likelihood = -2214.6021
Iteration 3:   log likelihood = -2214.4115
Iteration 4:   log likelihood = -2214.4113
Refining estimates:
Iteration 0:   log likelihood = -2214.4113

Cox regression -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =          205
Time at risk    =     13303449
                                                LR chi2(5)       =      105.10
Log likelihood  =   -2214.4113                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .984213   .1697153    -0.09   0.926      .701956    1.379966
      1.male |   2.526558    .672142     3.48   0.000     1.499973    4.255739
        age1 |   .9630387   .0159055    -2.28   0.023     .9323638    .9947229
        age2 |   1.113578   .0407327     2.94   0.003     1.036538    1.196344
        age3 |   .7770816   .2078138    -0.94   0.346     .4600775    1.312509
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_multivar1
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_multivar1.ster s
> aved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -2266.959
Iteration 1:   log likelihood =  -2213.967
Iteration 2:   log likelihood = -2200.3731
Iteration 3:   log likelihood = -2200.1114
Iteration 4:   log likelihood =  -2200.094
Iteration 5:   log likelihood = -2200.0877
Iteration 6:   log likelihood = -2200.0854
Iteration 7:   log likelihood = -2200.0846
Iteration 8:   log likelihood = -2200.0843
Iteration 9:   log likelihood = -2200.0841
Iteration 10:  log likelihood = -2200.0841
Iteration 11:  log likelihood = -2200.0841
Iteration 12:  log likelihood = -2200.0841
Iteration 13:  log likelihood = -2200.0841
Iteration 14:  log likelihood = -2200.0841
Iteration 15:  log likelihood = -2200.0841
Iteration 16:  log likelihood = -2200.0841
Iteration 17:  log likelihood = -2200.0841
Iteration 18:  log likelihood = -2200.0841
Iteration 19:  log likelihood = -2200.0841
Iteration 20:  log likelihood = -2200.0841
Iteration 21:  log likelihood = -2200.0841
Iteration 22:  log likelihood = -2200.0841
Iteration 23:  log likelihood = -2200.0841
Iteration 24:  log likelihood = -2200.0841
Iteration 25:  log likelihood = -2200.0841
Iteration 26:  log likelihood = -2200.0841
Iteration 27:  log likelihood = -2200.0841
Iteration 28:  log likelihood = -2200.0841
Iteration 29:  log likelihood = -2200.0841
Iteration 30:  log likelihood = -2200.0841
Iteration 31:  log likelihood = -2200.0841
Iteration 32:  log likelihood = -2200.0841
Iteration 33:  log likelihood = -2200.0841
Iteration 34:  log likelihood = -2200.0841
Iteration 35:  log likelihood = -2200.0841
Iteration 36:  log likelihood = -2200.0841
Iteration 37:  log likelihood = -2200.0841
Iteration 38:  log likelihood = -2200.0841
Iteration 39:  log likelihood = -2200.0841
Iteration 40:  log likelihood = -2200.0841
Iteration 41:  log likelihood = -2200.0841
Iteration 42:  log likelihood = -2200.0841
Iteration 43:  log likelihood = -2200.0841
Iteration 44:  log likelihood = -2200.0841
Refining estimates:
Iteration 0:   log likelihood = -2200.0841

Cox regression -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =          205
Time at risk    =     13303449
                                                LR chi2(24)      =      133.75
Log likelihood  =   -2200.0841                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9278832   .1621402    -0.43   0.668     .6587986    1.306875
      1.male |   1.779754   .6697436     1.53   0.126     .8512205    3.721154
        age1 |   .9957866    .021534    -0.20   0.845     .9544627      1.0389
        age2 |   1.129868   .0542071     2.55   0.011     1.028466    1.241267
        age3 |      .6115   .2243886    -1.34   0.180     .2978859    1.255287
             |
         imd |
          2  |   .8725388   .1891568    -0.63   0.529     .5704973    1.334492
          3  |   .7924366   .1773935    -1.04   0.299     .5109942     1.22889
          4  |   1.046237   .2239294     0.21   0.833     .6877721    1.591532
5 most de..  |   1.106171    .241757     0.46   0.644     .7207579    1.697676
             |
   obese4cat |
Obese I ..)  |   1.085907   .2180895     0.41   0.682     .7325559      1.6097
Obese II..)  |   1.534906   .4120547     1.60   0.110     .9069252    2.597717
Obese II..)  |   2.007143   .6377542     2.19   0.028     1.076752    3.741459
             |
smoke_nomiss |
     Former  |   1.282624   .2043311     1.56   0.118     .9386354    1.752677
    Current  |   1.743868   .4660812     2.08   0.037     1.032795     2.94451
             |
     diabcat |
Controlle..  |   1.820283   .6508665     1.68   0.094     .9031931    3.668575
Uncontrol..  |   1.862085   .8076722     1.43   0.152     .7957818    4.357174
Diabetes,..  |   2.07e-19          .        .       .            .           .
             |
1.myocardi~t |   1.870189   .9660362     1.21   0.226     .6795194    5.147177
       1.pad |   1.954573   1.458883     0.90   0.369     .4526054    8.440813
1.hyperten~n |   1.008196   .3144017     0.03   0.979     .5471435    1.857755
1.heart_f~re |   1.918586   .6721041     1.86   0.063     .9655946    3.812128
1.stroke_tia |   2.784923   1.804852     1.58   0.114     .7819282     9.91881
       1.vte |   3.108679   2.139311     1.65   0.099      .806866    11.97706
 1.oestrogen |   2.802276   2.051809     1.41   0.159      .667216    11.76943
1.flu_vac~ne |   1.078612   .1835143     0.44   0.656     .7727562    1.505526
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_multivar2
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_multivar2.ster s
> aved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -712.0988
Iteration 1:   log likelihood = -682.24265
Iteration 2:   log likelihood = -626.97732
Iteration 3:   log likelihood = -624.22148
Iteration 4:   log likelihood =  -624.1991
Iteration 5:   log likelihood =  -624.1976
Iteration 6:   log likelihood = -624.19705
Iteration 7:   log likelihood = -624.19684
Iteration 8:   log likelihood = -624.19677
Iteration 9:   log likelihood = -624.19674
Iteration 10:  log likelihood = -624.19673
Iteration 11:  log likelihood = -624.19673
Iteration 12:  log likelihood = -624.19673
Iteration 13:  log likelihood = -624.19673
Iteration 14:  log likelihood = -624.19673
Iteration 15:  log likelihood = -624.19673
Iteration 16:  log likelihood = -624.19673
Iteration 17:  log likelihood = -624.19673
Iteration 18:  log likelihood = -624.19673
Iteration 19:  log likelihood = -624.19673
Iteration 20:  log likelihood = -624.19673
Iteration 21:  log likelihood = -624.19673
Iteration 22:  log likelihood = -624.19673
Iteration 23:  log likelihood = -624.19673
Iteration 24:  log likelihood = -624.19673
Iteration 25:  log likelihood = -624.19673
Iteration 26:  log likelihood = -624.19673
Iteration 27:  log likelihood = -624.19673
Iteration 28:  log likelihood = -624.19673
Iteration 29:  log likelihood = -624.19673
Iteration 30:  log likelihood = -624.19673
Iteration 31:  log likelihood = -624.19673
Refining estimates:
Iteration 0:   log likelihood = -624.19673
Iteration 1:   log likelihood = -624.19673
Iteration 2:   log likelihood = -624.19673
Iteration 3:   log likelihood = -624.19673

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       64,042                  Number of obs    =      64,042
No. of failures =          205
Time at risk    =     13303449
                                                LR chi2(32)      =      175.80
Log likelihood  =   -624.19673                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8594319   .1608831    -0.81   0.418     .5954826    1.240377
      1.male |   1.916733   .7449585     1.67   0.094     .8948144    4.105727
        age1 |   .9932065   .0208408    -0.32   0.745     .9531878    1.034905
        age2 |   1.106552   .0558401     2.01   0.045     1.002346    1.221592
        age3 |   .7111698   .2779409    -0.87   0.383     .3306015    1.529825
             |
         imd |
          2  |   .8563219   .2078385    -0.64   0.523     .5321589    1.377948
          3  |   .7839376   .2010687    -0.95   0.343     .4741989    1.295992
          4  |   .8794184   .2275843    -0.50   0.620     .5295579     1.46042
5 most de..  |   .8374616   .2365254    -0.63   0.530     .4814586    1.456703
             |
   obese4cat |
Obese I ..)  |   1.070502    .223259     0.33   0.744     .7113195    1.611054
Obese II..)  |   1.469096   .4153775     1.36   0.174     .8440698    2.556948
Obese II..)  |   2.055501   .6879238     2.15   0.031       1.0667    3.960893
             |
smoke_nomiss |
     Former  |   1.146589   .1962958     0.80   0.424     .8197511    1.603737
    Current  |    1.49774   .4322288     1.40   0.162     .8507275    2.636832
             |
     diabcat |
Controlle..  |   1.689326    .631497     1.40   0.161     .8119339    3.514845
Uncontrol..  |   1.826168   .8132703     1.35   0.176     .7628943    4.371364
Diabetes,..  |   2.40e-15   1.61e-07    -0.00   1.000            0           .
             |
1.myocardi~t |    2.14919   1.144529     1.44   0.151     .7567916    6.103422
       1.pad |   1.237278   .9600863     0.27   0.784      .270373    5.662017
1.hyperten~n |   .9755696   .3148963    -0.08   0.939     .5182099    1.836584
1.heart_f~re |   1.561188   .5679076     1.22   0.221     .7652736    3.184884
1.stroke_tia |   2.623312   1.757281     1.44   0.150     .7057557    9.750914
       1.vte |   1.980986   1.360371     1.00   0.320     .5156433    7.610505
 1.oestrogen |   2.864317   2.356754     1.28   0.201     .5710239    14.36772
1.flu_vac~ne |   1.023739   .1870805     0.13   0.898     .7155482    1.464671
             |
         ckd |
        CKD  |   1.771089    .308458     3.28   0.001     1.258904    2.491656
      1.copd |   2.113582   .4416655     3.58   0.000      1.40329    3.183397
1.other_re~y |   .6916509   .2404881    -1.06   0.289      .349883     1.36726
1.immunode~y |   .9078166   .6702477    -0.13   0.896     .2135747    3.858749
    1.cancer |   1.086735   .2064851     0.44   0.662      .748844    1.577089
1.ae_atten~r |   2.132276   .3251142     4.97   0.000      1.58146    2.874938
1.gp_consult |   .9794216   .4213282    -0.05   0.961     .4215016    2.275831
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_multivar3
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/admitcovid_multivar3.ster s
> aved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_1/table2_admitcovid.txt 
> not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.021502   .1737709     0.13   0.900     .7318776    1.425738
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .984213   .1697153    -0.09   0.926      .701956    1.379966
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9278832   .1621402    -0.43   0.668     .6587986    1.306875
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8594319   .1608831    -0.81   0.418     .5954826    1.240377
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/05a_an_models_admitcovid
> .log
  log type:  text
 closed on:  31 Dec 2020, 03:07:13
-------------------------------------------------------------------------------
