-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/06a_an_models_ethnicity_
> onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:05:10

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(16,520 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |  outcome: ONS covid
  Treatment |         death
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    10,369         27 |    10,396 
            |     99.74       0.26 |    100.00 
------------+----------------------+----------
current use |    37,035         91 |    37,126 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Total |    47,404        118 |    47,522 
            |     99.75       0.25 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1269.8463
Iteration 1:   log likelihood = -1269.8055
Iteration 2:   log likelihood = -1269.8055
Refining estimates:
Iteration 0:   log likelihood = -1269.8055

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          118
Time at risk    =      9899376
                                                LR chi2(1)       =        0.08
Log likelihood  =   -1269.8055                  Prob > chi2      =      0.7749

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9389268   .2057644    -0.29   0.774     .6110717    1.442684
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_univar
> _ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_univar_ethn.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1269.8463
Iteration 1:   log likelihood = -1215.1023
Iteration 2:   log likelihood = -1197.9391
Iteration 3:   log likelihood = -1197.5333
Iteration 4:   log likelihood = -1197.5309
Iteration 5:   log likelihood = -1197.5309
Refining estimates:
Iteration 0:   log likelihood = -1197.5309

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          118
Time at risk    =      9899376
                                                LR chi2(5)       =      144.63
Log likelihood  =   -1197.5309                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8781511   .1950098    -0.59   0.558     .5682561    1.357045
      1.male |   1.968992    .776208     1.72   0.086      .909257    4.263842
        age1 |   .9839334    .030649    -0.52   0.603     .9256594    1.045876
        age2 |   1.174391   .0671907     2.81   0.005     1.049815     1.31375
        age3 |   .5242204   .1934035    -1.75   0.080     .2543756     1.08032
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multiv
> ar1_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multivar1_eth
> n.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1269.8463
Iteration 1:   log likelihood = -1259.0126
Iteration 2:   log likelihood = -1194.5081
Iteration 3:   log likelihood = -1179.7901
Iteration 4:   log likelihood = -1178.9541
Iteration 5:   log likelihood = -1178.9027
Iteration 6:   log likelihood = -1178.8909
Iteration 7:   log likelihood = -1178.8866
Iteration 8:   log likelihood =  -1178.885
Iteration 9:   log likelihood = -1178.8844
Iteration 10:  log likelihood = -1178.8842
Iteration 11:  log likelihood = -1178.8841
Iteration 12:  log likelihood = -1178.8841
Iteration 13:  log likelihood = -1178.8841
Iteration 14:  log likelihood = -1178.8841
Iteration 15:  log likelihood = -1178.8841
Iteration 16:  log likelihood = -1178.8841
Iteration 17:  log likelihood = -1178.8841
Iteration 18:  log likelihood = -1178.8841
Iteration 19:  log likelihood = -1178.8841
Iteration 20:  log likelihood = -1178.8841
Iteration 21:  log likelihood = -1178.8841
Iteration 22:  log likelihood = -1178.8841
Iteration 23:  log likelihood = -1178.8841
Iteration 24:  log likelihood = -1178.8841
Iteration 25:  log likelihood = -1178.8841
Iteration 26:  log likelihood = -1178.8841
Iteration 27:  log likelihood = -1178.8841
Iteration 28:  log likelihood = -1178.8841
Iteration 29:  log likelihood = -1178.8841
Iteration 30:  log likelihood = -1178.8841
Iteration 31:  log likelihood = -1178.8841
Iteration 32:  log likelihood = -1178.8841
Iteration 33:  log likelihood = -1178.8841
Iteration 34:  log likelihood = -1178.8841
Iteration 35:  log likelihood = -1178.8841
Iteration 36:  log likelihood = -1178.8841
Iteration 37:  log likelihood = -1178.8841
Iteration 38:  log likelihood = -1178.8841
Iteration 39:  log likelihood = -1178.8841
Iteration 40:  log likelihood = -1178.8841
Iteration 41:  log likelihood = -1178.8841
Iteration 42:  log likelihood = -1178.8841
Iteration 43:  log likelihood = -1178.8841
Iteration 44:  log likelihood = -1178.8841
Refining estimates:
Iteration 0:   log likelihood = -1178.8841

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          118
Time at risk    =      9899376
                                                LR chi2(23)      =      181.92
Log likelihood  =   -1178.8841                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7981247   .1796893    -1.00   0.317     .5133715    1.240823
      1.male |   1.239496   .7057114     0.38   0.706     .4060791    3.783378
        age1 |   1.009805   .0409899     0.24   0.810     .9325794    1.093427
        age2 |   1.220685   .0853669     2.85   0.004      1.06433    1.400011
        age3 |   .3602613   .1805414    -2.04   0.042     .1349107    .9620306
             |
         imd |
          2  |   1.008399   .2885184     0.03   0.977     .5755602    1.766747
          3  |   .9029753   .2683073    -0.34   0.731     .5043737    1.616588
          4  |   .8681521   .2699573    -0.45   0.649     .4719646    1.596917
5 most de..  |   1.546393   .4279095     1.58   0.115     .8990424    2.659866
             |
   obese4cat |
Obese I ..)  |   1.336952   .3503721     1.11   0.268     .7999141    2.234541
Obese II..)  |   1.781406   .7045484     1.46   0.144     .8205626    3.867357
Obese II..)  |   2.274825   1.140909     1.64   0.101     .8512141    6.079351
             |
smoke_nomiss |
     Former  |   1.688549   .3774676     2.34   0.019      1.08951    2.616953
    Current  |   1.602272   .6942022     1.09   0.277      .685399    3.745664
             |
     diabcat |
Controlle..  |   1.292976   .8105092     0.41   0.682     .3784512    4.417442
Uncontrol..  |   1.630281   1.197794     0.67   0.506     .3862519     6.88104
Diabetes,..  |   5.74e-19          .        .       .            .           .
             |
1.myocardi~t |   4.794591   3.180044     2.36   0.018     1.306732    17.59206
       1.pad |   1.23e-19          .        .       .            .           .
1.hyperten~n |   1.236952   .6057809     0.43   0.664     .4736837    3.230112
1.heart_f~re |   2.343662    1.31344     1.52   0.129     .7813808    7.029545
1.stroke_tia |   1.27e-19          .        .       .            .           .
       1.vte |   3.72e-19          .        .       .            .           .
 1.oestrogen |   2.41e-19          .        .       .            .           .
1.flu_vac~ne |   1.152021   .2757695     0.59   0.554     .7206103    1.841705
             |
   ethnicity |
      Mixed  |   6.629659   6.709269     1.87   0.062     .9121542    48.18525
Asian or ..  |   2.523966   1.835771     1.27   0.203     .6067002    10.50008
      Black  |   1.73e-19          .        .       .            .           .
      Other  |     6.1405   4.433139     2.51   0.012     1.491688    25.27722
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multiv
> ar2_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multivar2_eth
> n.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist      

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1269.8463
Iteration 1:   log likelihood = -1262.5172
Iteration 2:   log likelihood = -1197.7142
Iteration 3:   log likelihood = -1183.6583
Iteration 4:   log likelihood = -1182.8874
Iteration 5:   log likelihood = -1182.8485
Iteration 6:   log likelihood = -1182.8411
Iteration 7:   log likelihood = -1182.8384
Iteration 8:   log likelihood = -1182.8374
Iteration 9:   log likelihood =  -1182.837
Iteration 10:  log likelihood = -1182.8369
Iteration 11:  log likelihood = -1182.8369
Iteration 12:  log likelihood = -1182.8368
Iteration 13:  log likelihood = -1182.8368
Iteration 14:  log likelihood = -1182.8368
Iteration 15:  log likelihood = -1182.8368
Iteration 16:  log likelihood = -1182.8368
Iteration 17:  log likelihood = -1182.8368
Iteration 18:  log likelihood = -1182.8368
Iteration 19:  log likelihood = -1182.8368
Iteration 20:  log likelihood = -1182.8368
Iteration 21:  log likelihood = -1182.8368
Iteration 22:  log likelihood = -1182.8368
Iteration 23:  log likelihood = -1182.8368
Iteration 24:  log likelihood = -1182.8368
Iteration 25:  log likelihood = -1182.8368
Iteration 26:  log likelihood = -1182.8368
Iteration 27:  log likelihood = -1182.8368
Iteration 28:  log likelihood = -1182.8368
Iteration 29:  log likelihood = -1182.8368
Iteration 30:  log likelihood = -1182.8368
Iteration 31:  log likelihood = -1182.8368
Iteration 32:  log likelihood = -1182.8368
Iteration 33:  log likelihood = -1182.8368
Iteration 34:  log likelihood = -1182.8368
Iteration 35:  log likelihood = -1182.8368
Iteration 36:  log likelihood = -1182.8368
Iteration 37:  log likelihood = -1182.8368
Iteration 38:  log likelihood = -1182.8368
Iteration 39:  log likelihood = -1182.8368
Iteration 40:  log likelihood = -1182.8368
Iteration 41:  log likelihood = -1182.8368
Iteration 42:  log likelihood = -1182.8368
Iteration 43:  log likelihood = -1182.8368
Iteration 44:  log likelihood = -1182.8368
Refining estimates:
Iteration 0:   log likelihood = -1182.8368

Cox regression -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          118
Time at risk    =      9899376
                                                LR chi2(20)      =      174.02
Log likelihood  =   -1182.8368                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8033032   .1807668    -0.97   0.330     .5168139    1.248604
      1.male |   1.254959   .7158733     0.40   0.691     .4102736    3.838709
        age1 |   1.002485   .0404554     0.06   0.951     .9262483    1.084996
        age2 |   1.223862   .0854328     2.89   0.004     1.067367    1.403303
        age3 |   .3621464   .1812202    -2.03   0.042     .1358119    .9656739
             |
         imd |
          2  |   1.002513   .2866796     0.01   0.993     .5723739    1.755903
          3  |    .902216   .2678418    -0.35   0.729     .5042123    1.614387
          4  |   .8660061   .2689661    -0.46   0.643     .4711431    1.591802
5 most de..  |   1.560779   .4314366     1.61   0.107     .9079232    2.683082
             |
   obese4cat |
Obese I ..)  |   1.322747   .3466257     1.07   0.286     .7914426    2.210721
Obese II..)  |   1.710945   .6770908     1.36   0.175     .7877364    3.716133
Obese II..)  |   2.169002   1.086901     1.55   0.122     .8123015    5.791655
             |
smoke_nomiss |
     Former  |    1.68424   .3756103     2.34   0.019     1.087861    2.607561
    Current  |   1.603815   .6947563     1.09   0.276     .6861552    3.748747
             |
     diabcat |
Controlle..  |   1.342179   .8366063     0.47   0.637     .3955849    4.553874
Uncontrol..  |   1.657451   1.218337     0.69   0.492     .3924199    7.000522
Diabetes,..  |   5.82e-19          .        .       .            .           .
             |
1.myocardi~t |   4.612094   3.057676     2.31   0.021     1.257702    16.91292
       1.pad |   1.17e-19          .        .       .            .           .
1.hyperten~n |   1.206692   .5914099     0.38   0.701      .461759    3.153389
1.heart_f~re |   2.230595   1.251877     1.43   0.153     .7425072    6.701017
1.stroke_tia |   1.11e-19          .        .       .            .           .
       1.vte |   3.21e-19          .        .       .            .           .
 1.oestrogen |   2.28e-19          .        .       .            .           .
1.flu_vac~ne |   1.138711   .2721598     0.54   0.587     .7128046      1.8191
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multiv
> ar2_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multivar2_wit
> houtethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -375.38524
Iteration 1:   log likelihood = -321.01997
Iteration 2:   log likelihood = -295.76548
Iteration 3:   log likelihood =  -282.3622
Iteration 4:   log likelihood = -277.88519
Iteration 5:   log likelihood = -277.83468
Iteration 6:   log likelihood =  -277.8231
Iteration 7:   log likelihood = -277.81885
Iteration 8:   log likelihood = -277.81728
Iteration 9:   log likelihood = -277.81671
Iteration 10:  log likelihood =  -277.8165
Iteration 11:  log likelihood = -277.81642
Iteration 12:  log likelihood = -277.81639
Iteration 13:  log likelihood = -277.81638
Iteration 14:  log likelihood = -277.81638
Iteration 15:  log likelihood = -277.81637
Iteration 16:  log likelihood = -277.81637
Iteration 17:  log likelihood = -277.81637
Iteration 18:  log likelihood = -277.81637
Iteration 19:  log likelihood = -277.81637
Iteration 20:  log likelihood = -277.81637
Iteration 21:  log likelihood = -277.81637
Iteration 22:  log likelihood = -277.81637
Iteration 23:  log likelihood = -277.81637
Iteration 24:  log likelihood = -277.81637
Iteration 25:  log likelihood = -277.81637
Iteration 26:  log likelihood = -277.81637
Iteration 27:  log likelihood = -277.81637
Iteration 28:  log likelihood = -277.81637
Iteration 29:  log likelihood = -277.81637
Iteration 30:  log likelihood = -277.81637
Iteration 31:  log likelihood = -277.81637
Iteration 32:  log likelihood = -277.81637
Iteration 33:  log likelihood = -277.81637
Iteration 34:  log likelihood = -277.81637
Iteration 35:  log likelihood = -277.81637
Iteration 36:  log likelihood = -277.81637
Iteration 37:  log likelihood = -277.81637
Iteration 38:  log likelihood = -277.81637
Refining estimates:
Iteration 0:   log likelihood = -277.81637
Iteration 1:   log likelihood = -277.81637
Iteration 2:   log likelihood = -277.81637

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          118
Time at risk    =      9899376
                                                LR chi2(36)      =      195.14
Log likelihood  =   -277.81637                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7505765   .1908749    -1.13   0.259     .4559641    1.235547
      1.male |   1.159678   .7011885     0.25   0.806     .3545411    3.793224
        age1 |   1.016279   .0460543     0.36   0.722     .9299066    1.110673
        age2 |   1.231331   .0980555     2.61   0.009     1.053393    1.439326
        age3 |   .3143472   .1793762    -2.03   0.043     .1027277    .9619036
             |
         imd |
          2  |   .9612941    .330567    -0.11   0.909     .4899453    1.886101
          3  |    1.03517   .3641496     0.10   0.922     .5194911    2.062744
          4  |   .8852972   .3406411    -0.32   0.752     .4164542    1.881962
5 most de..  |   1.388596   .5646203     0.81   0.419     .6258454    3.080953
             |
   obese4cat |
Obese I ..)  |   1.453428   .4185787     1.30   0.194     .8265182    2.555845
Obese II..)  |   1.983656   .8615085     1.58   0.115     .8468109    4.646715
Obese II..)  |   3.576317   1.937038     2.35   0.019     1.237087    10.33884
             |
smoke_nomiss |
     Former  |   1.840162   .4655082     2.41   0.016     1.120795    3.021242
    Current  |   1.540782   .7721402     0.86   0.388     .5769974    4.114417
             |
     diabcat |
Controlle..  |   1.348735   .9299957     0.43   0.664     .3491372    5.210233
Uncontrol..  |   1.659594   1.342441     0.63   0.531      .339991    8.100955
Diabetes,..  |   8.88e-18   1.46e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   4.687482   3.395726     2.13   0.033     1.133205    19.38969
       1.pad |   4.30e-18   2.94e-09    -0.00   1.000            0           .
1.hyperten~n |   1.399389   .7424255     0.63   0.526     .4947042    3.958504
1.heart_f~re |    2.59344    1.52365     1.62   0.105     .8199629    8.202729
1.stroke_tia |   9.95e-18   5.34e-09    -0.00   1.000            0           .
       1.vte |   1.20e-17   6.84e-09    -0.00   1.000            0           .
 1.oestrogen |   4.18e-18   5.18e-09    -0.00   1.000            0           .
1.flu_vac~ne |   1.331294   .3623897     1.05   0.293     .7808536    2.269752
             |
         ckd |
        CKD  |   1.429238   .3439056     1.48   0.138     .8918406    2.290457
      1.copd |   2.006378   .5763852     2.42   0.015      1.14257    3.523246
1.other_re~y |   1.518959   .5805061     1.09   0.274     .7181895    3.212572
1.immunode~y |   2.019529   2.234072     0.64   0.525     .2310052    17.65544
    1.cancer |   1.515675   .3707021     1.70   0.089     .9384692     2.44789
1.ae_atten~r |   2.008235   .4351859     3.22   0.001     1.313284    3.070934
1.gp_consult |   .3556466   .1679953    -2.19   0.029     .1409094    .8976298
             |
   ethnicity |
      Mixed  |   10.46862   15.71994     1.56   0.118     .5517015    198.6437
Asian or ..  |    1.62971   1.510526     0.53   0.598      .264947    10.02448
      Black  |   2.12e-18   1.57e-09    -0.00   1.000            0           .
      Other  |   40.34203    41.6745     3.58   0.000     5.326495    305.5441
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multiv
> ar3_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multivar3_eth
> n.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -375.38524
Iteration 1:   log likelihood = -327.15658
Iteration 2:   log likelihood = -301.92557
Iteration 3:   log likelihood =  -288.9803
Iteration 4:   log likelihood = -283.41545
Iteration 5:   log likelihood =  -283.3486
Iteration 6:   log likelihood = -283.33861
Iteration 7:   log likelihood = -283.33494
Iteration 8:   log likelihood = -283.33359
Iteration 9:   log likelihood =  -283.3331
Iteration 10:  log likelihood = -283.33291
Iteration 11:  log likelihood = -283.33285
Iteration 12:  log likelihood = -283.33282
Iteration 13:  log likelihood = -283.33281
Iteration 14:  log likelihood = -283.33281
Iteration 15:  log likelihood = -283.33281
Iteration 16:  log likelihood = -283.33281
Iteration 17:  log likelihood = -283.33281
Iteration 18:  log likelihood = -283.33281
Iteration 19:  log likelihood = -283.33281
Iteration 20:  log likelihood = -283.33281
Iteration 21:  log likelihood = -283.33281
Iteration 22:  log likelihood = -283.33281
Iteration 23:  log likelihood = -283.33281
Iteration 24:  log likelihood = -283.33281
Iteration 25:  log likelihood = -283.33281
Iteration 26:  log likelihood = -283.33281
Iteration 27:  log likelihood = -283.33281
Iteration 28:  log likelihood = -283.33281
Iteration 29:  log likelihood = -283.33281
Iteration 30:  log likelihood = -283.33281
Iteration 31:  log likelihood = -283.33281
Iteration 32:  log likelihood = -283.33281
Iteration 33:  log likelihood = -283.33281
Iteration 34:  log likelihood = -283.33281
Refining estimates:
Iteration 0:   log likelihood = -283.33281
Iteration 1:   log likelihood = -283.33281
Iteration 2:   log likelihood = -283.33281

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       47,522                  Number of obs    =      47,522
No. of failures =          118
Time at risk    =      9899376
                                                LR chi2(32)      =      184.10
Log likelihood  =   -283.33281                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7541355   .1906887    -1.12   0.264     .4594273     1.23789
      1.male |   1.241722   .7457581     0.36   0.718     .3826542    4.029417
        age1 |   .9995709   .0424322    -0.01   0.992     .9197711    1.086294
        age2 |   1.241296   .0963573     2.78   0.005     1.066105    1.445277
        age3 |   .3159111   .1775838    -2.05   0.040     .1049728    .9507204
             |
         imd |
          2  |   .9832631   .3322322    -0.05   0.960     .5070602     1.90669
          3  |   1.002274   .3500603     0.01   0.995     .5054644    1.987386
          4  |   .8878669   .3386965    -0.31   0.755     .4203762    1.875243
5 most de..  |   1.362848    .544109     0.78   0.438     .6231749    2.980469
             |
   obese4cat |
Obese I ..)  |   1.409791   .4053072     1.19   0.232     .8024884    2.476683
Obese II..)  |   1.784524   .7682358     1.35   0.179     .7675049    4.149195
Obese II..)  |   2.926275   1.569268     2.00   0.045     1.022923    8.371194
             |
smoke_nomiss |
     Former  |   1.819311   .4557243     2.39   0.017     1.113492    2.972534
    Current  |   1.477823   .7299702     0.79   0.429     .5612699    3.891107
             |
     diabcat |
Controlle..  |   1.357618   .9206849     0.45   0.652     .3593559     5.12897
Uncontrol..  |   1.689073   1.318153     0.67   0.502     .3659069    7.796981
Diabetes,..  |   5.42e-16   1.04e-07    -0.00   1.000            0           .
             |
1.myocardi~t |   4.967232   3.532086     2.25   0.024     1.232663    20.01634
       1.pad |   2.25e-16   2.10e-08    -0.00   1.000            0           .
1.hyperten~n |   1.465087   .7677127     0.73   0.466      .524602    4.091637
1.heart_f~re |   2.333716    1.33872     1.48   0.140     .7581622    7.183465
1.stroke_tia |   4.96e-16   3.53e-08    -0.00   1.000            0           .
       1.vte |   5.14e-16   4.09e-08    -0.00   1.000            0           .
 1.oestrogen |   1.77e-16   2.59e-08    -0.00   1.000            0           .
1.flu_vac~ne |   1.361222   .3740937     1.12   0.262     .7943286    2.332695
             |
         ckd |
        CKD  |   1.478362   .3536826     1.63   0.102     .9249955    2.362772
      1.copd |   2.010021   .5711224     2.46   0.014     1.151708    3.507995
1.other_re~y |   1.506076   .5739086     1.07   0.283     .7136515    3.178393
1.immunode~y |     1.5358     1.6739     0.39   0.694     .1813815    13.00399
    1.cancer |   1.484847   .3602109     1.63   0.103     .9229699    2.388777
1.ae_atten~r |   1.962432   .4218077     3.14   0.002     1.287764    2.990563
1.gp_consult |   .3605805   .1688462    -2.18   0.029      .144018    .9027919
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multiv
> ar3_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_1/onscoviddeath_multivar3_wit
> houtethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_1/table3_onscoviddeath.t
> xt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     10,396     2151614           0    2151614    2151614

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     37,126     7747763           0    7747763    7747763

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9389268   .2057644    -0.29   0.774     .6110717    1.442684
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8781511   .1950098    -0.59   0.558     .5682561    1.357045
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7981247   .1796893    -1.00   0.317     .5133715    1.240823
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8033032   .1807668    -0.97   0.330     .5168139    1.248604
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7505765   .1908749    -1.13   0.259     .4559641    1.235547
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7541355   .1906887    -1.12   0.264     .4594273     1.23789
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/06a_an_models_ethnicity_
> onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:06:53
-------------------------------------------------------------------------------
