-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/SA1_02a_cr_create_popula
> tion_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:06:47

. 
. /* Use the dataset we derived from the 02a program===========================
> */ 
. 
. use $tempdir_main_analysis/analysis_dataset_`outcome' , clear

. 
. noi di "PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS

. drop if antiplatelet_date != .
(6,224 observations deleted)

. 
. /* SAVE DATA=================================================================
> =*/                
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_cov
> idtest.dta not found)
file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_covidtest.
> dta saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  covidtest != 0 & covidtest < .
obs. time interval:  (stime_covidtest[_n-1], stime_covidtest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     64,042  total observations
          0  exclusions
------------------------------------------------------------------------------
     64,042  observations remaining, representing
     64,042  subjects
      4,014  failures in single-failure-per-subject data
 13004812.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_STS
> ET_covidtest.dta not found)
file /workspace/output/oac_tempdata/sens_analysis_1/analysis_dataset_STSET_covi
> dtest.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_1/SA1_02a_cr_create_popula
> tion_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:06:53
-------------------------------------------------------------------------------
