-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_covidtest.
> log
  log type:  text
 opened on:  31 Dec 2020, 03:22:56

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt | outcome: first covid
  Treatment |         test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    15,308      1,025 |    16,333 
            |     93.72       6.28 |    100.00 
------------+----------------------+----------
current use |    46,831      3,115 |    49,946 
            |     93.76       6.24 |    100.00 
------------+----------------------+----------
      Total |    62,139      4,140 |    66,279 
            |     93.75       6.25 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45774.513
Iteration 1:   log likelihood = -45774.383
Iteration 2:   log likelihood = -45774.383
Refining estimates:
Iteration 0:   log likelihood = -45774.383

Cox regression -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =        4,140
Time at risk    =     13461907
                                                LR chi2(1)       =        0.26
Log likelihood  =   -45774.383                  Prob > chi2      =      0.6102

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9817847    .035353    -0.51   0.610     .9148828    1.053579
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_univar.ste
> r not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45774.513
Iteration 1:   log likelihood = -45682.779
Iteration 2:   log likelihood = -45643.893
Iteration 3:   log likelihood = -45642.433
Iteration 4:   log likelihood =  -45642.43
Refining estimates:
Iteration 0:   log likelihood =  -45642.43

Cox regression -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =        4,140
Time at risk    =     13461907
                                                LR chi2(5)       =      264.17
Log likelihood  =    -45642.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.002159   .0363362     0.06   0.953     .9334129    1.075968
      1.male |   1.010161   .0414624     0.25   0.805     .9320788    1.094784
        age1 |   .9576908   .0062117    -6.66   0.000     .9455931    .9699433
        age2 |   1.072328    .013142     5.70   0.000     1.046877    1.098398
        age3 |   .9086325   .0765387    -1.14   0.255     .7703485    1.071739
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar1.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar1.ster sa
> ved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45774.513
Iteration 1:   log likelihood = -45645.747
Iteration 2:   log likelihood = -45606.536
Iteration 3:   log likelihood = -45605.037
Iteration 4:   log likelihood = -45605.033
Iteration 5:   log likelihood = -45605.033
Refining estimates:
Iteration 0:   log likelihood = -45605.033

Cox regression -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =        4,140
Time at risk    =     13461907
                                                LR chi2(26)      =      338.96
Log likelihood  =   -45605.033                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.001677   .0385702     0.04   0.965      .928863    1.080199
      1.male |   .9986273   .0708566    -0.02   0.985      .868975    1.147624
        age1 |    .964919   .0079111    -4.36   0.000     .9495375    .9805497
        age2 |   1.060638   .0136788     4.56   0.000     1.034164     1.08779
        age3 |   .9595057   .0886627    -0.45   0.655     .8005577    1.150012
             |
         imd |
          2  |   1.006794   .0498158     0.14   0.891     .9137414    1.109322
          3  |   1.030141   .0509431     0.60   0.548     .9349806    1.134987
          4  |   1.221967   .0596057     4.11   0.000     1.110553    1.344559
5 most de..  |   1.248972   .0627641     4.42   0.000     1.131821     1.37825
             |
   obese4cat |
Obese I ..)  |    .934789   .0394935    -1.60   0.110     .8605012     1.01549
Obese II..)  |   .9935444   .0598341    -0.11   0.914     .8829284    1.118019
Obese II..)  |   .9978211   .0784292    -0.03   0.978     .8553579    1.164012
             |
smoke_nomiss |
     Former  |   1.094565   .0372982     2.65   0.008      1.02385    1.170165
    Current  |   1.199602   .0732692     2.98   0.003      1.06426    1.352156
             |
     diabcat |
Controlle..  |    .997649   .0821442    -0.03   0.977     .8489688    1.172368
Uncontrol..  |    1.10764   .1119319     1.01   0.312     .9086174    1.350257
Diabetes,..  |   .9384125   .3878508    -0.15   0.878     .4174339    2.109599
             |
1.myocardi~t |   1.042368   .1098993     0.39   0.694     .8477682    1.281638
       1.pad |   1.266716   .1989301     1.51   0.132     .9311152    1.723278
1.hyperten~n |   .9308613   .0620201    -1.08   0.282     .8169065    1.060712
1.heart_f~re |    1.05148    .084044     0.63   0.530     .8990114    1.229807
1.stroke_tia |   1.149064   .1858407     0.86   0.390     .8369078    1.577651
       1.vte |   1.254453   .2320784     1.23   0.220     .8729294    1.802727
 1.oestrogen |    1.14852   .2036169     0.78   0.435     .8113946    1.625717
1.antiplat~t |   1.000798   .0585993     0.01   0.989     .8922908      1.1225
1.flu_vac~ne |   1.035112   .0382177     0.93   0.350     .9628522    1.112794
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar2.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar2.ster sa
> ved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -14396.41
Iteration 1:   log likelihood = -14032.175
Iteration 2:   log likelihood = -13993.982
Iteration 3:   log likelihood = -13993.437
Iteration 4:   log likelihood = -13993.436
Refining estimates:
Iteration 0:   log likelihood = -13993.436

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =        4,140
Time at risk    =     13461907
                                                LR chi2(33)      =      805.95
Log likelihood  =   -13993.436                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.008836   .0404816     0.22   0.826     .9325337    1.091382
      1.male |   1.028907   .0750145     0.39   0.696     .8919032    1.186956
        age1 |   .9687464   .0082268    -3.74   0.000     .9527556    .9850056
        age2 |   1.051027   .0140008     3.74   0.000     1.023941    1.078829
        age3 |   .9812747   .0939817    -0.20   0.844     .8133298    1.183899
             |
         imd |
          2  |   1.003714   .0546886     0.07   0.946     .9020517    1.116835
          3  |   1.029426   .0583103     0.51   0.609     .9212553    1.150297
          4  |   1.147675   .0678323     2.33   0.020     1.022138     1.28863
5 most de..  |   1.144914   .0730639     2.12   0.034     1.010305    1.297457
             |
   obese4cat |
Obese I ..)  |   .9430368   .0409158    -1.35   0.176     .8661584    1.026739
Obese II..)  |   1.037276   .0641476     0.59   0.554     .9188699     1.17094
Obese II..)  |   1.030016   .0833489     0.37   0.715      .878951    1.207044
             |
smoke_nomiss |
     Former  |   1.063165   .0380082     1.71   0.087     .9912201    1.140331
    Current  |    1.14159   .0738841     2.05   0.041     1.005588    1.295985
             |
     diabcat |
Controlle..  |   .9823743   .0840723    -0.21   0.835     .8306738    1.161779
Uncontrol..  |   1.055851   .1102857     0.52   0.603     .8603855    1.295724
Diabetes,..  |   .8824124   .3762708    -0.29   0.769     .3825688    2.035325
             |
1.myocardi~t |   .9914145   .1078484    -0.08   0.937     .8010499    1.227018
       1.pad |   1.309085   .2125045     1.66   0.097     .9523398    1.799467
1.hyperten~n |   .9561363   .0656287    -0.65   0.513     .8357834     1.09382
1.heart_f~re |   1.054203   .0869652     0.64   0.522     .8968199    1.239204
1.stroke_tia |   1.189728   .1990886     1.04   0.299     .8570537    1.651534
       1.vte |    1.24192   .2385145     1.13   0.259     .8523499    1.809546
 1.oestrogen |   1.202186   .2190239     1.01   0.312     .8411879    1.718108
1.antiplat~t |   .9828409   .0594541    -0.29   0.775     .8729558    1.106558
1.flu_vac~ne |   .9905023   .0384037    -0.25   0.806     .9180213    1.068706
             |
         ckd |
        CKD  |    1.16762   .0496297     3.65   0.000     1.074289    1.269059
      1.copd |   1.220889   .0633436     3.85   0.000     1.102842    1.351572
1.other_re~y |   1.279077   .0915168     3.44   0.001     1.111716    1.471632
1.immunode~y |   1.356875   .1918649     2.16   0.031     1.028438    1.790199
    1.cancer |   1.385606   .0562405     8.04   0.000     1.279647    1.500339
1.ae_atten~r |   1.910476   .0660584    18.72   0.000     1.785294    2.044436
1.gp_consult |   1.034846   .1158575     0.31   0.760     .8309571    1.288763
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar3.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar3.ster sa
> ved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table2_covidtest.txt n
> ot found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9817847    .035353    -0.51   0.610     .9148828    1.053579
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.002159   .0363362     0.06   0.953     .9334129    1.075968
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.001677   .0385702     0.04   0.965      .928863    1.080199
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.008836   .0404816     0.22   0.826     .9325337    1.091382
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_covidtest.
> log
  log type:  text
 closed on:  31 Dec 2020, 03:23:13
-------------------------------------------------------------------------------
