-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_covidtest.
> log
  log type:  text
 opened on:   1 Mar 2021, 21:52:15

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt | outcome: first covid
  Treatment |         test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    13,802      2,593 |    16,395 
            |     84.18      15.82 |    100.00 
------------+----------------------+----------
current use |    42,257      7,813 |    50,070 
            |     84.40      15.60 |    100.00 
------------+----------------------+----------
      Total |    56,059     10,406 |    66,465 
            |     84.34      15.66 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -114575.33
Iteration 1:   log likelihood =  -114574.5
Iteration 2:   log likelihood =  -114574.5
Refining estimates:
Iteration 0:   log likelihood =  -114574.5

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =       10,406
Time at risk    =     13051589
                                                LR chi2(1)       =        1.65
Log likelihood  =    -114574.5                  Prob > chi2      =      0.1987

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9712235   .0220116    -1.29   0.198     .9290257    1.015338
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_univar.ste
> r not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -114575.33
Iteration 1:   log likelihood = -114391.48
Iteration 2:   log likelihood = -114363.85
Iteration 3:   log likelihood = -114363.43
Iteration 4:   log likelihood = -114363.43
Refining estimates:
Iteration 0:   log likelihood = -114363.43

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =       10,406
Time at risk    =     13051589
                                                LR chi2(5)       =      423.80
Log likelihood  =   -114363.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9919913   .0226333    -0.35   0.725      .948608    1.037359
      1.male |   1.014381   .0257798     0.56   0.574     .9650911    1.066188
        age1 |   .9583324    .003886   -10.50   0.000     .9507462    .9659791
        age2 |   1.061536   .0082853     7.65   0.000     1.045421      1.0779
        age3 |   .9432917   .0518138    -1.06   0.288      .847014    1.050513
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar1.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar1.ster sa
> ved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -114575.33
Iteration 1:   log likelihood = -114341.02
Iteration 2:   log likelihood =  -114313.2
Iteration 3:   log likelihood = -114312.77
Iteration 4:   log likelihood = -114312.77
Refining estimates:
Iteration 0:   log likelihood = -114312.77

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =       10,406
Time at risk    =     13051589
                                                LR chi2(26)      =      525.12
Log likelihood  =   -114312.77                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.013759   .0246668     0.56   0.574      .966548    1.063277
      1.male |   .9562336   .0422748    -1.01   0.311     .8768649    1.042786
        age1 |    .963093   .0049147    -7.37   0.000     .9535083     .972774
        age2 |    1.06005   .0087052     7.10   0.000     1.043125     1.07725
        age3 |   .9357338   .0562209    -1.11   0.269     .8317835    1.052675
             |
         imd |
          2  |   1.024132   .0311787     0.78   0.433     .9648101    1.087101
          3  |   1.061521   .0324659     1.95   0.051     .9997587    1.127099
          4  |   1.097197   .0340065     2.99   0.003      1.03253    1.165915
5 most de..  |   1.076961     .03465     2.30   0.021     1.011145     1.14706
             |
   obese4cat |
Obese I ..)  |    .939718    .024734    -2.36   0.018     .8924695     .989468
Obese II..)  |   .9737155   .0366979    -0.71   0.480     .9043813    1.048365
Obese II..)  |   1.007997   .0488968     0.16   0.870     .9165753    1.108536
             |
smoke_nomiss |
     Former  |   1.124428    .024182     5.45   0.000     1.078017    1.172837
    Current  |   1.232197   .0475345     5.41   0.000     1.142466    1.328976
             |
     diabcat |
Controlle..  |   1.013201     .05196     0.26   0.798     .9163118    1.120334
Uncontrol..  |   1.106511   .0698562     1.60   0.109     .9777275    1.252258
Diabetes,..  |   1.056177   .2597552     0.22   0.824     .6522179    1.710332
             |
1.myocardi~t |   .9590558   .0644408    -0.62   0.534     .8407174    1.094051
       1.pad |   1.296684   .1280849     2.63   0.009     1.068448    1.573674
1.hyperten~n |   1.036726   .0430632     0.87   0.385     .9556678    1.124659
1.heart_f~re |   1.042068   .0523684     0.82   0.412     .9443207    1.149933
1.stroke_tia |   1.158375   .1182673     1.44   0.150     .9482948    1.414994
       1.vte |   1.226171   .1448564     1.73   0.084       .97273    1.545644
 1.oestrogen |   1.288896   .1350479     2.42   0.015     1.049617    1.582724
1.antiplat~t |   1.127485   .0403903     3.35   0.001     1.051036    1.209493
1.flu_vac~ne |   1.046747   .0243887     1.96   0.050     1.000021    1.095656
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar2.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar2.ster sa
> ved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -35934.748
Iteration 1:   log likelihood = -35200.499
Iteration 2:   log likelihood = -35165.598
Iteration 3:   log likelihood = -35165.397
Iteration 4:   log likelihood = -35165.397
Refining estimates:
Iteration 0:   log likelihood = -35165.397

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =       10,406
Time at risk    =     13051589
                                                LR chi2(33)      =     1538.70
Log likelihood  =   -35165.397                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9771685   .0247443    -0.91   0.362     .9298545     1.02689
      1.male |     1.0055   .0456362     0.12   0.904     .9199181    1.099045
        age1 |    .964323   .0051031    -6.87   0.000     .9543729    .9743769
        age2 |   1.047166   .0088951     5.43   0.000     1.029877    1.064746
        age3 |   .9978805   .0620027    -0.03   0.973     .8834656    1.127113
             |
         imd |
          2  |   1.000116   .0335001     0.00   0.997     .9365659    1.067978
          3  |   1.044708   .0366326     1.25   0.212     .9753206    1.119031
          4  |   1.061042   .0394552     1.59   0.111     .9864621    1.141261
5 most de..  |   1.037364   .0424811     0.90   0.370     .9573568    1.124058
             |
   obese4cat |
Obese I ..)  |   .9627936   .0260428    -1.40   0.161       .91308    1.015214
Obese II..)  |   1.000132   .0388001     0.00   0.997     .9269042    1.079144
Obese II..)  |   1.024534   .0512487     0.48   0.628     .9288549    1.130068
             |
smoke_nomiss |
     Former  |   1.083071   .0244116     3.54   0.000     1.036267     1.13199
    Current  |   1.124995   .0462114     2.87   0.004     1.037973    1.219314
             |
     diabcat |
Controlle..  |   .9728073   .0518233    -0.52   0.605     .8763583    1.079871
Uncontrol..  |   1.085992   .0706439     1.27   0.205     .9559953    1.233665
Diabetes,..  |    1.00246   .2595721     0.01   0.992     .6034778    1.665226
             |
1.myocardi~t |   .9240882   .0637741    -1.14   0.253     .8071783    1.057931
       1.pad |   1.321917   .1353017     2.73   0.006     1.081636    1.615574
1.hyperten~n |   1.032971   .0440757     0.76   0.447     .9500977    1.123073
1.heart_f~re |   1.009624   .0522569     0.19   0.853     .9122265    1.117421
1.stroke_tia |   1.130746   .1189042     1.17   0.243     .9201454    1.389548
       1.vte |   1.121976   .1370905     0.94   0.346     .8830357    1.425572
 1.oestrogen |   1.269537   .1373491     2.21   0.027     1.026964    1.569407
1.antiplat~t |   1.069076   .0395868     1.80   0.071     .9942361     1.14955
1.flu_vac~ne |   1.010126   .0246265     0.41   0.679     .9629936    1.059564
             |
         ckd |
        CKD  |   1.134206   .0315247     4.53   0.000     1.074071    1.197707
      1.copd |   1.271181   .0419168     7.28   0.000     1.191624    1.356049
1.other_re~y |   1.304032    .059415     5.83   0.000     1.192629    1.425841
1.immunode~y |   1.262438   .1149592     2.56   0.010     1.056084    1.509113
    1.cancer |   1.416562   .0364575    13.53   0.000     1.346879     1.48985
1.ae_atten~r |   1.741039   .0376816    25.62   0.000     1.668729    1.816483
1.gp_consult |   1.227416   .0911621     2.76   0.006     1.061137    1.419749
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar3.
> ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/covidtest_multivar3.ster sa
> ved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table2_covidtest.txt n
> ot found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9712235   .0220116    -1.29   0.198     .9290257    1.015338
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9919913   .0226333    -0.35   0.725      .948608    1.037359
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.013759   .0246668     0.56   0.574      .966548    1.063277
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9771685   .0247443    -0.91   0.362     .9298545     1.02689
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_covidtest.
> log
  log type:  text
 closed on:   1 Mar 2021, 21:52:35
-------------------------------------------------------------------------------
