-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_onscovidde
> ath.log
  log type:  text
 opened on:   1 Mar 2021, 21:46:47

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |  outcome: ONS covid
  Treatment |         death
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    16,341         54 |    16,395 
            |     99.67       0.33 |    100.00 
------------+----------------------+----------
current use |    49,941        129 |    50,070 
            |     99.74       0.26 |    100.00 
------------+----------------------+----------
      Total |    66,282        183 |    66,465 
            |     99.72       0.28 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2030.4995
Iteration 1:   log likelihood = -2029.3489
Iteration 2:   log likelihood = -2029.3442
Iteration 3:   log likelihood = -2029.3442
Refining estimates:
Iteration 0:   log likelihood = -2029.3442

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          183
Time at risk    =   13824875.5
                                                LR chi2(1)       =        2.31
Log likelihood  =   -2029.3442                  Prob > chi2      =      0.1285

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7781367   .1261217    -1.55   0.122     .5663589    1.069104
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_univar
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_univar.ster s
> aved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2030.4995
Iteration 1:   log likelihood = -1966.8766
Iteration 2:   log likelihood = -1930.7742
Iteration 3:   log likelihood = -1928.2015
Iteration 4:   log likelihood = -1928.1607
Iteration 5:   log likelihood = -1928.1607
Refining estimates:
Iteration 0:   log likelihood = -1928.1607

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          183
Time at risk    =   13824875.5
                                                LR chi2(5)       =      204.68
Log likelihood  =   -1928.1607                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7818766   .1279844    -1.50   0.133     .5672912    1.077632
      1.male |   1.494385   .4683246     1.28   0.200      .808546    2.761977
        age1 |   .9490492   .0414858    -1.20   0.232     .8711243    1.033945
        age2 |   1.252405    .084732     3.33   0.001     1.096873     1.42999
        age3 |   .3433953   .1308407    -2.81   0.005     .1627305    .7246355
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar1.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar1.ste
> r saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2030.4995
Iteration 1:   log likelihood = -1956.4273
Iteration 2:   log likelihood = -1913.9503
Iteration 3:   log likelihood = -1911.0251
Iteration 4:   log likelihood = -1910.8828
Iteration 5:   log likelihood = -1910.8426
Iteration 6:   log likelihood = -1910.8279
Iteration 7:   log likelihood = -1910.8224
Iteration 8:   log likelihood = -1910.8204
Iteration 9:   log likelihood = -1910.8197
Iteration 10:  log likelihood = -1910.8194
Iteration 11:  log likelihood = -1910.8193
Iteration 12:  log likelihood = -1910.8193
Iteration 13:  log likelihood = -1910.8193
Iteration 14:  log likelihood = -1910.8193
Iteration 15:  log likelihood = -1910.8193
Iteration 16:  log likelihood = -1910.8193
Iteration 17:  log likelihood = -1910.8193
Iteration 18:  log likelihood = -1910.8193
Iteration 19:  log likelihood = -1910.8193
Iteration 20:  log likelihood = -1910.8193
Iteration 21:  log likelihood = -1910.8193
Iteration 22:  log likelihood = -1910.8193
Iteration 23:  log likelihood = -1910.8193
Iteration 24:  log likelihood = -1910.8193
Iteration 25:  log likelihood = -1910.8193
Iteration 26:  log likelihood = -1910.8193
Iteration 27:  log likelihood = -1910.8193
Iteration 28:  log likelihood = -1910.8193
Iteration 29:  log likelihood = -1910.8193
Iteration 30:  log likelihood = -1910.8193
Iteration 31:  log likelihood = -1910.8193
Iteration 32:  log likelihood = -1910.8193
Iteration 33:  log likelihood = -1910.8193
Iteration 34:  log likelihood = -1910.8193
Iteration 35:  log likelihood = -1910.8193
Iteration 36:  log likelihood = -1910.8193
Iteration 37:  log likelihood = -1910.8193
Iteration 38:  log likelihood = -1910.8193
Iteration 39:  log likelihood = -1910.8193
Iteration 40:  log likelihood = -1910.8193
Iteration 41:  log likelihood = -1910.8193
Iteration 42:  log likelihood = -1910.8193
Iteration 43:  log likelihood = -1910.8193
Iteration 44:  log likelihood = -1910.8193
Iteration 45:  log likelihood = -1910.8193
Refining estimates:
Iteration 0:   log likelihood = -1910.8193

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          183
Time at risk    =   13824875.5
                                                LR chi2(23)      =      239.36
Log likelihood  =   -1910.8193                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6963395   .1199588    -2.10   0.036     .4968028    .9760185
      1.male |   1.204343   .5566234     0.40   0.687     .4867899    2.979604
        age1 |   .9865001    .054674    -0.25   0.806     .8849561    1.099696
        age2 |   1.224877   .0870661     2.85   0.004     1.065584    1.407982
        age3 |   .3506505   .1505204    -2.44   0.015     .1511776    .8133205
             |
         imd |
          2  |   .9241343    .204795    -0.36   0.722     .5985528    1.426815
          3  |   .7217774   .1748398    -1.35   0.178      .448965    1.160364
          4  |    .864368   .2077431    -0.61   0.544     .5396597     1.38445
5 most de..  |    1.56833   .3417066     2.07   0.039     1.023242    2.403791
             |
   obese4cat |
Obese I ..)  |   .9081712   .2162034    -0.40   0.686     .5695432    1.448134
Obese II..)  |   1.320364   .4566189     0.80   0.422     .6703851    2.600537
Obese II..)  |   1.746029   .7798841     1.25   0.212     .7275326    4.190352
             |
smoke_nomiss |
     Former  |   1.395094   .2362117     1.97   0.049     1.001109     1.94413
    Current  |   1.378174   .4700486     0.94   0.347      .706298    2.689181
             |
     diabcat |
Controlle..  |    .917651   .5335382    -0.15   0.882     .2936123    2.868011
Uncontrol..  |   2.060601   1.223685     1.22   0.223     .6434414    6.599007
Diabetes,..  |   4.37e-19          .        .       .            .           .
             |
1.myocardi~t |    2.37326   1.374096     1.49   0.136     .7629698     7.38216
       1.pad |   1.283633   1.337552     0.24   0.811     .1665269     9.89458
1.hyperten~n |   .8868284   .3650202    -0.29   0.770      .395807     1.98699
1.heart_f~re |   2.125164   .9883642     1.62   0.105     .8541189    5.287695
1.stroke_tia |   7.91e-20          .        .       .            .           .
       1.vte |   2.616271   3.270681     0.77   0.442     .2257196    30.32468
 1.oestrogen |   1.66e-19          .        .       .            .           .
1.antiplat~t |   .6266157    .191798    -1.53   0.127     .3439227    1.141673
1.flu_vac~ne |   1.073808    .199159     0.38   0.701      .746542    1.544538
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar2.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar2.ste
> r saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -643.16509
Iteration 1:   log likelihood = -601.02938
Iteration 2:   log likelihood = -549.96414
Iteration 3:   log likelihood = -541.56544
Iteration 4:   log likelihood = -501.96791
Iteration 5:   log likelihood = -499.28315
Iteration 6:   log likelihood = -499.25965
Iteration 7:   log likelihood =  -499.2582
Iteration 8:   log likelihood = -499.25767
Iteration 9:   log likelihood = -499.25747
Iteration 10:  log likelihood =  -499.2574
Iteration 11:  log likelihood = -499.25737
Iteration 12:  log likelihood = -499.25736
Iteration 13:  log likelihood = -499.25736
Iteration 14:  log likelihood = -499.25736
Iteration 15:  log likelihood = -499.25736
Iteration 16:  log likelihood = -499.25736
Iteration 17:  log likelihood = -499.25736
Iteration 18:  log likelihood = -499.25736
Iteration 19:  log likelihood = -499.25736
Iteration 20:  log likelihood = -499.25736
Iteration 21:  log likelihood = -499.25736
Iteration 22:  log likelihood = -499.25736
Iteration 23:  log likelihood = -499.25736
Iteration 24:  log likelihood = -499.25736
Iteration 25:  log likelihood = -499.25736
Iteration 26:  log likelihood = -499.25736
Iteration 27:  log likelihood = -499.25736
Iteration 28:  log likelihood = -499.25736
Iteration 29:  log likelihood = -499.25736
Iteration 30:  log likelihood = -499.25736
Iteration 31:  log likelihood = -499.25736
Iteration 32:  log likelihood = -499.25736
Refining estimates:
Iteration 0:   log likelihood = -499.25736
Iteration 1:   log likelihood = -499.25736
Iteration 2:   log likelihood = -499.25736
Iteration 3:   log likelihood = -499.25736
Iteration 4:   log likelihood = -499.25736
Iteration 5:   log likelihood = -499.25736
Iteration 6:   log likelihood = -499.25736
Iteration 7:   log likelihood = -499.25736
Iteration 8:   log likelihood = -499.25736

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          183
Time at risk    =   13824875.5
                                                LR chi2(33)      =      287.82
Log likelihood  =   -499.25736                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6727506   .1282898    -2.08   0.038     .4629506    .9776278
      1.male |   1.148063   .5499098     0.29   0.773     .4490031      2.9355
        age1 |   .9913137   .0574095    -0.15   0.880     .8849441    1.110469
        age2 |   1.227196   .0930292     2.70   0.007     1.057761    1.423772
        age3 |   .3273269   .1522638    -2.40   0.016     .1315301    .8145884
             |
         imd |
          2  |   .8387585   .2126114    -0.69   0.488     .5103539    1.378486
          3  |   .7361035   .2076711    -1.09   0.277     .4234441    1.279622
          4  |   .8041314   .2294347    -0.76   0.445      .459687    1.406669
5 most de..  |   1.506873   .4533334     1.36   0.173     .8355993    2.717411
             |
   obese4cat |
Obese I ..)  |   .8719675   .2186146    -0.55   0.585     .5334478    1.425308
Obese II..)  |   1.342881    .481636     0.82   0.411     .6648849    2.712241
Obese II..)  |   1.903317    .885789     1.38   0.167     .7644843     4.73864
             |
smoke_nomiss |
     Former  |    1.34609   .2526586     1.58   0.113     .9317619    1.944657
    Current  |   1.261124   .4724497     0.62   0.536     .6051674    2.628088
             |
     diabcat |
Controlle..  |   .8013648   .4928924    -0.36   0.719     .2400407    2.675319
Uncontrol..  |   1.919841   1.186229     1.06   0.291     .5719074    6.444728
Diabetes,..  |   5.88e-18   6.58e-09    -0.00   1.000            0           .
             |
1.myocardi~t |   2.131357   1.270766     1.27   0.204     .6624442    6.857455
       1.pad |   .8799459   .9397632    -0.12   0.905     .1084903    7.137085
1.hyperten~n |   .9642603   .4136344    -0.08   0.932     .4159664    2.235272
1.heart_f~re |   2.151364   1.058324     1.56   0.119     .8203156    5.642179
1.stroke_tia |   3.46e-18   2.18e-09    -0.00   1.000            0           .
       1.vte |   2.775733   3.562677     0.80   0.426     .2243123    34.34805
 1.oestrogen |   2.05e-18   2.60e-09    -0.00   1.000            0           .
1.antiplat~t |   .6688023   .2164265    -1.24   0.214     .3546879    1.261099
1.flu_vac~ne |   1.156184   .2387737     0.70   0.482     .7713262     1.73307
             |
         ckd |
        CKD  |   1.207644   .2263304     1.01   0.314     .8363947     1.74368
      1.copd |    1.76199   .3926929     2.54   0.011     1.138406    2.727155
1.other_re~y |   1.689576   .4903134     1.81   0.071     .9566645    2.983978
1.immunode~y |   2.306462   1.763253     1.09   0.274     .5154854    10.31992
    1.cancer |   1.258958   .2457228     1.18   0.238     .8587642    1.845645
1.ae_atten~r |   2.378081   .3962371     5.20   0.000     1.715532    3.296509
1.gp_consult |    .430935   .1596894    -2.27   0.023     .2084425    .8909169
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar3.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar3.ste
> r saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table2_onscoviddeath.t
> xt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7781367   .1261217    -1.55   0.122     .5663589    1.069104
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7818766   .1279844    -1.50   0.133     .5672912    1.077632
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6963395   .1199588    -2.10   0.036     .4968028    .9760185
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6727506   .1282898    -2.08   0.038     .4629506    .9776278
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_onscovidde
> ath.log
  log type:  text
 closed on:   1 Mar 2021, 21:48:02
-------------------------------------------------------------------------------
