-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_admitcovid
> .log
  log type:  text
 opened on:   1 Mar 2021, 21:51:10

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |
anticoagula |   Failure/censoring
         nt |     indicator for
  Treatment |  outcome: SUS covid
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    16,337         58 |    16,395 
            |     99.65       0.35 |    100.00 
------------+----------------------+----------
current use |    49,909        161 |    50,070 
            |     99.68       0.32 |    100.00 
------------+----------------------+----------
      Total |    66,246        219 |    66,465 
            |     99.67       0.33 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2429.8519
Iteration 1:   log likelihood = -2429.6385
Iteration 2:   log likelihood = -2429.6383
Refining estimates:
Iteration 0:   log likelihood = -2429.6383

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          219
Time at risk    =   13805478.5
                                                LR chi2(1)       =        0.43
Log likelihood  =   -2429.6383                  Prob > chi2      =      0.5134

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9040257   .1384447    -0.66   0.510     .6696159    1.220495
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_univar.st
> er not found)
file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_univar.ster save
> d

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2429.8519
Iteration 1:   log likelihood = -2389.8615
Iteration 2:   log likelihood = -2382.6892
Iteration 3:   log likelihood = -2382.5548
Iteration 4:   log likelihood = -2382.5545
Refining estimates:
Iteration 0:   log likelihood = -2382.5545

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          219
Time at risk    =   13805478.5
                                                LR chi2(5)       =       94.59
Log likelihood  =   -2382.5545                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9028909    .139394    -0.66   0.508     .6671469    1.221938
      1.male |   2.367264   .6085984     3.35   0.001     1.430249    3.918154
        age1 |   .9377318   .0285087    -2.11   0.034     .8834879    .9953061
        age2 |   1.145746   .0604801     2.58   0.010     1.033133    1.270634
        age3 |   .6764433   .2226204    -1.19   0.235     .3548928    1.289334
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_multivar1
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_multivar1.ster s
> aved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2429.8519
Iteration 1:   log likelihood = -2377.7259
Iteration 2:   log likelihood = -2365.6344
Iteration 3:   log likelihood = -2365.4337
Iteration 4:   log likelihood =  -2365.418
Iteration 5:   log likelihood = -2365.4124
Iteration 6:   log likelihood = -2365.4103
Iteration 7:   log likelihood = -2365.4095
Iteration 8:   log likelihood = -2365.4092
Iteration 9:   log likelihood = -2365.4091
Iteration 10:  log likelihood = -2365.4091
Iteration 11:  log likelihood = -2365.4091
Iteration 12:  log likelihood = -2365.4091
Iteration 13:  log likelihood = -2365.4091
Iteration 14:  log likelihood = -2365.4091
Iteration 15:  log likelihood = -2365.4091
Iteration 16:  log likelihood = -2365.4091
Iteration 17:  log likelihood = -2365.4091
Iteration 18:  log likelihood = -2365.4091
Iteration 19:  log likelihood = -2365.4091
Iteration 20:  log likelihood = -2365.4091
Iteration 21:  log likelihood = -2365.4091
Iteration 22:  log likelihood = -2365.4091
Iteration 23:  log likelihood = -2365.4091
Iteration 24:  log likelihood = -2365.4091
Iteration 25:  log likelihood = -2365.4091
Iteration 26:  log likelihood = -2365.4091
Iteration 27:  log likelihood = -2365.4091
Iteration 28:  log likelihood = -2365.4091
Iteration 29:  log likelihood = -2365.4091
Iteration 30:  log likelihood = -2365.4091
Iteration 31:  log likelihood = -2365.4091
Iteration 32:  log likelihood = -2365.4091
Iteration 33:  log likelihood = -2365.4091
Iteration 34:  log likelihood = -2365.4091
Iteration 35:  log likelihood = -2365.4091
Iteration 36:  log likelihood = -2365.4091
Iteration 37:  log likelihood = -2365.4091
Iteration 38:  log likelihood = -2365.4091
Iteration 39:  log likelihood = -2365.4091
Iteration 40:  log likelihood = -2365.4091
Iteration 41:  log likelihood = -2365.4091
Iteration 42:  log likelihood = -2365.4091
Iteration 43:  log likelihood = -2365.4091
Iteration 44:  log likelihood = -2365.4091
Refining estimates:
Iteration 0:   log likelihood = -2365.4091

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          219
Time at risk    =   13805478.5
                                                LR chi2(25)      =      128.89
Log likelihood  =   -2365.4091                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8463348   .1385417    -1.02   0.308     .6140502    1.166489
      1.male |   1.791323   .6714812     1.56   0.120     .8592094    3.734639
        age1 |   .9926242   .0386849    -0.19   0.849     .9196266    1.071416
        age2 |   1.107461   .0627442     1.80   0.072     .9910669    1.237525
        age3 |    .707098   .2651194    -0.92   0.355     .3391018    1.474447
             |
         imd |
          2  |   .8873377   .1867591    -0.57   0.570      .587402    1.340425
          3  |   .7866782   .1731511    -1.09   0.276     .5110274    1.211016
          4  |   1.114118    .229368     0.52   0.600     .7442021    1.667906
5 most de..  |   1.151933   .2441995     0.67   0.505      .760291    1.745317
             |
   obese4cat |
Obese I ..)  |   1.028715   .1978024     0.15   0.883     .7057078    1.499563
Obese II..)  |   1.190523    .330975     0.63   0.530     .6903936    2.052951
Obese II..)  |   1.763172   .5698318     1.75   0.079     .9358332    3.321932
             |
smoke_nomiss |
     Former  |   1.426744   .2265714     2.24   0.025     1.045136    1.947688
    Current  |   2.059503    .525107     2.83   0.005     1.249492    3.394622
             |
     diabcat |
Controlle..  |   1.951974   .6952559     1.88   0.060      .971163    3.923338
Uncontrol..  |   1.808206   .8013766     1.34   0.181     .7585862    4.310135
Diabetes,..  |   1.80e-19          .        .       .            .           .
             |
1.myocardi~t |    2.43642   1.010126     2.15   0.032     1.081057    5.491053
       1.pad |   1.158111   .8576267     0.20   0.843     .2712704    4.944226
1.hyperten~n |   .9452229   .2951426    -0.18   0.857     .5125656    1.743087
1.heart_f~re |   1.555924   .5637629     1.22   0.222     .7648385    3.165242
1.stroke_tia |   1.726875   1.313727     0.72   0.473     .3887817    7.670363
       1.vte |   3.070007   2.356423     1.46   0.144     .6820068    13.81942
 1.oestrogen |   2.907593   2.122202     1.46   0.144     .6954347    12.15657
1.antiplat~t |   .7984781   .2044127    -0.88   0.379     .4834516    1.318782
1.flu_vac~ne |    1.10245   .1837475     0.59   0.558     .7952199    1.528376
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_multivar2
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_multivar2.ster s
> aved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -766.74441
Iteration 1:   log likelihood = -732.80186
Iteration 2:   log likelihood = -683.55642
Iteration 3:   log likelihood = -682.55108
Iteration 4:   log likelihood = -682.54433
Iteration 5:   log likelihood = -682.54206
Iteration 6:   log likelihood = -682.54122
Iteration 7:   log likelihood = -682.54091
Iteration 8:   log likelihood =  -682.5408
Iteration 9:   log likelihood = -682.54076
Iteration 10:  log likelihood = -682.54074
Iteration 11:  log likelihood = -682.54074
Iteration 12:  log likelihood = -682.54073
Iteration 13:  log likelihood = -682.54073
Iteration 14:  log likelihood = -682.54073
Iteration 15:  log likelihood = -682.54073
Iteration 16:  log likelihood = -682.54073
Iteration 17:  log likelihood = -682.54073
Iteration 18:  log likelihood = -682.54073
Iteration 19:  log likelihood = -682.54073
Iteration 20:  log likelihood = -682.54073
Iteration 21:  log likelihood = -682.54073
Iteration 22:  log likelihood = -682.54073
Iteration 23:  log likelihood = -682.54073
Iteration 24:  log likelihood = -682.54073
Iteration 25:  log likelihood = -682.54073
Iteration 26:  log likelihood = -682.54073
Iteration 27:  log likelihood = -682.54073
Iteration 28:  log likelihood = -682.54073
Iteration 29:  log likelihood = -682.54073
Iteration 30:  log likelihood = -682.54073
Iteration 31:  log likelihood = -682.54073
Refining estimates:
Iteration 0:   log likelihood = -682.54073
Iteration 1:   log likelihood = -682.54073
Iteration 2:   log likelihood = -682.54073
Iteration 3:   log likelihood = -682.54073

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          219
Time at risk    =   13805478.5
                                                LR chi2(33)      =      168.41
Log likelihood  =   -682.54073                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7734856   .1345035    -1.48   0.140      .550091    1.087602
      1.male |   2.000886   .7733004     1.79   0.073     .9381034      4.2677
        age1 |   .9793235   .0394885    -0.52   0.604     .9049067     1.05986
        age2 |   1.103446   .0659781     1.65   0.100     .9814214    1.240643
        age3 |   .7522751   .3000411    -0.71   0.475     .3442542    1.643895
             |
         imd |
          2  |   .9148178   .2134238    -0.38   0.703     .5790983    1.445163
          3  |    .825175   .2046463    -0.77   0.438     .5075105    1.341674
          4  |   1.071548    .264575     0.28   0.780     .6604537    1.738526
5 most de..  |   .9674465   .2606624    -0.12   0.902     .5705384    1.640473
             |
   obese4cat |
Obese I ..)  |   1.023749   .2029709     0.12   0.906     .6941165    1.509923
Obese II..)  |   1.122374    .326849     0.40   0.692     .6342458    1.986177
Obese II..)  |   1.892719   .6412226     1.88   0.060     .9743448    3.676711
             |
smoke_nomiss |
     Former  |   1.389992   .2366507     1.93   0.053     .9956177    1.940583
    Current  |   1.942544   .5274531     2.45   0.014     1.140898    3.307463
             |
     diabcat |
Controlle..  |   1.630775   .6082761     1.31   0.190     .7850505    3.387589
Uncontrol..  |   1.755321   .8026381     1.23   0.219     .7163683    4.301075
Diabetes,..  |   1.44e-15   7.84e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   2.272718    .993824     1.88   0.060     .9645581    5.355039
       1.pad |   .7973006   .6130789    -0.29   0.768      .176643    3.598717
1.hyperten~n |   .8791739   .2849384    -0.40   0.691     .4658029    1.659386
1.heart_f~re |   1.345793   .5082326     0.79   0.432     .6419867    2.821179
1.stroke_tia |   1.439841   1.113707     0.47   0.637     .3161665    6.557121
       1.vte |   2.050562   1.586776     0.93   0.353     .4499786    9.344451
 1.oestrogen |   2.593478   2.107387     1.17   0.241     .5274974    12.75102
1.antiplat~t |   .8208247   .2237157    -0.72   0.469     .4811224    1.400378
1.flu_vac~ne |   1.038418   .1847086     0.21   0.832     .7327651    1.471566
             |
         ckd |
        CKD  |   1.560195   .2645379     2.62   0.009     1.119061    2.175223
      1.copd |   1.645241   .3356591     2.44   0.015     1.102983    2.454088
1.other_re~y |   .6245893   .2177776    -1.35   0.177     .3153576    1.237046
1.immunode~y |    1.30922   .8037934     0.44   0.661     .3930239    4.361203
    1.cancer |    1.11006   .1991724     0.58   0.561     .7809434    1.577877
1.ae_atten~r |   2.144869   .3139687     5.21   0.000     1.609907    2.857596
1.gp_consult |   1.247111   .5648385     0.49   0.626     .5133114    3.029907
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_multivar3
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/admitcovid_multivar3.ster s
> aved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table2_admitcovid.txt 
> not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9040257   .1384447    -0.66   0.510     .6696159    1.220495
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9028909    .139394    -0.66   0.508     .6671469    1.221938
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8463348   .1385417    -1.02   0.308     .6140502    1.166489
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7734856   .1345035    -1.48   0.140      .550091    1.087602
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_admitcovid
> .log
  log type:  text
 closed on:   1 Mar 2021, 21:52:12
-------------------------------------------------------------------------------
