-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_positiveco
> vidtest.log
  log type:  text
 opened on:   1 Mar 2021, 21:53:17

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |    outcome: first
  Treatment |  positive covid test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    16,256        139 |    16,395 
            |     99.15       0.85 |    100.00 
------------+----------------------+----------
current use |    49,755        315 |    50,070 
            |     99.37       0.63 |    100.00 
------------+----------------------+----------
      Total |    66,011        454 |    66,465 
            |     99.32       0.68 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5035.6376
Iteration 1:   log likelihood = -5031.3507
Iteration 2:   log likelihood = -5031.3251
Iteration 3:   log likelihood = -5031.3251
Refining estimates:
Iteration 0:   log likelihood = -5031.3251

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          454
Time at risk    =   13783401.5
                                                LR chi2(1)       =        8.62
Log likelihood  =   -5031.3251                  Prob > chi2      =      0.0033

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .736809   .0750276    -3.00   0.003     .6035024    .8995614
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_un
> ivar.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_univar.st
> er saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5035.6376
Iteration 1:   log likelihood =  -4964.407
Iteration 2:   log likelihood = -4955.7722
Iteration 3:   log likelihood = -4955.7297
Iteration 4:   log likelihood = -4955.7296
Refining estimates:
Iteration 0:   log likelihood = -4955.7296

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          454
Time at risk    =   13783401.5
                                                LR chi2(5)       =      159.82
Log likelihood  =   -4955.7296                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7664257   .0787907    -2.59   0.010     .6265621    .9375101
      1.male |   1.231863   .1728067     1.49   0.137     .9357395    1.621696
        age1 |   .9119579   .0176159    -4.77   0.000     .8780768    .9471462
        age2 |   1.181708   .0417731     4.72   0.000     1.102606    1.266484
        age3 |   .6167359   .1398406    -2.13   0.033     .3954533    .9618411
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_mu
> ltivar1.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_multivar1
> .ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5035.6376
Iteration 1:   log likelihood = -4945.4866
Iteration 2:   log likelihood = -4932.1697
Iteration 3:   log likelihood = -4932.0993
Iteration 4:   log likelihood = -4932.0993
Refining estimates:
Iteration 0:   log likelihood = -4932.0993

Cox regression -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          454
Time at risk    =   13783401.5
                                                LR chi2(26)      =      207.08
Log likelihood  =   -4932.0993                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7286132    .079279    -2.91   0.004     .5886802    .9018091
      1.male |    1.07865   .2477771     0.33   0.742     .6876234    1.692039
        age1 |   .9471019   .0237956    -2.16   0.031     .9015932    .9949077
        age2 |   1.142754   .0433001     3.52   0.000     1.060962    1.230852
        age3 |   .6853282   .1754239    -1.48   0.140     .4149693     1.13183
             |
         imd |
          2  |   1.016462   .1551215     0.11   0.915     .7536852    1.370858
          3  |   1.013289   .1568237     0.09   0.932      .748162    1.372371
          4  |   1.112972    .172922     0.69   0.491     .8207926    1.509159
5 most de..  |   1.824834   .2634792     4.17   0.000     1.375062    2.421722
             |
   obese4cat |
Obese I ..)  |   .9463724   .1270598    -0.41   0.681     .7274111    1.231244
Obese II..)  |    .935581   .1875717    -0.33   0.740     .6315775    1.385914
Obese II..)  |   1.418319   .3163965     1.57   0.117     .9159868    2.196133
             |
smoke_nomiss |
     Former  |   1.136312   .1177538     1.23   0.218     .9274473    1.392214
    Current  |   1.114018   .2129266     0.56   0.572      .765947    1.620264
             |
     diabcat |
Controlle..  |   1.227791   .3150768     0.80   0.424     .7424859    2.030301
Uncontrol..  |   1.476629   .4485445     1.28   0.199      .814157    2.678147
Diabetes,..  |   1.665033   1.700387     0.50   0.618     .2249819    12.32248
             |
1.myocardi~t |   1.527206    .483223     1.34   0.181     .8214272    2.839397
       1.pad |   1.185061   .6231742     0.32   0.747     .4227946    3.321637
1.hyperten~n |   .9134793   .1939941    -0.43   0.670     .6024631    1.385055
1.heart_f~re |   1.097644   .2822291     0.36   0.717     .6631298    1.816874
1.stroke_tia |   2.594566   1.134484     2.18   0.029     1.101218    6.113021
       1.vte |   2.006975   1.002475     1.39   0.163     .7539989    5.342117
 1.oestrogen |   1.188415   .6985199     0.29   0.769     .3755378    3.760821
1.antiplat~t |    .769495   .1389487    -1.45   0.147     .5401362    1.096247
1.flu_vac~ne |   .9615644   .1054878    -0.36   0.721     .7755286    1.192227
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_mu
> ltivar2.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_multivar2
> .ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1569.8367
Iteration 1:   log likelihood = -1520.8593
Iteration 2:   log likelihood = -1452.7362
Iteration 3:   log likelihood = -1452.4827
Iteration 4:   log likelihood = -1452.4826
Refining estimates:
Iteration 0:   log likelihood = -1452.4826

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,465                  Number of obs    =      66,465
No. of failures =          454
Time at risk    =   13783401.5
                                                LR chi2(33)      =      234.71
Log likelihood  =   -1452.4826                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6903941   .0796602    -3.21   0.001     .5506584    .8655892
      1.male |   1.058232   .2492706     0.24   0.810      .666925    1.679131
        age1 |   .9598948   .0247038    -1.59   0.112      .912677    1.009555
        age2 |   1.128614   .0446839     3.06   0.002     1.044347     1.21968
        age3 |    .685829   .1859526    -1.39   0.164     .4031111    1.166828
             |
         imd |
          2  |   1.049338   .1764613     0.29   0.775     .7546989    1.459007
          3  |   1.077588   .1898039     0.42   0.671     .7629992    1.521884
          4  |   1.124384   .2075339     0.64   0.525     .7830757    1.614455
5 most de..  |   1.590538   .2998049     2.46   0.014     1.099256    2.301386
             |
   obese4cat |
Obese I ..)  |   .9644402   .1332144    -0.26   0.793     .7357023    1.264295
Obese II..)  |    .931677   .1919051    -0.34   0.731     .6222092    1.395065
Obese II..)  |     1.4528   .3370601     1.61   0.107     .9219785    2.289237
             |
smoke_nomiss |
     Former  |   1.044261   .1151628     0.39   0.695     .8412739    1.296227
    Current  |   .9645333   .1954942    -0.18   0.859     .6483259    1.434964
             |
     diabcat |
Controlle..  |   1.225599   .3293026     0.76   0.449     .7238383    2.075178
Uncontrol..  |   1.525806   .4722297     1.37   0.172     .8318717    2.798608
Diabetes,..  |   1.549455    1.63255     0.42   0.678     .1964847    12.21882
             |
1.myocardi~t |   1.571816   .5154002     1.38   0.168     .8265928    2.988901
       1.pad |   1.075868   .5867534     0.13   0.893     .3694314    3.133174
1.hyperten~n |   .9757149   .2141525    -0.11   0.911     .6345984    1.500192
1.heart_f~re |   1.108586    .293464     0.39   0.697      .659842    1.862511
1.stroke_tia |   2.906129   1.332486     2.33   0.020     1.183127    7.138357
       1.vte |   2.057306   1.056187     1.41   0.160     .7521532     5.62719
 1.oestrogen |   1.224863   .7467105     0.33   0.739     .3708269    4.045793
1.antiplat~t |   .7229871   .1364595    -1.72   0.086     .4994263    1.046622
1.flu_vac~ne |   .9035524   .1054897    -0.87   0.385     .7187462    1.135876
             |
         ckd |
        CKD  |   1.181864   .1494277     1.32   0.186     .9224583    1.514218
      1.copd |   1.495796   .2221983     2.71   0.007     1.117964    2.001323
1.other_re~y |   .9065635   .2059027    -0.43   0.666     .5808574    1.414904
1.immunode~y |   .8149785   .4822908    -0.35   0.730     .2555166      2.5994
    1.cancer |   .9286955   .1247105    -0.55   0.582     .7137879    1.208308
1.ae_atten~r |   1.968618    .200901     6.64   0.000     1.611739    2.404518
1.gp_consult |    .921562   .2600304    -0.29   0.772     .5300871    1.602145
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_mu
> ltivar3.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/positivecovidtest_multivar3
> .ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table2_positivecovidte
> st.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .736809   .0750276    -3.00   0.003     .6035024    .8995614
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7664257   .0787907    -2.59   0.010     .6265621    .9375101
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7286132    .079279    -2.91   0.004     .5886802    .9018091
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6903941   .0796602    -3.21   0.001     .5506584    .8655892
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_positiveco
> vidtest.log
  log type:  text
 closed on:   1 Mar 2021, 21:53:35
-------------------------------------------------------------------------------
