-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/12a_an_models_ethnicity_
> positivecovidtest.log
  log type:  text
 opened on:   9 Mar 2021, 18:00:16

. 
. /* Outcome: Admitcovid=======================================================
> =*/ 
. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(16,843 observations deleted)

. 
. * Create new diabetes variable, group Diabetes, no hba1c with uncontrolled di
> abetes
. clonevar diab_control = diabcat

. recode diab_control 4=3
(diab_control: 74 changes made)

. 
. /* Main Model================================================================
> =*/
. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $reviseddagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3661.3978
Iteration 1:   log likelihood = -3583.9694
Iteration 2:   log likelihood = -3569.6816
Iteration 3:   log likelihood = -3569.4553
Iteration 4:   log likelihood = -3569.4551
Refining estimates:
Iteration 0:   log likelihood = -3569.4551

Cox regression -- Breslow method for ties

No. of subjects =       49,622                  Number of obs    =      49,622
No. of failures =          339
Time at risk    =   10306677.5
                                                LR chi2(29)      =      183.89
Log likelihood  =   -3569.4551                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7242636   .0917518    -2.55   0.011     .5650202    .9283876
      1.male |   .9588497   .2543618    -0.16   0.874     .5700926    1.612708
        age1 |   .9581203   .0280765    -1.46   0.144     .9046419     1.01476
        age2 |   1.162487   .0516891     3.39   0.001     1.065468    1.268342
        age3 |   .5890764   .1770075    -1.76   0.078     .3268888    1.061557
             |
         imd |
          2  |    1.10033   .2055507     0.51   0.609     .7629774    1.586845
          3  |   1.171252   .2183858     0.85   0.397     .8127179    1.687957
          4  |     1.2314   .2313657     1.11   0.268     .8520567    1.779631
5 most de..  |   2.190766   .3750338     4.58   0.000     1.566318    3.064163
             |
   obese4cat |
Obese I ..)  |   1.015305   .1519023     0.10   0.919     .7572622    1.361278
Obese II..)  |   .9094655   .2125493    -0.41   0.685      .575246    1.437867
Obese II..)  |   1.294566   .3467502     0.96   0.335     .7658247    2.188361
             |
smoke_nomiss |
     Former  |   1.242046   .1536423     1.75   0.080     .9746382    1.582823
    Current  |   1.393562   .2954264     1.57   0.117     .9197647    2.111425
             |
diab_control |
Controlle..  |   1.111445   .3418478     0.34   0.731     .6082518    2.030919
Uncontrol..  |   1.646879   .5600629     1.47   0.142     .8456472    3.207261
             |
1.myocardi~t |   1.927302   .6894285     1.83   0.067     .9560057    3.885428
       1.pad |   .8569689   .6256992    -0.21   0.833     .2048693    3.584704
1.hyperten~n |   1.220279    .297505     0.82   0.414     .7567203    1.967808
1.heart_f~re |   1.288639   .3834558     0.85   0.394     .7191876    2.308981
1.stroke_tia |   3.276504   1.662344     2.34   0.019     1.212135    8.856666
       1.vte |   2.656303   1.532619     1.69   0.090      .857346    8.229986
 1.oestrogen |   .5564505   .5613465    -0.58   0.561     .0770434    4.018996
1.antiplat~t |   .7239234   .1519629    -1.54   0.124     .4797468    1.092379
1.flu_vac~ne |   1.036829   .1351185     0.28   0.781     .8031177     1.33855
             |
   ethnicity |
      Mixed  |   2.968237   2.111733     1.53   0.126      .736066    11.96962
Asian or ..  |   2.213026   .7657888     2.30   0.022     1.123154    4.360474
      Black  |   .5180682   .5207106    -0.65   0.513      .072251    3.714754
      Other  |   1.871084   1.090618     1.07   0.282     .5969591    5.864647
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/12a_`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtes
> t_multivar2_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtest_multi
> var2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $reviseddagvarlist       

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3661.3978
Iteration 1:   log likelihood = -3587.2652
Iteration 2:   log likelihood = -3573.3435
Iteration 3:   log likelihood = -3573.1199
Iteration 4:   log likelihood = -3573.1196
Refining estimates:
Iteration 0:   log likelihood = -3573.1196

Cox regression -- Breslow method for ties

No. of subjects =       49,622                  Number of obs    =      49,622
No. of failures =          339
Time at risk    =   10306677.5
                                                LR chi2(25)      =      176.56
Log likelihood  =   -3573.1196                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7233992   .0915769    -2.56   0.011     .5644459    .9271153
      1.male |   .9484856   .2519367    -0.20   0.842     .5635528    1.596345
        age1 |   .9560682   .0279229    -1.54   0.124     .9028773    1.012393
        age2 |   1.164105   .0516716     3.42   0.001      1.06711    1.269915
        age3 |   .5871149   .1763151    -1.77   0.076     .3259123    1.057658
             |
         imd |
          2  |   1.102651   .2059741     0.52   0.601     .7645999    1.590163
          3  |   1.175879   .2191976     0.87   0.385     .8159968     1.69448
          4  |   1.244584   .2336233     1.17   0.244     .8614766    1.798063
5 most de..  |   2.222466   .3797611     4.67   0.000     1.589963    3.106584
             |
   obese4cat |
Obese I ..)  |   1.009008   .1509449     0.06   0.952     .7525878    1.352795
Obese II..)  |   .8912548   .2081178    -0.49   0.622     .5639453    1.408532
Obese II..)  |    1.25461   .3357403     0.85   0.397     .7425452      2.1198
             |
smoke_nomiss |
     Former  |   1.223938   .1509268     1.64   0.101     .9611604    1.558559
    Current  |   1.362152   .2885476     1.46   0.145     .8993191    2.063182
             |
diab_control |
Controlle..  |   1.160951   .3559404     0.49   0.626     .6365619    2.117322
Uncontrol..  |   1.708114   .5808386     1.57   0.115      .877139    3.326328
             |
1.myocardi~t |    1.91883   .6867257     1.82   0.069     .9514852    3.869645
       1.pad |   .8467151   .6181964    -0.23   0.820     .2024256     3.54168
1.hyperten~n |   1.221637   .2981517     0.82   0.412     .7571789    1.970996
1.heart_f~re |   1.276561   .3801462     0.82   0.412     .7121362    2.288339
1.stroke_tia |     3.2738   1.665535     2.33   0.020      1.20783    8.873567
       1.vte |   2.642782    1.52896     1.68   0.093      .850365    8.213289
 1.oestrogen |   .5426046   .5473511    -0.61   0.544     .0751339      3.9186
1.antiplat~t |   .7395449   .1550395    -1.44   0.150     .4903623    1.115352
1.flu_vac~ne |   1.036373   .1351272     0.27   0.784     .8026619    1.338135
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/12a_`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtes
> t_multivar2_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtest_multi
> var2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $revisedfullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1077.0251
Iteration 1:   log likelihood =  -1026.541
Iteration 2:   log likelihood = -982.50953
Iteration 3:   log likelihood =  -982.1792
Iteration 4:   log likelihood = -982.17909
Iteration 5:   log likelihood = -982.17909
Refining estimates:
Iteration 0:   log likelihood = -982.17909

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       49,622                  Number of obs    =      49,622
No. of failures =          339
Time at risk    =   10306677.5
                                                LR chi2(36)      =      189.69
Log likelihood  =   -982.17909                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7223187   .0994228    -2.36   0.018     .5515262    .9460009
      1.male |   .9304509   .2562255    -0.26   0.793     .5423648     1.59623
        age1 |   .9701479   .0294439    -1.00   0.318     .9141219    1.029608
        age2 |   1.151872   .0544309     2.99   0.003     1.049981    1.263651
        age3 |   .5916797   .1921061    -1.62   0.106     .3131261    1.118032
             |
         imd |
          2  |   1.028229   .2146019     0.13   0.894     .6830235    1.547905
          3  |   1.183189   .2524171     0.79   0.430     .7788642    1.797406
          4  |    1.13439   .2571134     0.56   0.578      .727503    1.768847
5 most de..  |    1.74877   .3920899     2.49   0.013       1.1269    2.713811
             |
   obese4cat |
Obese I ..)  |   1.053117   .1647991     0.33   0.741     .7749517    1.431128
Obese II..)  |   .9523032   .2328609    -0.20   0.842     .5897067    1.537851
Obese II..)  |   1.348383   .3785742     1.06   0.287     .7777297     2.33775
             |
smoke_nomiss |
     Former  |   1.214815   .1635889     1.45   0.148     .9330096    1.581737
    Current  |   1.310539   .3015793     1.18   0.240      .834781     2.05744
             |
diab_control |
Controlle..  |   1.217285   .3949397     0.61   0.544     .6445039    2.299104
Uncontrol..  |   1.710648   .6067246     1.51   0.130     .8536123    3.428158
             |
1.myocardi~t |   2.045294   .7728821     1.89   0.058     .9752168    4.289537
       1.pad |   .7486926   .5640555    -0.38   0.701     .1710091    3.277842
1.hyperten~n |    1.32292   .3375219     1.10   0.273     .8023488    2.181243
1.heart_f~re |   1.341682   .4113237     0.96   0.338     .7356888    2.446838
1.stroke_tia |   4.093653   2.218153     2.60   0.009     1.415422    11.83957
       1.vte |   3.096879   1.874388     1.87   0.062     .9456581    10.14179
 1.oestrogen |   .5617075   .5850478    -0.55   0.580     .0729355    4.325948
1.antiplat~t |   .6521287   .1469174    -1.90   0.058     .4193406    1.014144
1.flu_vac~ne |   .9772958   .1368509    -0.16   0.870      .742732    1.285938
             |
         ckd |
        CKD  |   1.176852   .1745046     1.10   0.272     .8800451    1.573761
      1.copd |   1.505733   .2546327     2.42   0.016     1.080942    2.097459
1.other_re~y |   .6036747   .1795427    -1.70   0.090     .3370092    1.081345
1.immunode~y |   .7615582   .5604072    -0.37   0.711     .1800238    3.221633
    1.cancer |   1.041082   .1621222     0.26   0.796     .7672406    1.412661
1.ae_atten~r |   1.896174   .2286263     5.31   0.000     1.497086    2.401649
1.gp_consult |   .9711318    .342879    -0.08   0.934     .4861195    1.940051
             |
   ethnicity |
      Mixed  |   2.360018   2.220412     0.91   0.361     .3733071    14.91984
Asian or ..  |   2.814332   1.161941     2.51   0.012     1.252978    6.321311
      Black  |   .5365492   .5608215    -0.60   0.551     .0691674    4.162148
      Other  |   1.908733   1.265582     0.97   0.330     .5204243    7.000559
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/12a_`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtes
> t_multivar3_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtest_multi
> var3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $revisedfullvarlist , strata(practice_
> id)                

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1077.0251
Iteration 1:   log likelihood = -1030.4522
Iteration 2:   log likelihood = -986.05063
Iteration 3:   log likelihood = -985.73257
Iteration 4:   log likelihood = -985.73255
Refining estimates:
Iteration 0:   log likelihood = -985.73255

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       49,622                  Number of obs    =      49,622
No. of failures =          339
Time at risk    =   10306677.5
                                                LR chi2(32)      =      182.59
Log likelihood  =   -985.73255                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7188956   .0985953    -2.41   0.016     .5494459    .9406037
      1.male |   .9306155   .2559498    -0.26   0.794     .5428276    1.595433
        age1 |    .967605   .0292239    -1.09   0.276     .9119895    1.026612
        age2 |   1.151265   .0542708     2.99   0.003     1.049662    1.262703
        age3 |    .597303   .1937063    -1.59   0.112     .3163361    1.127822
             |
         imd |
          2  |   1.033612    .215091     0.16   0.874     .6874257    1.554138
          3  |   1.184265   .2519353     0.79   0.427      .780491    1.796924
          4  |   1.126082   .2546917     0.53   0.600     .7228518    1.754246
5 most de..  |   1.757446   .3931833     2.52   0.012     1.133568    2.724686
             |
   obese4cat |
Obese I ..)  |   1.045701   .1633177     0.29   0.775     .7699578    1.420196
Obese II..)  |   .9195569   .2244937    -0.34   0.731      .569866    1.483831
Obese II..)  |   1.286745   .3599708     0.90   0.367     .7436457    2.226479
             |
smoke_nomiss |
     Former  |   1.177317   .1567951     1.23   0.220     .9068391    1.528468
    Current  |   1.254271   .2868929     0.99   0.322     .8011132    1.963764
             |
diab_control |
Controlle..  |   1.240763    .400977     0.67   0.504      .658577    2.337607
Uncontrol..  |   1.816301   .6393068     1.70   0.090      .911128     3.62073
             |
1.myocardi~t |   1.963219   .7419794     1.78   0.074     .9359775    4.117864
       1.pad |   .7439238   .5608001    -0.39   0.695     .1697688    3.259859
1.hyperten~n |   1.317445   .3355612     1.08   0.279     .7996989    2.170395
1.heart_f~re |   1.301518   .3987594     0.86   0.390     .7139352    2.372693
1.stroke_tia |    3.88356   2.102613     2.51   0.012     1.343933    11.22231
       1.vte |   2.973942   1.801367     1.80   0.072     .9072881    9.748096
 1.oestrogen |   .5219507   .5439423    -0.62   0.533     .0676961    4.024345
1.antiplat~t |   .6684636    .149904    -1.80   0.072     .4307195    1.037435
1.flu_vac~ne |   .9807327   .1371246    -0.14   0.889     .7456533    1.289925
             |
         ckd |
        CKD  |     1.1862   .1749533     1.16   0.247     .8884103    1.583806
      1.copd |   1.497405   .2525156     2.39   0.017     1.075961    2.083925
1.other_re~y |   .6112153    .181434    -1.66   0.097     .3416035    1.093619
1.immunode~y |     .81379   .5938373    -0.28   0.778     .1947041    3.401336
    1.cancer |   1.033208   .1603498     0.21   0.833     .7622278    1.400525
1.ae_atten~r |   1.927192   .2319125     5.45   0.000     1.522278     2.43981
1.gp_consult |    .951997   .3357771    -0.14   0.889     .4768808    1.900471
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/12a_`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtes
> t_multivar3_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/12a_positivecovidtest_multi
> var3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table9_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table9_positivecovidte
> st.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 9: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("DAG Adjusted with ethnicity") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
. /* Main Model */ 
. estimates use $tempdir/12a_`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7242636   .0917518    -2.55   0.011     .5650202    .9283876
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/12a_`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7233992   .0915769    -2.56   0.011     .5644459    .9271153
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/12a_`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7223187   .0994228    -2.36   0.018     .5515262    .9460009
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/12a_`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7188956   .0985953    -2.41   0.016     .5494459    .9406037
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/12a_an_models_ethnicity_
> positivecovidtest.log
  log type:  text
 closed on:   9 Mar 2021, 18:00:43
-------------------------------------------------------------------------------
