-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/SA2_02a_cr_create_popula
> tion_onscoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:43:02

. 
. /*  Exclude people aged <55==================================================
> */ 
. 
. use $tempdir_main_analysis/analysis_dataset_`outcome' , clear

. 
. noi di "DROP AGE <55:" 
DROP AGE <55:

. drop if age < 55
(3,999 observations deleted)

. 
. datacheck age >= 55, nol

. 
. /* SAVE DATA=================================================================
> =*/                
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/analysis_dataset_ons
> coviddeath.dta not found)
file /workspace/output/oac_tempdata/sens_analysis_2/analysis_dataset_onscovidde
> ath.dta saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     66,465  total observations
          0  exclusions
------------------------------------------------------------------------------
     66,465  observations remaining, representing
     66,465  subjects
        183  failures in single-failure-per-subject data
 13824875.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/analysis_dataset_STS
> ET_onscoviddeath.dta not found)
file /workspace/output/oac_tempdata/sens_analysis_2/analysis_dataset_STSET_onsc
> oviddeath.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/SA2_02a_cr_create_popula
> tion_onscoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 21:43:04
-------------------------------------------------------------------------------
