-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/05c_an_models_posi
> tivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:50:21

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   485,579      2,667 |   488,246 
            |     99.45       0.55 |    100.00 
------------+----------------------+----------
current use |    49,109        314 |    49,423 
            |     99.36       0.64 |    100.00 
------------+----------------------+----------
      Total |   534,688      2,981 |   537,669 
            |     99.45       0.55 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7046.5597
Iteration 1:   log likelihood = -7044.4407
Iteration 2:   log likelihood = -7044.4349
Iteration 3:   log likelihood = -7044.4349
Refining estimates:
Iteration 0:   log likelihood = -7044.4349

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        2,981
Time at risk    =    111953988
                                                LR chi2(1)       =        4.25
Log likelihood  =   -7044.4349                  Prob > chi2      =      0.0393

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.133792   .0679449     2.10   0.036     1.008146    1.275097
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_univar.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_uni
> var.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7046.5597
Iteration 1:   log likelihood = -7040.2942
Iteration 2:   log likelihood = -7040.2505
Iteration 3:   log likelihood = -7040.2505
Refining estimates:
Iteration 0:   log likelihood = -7040.2505

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        2,981
Time at risk    =    111953988
                                                LR chi2(4)       =       12.62
Log likelihood  =   -7040.2505                  Prob > chi2      =      0.0133

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.322027   .1179528     3.13   0.002     1.109929    1.574656
      1.male |          1  (omitted)
        age1 |   .9407859   .1090818    -0.53   0.599     .7495423    1.180825
        age2 |   1.128034   .0852453     1.59   0.111     .9727411     1.30812
        age3 |   .9612403   .1467022    -0.26   0.796     .7127277    1.296404
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7046.5597
Iteration 1:   log likelihood = -6844.4889
Iteration 2:   log likelihood = -6839.7169
Iteration 3:   log likelihood =  -6839.715
Refining estimates:
Iteration 0:   log likelihood =  -6839.715

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        2,981
Time at risk    =    111953988
                                                LR chi2(25)      =      413.69
Log likelihood  =    -6839.715                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.308472   .1192826     2.95   0.003     1.094378    1.564449
      1.male |          1  (omitted)
        age1 |   1.062746   .1249489     0.52   0.605     .8440194    1.338156
        age2 |   1.061705   .0817604     0.78   0.437     .9129644    1.234677
        age3 |     .85679   .1355813    -0.98   0.329      .628315    1.168346
             |
         imd |
          2  |   1.261704   .0929518     3.16   0.002     1.092064    1.457696
          3  |   1.317558   .0988614     3.68   0.000     1.137367    1.526296
          4  |   1.507119   .1158116     5.34   0.000     1.296399    1.752091
5 most de..  |   1.859049   .1457347     7.91   0.000     1.594276    2.167796
             |
   obese4cat |
Obese I ..)  |   1.051255   .0542147     0.97   0.332     .9501898     1.16307
Obese II..)  |   1.263919   .1009996     2.93   0.003     1.080687    1.478219
Obese II..)  |   1.421008   .1729331     2.89   0.004     1.119457    1.803789
             |
smoke_nomiss |
     Former  |     1.1616   .0514326     3.38   0.001     1.065045     1.26691
    Current  |   .6402466   .0551051    -5.18   0.000     .5408608     .757895
             |
     diabcat |
Controlle..  |   1.364431   .0714526     5.93   0.000     1.231334    1.511915
Uncontrol..  |   1.670072   .1130017     7.58   0.000     1.462651    1.906908
Diabetes,..  |   .7278725   .3437781    -0.67   0.501     .2884218    1.836887
             |
1.myocardi~t |   1.035068     .07835     0.46   0.649     .8923536    1.200608
       1.pad |   1.375589   .1322099     3.32   0.001     1.139406     1.66073
1.hyperten~n |   .9637671   .0409985    -0.87   0.386     .8866701    1.047568
1.heart_f~re |   1.193197   .0999314     2.11   0.035     1.012565    1.406051
1.stroke_tia |   1.647911   .1060074     7.76   0.000     1.452705    1.869348
       1.vte |   1.563445   .1536278     4.55   0.000      1.28956    1.895499
 1.oestrogen |    1.19899   .3223988     0.67   0.500     .7078384    2.030939
1.antiplat~t |   1.094387   .0606489     1.63   0.104     .9817457    1.219953
1.flu_vac~ne |   .8941642   .0420962    -2.38   0.017     .8153493    .9805977
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7046.5597
Iteration 1:   log likelihood =  -6629.313
Iteration 2:   log likelihood = -6616.5481
Iteration 3:   log likelihood = -6616.5469
Refining estimates:
Iteration 0:   log likelihood = -6616.5469

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        2,981
Time at risk    =    111953988
                                                LR chi2(32)      =      860.03
Log likelihood  =   -6616.5469                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.20577   .1113943     2.03   0.043     1.006066    1.445114
      1.male |          1  (omitted)
        age1 |   1.015013   .1203367     0.13   0.900      .804555    1.280522
        age2 |   1.086098   .0845324     1.06   0.289     .9324354    1.265083
        age3 |   .8323015   .1328588    -1.15   0.250     .6087023    1.138037
             |
         imd |
          2  |   1.229593    .091258     2.78   0.005     1.063131    1.422119
          3  |   1.269179   .0963391     3.14   0.002     1.093733     1.47277
          4  |   1.431162   .1112568     4.61   0.000     1.228902     1.66671
5 most de..  |   1.725476   .1372666     6.86   0.000     1.476364    2.016622
             |
   obese4cat |
Obese I ..)  |   1.058956      .0551     1.10   0.271     .9562862    1.172649
Obese II..)  |   1.272389   .1028087     2.98   0.003     1.086033    1.490722
Obese II..)  |   1.348483   .1662046     2.43   0.015     1.059089    1.716954
             |
smoke_nomiss |
     Former  |   1.112834   .0504598     2.36   0.018     1.018202    1.216261
    Current  |   .5916711   .0522084    -5.95   0.000     .4977042    .7033792
             |
     diabcat |
Controlle..  |   1.322734   .0703126     5.26   0.000      1.19186    1.467979
Uncontrol..  |   1.570103   .1082511     6.54   0.000     1.371645    1.797274
Diabetes,..  |   .6478051   .3092298    -0.91   0.363     .2541694     1.65107
             |
1.myocardi~t |   .9968828   .0761375    -0.04   0.967     .8582882    1.157857
       1.pad |   1.303307   .1278263     2.70   0.007     1.075381    1.579543
1.hyperten~n |   .9607726   .0414574    -0.93   0.354     .8828588    1.045562
1.heart_f~re |   1.034445    .088255     0.40   0.691     .8751568    1.222724
1.stroke_tia |   1.510001   .0985848     6.31   0.000      1.32863     1.71613
       1.vte |   1.391724   .1388271     3.31   0.001     1.144575    1.692241
 1.oestrogen |    1.19654    .321078     0.67   0.504     .7071591    2.024593
1.antiplat~t |   1.038712   .0580818     0.68   0.497     .9308903    1.159023
1.flu_vac~ne |   .8835504    .042052    -2.60   0.009     .8048575    .9699373
             |
         ckd |
        CKD  |    1.26066   .0649665     4.49   0.000     1.139547    1.394644
      1.copd |   1.194018   .0756468     2.80   0.005     1.054588    1.351881
1.other_re~y |   1.485737   .1253995     4.69   0.000     1.259211    1.753013
1.immunode~y |    1.15667   .2423534     0.69   0.487     .7671139     1.74405
    1.cancer |   1.168243   .0604411     3.01   0.003     1.055589     1.29292
1.ae_atten~r |   2.277871   .0982934    19.08   0.000     2.093141    2.478904
1.gp_consult |    1.08154    .504103     0.17   0.866     .4338101    2.696407
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_2/table2_positivec
> ovidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.133792   .0679449     2.10   0.036     1.008146    1.275097
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.322027   .1179528     3.13   0.002     1.109929    1.574656
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.308472   .1192826     2.95   0.003     1.094378    1.564449
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.20577   .1113943     2.03   0.043     1.006066    1.445114
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/05c_an_models_posi
> tivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:52:28
-------------------------------------------------------------------------------
