-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:33:28

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   272,197      3,795 |   275,992 
             |     98.62       1.38 |    100.00 
-------------+----------------------+----------
warfarin use |    91,207        888 |    92,095 
             |     99.04       0.96 |    100.00 
-------------+----------------------+----------
       Total |   363,404      4,683 |   368,087 
             |     98.73       1.27 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -59909.539
Iteration 1:   log likelihood = -59859.305
Iteration 2:   log likelihood = -59858.907
Iteration 3:   log likelihood = -59858.907
Refining estimates:
Iteration 0:   log likelihood = -59858.907

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        4,683
Time at risk    =     75073860
                                                LR chi2(1)       =      101.26
Log likelihood  =   -59858.907                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6964482    .025962    -9.70   0.000      .647378    .7492379
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_univ
> ar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -59909.539
Iteration 1:   log likelihood =  -59267.97
Iteration 2:   log likelihood = -59141.292
Iteration 3:   log likelihood = -59138.976
Iteration 4:   log likelihood = -59138.975
Refining estimates:
Iteration 0:   log likelihood = -59138.975

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        4,683
Time at risk    =     75073860
                                                LR chi2(5)       =     1541.13
Log likelihood  =   -59138.975                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6623331   .0247843   -11.01   0.000     .6154953    .7127352
      1.male |   1.145149   .0344362     4.51   0.000     1.079606    1.214672
        age1 |   .9695399   .0056385    -5.32   0.000     .9585514    .9806545
        age2 |    1.12349   .0116857    11.19   0.000     1.100818    1.146629
        age3 |   .6293807   .0404259    -7.21   0.000     .5549319    .7138174
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24159.003
Iteration 1:   log likelihood = -22886.652
Iteration 2:   log likelihood = -22333.195
Iteration 3:   log likelihood = -22329.631
Iteration 4:   log likelihood =  -22329.63
Refining estimates:
Iteration 0:   log likelihood =  -22329.63

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        4,683
Time at risk    =     75073860
                                                LR chi2(27)      =     3658.75
Log likelihood  =    -22329.63                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7387719   .0285997    -7.82   0.000     .6847913    .7970076
      1.male |   1.218257    .039041     6.16   0.000     1.144092     1.29723
        age1 |    .974186   .0059085    -4.31   0.000     .9626741    .9858356
        age2 |   1.120776   .0120025    10.65   0.000     1.097497    1.144549
        age3 |   .5676526   .0372553    -8.63   0.000     .4991349     .645576
             |
         imd |
          2  |   1.101297   .0614194     1.73   0.084     .9872628    1.228502
          3  |   1.208154   .0677396     3.37   0.001     1.082422    1.348491
          4  |   1.302975   .0757776     4.55   0.000     1.162606    1.460292
5 most de..  |   1.479144   .0873452     6.63   0.000     1.317486    1.660638
             |
   obese4cat |
Obese I ..)  |   .9899726   .0397059    -0.25   0.802     .9151307    1.070935
Obese II..)  |   1.215943   .0681907     3.49   0.000     1.089375    1.357216
Obese II..)  |   1.324595   .1017946     3.66   0.000     1.139381    1.539918
             |
smoke_nomiss |
     Former  |   1.203583   .0400177     5.57   0.000     1.127651    1.284628
    Current  |   1.014439   .0778729     0.19   0.852     .8727378    1.179147
             |
     diabcat |
Controlle..  |   1.203467   .0431082     5.17   0.000     1.121874    1.290994
Uncontrol..  |    1.55124   .0758394     8.98   0.000     1.409497    1.707237
Diabetes,..  |   .8916602   .2342802    -0.44   0.663      .532782    1.492276
             |
1.myocardi~t |   1.105428   .0481742     2.30   0.021     1.014929    1.203998
       1.pad |   1.339146   .0720863     5.43   0.000     1.205057    1.488155
1.hyperten~n |   1.033066   .0369254     0.91   0.363     .9631706    1.108034
1.heart_f~re |   1.279238   .0408586     7.71   0.000     1.201612    1.361879
1.stroke_tia |    1.17522   .0391849     4.84   0.000     1.100874    1.254586
       1.vte |   1.396588   .0656763     7.10   0.000     1.273619     1.53143
 1.oestrogen |   1.065278   .2423038     0.28   0.781     .6821067    1.663696
1.flu_vac~ne |   .8198223   .0307035    -5.30   0.000     .7618001    .8822637
1.antiplat~t |    1.01946   .0626482     0.31   0.754     .9037784    1.149949
1.care_ho~ce |   6.781838   .2951432    43.99   0.000     6.227352    7.385696
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24159.003
Iteration 1:   log likelihood = -22601.659
Iteration 2:   log likelihood =  -21981.66
Iteration 3:   log likelihood = -21977.928
Iteration 4:   log likelihood = -21977.927
Refining estimates:
Iteration 0:   log likelihood = -21977.927

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        4,683
Time at risk    =     75073860
                                                LR chi2(34)      =     4362.15
Log likelihood  =   -21977.927                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8058523   .0313387    -5.55   0.000      .746712    .8696764
      1.male |   1.242972   .0398314     6.79   0.000     1.167305    1.323544
        age1 |   .9769098   .0059066    -3.86   0.000     .9654014    .9885555
        age2 |   1.104433   .0118333     9.27   0.000     1.081482    1.127871
        age3 |   .6169261   .0405809    -7.34   0.000     .5423028    .7018179
             |
         imd |
          2  |   1.094357    .061102     1.61   0.106     .9809198    1.220913
          3  |   1.188537   .0666677     3.08   0.002     1.064798    1.326657
          4  |   1.264206   .0736711     4.02   0.000     1.127755    1.417168
5 most de..  |   1.403803   .0831065     5.73   0.000     1.250012    1.576515
             |
   obese4cat |
Obese I ..)  |   1.000904   .0402451     0.02   0.982     .9250526    1.082974
Obese II..)  |   1.223885   .0687745     3.60   0.000     1.096248    1.366384
Obese II..)  |   1.313005   .1010584     3.54   0.000      1.12915    1.526796
             |
smoke_nomiss |
     Former  |   1.137806    .038535     3.81   0.000     1.064731    1.215897
    Current  |   .9140106   .0713766    -1.15   0.250     .7842951     1.06518
             |
     diabcat |
Controlle..  |   1.186367   .0426558     4.75   0.000     1.105641    1.272987
Uncontrol..  |   1.477813   .0727454     7.93   0.000     1.341897    1.627496
Diabetes,..  |    .873239   .2295413    -0.52   0.606     .5216564    1.461779
             |
1.myocardi~t |   1.065306   .0464235     1.45   0.147     .9780954    1.160294
       1.pad |   1.276088   .0688146     4.52   0.000     1.148097    1.418348
1.hyperten~n |    1.02717   .0368664     0.75   0.455     .9573962    1.102029
1.heart_f~re |   1.178101   .0382676     5.05   0.000     1.105435    1.255543
1.stroke_tia |   1.125791    .037609     3.55   0.000      1.05444     1.20197
       1.vte |   1.295804   .0611863     5.49   0.000     1.181262    1.421451
 1.oestrogen |   1.037678   .2369811     0.16   0.871     .6632363    1.623517
1.flu_vac~ne |   .8237493   .0310054    -5.15   0.000     .7651673    .8868165
             |
         ckd |
        CKD  |   1.127803   .0367545     3.69   0.000     1.058018     1.20219
      1.copd |   1.240689   .0537286     4.98   0.000     1.139728    1.350593
1.other_re~y |   1.332966   .0705896     5.43   0.000     1.201551    1.478755
1.immunode~y |   1.126535    .212562     0.63   0.528     .7782777    1.630628
    1.cancer |   1.044706   .0395279     1.16   0.248     .9700356    1.125124
1.ae_atten~r |   2.109959   .0667613    23.60   0.000     1.983084    2.244951
1.gp_consult |   .7103934    .058269    -4.17   0.000     .6048954    .8342909
1.antiplat~t |   .9307143   .0572734    -1.17   0.243     .8249658    1.050018
1.care_ho~ce |   6.191879   .2738204    41.23   0.000     5.677801    6.752502
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table2_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6964482    .025962    -9.70   0.000      .647378    .7492379
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6623331   .0247843   -11.01   0.000     .6154953    .7127352
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7387719   .0285997    -7.82   0.000     .6847913    .7970076
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8058523   .0313387    -5.55   0.000      .746712    .8696764
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:35:11
-------------------------------------------------------------------------------
