-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_onsco
> viddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:31:33

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   274,202      1,790 |   275,992 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    91,666        429 |    92,095 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   365,868      2,219 |   368,087 
             |     99.40       0.60 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28398.576
Iteration 1:   log likelihood = -28377.772
Iteration 2:   log likelihood = -28377.629
Iteration 3:   log likelihood = -28377.629
Refining estimates:
Iteration 0:   log likelihood = -28377.629

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        2,219
Time at risk    =   75472613.5
                                                LR chi2(1)       =       41.89
Log likelihood  =   -28377.629                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7142557   .0383952    -6.26   0.000     .6428311    .7936162
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_u
> nivar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_univar.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28398.576
Iteration 1:   log likelihood = -27884.732
Iteration 2:   log likelihood =  -27702.37
Iteration 3:   log likelihood =  -27698.07
Iteration 4:   log likelihood = -27698.065
Refining estimates:
Iteration 0:   log likelihood = -27698.065

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        2,219
Time at risk    =   75472613.5
                                                LR chi2(5)       =     1401.02
Log likelihood  =   -27698.065                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6512105   .0351142    -7.95   0.000     .5858998    .7238014
      1.male |   1.480551   .0651391     8.92   0.000      1.35823    1.613887
        age1 |    1.04976   .0188616     2.70   0.007     1.013435    1.087387
        age2 |   1.070867   .0268163     2.73   0.006     1.019577    1.124737
        age3 |   .7077543   .0914363    -2.68   0.007     .5494321     .911698
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11458.824
Iteration 1:   log likelihood =  -10580.63
Iteration 2:   log likelihood =  -10159.33
Iteration 3:   log likelihood = -10156.235
Iteration 4:   log likelihood = -10156.155
Iteration 5:   log likelihood = -10156.155
Refining estimates:
Iteration 0:   log likelihood = -10156.155

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        2,219
Time at risk    =   75472613.5
                                                LR chi2(27)      =     2605.34
Log likelihood  =   -10156.155                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7396962   .0414898    -5.38   0.000     .6626882    .8256529
      1.male |   1.527648   .0720684     8.98   0.000      1.39273    1.675635
        age1 |   1.057573   .0193106     3.07   0.002     1.020394    1.096106
        age2 |   1.061899   .0270084     2.36   0.018     1.010261    1.116176
        age3 |   .6621151   .0868431    -3.14   0.002     .5120233     .856204
             |
         imd |
          2  |   1.003453   .0806927     0.04   0.966     .8571324    1.174753
          3  |   1.193615   .0959434     2.20   0.028     1.019634    1.397283
          4  |   1.153791   .0978421     1.69   0.092     .9771127    1.362415
5 most de..  |   1.362976   .1178193     3.58   0.000     1.150557    1.614613
             |
   obese4cat |
Obese I ..)  |   .9577048   .0572234    -0.72   0.470     .8518672    1.076692
Obese II..)  |   1.180904   .1031207     1.90   0.057     .9951411    1.401343
Obese II..)  |   1.333152   .1694691     2.26   0.024     1.039144    1.710344
             |
smoke_nomiss |
     Former  |   1.376006   .0687419     6.39   0.000      1.24766    1.517554
    Current  |   1.356127    .153689     2.69   0.007     1.086011    1.693427
             |
     diabcat |
Controlle..  |   1.250631    .064434     4.34   0.000      1.13051    1.383516
Uncontrol..  |   1.473237   .1086808     5.25   0.000      1.27491    1.702417
Diabetes,..  |   .5467056   .2479204    -1.33   0.183     .2247761     1.32971
             |
1.myocardi~t |   1.326701   .0773249     4.85   0.000     1.183483    1.487251
       1.pad |   1.435687   .1053333     4.93   0.000     1.243395    1.657718
1.hyperten~n |   1.018555   .0532881     0.35   0.725     .9192883     1.12854
1.heart_f~re |   1.480131   .0674632     8.60   0.000     1.353639    1.618442
1.stroke_tia |    1.18848   .0566439     3.62   0.000     1.082487     1.30485
       1.vte |   1.403808   .0950798     5.01   0.000     1.229295    1.603096
 1.oestrogen |   .6404776   .2905648    -0.98   0.326     .2632329     1.55836
1.flu_vac~ne |   .8052764   .0446473    -3.91   0.000     .7223564     .897715
1.antiplat~t |    .901624   .0816057    -1.14   0.253     .7550634    1.076632
1.care_ho~ce |   6.846229   .4177405    31.53   0.000     6.074536    7.715955
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11458.824
Iteration 1:   log likelihood = -10410.562
Iteration 2:   log likelihood =  -9961.088
Iteration 3:   log likelihood = -9957.8632
Iteration 4:   log likelihood = -9957.7907
Iteration 5:   log likelihood = -9957.7906
Refining estimates:
Iteration 0:   log likelihood = -9957.7906

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =        2,219
Time at risk    =   75472613.5
                                                LR chi2(34)      =     3002.07
Log likelihood  =   -9957.7906                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8106652   .0456876    -3.72   0.000     .7258877    .9053441
      1.male |    1.55231   .0732389     9.32   0.000     1.415201    1.702702
        age1 |   1.058779    .019311     3.13   0.002     1.021598    1.097312
        age2 |   1.044074   .0265544     1.70   0.090      .993304    1.097439
        age3 |    .732631   .0962455    -2.37   0.018     .5663217    .9477797
             |
         imd |
          2  |   1.005293   .0809879     0.07   0.948     .8584575    1.177245
          3  |   1.177553   .0947927     2.03   0.042     1.005678    1.378802
          4  |   1.115881   .0949617     1.29   0.198     .9444529    1.318424
5 most de..  |   1.296352   .1125056     2.99   0.003      1.09358    1.536724
             |
   obese4cat |
Obese I ..)  |   .9627719    .057721    -0.63   0.527     .8560347    1.082818
Obese II..)  |   1.173235    .102697     1.83   0.068     .9882721    1.392815
Obese II..)  |   1.302873   .1661546     2.07   0.038     1.014726    1.672843
             |
smoke_nomiss |
     Former  |   1.289485   .0655339     5.00   0.000     1.167231    1.424544
    Current  |   1.211418    .139993     1.66   0.097     .9658906    1.519357
             |
     diabcat |
Controlle..  |   1.220766   .0632033     3.85   0.000     1.102967    1.351145
Uncontrol..  |   1.367953   .1017465     4.21   0.000     1.182388    1.582641
Diabetes,..  |   .5486769   .2488712    -1.32   0.186     .2255408    1.334776
             |
1.myocardi~t |   1.267628   .0738943     4.07   0.000     1.130765    1.421056
       1.pad |   1.351586   .0995133     4.09   0.000     1.169963    1.561403
1.hyperten~n |   .9985245   .0525196    -0.03   0.978     .9007161    1.106954
1.heart_f~re |   1.329831   .0616434     6.15   0.000     1.214338    1.456308
1.stroke_tia |   1.138288   .0543562     2.71   0.007     1.036586    1.249969
       1.vte |    1.30137   .0883671     3.88   0.000     1.139204     1.48662
 1.oestrogen |   .6346695   .2888633    -1.00   0.318     .2600949    1.548686
1.flu_vac~ne |     .80565   .0448852    -3.88   0.000     .7223096    .8986063
             |
         ckd |
        CKD  |   1.273991   .0597621     5.16   0.000     1.162082    1.396676
      1.copd |   1.241207   .0760474     3.53   0.000     1.100759    1.399576
1.other_re~y |   1.533795   .1105537     5.93   0.000     1.331723    1.766528
1.immunode~y |   1.561222   .3768838     1.85   0.065     .9727068    2.505805
    1.cancer |   1.017802   .0552708     0.32   0.745      .915039    1.132106
1.ae_atten~r |   2.141965    .099513    16.40   0.000      1.95554    2.346163
1.gp_consult |   .7288336   .0847624    -2.72   0.007     .5802761    .9154235
1.antiplat~t |   .8262466   .0749262    -2.10   0.035     .6917045    .9869584
1.care_ho~ce |   6.327683   .3928564    29.72   0.000     5.602703    7.146475
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table2_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7142557   .0383952    -6.26   0.000     .6428311    .7936162
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6512105   .0351142    -7.95   0.000     .5858998    .7238014
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7396962   .0414898    -5.38   0.000     .6626882    .8256529
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8106652   .0456876    -3.72   0.000     .7258877    .9053441
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_onsco
> viddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:33:21
-------------------------------------------------------------------------------
