-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_onscovidde
> ath.log
  log type:  text
 opened on:  31 Dec 2020, 03:18:35

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |  outcome: ONS covid
  Treatment |         death
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    16,279         54 |    16,333 
            |     99.67       0.33 |    100.00 
------------+----------------------+----------
current use |    49,817        129 |    49,946 
            |     99.74       0.26 |    100.00 
------------+----------------------+----------
      Total |    66,096        183 |    66,279 
            |     99.72       0.28 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2029.9794
Iteration 1:   log likelihood = -2028.8149
Iteration 2:   log likelihood = -2028.8101
Iteration 3:   log likelihood = -2028.8101
Refining estimates:
Iteration 0:   log likelihood = -2028.8101

Cox regression -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =          183
Time at risk    =   13785684.5
                                                LR chi2(1)       =        2.34
Log likelihood  =   -2028.8101                  Prob > chi2      =      0.1262

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7769311   .1259263    -1.56   0.119     .5654813    1.067448
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_univar
> .ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_univar.ster s
> aved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2029.9794
Iteration 1:   log likelihood = -1966.5376
Iteration 2:   log likelihood = -1930.2915
Iteration 3:   log likelihood =  -1927.695
Iteration 4:   log likelihood = -1927.6535
Iteration 5:   log likelihood = -1927.6534
Refining estimates:
Iteration 0:   log likelihood = -1927.6534

Cox regression -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =          183
Time at risk    =   13785684.5
                                                LR chi2(5)       =      204.65
Log likelihood  =   -1927.6534                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .779312    .127561    -1.52   0.128     .5654356    1.074087
      1.male |   1.496045   .4688639     1.29   0.199      .809424    2.765115
        age1 |   .9490543    .041501    -1.20   0.232      .871102    1.033982
        age2 |   1.252113   .0847183     3.32   0.001     1.096607    1.429671
        age3 |   .3441671   .1311168    -2.80   0.005     .1631129    .7261901
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar1.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar1.ste
> r saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2029.9794
Iteration 1:   log likelihood = -1956.1379
Iteration 2:   log likelihood =  -1913.583
Iteration 3:   log likelihood = -1910.6301
Iteration 4:   log likelihood = -1910.4872
Iteration 5:   log likelihood = -1910.4472
Iteration 6:   log likelihood = -1910.4324
Iteration 7:   log likelihood =  -1910.427
Iteration 8:   log likelihood =  -1910.425
Iteration 9:   log likelihood = -1910.4243
Iteration 10:  log likelihood =  -1910.424
Iteration 11:  log likelihood = -1910.4239
Iteration 12:  log likelihood = -1910.4239
Iteration 13:  log likelihood = -1910.4239
Iteration 14:  log likelihood = -1910.4239
Iteration 15:  log likelihood = -1910.4239
Iteration 16:  log likelihood = -1910.4239
Iteration 17:  log likelihood = -1910.4239
Iteration 18:  log likelihood = -1910.4239
Iteration 19:  log likelihood = -1910.4239
Iteration 20:  log likelihood = -1910.4239
Iteration 21:  log likelihood = -1910.4239
Iteration 22:  log likelihood = -1910.4239
Iteration 23:  log likelihood = -1910.4239
Iteration 24:  log likelihood = -1910.4239
Iteration 25:  log likelihood = -1910.4239
Iteration 26:  log likelihood = -1910.4239
Iteration 27:  log likelihood = -1910.4239
Iteration 28:  log likelihood = -1910.4239
Iteration 29:  log likelihood = -1910.4239
Iteration 30:  log likelihood = -1910.4239
Iteration 31:  log likelihood = -1910.4239
Iteration 32:  log likelihood = -1910.4239
Iteration 33:  log likelihood = -1910.4239
Iteration 34:  log likelihood = -1910.4239
Iteration 35:  log likelihood = -1910.4239
Iteration 36:  log likelihood = -1910.4239
Iteration 37:  log likelihood = -1910.4239
Iteration 38:  log likelihood = -1910.4239
Iteration 39:  log likelihood = -1910.4239
Iteration 40:  log likelihood = -1910.4239
Iteration 41:  log likelihood = -1910.4239
Iteration 42:  log likelihood = -1910.4239
Iteration 43:  log likelihood = -1910.4239
Iteration 44:  log likelihood = -1910.4239
Iteration 45:  log likelihood = -1910.4239
Refining estimates:
Iteration 0:   log likelihood = -1910.4239

Cox regression -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =          183
Time at risk    =   13785684.5
                                                LR chi2(23)      =      239.11
Log likelihood  =   -1910.4239                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .694079   .1195824    -2.12   0.034     .4951719    .9728857
      1.male |   1.207167   .5580989     0.41   0.684     .4877964    2.987417
        age1 |   .9861812   .0546445    -0.25   0.802     .8846907    1.099315
        age2 |   1.224767   .0870531     2.85   0.004     1.065498    1.407844
        age3 |   .3514063   .1508339    -2.44   0.015     .1515127    .8150236
             |
         imd |
          2  |   .9139831   .2039929    -0.40   0.687     .5901434    1.415529
          3  |   .7348748   .1761508    -1.29   0.199     .4593872    1.175568
          4  |   .8663037   .2082087    -0.60   0.550     .5408678    1.387552
5 most de..  |     1.5695     .34199     2.07   0.039     1.023969    2.405669
             |
   obese4cat |
Obese I ..)  |    .903023   .2148899    -0.43   0.668     .5664228     1.43965
Obese II..)  |   1.313198   .4539418     0.79   0.431     .6669442    2.585655
Obese II..)  |   1.735065   .7746055     1.23   0.217     .7232756    4.162245
             |
smoke_nomiss |
     Former  |   1.394343   .2361216     1.96   0.050     1.000519    1.943186
    Current  |   1.376843   .4696918     0.94   0.349     .7055185    2.686956
             |
     diabcat |
Controlle..  |   .9171264   .5332799    -0.15   0.882     .2934151    2.866658
Uncontrol..  |   2.056027   1.221463     1.21   0.225     .6417104    6.587466
Diabetes,..  |   4.37e-19          .        .       .            .           .
             |
1.myocardi~t |   2.368002   1.370709     1.49   0.136     .7614954     7.36371
       1.pad |   1.276472   1.330359     0.23   0.815     .1655297    9.843434
1.hyperten~n |   .8869746   .3650028    -0.29   0.771     .3959401    1.986977
1.heart_f~re |   2.121204   .9863382     1.62   0.106     .8526729    5.276944
1.stroke_tia |   7.86e-20          .        .       .            .           .
       1.vte |   2.613273   3.266292     0.77   0.442     .2255695    30.27536
 1.oestrogen |   1.65e-19          .        .       .            .           .
1.antiplat~t |    .626491   .1917921    -1.53   0.127     .3438195    1.141561
1.flu_vac~ne |   1.074069   .1992435     0.39   0.700     .7466746    1.545016
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar2.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar2.ste
> r saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -641.94092
Iteration 1:   log likelihood = -599.02691
Iteration 2:   log likelihood = -549.03917
Iteration 3:   log likelihood = -543.82428
Iteration 4:   log likelihood = -501.32736
Iteration 5:   log likelihood = -497.36096
Iteration 6:   log likelihood = -497.29986
Iteration 7:   log likelihood =  -497.2984
Iteration 8:   log likelihood = -497.29787
Iteration 9:   log likelihood = -497.29767
Iteration 10:  log likelihood =  -497.2976
Iteration 11:  log likelihood = -497.29757
Iteration 12:  log likelihood = -497.29756
Iteration 13:  log likelihood = -497.29756
Iteration 14:  log likelihood = -497.29756
Iteration 15:  log likelihood = -497.29756
Iteration 16:  log likelihood = -497.29756
Iteration 17:  log likelihood = -497.29756
Iteration 18:  log likelihood = -497.29756
Iteration 19:  log likelihood = -497.29756
Iteration 20:  log likelihood = -497.29756
Iteration 21:  log likelihood = -497.29756
Iteration 22:  log likelihood = -497.29756
Iteration 23:  log likelihood = -497.29756
Iteration 24:  log likelihood = -497.29756
Iteration 25:  log likelihood = -497.29756
Iteration 26:  log likelihood = -497.29756
Iteration 27:  log likelihood = -497.29756
Iteration 28:  log likelihood = -497.29756
Iteration 29:  log likelihood = -497.29756
Iteration 30:  log likelihood = -497.29756
Iteration 31:  log likelihood = -497.29756
Iteration 32:  log likelihood = -497.29756
Iteration 33:  log likelihood = -497.29756
Refining estimates:
Iteration 0:   log likelihood = -497.29756
Iteration 1:   log likelihood = -497.29756
Iteration 2:   log likelihood = -497.29756
Iteration 3:   log likelihood = -497.29756
Iteration 4:   log likelihood = -497.29756
Iteration 5:   log likelihood = -497.29756
Iteration 6:   log likelihood = -497.29756
Iteration 7:   log likelihood = -497.29756
Iteration 8:   log likelihood = -497.29756
Iteration 9:   log likelihood = -497.29756

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,279                  Number of obs    =      66,279
No. of failures =          183
Time at risk    =   13785684.5
                                                LR chi2(32)      =      289.29
Log likelihood  =   -497.29756                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |     .65527   .1250379    -2.22   0.027     .4508115    .9524574
      1.male |   1.153298   .5530451     0.30   0.766     .4505697    2.952033
        age1 |   .9912663   .0573509    -0.15   0.879     .8849996    1.110293
        age2 |   1.227379   .0929404     2.71   0.007     1.058092    1.423751
        age3 |   .3268444   .1519223    -2.41   0.016     .1314285    .8128167
             |
         imd |
          2  |   .8339305   .2132843    -0.71   0.478     .5051593    1.376675
          3  |     .75031   .2095429    -1.03   0.304     .4340316     1.29706
          4  |   .7937741   .2258548    -0.81   0.417     .4544668     1.38641
5 most de..  |   1.534891   .4650192     1.41   0.157     .8476031    2.779472
             |
   obese4cat |
Obese I ..)  |   .8458753   .2117491    -0.67   0.504     .5178737    1.381621
Obese II..)  |   1.348603   .4839502     0.83   0.405     .6674645    2.724836
Obese II..)  |    1.87189   .8688438     1.35   0.177     .7536897    4.649094
             |
smoke_nomiss |
     Former  |   1.325933   .2486027     1.50   0.132     .9181793    1.914766
    Current  |   1.244461   .4660249     0.58   0.559     .5973429    2.592618
             |
     diabcat |
Controlle..  |    .803011   .4934801    -0.36   0.721     .2407834    2.678036
Uncontrol..  |   1.936728   1.194069     1.07   0.284     .5784549    6.484373
Diabetes,..  |   8.29e-19   2.41e-09    -0.00   1.000            0           .
             |
1.myocardi~t |   2.144888   1.278339     1.28   0.200     .6669512    6.897871
       1.pad |   .8877659   .9482815    -0.11   0.911     .1094142    7.203161
1.hyperten~n |   .9681111   .4155913    -0.08   0.940     .4173697    2.245585
1.heart_f~re |   2.146356   1.055842     1.55   0.121     .8184195     5.62895
1.stroke_tia |   4.58e-19   7.97e-10    -0.00   1.000            0           .
       1.vte |   2.778843   3.565139     0.80   0.426     .2248061    34.34946
 1.oestrogen |   2.80e-19          .        .       .            .           .
1.antiplat~t |   .6517237   .2111293    -1.32   0.186     .3453921    1.229744
1.flu_vac~ne |   1.185169   .2460929     0.82   0.413     .7889211    1.780438
             |
         ckd |
        CKD  |   1.245849   .2337598     1.17   0.241     .8624892    1.799605
      1.copd |   1.762125   .3923429     2.54   0.011     1.138975    2.726212
1.other_re~y |   1.665965   .4824228     1.76   0.078     .9444494    2.938685
1.immunode~y |   2.261677    1.72915     1.07   0.286     .5054174    10.12071
    1.cancer |    1.24406   .2427674     1.12   0.263     .8486661    1.823669
1.ae_atten~r |   2.403655   .4007308     5.26   0.000     1.733653    3.332592
1.gp_consult |   .3982572   .1470381    -2.49   0.013     .1931509    .8211653
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar3.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar3.ste
> r saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table2_onscoviddeath.t
> xt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7769311   .1259263    -1.56   0.119     .5654813    1.067448
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .779312    .127561    -1.52   0.128     .5654356    1.074087
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .694079   .1195824    -2.12   0.034     .4951719    .9728857
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .65527   .1250379    -2.22   0.027     .4508115    .9524574
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/05a_an_models_onscovidde
> ath.log
  log type:  text
 closed on:  31 Dec 2020, 03:19:54
-------------------------------------------------------------------------------
