-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/06a_an_models_ethnicity_
> onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:18:56

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(17,178 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |  outcome: ONS covid
  Treatment |         death
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    12,077         34 |    12,111 
            |     99.72       0.28 |    100.00 
------------+----------------------+----------
current use |    36,899         91 |    36,990 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Total |    48,976        125 |    49,101 
            |     99.75       0.25 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1349.2202
Iteration 1:   log likelihood = -1348.9938
Iteration 2:   log likelihood = -1348.9935
Refining estimates:
Iteration 0:   log likelihood = -1348.9935

Cox regression -- Breslow method for ties

No. of subjects =       49,101                  Number of obs    =      49,101
No. of failures =          125
Time at risk    =   10228920.5
                                                LR chi2(1)       =        0.45
Log likelihood  =   -1348.9935                  Prob > chi2      =      0.5008

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8721599   .1753037    -0.68   0.496     .5881729    1.293264
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_univar
> _ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_univar_ethn.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1349.2202
Iteration 1:   log likelihood = -1324.1988
Iteration 2:   log likelihood = -1280.5253
Iteration 3:   log likelihood = -1276.8611
Iteration 4:   log likelihood = -1276.7535
Iteration 5:   log likelihood = -1276.7534
Refining estimates:
Iteration 0:   log likelihood = -1276.7534

Cox regression -- Breslow method for ties

No. of subjects =       49,101                  Number of obs    =      49,101
No. of failures =          125
Time at risk    =   10228920.5
                                                LR chi2(5)       =      144.93
Log likelihood  =   -1276.7534                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8629695   .1751712    -0.73   0.468      .579713    1.284629
      1.male |   1.865242   .7316954     1.59   0.112     .8646226    4.023868
        age1 |   .9467507   .0490609    -1.06   0.291     .8553151    1.047961
        age2 |   1.249387   .1007232     2.76   0.006      1.06678    1.463252
        age3 |   .3650645   .1664603    -2.21   0.027      .149363      .89227
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar1_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar1_eth
> n.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1349.2202
Iteration 1:   log likelihood = -1313.2604
Iteration 2:   log likelihood = -1265.3855
Iteration 3:   log likelihood = -1260.4057
Iteration 4:   log likelihood = -1260.2286
Iteration 5:   log likelihood = -1260.1908
Iteration 6:   log likelihood = -1260.1769
Iteration 7:   log likelihood = -1260.1718
Iteration 8:   log likelihood = -1260.1699
Iteration 9:   log likelihood = -1260.1693
Iteration 10:  log likelihood =  -1260.169
Iteration 11:  log likelihood = -1260.1689
Iteration 12:  log likelihood = -1260.1689
Iteration 13:  log likelihood = -1260.1689
Iteration 14:  log likelihood = -1260.1689
Iteration 15:  log likelihood = -1260.1689
Iteration 16:  log likelihood = -1260.1689
Iteration 17:  log likelihood = -1260.1689
Iteration 18:  log likelihood = -1260.1689
Iteration 19:  log likelihood = -1260.1689
Iteration 20:  log likelihood = -1260.1689
Iteration 21:  log likelihood = -1260.1689
Iteration 22:  log likelihood = -1260.1689
Iteration 23:  log likelihood = -1260.1689
Iteration 24:  log likelihood = -1260.1689
Iteration 25:  log likelihood = -1260.1689
Iteration 26:  log likelihood = -1260.1689
Iteration 27:  log likelihood = -1260.1689
Iteration 28:  log likelihood = -1260.1689
Iteration 29:  log likelihood = -1260.1689
Iteration 30:  log likelihood = -1260.1689
Iteration 31:  log likelihood = -1260.1689
Iteration 32:  log likelihood = -1260.1689
Iteration 33:  log likelihood = -1260.1689
Iteration 34:  log likelihood = -1260.1689
Iteration 35:  log likelihood = -1260.1689
Refining estimates:
Iteration 0:   log likelihood = -1260.1689
Iteration 1:   log likelihood = -1260.1689
Iteration 2:   log likelihood = -1260.1689
Iteration 3:   log likelihood = -1260.1689
Iteration 4:   log likelihood = -1260.1689
Iteration 5:   log likelihood = -1260.1689
Iteration 6:   log likelihood = -1260.1689

Cox regression -- Breslow method for ties

No. of subjects =       49,101                  Number of obs    =      49,101
No. of failures =          125
Time at risk    =   10228920.5
                                                LR chi2(30)      =      178.10
Log likelihood  =   -1260.1689                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7527612   .1615043    -1.32   0.186     .4943478    1.146256
      1.male |   1.390391   .7848054     0.58   0.559     .4599143    4.203366
        age1 |   .9769991   .0636707    -0.36   0.721     .8598479    1.110112
        age2 |   1.257495   .1058682     2.72   0.006     1.066213    1.483094
        age3 |   .3118225     .15994    -2.27   0.023     .1141062      .85213
             |
         imd |
          2  |   1.005817   .2819792     0.02   0.983     .5806121    1.742417
          3  |    .858559   .2527967    -0.52   0.605      .482103    1.528975
          4  |   .9706992   .2864806    -0.10   0.920     .5443412    1.731004
5 most de..  |   1.606225   .4332294     1.76   0.079     .9467192    2.725157
             |
   obese4cat |
Obese I ..)  |   1.229954   .3182943     0.80   0.424     .7406455    2.042526
Obese II..)  |   1.430763   .5932668     0.86   0.388     .6347704     3.22492
Obese II..)  |   2.276624   1.128484     1.66   0.097     .8617177     6.01475
             |
smoke_nomiss |
     Former  |   1.768582   .3921737     2.57   0.010     1.145185    2.731333
    Current  |   2.012734   .7968034     1.77   0.077     .9264283    4.372814
             |
     diabcat |
Controlle..  |   .9074747   .6075188    -0.15   0.885     .2443365    3.370394
Uncontrol..  |   1.451718   1.076708     0.50   0.615     .3392845    6.211555
Diabetes,..  |   2.19e-18   5.50e-09    -0.00   1.000            0           .
             |
1.myocardi~t |    2.62169   1.732609     1.46   0.145     .7178665    9.574562
       1.pad |   1.719483   1.817866     0.51   0.608     .2165177    13.65534
1.hyperten~n |    1.06997   .5153946     0.14   0.888     .4162514    2.750347
1.heart_f~re |   2.096024   1.166863     1.33   0.184     .7039307    6.241122
1.stroke_tia |   3.42e-18   2.72e-09    -0.00   1.000            0           .
       1.vte |   3.58e-18   3.74e-09    -0.00   1.000            0           .
 1.oestrogen |   2.80e-18   2.87e-09    -0.00   1.000            0           .
1.antiplat~t |   .6100665   .2260225    -1.33   0.182     .2951325    1.261065
1.flu_vac~ne |   1.087933   .2497078     0.37   0.713      .693793    1.705981
             |
   ethnicity |
      Mixed  |   6.496026   6.554379     1.85   0.064     .8990833    46.93486
Asian or ..  |   2.383317   1.720548     1.20   0.229     .5790128    9.810146
      Black  |   3.49e-18   2.86e-09    -0.00   1.000            0           .
      Other  |   2.763059   2.789016     1.01   0.314     .3821135    19.97965
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar2_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar2_eth
> n.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist      

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1349.2202
Iteration 1:   log likelihood = -1315.2284
Iteration 2:   log likelihood = -1267.5642
Iteration 3:   log likelihood = -1262.7223
Iteration 4:   log likelihood = -1262.5743
Iteration 5:   log likelihood = -1262.5478
Iteration 6:   log likelihood = -1262.5381
Iteration 7:   log likelihood = -1262.5345
Iteration 8:   log likelihood = -1262.5331
Iteration 9:   log likelihood = -1262.5327
Iteration 10:  log likelihood = -1262.5325
Iteration 11:  log likelihood = -1262.5324
Iteration 12:  log likelihood = -1262.5324
Iteration 13:  log likelihood = -1262.5324
Iteration 14:  log likelihood = -1262.5324
Iteration 15:  log likelihood = -1262.5324
Iteration 16:  log likelihood = -1262.5324
Iteration 17:  log likelihood = -1262.5324
Iteration 18:  log likelihood = -1262.5324
Iteration 19:  log likelihood = -1262.5324
Iteration 20:  log likelihood = -1262.5324
Iteration 21:  log likelihood = -1262.5324
Iteration 22:  log likelihood = -1262.5324
Iteration 23:  log likelihood = -1262.5324
Iteration 24:  log likelihood = -1262.5324
Iteration 25:  log likelihood = -1262.5324
Iteration 26:  log likelihood = -1262.5324
Iteration 27:  log likelihood = -1262.5324
Iteration 28:  log likelihood = -1262.5324
Iteration 29:  log likelihood = -1262.5324
Iteration 30:  log likelihood = -1262.5324
Iteration 31:  log likelihood = -1262.5324
Iteration 32:  log likelihood = -1262.5324
Iteration 33:  log likelihood = -1262.5324
Iteration 34:  log likelihood = -1262.5324
Iteration 35:  log likelihood = -1262.5324
Iteration 36:  log likelihood = -1262.5324
Iteration 37:  log likelihood = -1262.5324
Iteration 38:  log likelihood = -1262.5324
Iteration 39:  log likelihood = -1262.5324
Iteration 40:  log likelihood = -1262.5324
Iteration 41:  log likelihood = -1262.5324
Iteration 42:  log likelihood = -1262.5324
Iteration 43:  log likelihood = -1262.5324
Iteration 44:  log likelihood = -1262.5324
Refining estimates:
Iteration 0:   log likelihood = -1262.5324

Cox regression -- Breslow method for ties

No. of subjects =       49,101                  Number of obs    =      49,101
No. of failures =          125
Time at risk    =   10228920.5
                                                LR chi2(22)      =      173.38
Log likelihood  =   -1262.5324                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7535455   .1614329    -1.32   0.187     .4951715    1.146736
      1.male |   1.388035   .7832756     0.58   0.561     .4592645    4.195058
        age1 |   .9733562   .0632533    -0.42   0.678     .8569523    1.105572
        age2 |   1.259243   .1059164     2.74   0.006     1.067859    1.484926
        age3 |    .312319   .1601045    -2.27   0.023     .1143526    .8530036
             |
         imd |
          2  |   1.004944   .2816781     0.02   0.986     .5801718    1.740713
          3  |   .8599671   .2530543    -0.51   0.608     .4830665    1.530935
          4  |   .9739191    .287189    -0.09   0.929     .5464128    1.735901
5 most de..  |   1.615805   .4354386     1.78   0.075     .9527984    2.740165
             |
   obese4cat |
Obese I ..)  |    1.22225   .3161502     0.78   0.438     .7361835    2.029242
Obese II..)  |   1.405311   .5825815     0.82   0.412     .6235926    3.166971
Obese II..)  |   2.206505   1.093799     1.60   0.110     .8351242    5.829867
             |
smoke_nomiss |
     Former  |   1.759002   .3894048     2.55   0.011     1.139801    2.714588
    Current  |   2.001503   .7927966     1.75   0.080     .9208627    4.350285
             |
     diabcat |
Controlle..  |   .9379018   .6265027    -0.10   0.924     .2532614    3.473328
Uncontrol..  |   1.492702   1.107986     0.54   0.589     .3484601    6.394304
Diabetes,..  |   7.81e-19          .        .       .            .           .
             |
1.myocardi~t |   2.562592   1.692807     1.42   0.154     .7020851    9.353397
       1.pad |   1.708277   1.805992     0.51   0.612     .2151132    13.56593
1.hyperten~n |   1.058028   .5096986     0.12   0.907     .4115627    2.719934
1.heart_f~re |   2.047515   1.138756     1.29   0.198     .6883652    6.090255
1.stroke_tia |   1.63e-19          .        .       .            .           .
       1.vte |   1.70e-19          .        .       .            .           .
 1.oestrogen |   1.35e-19          .        .       .            .           .
1.antiplat~t |   .6215591   .2300031    -1.29   0.199     .3009553    1.283698
1.flu_vac~ne |    1.08236   .2483128     0.34   0.730     .6903843    1.696886
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar2_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar2_wit
> houtethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -402.4439
Iteration 1:   log likelihood = -348.19566
Iteration 2:   log likelihood = -319.05679
Iteration 3:   log likelihood = -307.01593
Iteration 4:   log likelihood = -304.78723
Iteration 5:   log likelihood = -304.75629
Iteration 6:   log likelihood = -304.74564
Iteration 7:   log likelihood = -304.74173
Iteration 8:   log likelihood = -304.74029
Iteration 9:   log likelihood = -304.73976
Iteration 10:  log likelihood = -304.73957
Iteration 11:  log likelihood =  -304.7395
Iteration 12:  log likelihood = -304.73947
Iteration 13:  log likelihood = -304.73946
Iteration 14:  log likelihood = -304.73946
Iteration 15:  log likelihood = -304.73946
Iteration 16:  log likelihood = -304.73946
Iteration 17:  log likelihood = -304.73946
Iteration 18:  log likelihood = -304.73946
Iteration 19:  log likelihood = -304.73946
Iteration 20:  log likelihood = -304.73946
Iteration 21:  log likelihood = -304.73946
Iteration 22:  log likelihood = -304.73946
Iteration 23:  log likelihood = -304.73946
Iteration 24:  log likelihood = -304.73946
Iteration 25:  log likelihood = -304.73946
Iteration 26:  log likelihood = -304.73946
Iteration 27:  log likelihood = -304.73946
Iteration 28:  log likelihood = -304.73946
Iteration 29:  log likelihood = -304.73946
Iteration 30:  log likelihood = -304.73946
Iteration 31:  log likelihood = -304.73946
Iteration 32:  log likelihood = -304.73946
Iteration 33:  log likelihood = -304.73946
Iteration 34:  log likelihood = -304.73946
Iteration 35:  log likelihood = -304.73946
Iteration 36:  log likelihood = -304.73946
Iteration 37:  log likelihood = -304.73946
Refining estimates:
Iteration 0:   log likelihood = -304.73946
Iteration 1:   log likelihood = -304.73946

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       49,101                  Number of obs    =      49,101
No. of failures =          125
Time at risk    =   10228920.5
                                                LR chi2(37)      =      195.41
Log likelihood  =   -304.73946                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7048389   .1710763    -1.44   0.150     .4380148    1.134203
      1.male |   1.317551   .7903314     0.46   0.646     .4066075    4.269329
        age1 |   .9927145   .0698227    -0.10   0.917     .8648783    1.139446
        age2 |    1.24861   .1175473     2.36   0.018     1.038228    1.501624
        age3 |   .3058593   .1778039    -2.04   0.042     .0978805    .9557559
             |
         imd |
          2  |   .9271176   .3095707    -0.23   0.821     .4818513    1.783843
          3  |   .9194485   .3196646    -0.24   0.809      .465147    1.817459
          4  |    .973985    .357735    -0.07   0.943     .4741485    2.000738
5 most de..  |   1.488683   .5831916     1.02   0.310     .6907869    3.208193
             |
   obese4cat |
Obese I ..)  |   1.228373   .3457193     0.73   0.465     .7075607    2.132537
Obese II..)  |   1.414351    .632109     0.78   0.438     .5890248    3.396101
Obese II..)  |   2.737771   1.470791     1.87   0.061     .9552407    7.846597
             |
smoke_nomiss |
     Former  |   1.958384   .4916976     2.68   0.007     1.197248    3.203404
    Current  |    1.94769   .8866475     1.46   0.143     .7980448     4.75349
             |
     diabcat |
Controlle..  |   .9733304   .7000023    -0.04   0.970     .2377338    3.985012
Uncontrol..  |   1.631241   1.332219     0.60   0.549     .3291166    8.085118
Diabetes,..  |   6.25e-17   2.64e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   2.394966   1.686422     1.24   0.215     .6024531    9.520844
       1.pad |    .992975   1.111962    -0.01   0.995     .1105958    8.915346
1.hyperten~n |   1.328388   .6829299     0.55   0.581      .484974    3.638574
1.heart_f~re |   2.486011   1.455738     1.56   0.120     .7889754    7.833264
1.stroke_tia |   4.76e-17   9.32e-09    -0.00   1.000            0           .
       1.vte |   5.22e-17   1.54e-08    -0.00   1.000            0           .
 1.oestrogen |   2.69e-17   1.12e-08    -0.00   1.000            0           .
1.antiplat~t |   .7143471   .2930956    -0.82   0.412     .3196411    1.596453
1.flu_vac~ne |   1.226608   .3202392     0.78   0.434     .7353202    2.046138
             |
         ckd |
        CKD  |   1.250321   .2891224     0.97   0.334     .7946779    1.967217
      1.copd |   1.791348   .4826511     2.16   0.030      1.05642    3.037548
1.other_re~y |   1.399979   .5352615     0.88   0.379     .6617246     2.96187
1.immunode~y |   3.684443   2.989733     1.61   0.108     .7510453    18.07497
    1.cancer |   1.639121    .379904     2.13   0.033       1.0407    2.581646
1.ae_atten~r |   2.117332   .4399544     3.61   0.000      1.40903    3.181689
1.gp_consult |   .4446313   .2087346    -1.73   0.084     .1771735    1.115838
             |
   ethnicity |
      Mixed  |   9.643485   15.39705     1.42   0.156     .4218738    220.4375
Asian or ..  |   1.449328   1.335655     0.40   0.687     .2380817    8.822816
      Black  |   2.56e-17   4.72e-09    -0.00   1.000            0           .
      Other  |    19.4301     24.234     2.38   0.017     1.685862     223.938
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar3_ethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar3_eth
> n.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -402.4439
Iteration 1:   log likelihood = -351.33206
Iteration 2:   log likelihood = -322.24335
Iteration 3:   log likelihood = -310.30931
Iteration 4:   log likelihood = -307.90701
Iteration 5:   log likelihood = -307.88648
Iteration 6:   log likelihood = -307.87983
Iteration 7:   log likelihood = -307.87738
Iteration 8:   log likelihood = -307.87649
Iteration 9:   log likelihood = -307.87616
Iteration 10:  log likelihood = -307.87603
Iteration 11:  log likelihood = -307.87599
Iteration 12:  log likelihood = -307.87597
Iteration 13:  log likelihood = -307.87597
Iteration 14:  log likelihood = -307.87597
Iteration 15:  log likelihood = -307.87596
Iteration 16:  log likelihood = -307.87596
Iteration 17:  log likelihood = -307.87596
Iteration 18:  log likelihood = -307.87596
Iteration 19:  log likelihood = -307.87596
Iteration 20:  log likelihood = -307.87596
Iteration 21:  log likelihood = -307.87596
Iteration 22:  log likelihood = -307.87596
Iteration 23:  log likelihood = -307.87596
Iteration 24:  log likelihood = -307.87596
Iteration 25:  log likelihood = -307.87596
Iteration 26:  log likelihood = -307.87596
Iteration 27:  log likelihood = -307.87596
Iteration 28:  log likelihood = -307.87596
Iteration 29:  log likelihood = -307.87596
Iteration 30:  log likelihood = -307.87596
Iteration 31:  log likelihood = -307.87596
Iteration 32:  log likelihood = -307.87596
Iteration 33:  log likelihood = -307.87596
Iteration 34:  log likelihood = -307.87596
Iteration 35:  log likelihood = -307.87596
Iteration 36:  log likelihood = -307.87596
Iteration 37:  log likelihood = -307.87596
Refining estimates:
Iteration 0:   log likelihood = -307.87596
Iteration 1:   log likelihood = -307.87596
Iteration 2:   log likelihood = -307.87596
Iteration 3:   log likelihood = -307.87596
Iteration 4:   log likelihood = -307.87596
Iteration 5:   log likelihood = -307.87596
Iteration 6:   log likelihood = -307.87596

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       49,101                  Number of obs    =      49,101
No. of failures =          125
Time at risk    =   10228920.5
                                                LR chi2(30)      =      189.14
Log likelihood  =   -307.87596                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .705426    .170571    -1.44   0.149     .4391695    1.133107
      1.male |    1.38541   .8232674     0.55   0.583     .4322747    4.440145
        age1 |   .9840168   .0684937    -0.23   0.817     .8585261     1.12785
        age2 |   1.248711   .1164691     2.38   0.017     1.040086    1.499183
        age3 |   .3149142   .1813719    -2.01   0.045     .1018475    .9737197
             |
         imd |
          2  |   .9424731   .3111833    -0.18   0.858     .4934254    1.800182
          3  |   .8907999   .3085198    -0.33   0.738     .4518298    1.756246
          4  |   .9654686   .3534786    -0.10   0.924     .4710806    1.978705
5 most de..  |   1.449914   .5628075     0.96   0.339     .6775399    3.102772
             |
   obese4cat |
Obese I ..)  |   1.216475   .3426063     0.70   0.487     .7004417    2.112683
Obese II..)  |   1.405358   .6232067     0.77   0.443     .5892797    3.351604
Obese II..)  |   2.508202   1.339446     1.72   0.085     .8806402    7.143753
             |
smoke_nomiss |
     Former  |   1.927319   .4807131     2.63   0.009     1.182079    3.142396
    Current  |   1.902168     .85438     1.43   0.152      .788719    4.587495
             |
     diabcat |
Controlle..  |   .9235756   .6596668    -0.11   0.911     .2277714    3.744948
Uncontrol..  |   1.546142   1.223713     0.55   0.582     .3277599     7.29362
Diabetes,..  |   4.09e-19          .        .       .            .           .
             |
1.myocardi~t |   2.365187   1.648914     1.23   0.217      .603173    9.274472
       1.pad |   .9963308   1.107314    -0.00   0.997     .1128197    8.798777
1.hyperten~n |   1.309803   .6684817     0.53   0.597     .4817032    3.561493
1.heart_f~re |   2.283464   1.322593     1.43   0.154     .7337941    7.105818
1.stroke_tia |   2.74e-19   6.60e-10    -0.00   1.000            0           .
       1.vte |   3.06e-19          .        .       .            .           .
 1.oestrogen |   1.47e-19          .        .       .            .           .
1.antiplat~t |   .6955465   .2850578    -0.89   0.376     .3115127    1.553018
1.flu_vac~ne |   1.227744   .3219075     0.78   0.434     .7343911    2.052523
             |
         ckd |
        CKD  |   1.281455   .2955011     1.08   0.282     .8154884    2.013672
      1.copd |   1.788117   .4777376     2.18   0.030     1.059199    3.018662
1.other_re~y |   1.408038   .5378118     0.90   0.370     .6660253    2.976719
1.immunode~y |   2.981706    2.41993     1.35   0.178     .6076259    14.63166
    1.cancer |   1.628936    .373822     2.13   0.033     1.038874    2.554141
1.ae_atten~r |   2.104845   .4336839     3.61   0.000     1.405523    3.152117
1.gp_consult |   .4492172   .2101426    -1.71   0.087     .1795835    1.123689
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multiv
> ar3_withoutethn.ster not found)
file /workspace/output/oac_tempdata/sens_analysis_2/onscoviddeath_multivar3_wit
> houtethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/sens_analysis_2/table3_onscoviddeath.t
> xt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     12,111     2508622           0    2508622    2508622

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     36,990     7720299           0    7720299    7720299

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8721599   .1753037    -0.68   0.496     .5881729    1.293264
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8629695   .1751712    -0.73   0.468      .579713    1.284629
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7527612   .1615043    -1.32   0.186     .4943478    1.146256
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7535455   .1614329    -1.32   0.187     .4951715    1.146736
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7048389   .1710763    -1.44   0.150     .4380148    1.134203
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .705426    .170571    -1.44   0.149     .4391695    1.133107
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/sens_analysis_2/06a_an_models_ethnicity_
> onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:20:39
-------------------------------------------------------------------------------
