-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/03_an_checks_covidtest.log
  log type:  text
 opened on:   1 Mar 2021, 21:11:14

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_`outcome', clear

. 
. *Duplicate patient check
. sort patient_id

. datacheck _n==1, by(patient_id) nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. * Check date ranges for all treatment variables  
. foreach i in warfarin_last_four_months  ///
>              doac_last_four_months      ///
>               {
  2.         
.         summ `i', format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
warfarin_l~s |     95,819   02feb2020    24.07299  01nov2019  29feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doac_last_~s |    280,795   06feb2020    19.63602  01nov2019  29feb2020

. 
. * Check date ranges for all comorbidities/ medications 
. foreach var of varlist  ckd                                             ///  
>                    
>                                                 hypertension                 
>            ///
>                                                 other_respiratory            
>            ///
>                                                 heart_failure                
>            ///
>                                                 copd                         
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 cancer                       
>            ///
>                                                 myocardial_infarct           
>            ///
>                                                 stroke                       
>                    ///
>                                                 tia                          
>                            ///
>                                                 pad                          
>                            ///
>                                                 vte                          
>                            ///
>                                                 antiplatelet                /
> //
>                                                 oestrogen                   /
> //
>                                                 has_bled_score               
>            ///
>                                                  { 
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ckd_date |    130,348   09nov2019    91.50346  15feb2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |    261,966   26feb1999    8037.027  15jan1800  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_resp~e |     21,175   18mar2010    6178.311  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
heart_fai~te |     98,353   27may2013    4610.618  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   copd_date |     47,461   13oct2008    6633.086  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |    116,575   15nov2007    6614.667  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 cancer_date |     65,728   04jun2008     5012.39  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
myocardial~e |     42,325   24apr2008    4295.906  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 stroke_date |     59,397   07jun2014    3352.027  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    tia_date |     43,215   28feb2013    3179.931  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    pad_date |     19,364   22apr2012    3534.184  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    vte_date |     28,129   12feb2008    5005.034  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
antiplatel~e |     23,138   25jan2020    29.40323  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
oestrogen_~e |      2,013   22jan2020    29.72413  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_bled_~te |    139,529   02jul2017      585.66  15nov2011  15feb2020

. 
. summ immunodef_any, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
immunodef_~y |    372,746    .0059451    .0768748          0          1

. 
. * Death outcome flag (covid)
. //Underlying Covid-death should be a subset of Any Covid-death
. datacheck !(died_ons_covid_flag_underlying==1 & died_ons_covid_flag_any!=1), 
> nolist

. 
. * Outcome dates
. summ  stime_onscoviddeath stime_onsnoncoviddeath ///
> stime_admitcovid stime_covidtest stime_positivecovidtest,  format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_onsc~h |    372,746   21sep2020    29.44709  01mar2020  28sep2020
stime_onsn~h |    372,746   21sep2020    29.44709  01mar2020  28sep2020
stime_admi~d |    372,746   21sep2020      30.877  01mar2020  28sep2020
stime_covi~t |    372,746   07sep2020    47.05531  01mar2020  28sep2020
stime_posi~t |    372,746   20sep2020    32.14649  01mar2020  28sep2020

. summ  died_date_ons died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     29,224   23aug2020    107.2891  01mar2020  14feb2021
died_date_~d |      5,924   23sep2020    120.9622  02mar2020  14feb2021

. summ  covid_admission_date covid_admission_primary_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
covid~n_date |      7,474   23jul2020    104.3862  01mar2020  30dec2020
covid~y_date |      4,062   10jul2020    104.5021  01mar2020  30dec2020

. summ  first_tested_for_covid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_test~d |    139,740   15sep2020     93.7464  01mar2020  25feb2021

. summ  first_positive_test_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_posi~e |     20,512   25oct2020    103.8418  01mar2020  25feb2021

. summ  mi_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 mi_date_ons |        882   19aug2020    100.6911  01mar2020  12feb2021

. summ  stroke_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dat~s |        120   15aug2020    105.4781  01mar2020  06feb2021

. summ  vte_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
vte_date_ons |         44   17aug2020    98.09229  07mar2020  28jan2021

. summ  gi_bleed_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gi_bleed_d~s |        114   22aug2020     98.6243  04mar2020  03feb2021

. summ  intracranial_bleed_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
intrac~e_ons |        423   18aug2020    99.70972  01mar2020  10feb2021

. 
. * Follow-up for outcomes
. datacheck follow_up_`outcome' > 0, nol

. 
. summ  follow_up_`outcome', detail

          Number of days (follow-up) for covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%           24              1
 5%           71              1
10%          107              1       Obs             372,746
25%          212              1       Sum of Wgt.     372,746

50%          212                      Mean           191.0192
                        Largest       Std. Dev.      47.05531
75%          212            212
90%          212            212       Variance       2214.202
95%          212            212       Skewness      -2.231906
99%          212            212       Kurtosis       6.827964

. 
. * Outcome date day lags since cohort entry (only ONS dataset)
. * check how the death count tail out
. gen days_died_since_entry = died_date_ons - enter_date
(343,522 missing values generated)

. su days_died_since_entry, detail

                    days_died_since_entry
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3             .5
 5%           18             .5
10%           33             .5       Obs              29,224
25%           70             .5       Sum of Wgt.      29,224

50%          179                      Mean           175.2186
                        Largest       Std. Dev.      107.2891
75%          275            349
90%          319            349       Variance       11510.94
95%          331            350       Skewness       -.023303
99%          343            350       Kurtosis       1.596585

. 
. * check the dates of first positive covid test date and covid first test date
. datacheck first_positive_test_date == first_tested_for_covid, nol

 (119306 contradictions)

. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      6,636    17.29679    .8891052         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     94,656    22.55145    1.685146       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    126,602    27.37228    1.414825         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     77,182    32.12877    1.420793         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     32,146    37.06892    1.407627         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     17,125    43.45286    2.655101         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     6,636          0          0          0 |     6,636 
  Normal (18.5-24.9) |    94,656          0          0          0 |    94,656 
Overweight (25-29.9) |   126,602          0          0          0 |   126,602 
   Obese I (30-34.9) |         0     77,182          0          0 |    77,182 
  Obese II (35-39.9) |         0          0     32,146          0 |    32,146 
     Obese III (40+) |         0          0          0     17,125 |    17,125 
        Unknown (.u) |    18,399          0          0          0 |    18,399 
---------------------+--------------------------------------------+----------
               Total |   246,293     77,182     32,146     17,125 |   372,746 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        622    33.93408    4.559907         18         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,681    46.04103    2.670002         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     15,033     55.6513    2.704983         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     52,231    65.50761     2.76449         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    132,899    74.72293    2.771364         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    169,280    85.79644    4.316063         80        107


. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |   134,497          0          0 |   134,497 
      Former |         0    216,215          0 |   216,215 
     Current |         0          0     21,662 |    21,662 
Unknown (.u) |       372          0          0 |       372 
-------------+---------------------------------+----------
       Total |   134,869    216,215     21,662 |   372,746 

. 
. * Diabetes
. safetab diabcat diabetes, m
17

                      |       Diabetes
    Diabetes Severity |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |   256,171          0 |   256,171 
  Controlled diabetes |         0     85,071 |    85,071 
Uncontrolled diabetes |         0     30,368 |    30,368 
Diabetes, no hba1c me |         0      1,136 |     1,136 
----------------------+----------------------+----------
                Total |   256,171    116,575 |   372,746 

. 
. * CKD
. safetab ckd egfr_cat, m
13

   Chronic |
    kidney |                    Calculated eGFR
   disease |        15         30         45         60          . |     Total
-----------+-------------------------------------------------------+----------
    No CKD |         0          0          0    201,792     40,606 |   242,398 
       CKD |    10,426     41,763     78,159          0          0 |   130,348 
-----------+-------------------------------------------------------+----------
     Total |    10,426     41,763     78,159    201,792     40,606 |   372,746 

. 
. /* RELATIONSHIP WITH EXPOSURE AND COVARIATES (past 4 months)=============*/
. 
. foreach var of varlist  agegroup                    ///
>                         sex                         ///
>                                                 bmicat                      /
> //
>                                                 ethnicity                   /
> //
>                                                 care_home_residence          
>            ///
>                                                 imd                         /
> //
>                                                 smoke_nomiss                /
> //
>                                                 hypertension                 
>            ///
>                                                 heart_failure                
>            ///
>                                                 diabcat                      
>                    ///
>                                                 copd                         
>                    ///                                             
>                                                 other_respiratory            
>            ///
>                                                 cancer                       
>            ///
>                                                 immunodef_any                
>            ///
>                                                 ckd                          
>                    ///
>                                                 myocardial_infarct           
>            ///
>                                                 pad                          
>                            ///
>                                                 stroke_tia                   
>                    ///
>                                                 vte                          
>                            ///
>                                                 flu_vaccine                  
>                    ///                                             
>                                                 oestrogen                    
>                    ///
>                                                 antiplatelet                 
>            ///
>                                                 gp_consult                   
>            ///
>                                                 ae_attendance_last_year     /
> //
>                                               {
  2.                                                         
.         safetab `var' exposure , col m
  3. }
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |   warfarin vs DOACs
       age |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
    18-<40 |       510        112 |       622 
           |      0.18       0.12 |      0.17 
-----------+----------------------+----------
    40-<50 |     2,320        361 |     2,681 
           |      0.83       0.39 |      0.72 
-----------+----------------------+----------
    50-<60 |    12,788      2,245 |    15,033 
           |      4.56       2.43 |      4.03 
-----------+----------------------+----------
    60-<70 |    42,407      9,824 |    52,231 
           |     15.12      10.64 |     14.01 
-----------+----------------------+----------
    70-<80 |    98,848     34,051 |   132,899 
           |     35.25      36.88 |     35.65 
-----------+----------------------+----------
       80+ |   123,534     45,746 |   169,280 
           |     44.06      49.54 |     45.41 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   warfarin vs DOACs
       Sex |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         F |   122,778     36,414 |   159,192 
           |     43.79      39.44 |     42.71 
-----------+----------------------+----------
         M |   157,629     55,925 |   213,554 
           |     56.21      60.56 |     57.29 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   warfarin vs DOACs
         Grouped BMI |  DOAC use  warfarin  |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     5,437      1,199 |     6,636 
                     |      1.94       1.30 |      1.78 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    72,658     21,998 |    94,656 
                     |     25.91      23.82 |     25.39 
---------------------+----------------------+----------
Overweight (25-29.9) |    94,621     31,981 |   126,602 
                     |     33.74      34.63 |     33.96 
---------------------+----------------------+----------
   Obese I (30-34.9) |    57,590     19,592 |    77,182 
                     |     20.54      21.22 |     20.71 
---------------------+----------------------+----------
  Obese II (35-39.9) |    24,032      8,114 |    32,146 
                     |      8.57       8.79 |      8.62 
---------------------+----------------------+----------
     Obese III (40+) |    12,586      4,539 |    17,125 
                     |      4.49       4.92 |      4.59 
---------------------+----------------------+----------
        Unknown (.u) |    13,483      4,916 |    18,399 
                     |      4.81       5.32 |      4.94 
---------------------+----------------------+----------
               Total |   280,407     92,339 |   372,746 
                     |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   warfarin vs DOACs
            Ethnicity |  DOAC use  warfarin  |     Total
----------------------+----------------------+----------
                White |   201,046     66,800 |   267,846 
                      |     71.70      72.34 |     71.86 
----------------------+----------------------+----------
                Mixed |       548        115 |       663 
                      |      0.20       0.12 |      0.18 
----------------------+----------------------+----------
Asian or Asian Britis |     3,911        766 |     4,677 
                      |      1.39       0.83 |      1.25 
----------------------+----------------------+----------
                Black |     1,289        258 |     1,547 
                      |      0.46       0.28 |      0.42 
----------------------+----------------------+----------
                Other |     1,100        281 |     1,381 
                      |      0.39       0.30 |      0.37 
----------------------+----------------------+----------
              Unknown |    72,513     24,119 |    96,632 
                      |     25.86      26.12 |     25.92 
----------------------+----------------------+----------
                Total |   280,407     92,339 |   372,746 
                      |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Care home |   warfarin vs DOACs
 residence |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   272,274     91,300 |   363,574 
           |     97.10      98.87 |     97.54 
-----------+----------------------+----------
         1 |     8,133      1,039 |     9,172 
           |      2.90       1.13 |      2.46 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |   warfarin vs DOACs
           (IMD) |  DOAC use  warfarin  |     Total
-----------------+----------------------+----------
1 least deprived |    57,570     17,703 |    75,273 
                 |     20.53      19.17 |     20.19 
-----------------+----------------------+----------
               2 |    56,881     18,400 |    75,281 
                 |     20.29      19.93 |     20.20 
-----------------+----------------------+----------
               3 |    55,654     19,056 |    74,710 
                 |     19.85      20.64 |     20.04 
-----------------+----------------------+----------
               4 |    54,758     18,615 |    73,373 
                 |     19.53      20.16 |     19.68 
-----------------+----------------------+----------
 5 most deprived |    55,544     18,565 |    74,109 
                 |     19.81      20.11 |     19.88 
-----------------+----------------------+----------
           Total |   280,407     92,339 |   372,746 
                 |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |
      status |
(missing set |   warfarin vs DOACs
     to non) |  DOAC use  warfarin  |     Total
-------------+----------------------+----------
       Never |   101,827     33,042 |   134,869 
             |     36.31      35.78 |     36.18 
-------------+----------------------+----------
      Former |   161,752     54,463 |   216,215 
             |     57.68      58.98 |     58.01 
-------------+----------------------+----------
     Current |    16,828      4,834 |    21,662 
             |      6.00       5.24 |      5.81 
-------------+----------------------+----------
       Total |   280,407     92,339 |   372,746 
             |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |   warfarin vs DOACs
        on |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |    85,329     25,451 |   110,780 
           |     30.43      27.56 |     29.72 
-----------+----------------------+----------
         1 |   195,078     66,888 |   261,966 
           |     69.57      72.44 |     70.28 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Heart |   warfarin vs DOACs
   Failure |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   208,980     65,413 |   274,393 
           |     74.53      70.84 |     73.61 
-----------+----------------------+----------
         1 |    71,427     26,926 |    98,353 
           |     25.47      29.16 |     26.39 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   warfarin vs DOACs
    Diabetes Severity |  DOAC use  warfarin  |     Total
----------------------+----------------------+----------
          No diabetes |   195,719     60,452 |   256,171 
                      |     69.80      65.47 |     68.73 
----------------------+----------------------+----------
  Controlled diabetes |    61,178     23,893 |    85,071 
                      |     21.82      25.88 |     22.82 
----------------------+----------------------+----------
Uncontrolled diabetes |    22,672      7,696 |    30,368 
                      |      8.09       8.33 |      8.15 
----------------------+----------------------+----------
Diabetes, no hba1c me |       838        298 |     1,136 
                      |      0.30       0.32 |      0.30 
----------------------+----------------------+----------
                Total |   280,407     92,339 |   372,746 
                      |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   warfarin vs DOACs
      COPD |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   244,218     81,067 |   325,285 
           |     87.09      87.79 |     87.27 
-----------+----------------------+----------
         1 |    36,189     11,272 |    47,461 
           |     12.91      12.21 |     12.73 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
Respirator |   warfarin vs DOACs
y Diseases |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   263,963     87,608 |   351,571 
           |     94.14      94.88 |     94.32 
-----------+----------------------+----------
         1 |    16,444      4,731 |    21,175 
           |      5.86       5.12 |      5.68 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   warfarin vs DOACs
    Cancer |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   230,919     76,099 |   307,018 
           |     82.35      82.41 |     82.37 
-----------+----------------------+----------
         1 |    49,488     16,240 |    65,728 
           |     17.65      17.59 |     17.63 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |   warfarin vs DOACs
algorithm) |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   278,719     91,811 |   370,530 
           |     99.40      99.43 |     99.41 
-----------+----------------------+----------
         1 |     1,688        528 |     2,216 
           |      0.60       0.57 |      0.59 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
    kidney |   warfarin vs DOACs
   disease |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
    No CKD |   184,692     57,706 |   242,398 
           |     65.87      62.49 |     65.03 
-----------+----------------------+----------
       CKD |    95,715     34,633 |   130,348 
           |     34.13      37.51 |     34.97 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Myocardial |   warfarin vs DOACs
infarction |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   248,496     81,925 |   330,421 
           |     88.62      88.72 |     88.65 
-----------+----------------------+----------
         1 |    31,911     10,414 |    42,325 
           |     11.38      11.28 |     11.35 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Peripheral |
  arterial |   warfarin vs DOACs
   disease |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   266,134     87,248 |   353,382 
           |     94.91      94.49 |     94.81 
-----------+----------------------+----------
         1 |    14,273      5,091 |    19,364 
           |      5.09       5.51 |      5.19 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Stroke/Tra |
    nsient |
 ischaemic |   warfarin vs DOACs
    attack |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   220,136     73,869 |   294,005 
           |     78.51      80.00 |     78.88 
-----------+----------------------+----------
         1 |    60,271     18,470 |    78,741 
           |     21.49      20.00 |     21.12 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Venous |
thromboemb |   warfarin vs DOACs
     olism |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   260,480     84,137 |   344,617 
           |     92.89      91.12 |     92.45 
-----------+----------------------+----------
         1 |    19,927      8,202 |    28,129 
           |      7.11       8.88 |      7.55 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Flu |   warfarin vs DOACs
   vaccine |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |    60,254     13,781 |    74,035 
           |     21.49      14.92 |     19.86 
-----------+----------------------+----------
         1 |   220,153     78,558 |   298,711 
           |     78.51      85.08 |     80.14 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |   warfarin vs DOACs
 Oestrogen |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   278,755     91,978 |   370,733 
           |     99.41      99.61 |     99.46 
-----------+----------------------+----------
         1 |     1,652        361 |     2,013 
           |      0.59       0.39 |      0.54 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |
antiplatel |   warfarin vs DOACs
        et |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   261,377     88,231 |   349,608 
           |     93.21      95.55 |     93.79 
-----------+----------------------+----------
         1 |    19,030      4,108 |    23,138 
           |      6.79       4.45 |      6.21 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        GP |
consultati |
on in last |
      year |   warfarin vs DOACs
  (binary) |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |     9,897      2,770 |    12,667 
           |      3.53       3.00 |      3.40 
-----------+----------------------+----------
         1 |   270,510     89,569 |   360,079 
           |     96.47      97.00 |     96.60 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       A&E |
attendance |
   rate in |
 last year |   warfarin vs DOACs
  (binary) |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   178,368     67,671 |   246,039 
           |     63.61      73.29 |     66.01 
-----------+----------------------+----------
         1 |   102,039     24,668 |   126,707 
           |     36.39      26.71 |     33.99 
-----------+----------------------+----------
     Total |   280,407     92,339 |   372,746 
           |    100.00     100.00 |    100.00 

. 
. bysort exposure: su gp_consult_count, detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            3              0       Obs             280,407
25%            6              0       Sum of Wgt.     280,407

50%           10                      Mean           13.29088
                        Largest       Std. Dev.      12.53421
75%           17            310
90%           27            324       Variance       157.1064
95%           35            346       Skewness        3.47577
99%           60            432       Kurtosis       32.74681

-------------------------------------------------------------------------------
-> exposure = warfarin use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%            4              0       Obs              92,339
25%            9              0       Sum of Wgt.      92,339

50%           16                      Mean           19.85037
                        Largest       Std. Dev.      16.54955
75%           27            228
90%           39            252       Variance       273.8877
95%           49            268       Skewness       2.413083
99%           79            307       Kurtosis       15.95023


. bysort exposure: su has_bled_score_ever, detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

          Ever record of HAS-BLED score in 10 years
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs             102,586
25%            1              0       Sum of Wgt.     102,586

50%            1                      Mean           1.578188
                        Largest       Std. Dev.      .9119513
75%            2              9
90%            3              9       Variance       .8316552
95%            3              9       Skewness       .9530766
99%            4              9       Kurtosis       5.359365

-------------------------------------------------------------------------------
-> exposure = warfarin use

          Ever record of HAS-BLED score in 10 years
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              36,935
25%            1              0       Sum of Wgt.      36,935

50%            1                      Mean           1.526763
                        Largest       Std. Dev.      .9039437
75%            2              9
90%            3              9       Variance       .8171142
95%            3              9       Skewness       1.249315
99%            4              9       Kurtosis       6.730462


. bysort exposure: su has_bled_score_recent, detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

               Recent record of HAS-BLED score
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              27,369
25%            1              0       Sum of Wgt.      27,369

50%            1                      Mean           1.557967
                        Largest       Std. Dev.      .8145914
75%            2              6
90%            3              6       Variance       .6635591
95%            3              7       Skewness       .8287872
99%            4              9       Kurtosis       4.314228

-------------------------------------------------------------------------------
-> exposure = warfarin use

               Recent record of HAS-BLED score
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs               5,994
25%            1              0       Sum of Wgt.       5,994

50%            1                      Mean           1.587421
                        Largest       Std. Dev.      .8320194
75%            2              6
90%            3              6       Variance       .6922562
95%            3              7       Skewness       1.020121
99%            4              7       Kurtosis       4.974728


. bysort exposure: su ae_attendance_count , detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             280,407
25%            0              0       Sum of Wgt.     280,407

50%            0                      Mean           .6807141
                        Largest       Std. Dev.      1.326147
75%            1             46
90%            2             51       Variance       1.758665
95%            3             54       Skewness       5.715692
99%            6             69       Kurtosis       106.8177

-------------------------------------------------------------------------------
-> exposure = warfarin use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              92,339
25%            0              0       Sum of Wgt.      92,339

50%            0                      Mean           .4387962
                        Largest       Std. Dev.      .9813552
75%            1             21
90%            1             23       Variance       .9630581
95%            2             37       Skewness       5.610994
99%            4             45       Kurtosis       102.6788


. bysort exposure: su age, detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           49             18
 5%           59             19
10%           64             19       Obs             280,407
25%           71             19       Sum of Wgt.     280,407

50%           78                      Mean           77.04845
                        Largest       Std. Dev.      10.09403
75%           84            105
90%           89            105       Variance       101.8894
95%           92            106       Skewness       -.605006
99%           96            107       Kurtosis       3.597434

-------------------------------------------------------------------------------
-> exposure = warfarin use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           53             24
 5%           63             25
10%           68             25       Obs              92,339
25%           73             26       Sum of Wgt.      92,339

50%           79                      Mean           78.53643
                        Largest       Std. Dev.      8.822305
75%           85            103
90%           89            103       Variance       77.83307
95%           91            103       Skewness      -.6935186
99%           95            105       Kurtosis       4.152547


. bysort exposure: su follow_up_`outcome', detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

          Number of days (follow-up) for covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%           23              1
 5%           68              1
10%          101              1       Obs             280,407
25%          212            1.5       Sum of Wgt.     280,407

50%          212                      Mean           189.6913
                        Largest       Std. Dev.      48.35045
75%          212            212
90%          212            212       Variance       2337.766
95%          212            212       Skewness      -2.128856
99%          212            212       Kurtosis       6.334136

-------------------------------------------------------------------------------
-> exposure = warfarin use

          Number of days (follow-up) for covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%           29              1
 5%           81              1
10%          130            1.5       Obs              92,339
25%          212            1.5       Sum of Wgt.      92,339

50%          212                      Mean           195.0516
                        Largest       Std. Dev.      42.63077
75%          212            212
90%          212            212       Variance       1817.383
95%          212            212       Skewness      -2.604041
99%          212            212       Kurtosis       8.819458


. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab `outcome', m
10

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
first covid |
       test |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    299,269       80.29       80.29
          1 |     73,477       19.71      100.00
------------+-----------------------------------
      Total |    372,746      100.00

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/03_an_checks_covidtest.log
  log type:  text
 closed on:   1 Mar 2021, 21:11:49
-------------------------------------------------------------------------------
