-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/03_an_checks_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 02:56:25

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_`outcome', clear

. 
. *Duplicate patient check
. sort patient_id

. datacheck _n==1, by(patient_id) nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. * Check date ranges for all treatment variables  
. foreach i in warfarin_last_four_months  ///
>              doac_last_four_months      ///
>               {
  2.         
.         summ `i', format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
warfarin_l~s |     95,559   02feb2020    24.06417  01nov2019  29feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doac_last_~s |    279,842   06feb2020    19.63183  01nov2019  29feb2020

. 
. * Check date ranges for all comorbidities/ medications 
. foreach var of varlist  ckd                                             ///  
>                    
>                                                 hypertension                 
>            ///
>                                                 other_respiratory            
>            ///
>                                                 heart_failure                
>            ///
>                                                 copd                         
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 cancer                       
>            ///
>                                                 myocardial_infarct           
>            ///
>                                                 stroke                       
>                    ///
>                                                 tia                          
>                            ///
>                                                 pad                          
>                            ///
>                                                 vte                          
>                            ///
>                                                 antiplatelet                /
> //
>                                                 oestrogen                   /
> //
>                                                  { 
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ckd_date |    129,926   09nov2019    91.51161  15feb2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |    261,029   28feb1999    8028.142  15jan1800  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_resp~e |     21,111   28mar2010    6154.464  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
heart_fai~te |     98,003   03jun2013     4577.28  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   copd_date |     47,296   19oct2008    6615.205  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |    116,109   17nov2007    6611.391  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 cancer_date |     65,518   08jun2008    4987.724  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
myocardial~e |     42,164   25apr2008    4281.737  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 stroke_date |     59,179   10jun2014    3325.561  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    tia_date |     43,046   26feb2013    3170.877  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    pad_date |     19,297   29apr2012    3499.668  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    vte_date |     28,043   12feb2008    5008.928  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
antiplatel~e |     23,016   25jan2020     29.3977  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
oestrogen_~e |      2,004   22jan2020     29.6909  15nov2019  15feb2020

. 
. summ immunodef_any, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
immunodef_~y |    371,551    .0059534    .0769285          0          1

. 
. * Death outcome flag (covid)
. //Underlying Covid-death should be a subset of Any Covid-death
. datacheck !(died_ons_covid_flag_underlying==1 & died_ons_covid_flag_any!=1), 
> nolist

. 
. * Outcome dates
. summ  stime_onscoviddeath stime_onsnoncoviddeath ///
> stime_admitcovid stime_covidtest stime_positivecovidtest,  format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_onsc~h |    371,551   21sep2020     29.4606  01mar2020  28sep2020
stime_onsn~h |    371,551   21sep2020     29.4606  01mar2020  28sep2020
stime_admi~d |    371,551   21sep2020    30.87037  01mar2020  28sep2020
stime_covi~t |    371,551   15sep2020    39.93869  01mar2020  28sep2020
stime_posi~t |    371,551   20sep2020    32.16293  01mar2020  28sep2020

. summ  died_date_ons died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     21,738   08jul2020    83.46801  01mar2020  07dec2020
died_date_~d |      3,199   24jun2020    91.87244  02mar2020  06dec2020

. summ  covid_admission_date covid_admission_primary_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
covid~n_date |      4,406   10may2020    60.89329  01mar2020  30oct2020
covid~y_date |      2,653   07may2020    59.96224  01mar2020  30oct2020

. summ  first_tested_for_covid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_test~d |     49,828   08aug2020    78.74807  01mar2020  17dec2020

. summ  first_positive_test_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_posi~e |     11,259   21aug2020    99.90262  01mar2020  17dec2020

. 
. * Follow-up for outcomes
. datacheck follow_up_`outcome' > 0, nol

. 
. summ  follow_up_`outcome', detail

          Number of days (follow-up) for covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%           26              1
 5%           86              1
10%          170              1       Obs             371,551
25%          212              1       Sum of Wgt.     371,551

50%          212                      Mean           199.0986
                        Largest       Std. Dev.      39.93869
75%          212            212
90%          212            212       Variance       1595.099
95%          212            212       Skewness      -3.212576
99%          212            212       Kurtosis       12.35231

. 
. * Outcome date day lags since cohort entry (only ONS dataset)
. * check how the death count tail out
. gen days_died_since_entry = died_date_ons - enter_date
(349,813 missing values generated)

. su days_died_since_entry, detail

                    days_died_since_entry
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             .5
 5%           14             .5
10%           26             .5       Obs              21,738
25%           52             .5       Sum of Wgt.      21,738

50%          120                      Mean            129.592
                        Largest       Std. Dev.      83.46801
75%          207            280
90%          250            280       Variance       6966.909
95%          263            280       Skewness       .1877567
99%          274            281       Kurtosis       1.677236

. 
. * check the dates of first positive covid test date and covid first test date
. datacheck first_positive_test_date == first_tested_for_covid, nol

 (38650 contradictions)

. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      6,482    17.30602    .8884717         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     93,761     22.5592    1.681747       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    126,246    27.37286    1.415589         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     77,111    32.12905    1.422528         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     32,056    37.07136    1.407645         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     17,044    43.45972    2.655024         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     6,482          0          0          0 |     6,482 
  Normal (18.5-24.9) |    93,761          0          0          0 |    93,761 
Overweight (25-29.9) |   126,246          0          0          0 |   126,246 
   Obese I (30-34.9) |         0     77,111          0          0 |    77,111 
  Obese II (35-39.9) |         0          0     32,056          0 |    32,056 
     Obese III (40+) |         0          0          0     17,044 |    17,044 
        Unknown (.u) |    18,851          0          0          0 |    18,851 
---------------------+--------------------------------------------+----------
               Total |   245,340     77,111     32,056     17,044 |   371,551 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        621    33.93076    4.562827         18         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,666    46.05251    2.665367         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     14,963    55.65268    2.705502         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     52,018    65.50905     2.76398         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    132,505    74.72261    2.771011         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    168,778    85.79623    4.317135         80        107


. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |   134,043          0          0 |   134,043 
      Former |         0    215,559          0 |   215,559 
     Current |         0          0     21,578 |    21,578 
Unknown (.u) |       371          0          0 |       371 
-------------+---------------------------------+----------
       Total |   134,414    215,559     21,578 |   371,551 

. 
. * Diabetes
. safetab diabcat diabetes, m
17

                      |       Diabetes
    Diabetes Severity |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |   255,442          0 |   255,442 
  Controlled diabetes |         0     84,734 |    84,734 
Uncontrolled diabetes |         0     30,260 |    30,260 
Diabetes, no hba1c me |         0      1,115 |     1,115 
----------------------+----------------------+----------
                Total |   255,442    116,109 |   371,551 

. 
. * CKD
. safetab ckd egfr_cat, m
13

   Chronic |
    kidney |                    Calculated eGFR
   disease |        15         30         45         60          . |     Total
-----------+-------------------------------------------------------+----------
    No CKD |         0          0          0    201,185     40,440 |   241,625 
       CKD |    10,399     41,618     77,909          0          0 |   129,926 
-----------+-------------------------------------------------------+----------
     Total |    10,399     41,618     77,909    201,185     40,440 |   371,551 

. 
. /* RELATIONSHIP WITH EXPOSURE AND COVARIATES (past 4 months)=============*/
. 
. foreach var of varlist  agegroup                    ///
>                         sex                         ///
>                                                 bmicat                      /
> //
>                                                 ethnicity                   /
> //
>                                                 care_home_residence          
>            ///
>                                                 imd                         /
> //
>                                                 smoke_nomiss                /
> //
>                                                 hypertension                 
>            ///
>                                                 heart_failure                
>            ///
>                                                 diabcat                      
>                    ///
>                                                 copd                         
>                    ///                                             
>                                                 other_respiratory            
>            ///
>                                                 cancer                       
>            ///
>                                                 immunodef_any                
>            ///
>                                                 ckd                          
>                    ///
>                                                 myocardial_infarct           
>            ///
>                                                 pad                          
>                            ///
>                                                 stroke_tia                   
>                    ///
>                                                 vte                          
>                            ///
>                                                 flu_vaccine                  
>                    ///                                             
>                                                 oestrogen                    
>                    ///
>                                                 antiplatelet                 
>            ///
>                                                 gp_consult                   
>            ///
>                                                 ae_attendance_last_year     /
> //
>                                               {
  2.                                                         
.         safetab `var' exposure , col m
  3. }
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |   warfarin vs DOACs
       age |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
    18-<40 |       510        111 |       621 
           |      0.18       0.12 |      0.17 
-----------+----------------------+----------
    40-<50 |     2,306        360 |     2,666 
           |      0.83       0.39 |      0.72 
-----------+----------------------+----------
    50-<60 |    12,727      2,236 |    14,963 
           |      4.55       2.43 |      4.03 
-----------+----------------------+----------
    60-<70 |    42,229      9,789 |    52,018 
           |     15.11      10.63 |     14.00 
-----------+----------------------+----------
    70-<80 |    98,545     33,960 |   132,505 
           |     35.26      36.87 |     35.66 
-----------+----------------------+----------
       80+ |   123,139     45,639 |   168,778 
           |     44.06      49.56 |     45.43 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   warfarin vs DOACs
       Sex |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         F |   122,376     36,330 |   158,706 
           |     43.79      39.45 |     42.71 
-----------+----------------------+----------
         M |   157,080     55,765 |   212,845 
           |     56.21      60.55 |     57.29 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   warfarin vs DOACs
         Grouped BMI |  DOAC use  warfarin  |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     5,323      1,159 |     6,482 
                     |      1.90       1.26 |      1.74 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    72,001     21,760 |    93,761 
                     |     25.76      23.63 |     25.24 
---------------------+----------------------+----------
Overweight (25-29.9) |    94,345     31,901 |   126,246 
                     |     33.76      34.64 |     33.98 
---------------------+----------------------+----------
   Obese I (30-34.9) |    57,482     19,629 |    77,111 
                     |     20.57      21.31 |     20.75 
---------------------+----------------------+----------
  Obese II (35-39.9) |    23,958      8,098 |    32,056 
                     |      8.57       8.79 |      8.63 
---------------------+----------------------+----------
     Obese III (40+) |    12,511      4,533 |    17,044 
                     |      4.48       4.92 |      4.59 
---------------------+----------------------+----------
        Unknown (.u) |    13,836      5,015 |    18,851 
                     |      4.95       5.45 |      5.07 
---------------------+----------------------+----------
               Total |   279,456     92,095 |   371,551 
                     |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   warfarin vs DOACs
            Ethnicity |  DOAC use  warfarin  |     Total
----------------------+----------------------+----------
                White |   199,186     66,189 |   265,375 
                      |     71.28      71.87 |     71.42 
----------------------+----------------------+----------
                Mixed |       541        114 |       655 
                      |      0.19       0.12 |      0.18 
----------------------+----------------------+----------
Asian or Asian Britis |     3,877        752 |     4,629 
                      |      1.39       0.82 |      1.25 
----------------------+----------------------+----------
                Black |     1,280        256 |     1,536 
                      |      0.46       0.28 |      0.41 
----------------------+----------------------+----------
                Other |     1,091        279 |     1,370 
                      |      0.39       0.30 |      0.37 
----------------------+----------------------+----------
              Unknown |    73,481     24,505 |    97,986 
                      |     26.29      26.61 |     26.37 
----------------------+----------------------+----------
                Total |   279,456     92,095 |   371,551 
                      |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Care home |   warfarin vs DOACs
 residence |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   271,324     91,058 |   362,382 
           |     97.09      98.87 |     97.53 
-----------+----------------------+----------
         1 |     8,132      1,037 |     9,169 
           |      2.91       1.13 |      2.47 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |   warfarin vs DOACs
           (IMD) |  DOAC use  warfarin  |     Total
-----------------+----------------------+----------
1 least deprived |    57,394     17,639 |    75,033 
                 |     20.54      19.15 |     20.19 
-----------------+----------------------+----------
               2 |    55,905     18,099 |    74,004 
                 |     20.00      19.65 |     19.92 
-----------------+----------------------+----------
               3 |    56,424     19,301 |    75,725 
                 |     20.19      20.96 |     20.38 
-----------------+----------------------+----------
               4 |    54,472     18,567 |    73,039 
                 |     19.49      20.16 |     19.66 
-----------------+----------------------+----------
 5 most deprived |    55,261     18,489 |    73,750 
                 |     19.77      20.08 |     19.85 
-----------------+----------------------+----------
           Total |   279,456     92,095 |   371,551 
                 |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |
      status |
(missing set |   warfarin vs DOACs
     to non) |  DOAC use  warfarin  |     Total
-------------+----------------------+----------
       Never |   101,474     32,940 |   134,414 
             |     36.31      35.77 |     36.18 
-------------+----------------------+----------
      Former |   161,227     54,332 |   215,559 
             |     57.69      59.00 |     58.02 
-------------+----------------------+----------
     Current |    16,755      4,823 |    21,578 
             |      6.00       5.24 |      5.81 
-------------+----------------------+----------
       Total |   279,456     92,095 |   371,551 
             |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |   warfarin vs DOACs
        on |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |    85,129     25,393 |   110,522 
           |     30.46      27.57 |     29.75 
-----------+----------------------+----------
         1 |   194,327     66,702 |   261,029 
           |     69.54      72.43 |     70.25 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Heart |   warfarin vs DOACs
   Failure |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   208,300     65,248 |   273,548 
           |     74.54      70.85 |     73.62 
-----------+----------------------+----------
         1 |    71,156     26,847 |    98,003 
           |     25.46      29.15 |     26.38 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   warfarin vs DOACs
    Diabetes Severity |  DOAC use  warfarin  |     Total
----------------------+----------------------+----------
          No diabetes |   195,128     60,314 |   255,442 
                      |     69.82      65.49 |     68.75 
----------------------+----------------------+----------
  Controlled diabetes |    60,914     23,820 |    84,734 
                      |     21.80      25.86 |     22.81 
----------------------+----------------------+----------
Uncontrolled diabetes |    22,591      7,669 |    30,260 
                      |      8.08       8.33 |      8.14 
----------------------+----------------------+----------
Diabetes, no hba1c me |       823        292 |     1,115 
                      |      0.29       0.32 |      0.30 
----------------------+----------------------+----------
                Total |   279,456     92,095 |   371,551 
                      |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   warfarin vs DOACs
      COPD |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   243,396     80,859 |   324,255 
           |     87.10      87.80 |     87.27 
-----------+----------------------+----------
         1 |    36,060     11,236 |    47,296 
           |     12.90      12.20 |     12.73 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
Respirator |   warfarin vs DOACs
y Diseases |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   263,058     87,382 |   350,440 
           |     94.13      94.88 |     94.32 
-----------+----------------------+----------
         1 |    16,398      4,713 |    21,111 
           |      5.87       5.12 |      5.68 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   warfarin vs DOACs
    Cancer |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   230,138     75,895 |   306,033 
           |     82.35      82.41 |     82.37 
-----------+----------------------+----------
         1 |    49,318     16,200 |    65,518 
           |     17.65      17.59 |     17.63 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |   warfarin vs DOACs
algorithm) |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   277,772     91,567 |   369,339 
           |     99.40      99.43 |     99.40 
-----------+----------------------+----------
         1 |     1,684        528 |     2,212 
           |      0.60       0.57 |      0.60 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
    kidney |   warfarin vs DOACs
   disease |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
    No CKD |   184,072     57,553 |   241,625 
           |     65.87      62.49 |     65.03 
-----------+----------------------+----------
       CKD |    95,384     34,542 |   129,926 
           |     34.13      37.51 |     34.97 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Myocardial |   warfarin vs DOACs
infarction |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   247,689     81,698 |   329,387 
           |     88.63      88.71 |     88.65 
-----------+----------------------+----------
         1 |    31,767     10,397 |    42,164 
           |     11.37      11.29 |     11.35 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Peripheral |
  arterial |   warfarin vs DOACs
   disease |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   265,244     87,010 |   352,254 
           |     94.91      94.48 |     94.81 
-----------+----------------------+----------
         1 |    14,212      5,085 |    19,297 
           |      5.09       5.52 |      5.19 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Stroke/Tra |
    nsient |
 ischaemic |   warfarin vs DOACs
    attack |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   219,417     73,670 |   293,087 
           |     78.52      79.99 |     78.88 
-----------+----------------------+----------
         1 |    60,039     18,425 |    78,464 
           |     21.48      20.01 |     21.12 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Venous |
thromboemb |   warfarin vs DOACs
     olism |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   259,598     83,910 |   343,508 
           |     92.89      91.11 |     92.45 
-----------+----------------------+----------
         1 |    19,858      8,185 |    28,043 
           |      7.11       8.89 |      7.55 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Flu |   warfarin vs DOACs
   vaccine |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |    60,015     13,730 |    73,745 
           |     21.48      14.91 |     19.85 
-----------+----------------------+----------
         1 |   219,441     78,365 |   297,806 
           |     78.52      85.09 |     80.15 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |   warfarin vs DOACs
 Oestrogen |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   277,809     91,738 |   369,547 
           |     99.41      99.61 |     99.46 
-----------+----------------------+----------
         1 |     1,647        357 |     2,004 
           |      0.59       0.39 |      0.54 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |
antiplatel |   warfarin vs DOACs
        et |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   260,536     87,999 |   348,535 
           |     93.23      95.55 |     93.81 
-----------+----------------------+----------
         1 |    18,920      4,096 |    23,016 
           |      6.77       4.45 |      6.19 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        GP |
consultati |
on in last |
      year |   warfarin vs DOACs
  (binary) |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |     9,046      2,485 |    11,531 
           |      3.24       2.70 |      3.10 
-----------+----------------------+----------
         1 |   270,410     89,610 |   360,020 
           |     96.76      97.30 |     96.90 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       A&E |
attendance |
   rate in |
 last year |   warfarin vs DOACs
  (binary) |  DOAC use  warfarin  |     Total
-----------+----------------------+----------
         0 |   177,745     67,464 |   245,209 
           |     63.60      73.25 |     66.00 
-----------+----------------------+----------
         1 |   101,711     24,631 |   126,342 
           |     36.40      26.75 |     34.00 
-----------+----------------------+----------
     Total |   279,456     92,095 |   371,551 
           |    100.00     100.00 |    100.00 

. 
. bysort exposure: su gp_consult_count, detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            3              0       Obs             279,456
25%            6              0       Sum of Wgt.     279,456

50%           10                      Mean           13.30919
                        Largest       Std. Dev.      12.49002
75%           17            324
90%           27            346       Variance       156.0006
95%           35            348       Skewness       3.494425
99%           60            432       Kurtosis       33.79092

-------------------------------------------------------------------------------
-> exposure = warfarin use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%            4              0       Obs              92,095
25%            9              0       Sum of Wgt.      92,095

50%           17                      Mean           19.89681
                        Largest       Std. Dev.      16.50265
75%           27            228
90%           39            252       Variance       272.3375
95%           49            268       Skewness       2.411168
99%           79            307       Kurtosis       15.92943


. bysort exposure: su ae_attendance_count , detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             279,456
25%            0              0       Sum of Wgt.     279,456

50%            0                      Mean           .6804828
                        Largest       Std. Dev.      1.324445
75%            1             46
90%            2             51       Variance       1.754154
95%            3             54       Skewness       5.690472
99%            6             69       Kurtosis       106.2866

-------------------------------------------------------------------------------
-> exposure = warfarin use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              92,095
25%            0              0       Sum of Wgt.      92,095

50%            0                      Mean           .4392421
                        Largest       Std. Dev.      .9817751
75%            1             21
90%            1             23       Variance       .9638823
95%            2             37       Skewness       5.610287
99%            4             45       Kurtosis       102.6986


. bysort exposure: su age, detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           49             18
 5%           59             19
10%           64             19       Obs             279,456
25%           71             19       Sum of Wgt.     279,456

50%           78                      Mean           77.05214
                        Largest       Std. Dev.      10.09139
75%           84            105
90%           89            105       Variance       101.8362
95%           92            106       Skewness      -.6049309
99%           96            107       Kurtosis       3.599538

-------------------------------------------------------------------------------
-> exposure = warfarin use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           53             24
 5%           63             25
10%           68             25       Obs              92,095
25%           73             26       Sum of Wgt.      92,095

50%           79                      Mean           78.54041
                        Largest       Std. Dev.      8.819058
75%           85            103
90%           89            103       Variance       77.77579
95%           91            103       Skewness      -.6928811
99%           95            105       Kurtosis       4.152248


. bysort exposure: su follow_up_`outcome', detail

-------------------------------------------------------------------------------
-> exposure = DOAC use

          Number of days (follow-up) for covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%           25              1
 5%           81              1
10%          160              1       Obs             279,456
25%          212            1.5       Sum of Wgt.     279,456

50%          212                      Mean           198.2871
                        Largest       Std. Dev.      41.15598
75%          212            212
90%          212            212       Variance       1693.815
95%          212            212       Skewness      -3.089801
99%          212            212       Kurtosis       11.50986

-------------------------------------------------------------------------------
-> exposure = warfarin use

          Number of days (follow-up) for covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%           31              1
 5%          106              1
10%          204            1.5       Obs              92,095
25%          212            1.5       Sum of Wgt.      92,095

50%          212                      Mean           201.5612
                        Largest       Std. Dev.      35.88181
75%          212            212
90%          212            212       Variance       1287.505
95%          212            212       Skewness      -3.660608
99%          212            212       Kurtosis        15.7275


. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab `outcome', m
10

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
first covid |
       test |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    338,736       91.17       91.17
          1 |     32,815        8.83      100.00
------------+-----------------------------------
      Total |    371,551      100.00

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/03_an_checks_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 02:56:52
-------------------------------------------------------------------------------
