-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_positivecovidtest.log
  log type:  text
 opened on:   1 Mar 2021, 21:18:19

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   276,525      3,882 |   280,407 
             |     98.62       1.38 |    100.00 
-------------+----------------------+----------
warfarin use |    91,449        890 |    92,339 
             |     99.04       0.96 |    100.00 
-------------+----------------------+----------
       Total |   367,974      4,772 |   372,746 
             |     98.72       1.28 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -61107.184
Iteration 1:   log likelihood =  -61054.44
Iteration 2:   log likelihood = -61053.999
Iteration 3:   log likelihood = -61053.999
Refining estimates:
Iteration 0:   log likelihood = -61053.999

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(1)       =      106.37
Log likelihood  =   -61053.999                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6912731   .0256908    -9.93   0.000     .6427103    .7435054
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_univar.ster n
> ot found)
file /workspace/output/warfarin_tempdata/positivecovidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -61107.184
Iteration 1:   log likelihood = -60453.123
Iteration 2:   log likelihood = -60325.957
Iteration 3:   log likelihood = -60323.656
Iteration 4:   log likelihood = -60323.655
Refining estimates:
Iteration 0:   log likelihood = -60323.655

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(5)       =     1567.06
Log likelihood  =   -60323.655                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6581524   .0245495   -11.21   0.000     .6117529    .7080711
      1.male |   1.151674   .0343113     4.74   0.000     1.086351    1.220925
        age1 |   .9707052   .0056494    -5.11   0.000     .9596955    .9818412
        age2 |   1.121497   .0116233    11.06   0.000     1.098945    1.144511
        age3 |   .6345821   .0405236    -7.12   0.000     .5599267    .7191912
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar1.ste
> r not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24673.068
Iteration 1:   log likelihood = -23384.314
Iteration 2:   log likelihood = -22807.186
Iteration 3:   log likelihood = -22803.405
Iteration 4:   log likelihood = -22803.404
Refining estimates:
Iteration 0:   log likelihood = -22803.404

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(27)      =     3739.33
Log likelihood  =   -22803.404                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7324621    .028243    -8.07   0.000     .6791468    .7899628
      1.male |   1.229758   .0390635     6.51   0.000      1.15553    1.308755
        age1 |   .9755872   .0059171    -4.08   0.000     .9640586    .9872537
        age2 |   1.118593    .011928    10.51   0.000     1.095457    1.142218
        age3 |   .5719952   .0372965    -8.57   0.000     .5033737    .6499714
             |
         imd |
          2  |   1.109524   .0609951     1.89   0.059     .9961914    1.235751
          3  |   1.203013   .0671096     3.31   0.001     1.078416    1.342005
          4  |     1.2983   .0748469     4.53   0.000     1.159587    1.453606
5 most de..  |   1.479401   .0865397     6.70   0.000     1.319149    1.659122
             |
   obese4cat |
Obese I ..)  |   .9859241   .0392197    -0.36   0.722     .9119752    1.065869
Obese II..)  |   1.194901   .0669798     3.18   0.001     1.070577    1.333662
Obese II..)  |   1.339877   .1015449     3.86   0.000     1.154929    1.554443
             |
smoke_nomiss |
     Former  |   1.194313    .039294     5.40   0.000     1.119729    1.273865
    Current  |   1.001398   .0764323     0.02   0.985     .8622597    1.162987
             |
     diabcat |
Controlle..  |   1.207181   .0428235     5.31   0.000     1.126099      1.2941
Uncontrol..  |   1.565169   .0756063     9.27   0.000     1.423782    1.720596
Diabetes,..  |   .8816123   .2315551    -0.48   0.631     .5268777    1.475181
             |
1.myocardi~t |   1.105566   .0476997     2.33   0.020      1.01592    1.203122
       1.pad |   1.336036   .0712056     5.44   0.000     1.203517    1.483146
1.hyperten~n |   1.031525   .0365398     0.88   0.381     .9623382    1.105687
1.heart_f~re |   1.280053   .0404838     7.81   0.000     1.203115    1.361911
1.stroke_tia |   1.179126   .0389003     4.99   0.000     1.105295    1.257888
       1.vte |    1.39921    .065082     7.22   0.000     1.277293    1.532764
 1.oestrogen |   1.047991   .2382476     0.21   0.837     .6711936    1.636318
1.antiplat~t |   1.014174    .061731     0.23   0.817     .9001215    1.142677
1.flu_vac~ne |   .8174125   .0303189    -5.44   0.000     .7600972    .8790498
1.care_ho~ce |   6.818019   .2938029    44.55   0.000     6.265823    7.418879
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar2.ste
> r not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24673.068
Iteration 1:   log likelihood = -23092.867
Iteration 2:   log likelihood = -22446.903
Iteration 3:   log likelihood = -22442.954
Iteration 4:   log likelihood = -22442.953
Refining estimates:
Iteration 0:   log likelihood = -22442.953

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =        4,772
Time at risk    =     76003822
                                                LR chi2(34)      =     4460.23
Log likelihood  =   -22442.953                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8003447   .0310026    -5.75   0.000     .7418301    .8634749
      1.male |   1.254704   .0398518     7.14   0.000     1.178977    1.335294
        age1 |   .9782334   .0059129    -3.64   0.000     .9667128    .9898913
        age2 |   1.102454   .0117579     9.15   0.000     1.079648    1.125742
        age3 |   .6207098   .0405523    -7.30   0.000     .5461071    .7055038
             |
         imd |
          2  |   1.100388   .0605599     1.74   0.082     .9878703    1.225721
          3  |   1.183802   .0660693     3.02   0.003      1.06114    1.320644
          4  |   1.258687    .072703     3.98   0.000     1.123962    1.409562
5 most de..  |   1.403597   .0823045     5.78   0.000     1.251207    1.574546
             |
   obese4cat |
Obese I ..)  |   .9972444   .0397689    -0.07   0.945     .9222671    1.078317
Obese II..)  |   1.204746   .0676521     3.32   0.001     1.079187    1.344914
Obese II..)  |   1.328649   .1008473     3.74   0.000     1.144992    1.541766
             |
smoke_nomiss |
     Former  |   1.129846   .0378687     3.64   0.000      1.05801     1.20656
    Current  |   .9025924   .0700839    -1.32   0.187      .775172    1.050958
             |
     diabcat |
Controlle..  |   1.189174   .0423415     4.87   0.000     1.109015    1.275126
Uncontrol..  |   1.489149   .0724296     8.19   0.000     1.353746    1.638095
Diabetes,..  |    .862759   .2266959    -0.56   0.574      .515502    1.443938
             |
1.myocardi~t |   1.065562   .0459679     1.47   0.141     .9791707    1.159576
       1.pad |   1.274433   .0680339     4.54   0.000     1.147828    1.415003
1.hyperten~n |   1.025105   .0364581     0.70   0.486     .9560823    1.099111
1.heart_f~re |   1.176942   .0378582     5.06   0.000     1.105032    1.253531
1.stroke_tia |   1.129176   .0373158     3.68   0.000     1.058357    1.204735
       1.vte |   1.296594   .0605618     5.56   0.000     1.183166    1.420896
 1.oestrogen |   1.019899   .2327648     0.09   0.931     .6520681    1.595223
1.antiplat~t |   .9244789   .0563444    -1.29   0.198     .8203868    1.041778
1.flu_vac~ne |   .8213996   .0306177    -5.28   0.000     .7635297    .8836556
             |
         ckd |
        CKD  |   1.132827   .0365372     3.87   0.000     1.063432    1.206751
      1.copd |   1.238247   .0531671     4.98   0.000     1.138306    1.346963
1.other_re~y |   1.321655   .0695522     5.30   0.000      1.19213    1.465253
1.immunode~y |   1.148312   .2130412     0.75   0.456     .7982521    1.651883
    1.cancer |   1.040477   .0390104     1.06   0.290     .9667602    1.119816
1.ae_atten~r |   2.121823   .0665964    23.97   0.000      1.99523    2.256448
1.gp_consult |   .7150889   .0583322    -4.11   0.000     .6094312    .8390645
1.care_ho~ce |   6.233366   .2728037    41.81   0.000      5.72097    6.791653
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar3.ste
> r not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table2_positivecovidtest.txt not 
> found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6912731   .0256908    -9.93   0.000     .6427103    .7435054
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6581524   .0245495   -11.21   0.000     .6117529    .7080711
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7324621    .028243    -8.07   0.000     .6791468    .7899628
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8003447   .0310026    -5.75   0.000     .7418301    .8634749
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_positivecovidtest.log
  log type:  text
 closed on:   1 Mar 2021, 21:20:36
-------------------------------------------------------------------------------
