-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_onsnoncoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:02:13

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   269,219     11,188 |   280,407 
             |     96.01       3.99 |    100.00 
-------------+----------------------+----------
warfarin use |    89,332      3,007 |    92,339 
             |     96.74       3.26 |    100.00 
-------------+----------------------+----------
       Total |   358,551     14,195 |   372,746 
             |     96.19       3.81 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -181715.04
Iteration 1:   log likelihood = -181660.55
Iteration 2:   log likelihood =  -181660.4
Iteration 3:   log likelihood =  -181660.4
Refining estimates:
Iteration 0:   log likelihood =  -181660.4

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       14,195
Time at risk    =   76409267.5
                                                LR chi2(1)       =      109.27
Log likelihood  =    -181660.4                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8101624   .0166417   -10.25   0.000     .7781931    .8434449
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_univar.ster no
> t found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -181715.04
Iteration 1:   log likelihood = -179389.85
Iteration 2:   log likelihood =  -177345.5
Iteration 3:   log likelihood = -177282.24
Iteration 4:   log likelihood = -177282.06
Iteration 5:   log likelihood = -177282.06
Refining estimates:
Iteration 0:   log likelihood = -177282.06

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       14,195
Time at risk    =   76409267.5
                                                LR chi2(5)       =     8865.96
Log likelihood  =   -177282.06                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7585471   .0156363   -13.41   0.000     .7285114    .7898211
      1.male |   1.205344   .0207425    10.85   0.000     1.165368    1.246692
        age1 |    1.03578   .0065185     5.59   0.000     1.023082    1.048635
        age2 |   1.061998   .0096317     6.63   0.000     1.043287    1.081044
        age3 |    .834491   .0399201    -3.78   0.000      .759805    .9165183
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar1.ster
>  not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -74760.719
Iteration 1:   log likelihood = -69560.863
Iteration 2:   log likelihood = -68420.918
Iteration 3:   log likelihood = -68397.151
Iteration 4:   log likelihood = -68396.535
Iteration 5:   log likelihood = -68396.534
Refining estimates:
Iteration 0:   log likelihood = -68396.534

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       14,195
Time at risk    =   76409267.5
                                                LR chi2(27)      =    12728.37
Log likelihood  =   -68396.534                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7928926   .0168936   -10.89   0.000     .7604636    .8267045
      1.male |   1.188569   .0217414     9.44   0.000     1.146711    1.231954
        age1 |   1.045357   .0067401     6.88   0.000      1.03223    1.058651
        age2 |    1.05029   .0097282     5.30   0.000     1.031395    1.069531
        age3 |   .8236849   .0402042    -3.97   0.000      .748538     .906376
             |
         imd |
          2  |   1.006875   .0305951     0.23   0.822     .9486602    1.068662
          3  |   1.065913   .0328544     2.07   0.038     1.003426    1.132291
          4  |   1.131678   .0363618     3.85   0.000     1.062607    1.205237
5 most de..  |   1.304203   .0440279     7.87   0.000     1.220702    1.393415
             |
   obese4cat |
Obese I ..)  |   .7751751   .0193865   -10.18   0.000     .7380945    .8141186
Obese II..)  |   .9058097   .0338685    -2.65   0.008     .8418027    .9746836
Obese II..)  |   1.170084   .0589793     3.12   0.002     1.060013    1.291584
             |
smoke_nomiss |
     Former  |   1.225755   .0237079    10.52   0.000     1.180158    1.273113
    Current  |   1.997985   .0756927    18.27   0.000     1.855004    2.151986
             |
     diabcat |
Controlle..  |   1.187084   .0245107     8.31   0.000     1.140003    1.236109
Uncontrol..  |   1.424849    .042099    11.98   0.000      1.34468    1.509798
Diabetes,..  |   1.138166    .157438     0.94   0.349     .8678849    1.492619
             |
1.myocardi~t |    1.15489   .0277407     6.00   0.000     1.101779     1.21056
       1.pad |   1.440825   .0419614    12.54   0.000     1.360886     1.52546
1.hyperten~n |   1.104441   .0229697     4.78   0.000     1.060327    1.150391
1.heart_f~re |   1.667288   .0296576    28.74   0.000     1.610161    1.726441
1.stroke_tia |   1.207796   .0227228    10.04   0.000     1.164071    1.253163
       1.vte |   1.277255   .0354409     8.82   0.000     1.209647    1.348641
 1.oestrogen |   1.283262   .1570635     2.04   0.042     1.009563    1.631163
1.antiplat~t |   1.092137   .0370432     2.60   0.009     1.021895    1.167208
1.flu_vac~ne |    .772183   .0166282   -12.01   0.000     .7402706    .8054712
1.care_ho~ce |   3.192287   .0902804    41.04   0.000     3.020155    3.374229
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2.ster
>  not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -74760.719
Iteration 1:   log likelihood = -68331.011
Iteration 2:   log likelihood = -66968.671
Iteration 3:   log likelihood = -66945.661
Iteration 4:   log likelihood = -66945.132
Iteration 5:   log likelihood = -66945.131
Refining estimates:
Iteration 0:   log likelihood = -66945.131

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       14,195
Time at risk    =   76409267.5
                                                LR chi2(34)      =    15631.18
Log likelihood  =   -66945.131                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8797072   .0188629    -5.98   0.000     .8435026    .9174657
      1.male |   1.181201   .0216002     9.11   0.000     1.139615    1.224305
        age1 |   1.043228   .0066905     6.60   0.000     1.030197    1.056423
        age2 |   1.036202   .0095672     3.85   0.000      1.01762    1.055125
        age3 |   .9071016   .0442383    -2.00   0.046      .824411    .9980862
             |
         imd |
          2  |   1.003217   .0305389     0.11   0.916     .9451125    1.064894
          3  |   1.051297    .032456     1.62   0.105     .9895705    1.116873
          4  |   1.103601   .0355158     3.06   0.002     1.036141    1.175452
5 most de..  |   1.245674   .0422331     6.48   0.000     1.165589    1.331261
             |
   obese4cat |
Obese I ..)  |   .7874341   .0197323    -9.54   0.000      .749694    .8270741
Obese II..)  |   .9125868   .0341716    -2.44   0.015     .8480104    .9820807
Obese II..)  |   1.157323   .0584354     2.89   0.004     1.048276    1.277713
             |
smoke_nomiss |
     Former  |   1.137848   .0224144     6.56   0.000     1.094754    1.182639
    Current  |   1.762695   .0684882    14.59   0.000     1.633444    1.902173
             |
     diabcat |
Controlle..  |   1.155874   .0239496     6.99   0.000     1.109874     1.20378
Uncontrol..  |   1.357413   .0403133    10.29   0.000     1.280657    1.438771
Diabetes,..  |   1.130855   .1564009     0.89   0.374     .8623487    1.482965
             |
1.myocardi~t |    1.11638   .0268442     4.58   0.000     1.064987    1.170254
       1.pad |   1.366749   .0399151    10.70   0.000     1.290714    1.447264
1.hyperten~n |   1.103204   .0230132     4.71   0.000     1.059009    1.149244
1.heart_f~re |   1.531339   .0277214    23.54   0.000     1.477959    1.586647
1.stroke_tia |    1.15999   .0218839     7.87   0.000     1.117882    1.203685
       1.vte |   1.152441   .0321264     5.09   0.000     1.091163    1.217159
 1.oestrogen |   1.037221   .1274899     0.30   0.766      .815166    1.319765
1.antiplat~t |   1.006887   .0342311     0.20   0.840     .9419821    1.076265
1.flu_vac~ne |   .7618695   .0164949   -12.56   0.000     .7302164    .7948946
             |
         ckd |
        CKD  |   1.121535   .0207418     6.20   0.000      1.08161    1.162934
      1.copd |   1.324092   .0319519    11.63   0.000     1.262925    1.388221
1.other_re~y |   1.436334   .0421011    12.35   0.000     1.356143    1.521267
1.immunode~y |   1.606712   .1432543     5.32   0.000     1.349102    1.913512
    1.cancer |   1.600038   .0306542    24.53   0.000      1.54107    1.661261
1.ae_atten~r |   2.080786   .0379192    40.21   0.000     2.007777    2.156449
1.gp_consult |   .7717961   .0393657    -5.08   0.000     .6983719    .8529399
1.care_ho~ce |   3.003778    .086007    38.41   0.000      2.83985    3.177169
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3.ster
>  not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table2_onsnoncoviddeath.txt not f
> ound)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8101624   .0166417   -10.25   0.000     .7781931    .8434449
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7585471   .0156363   -13.41   0.000     .7285114    .7898211
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7928926   .0168936   -10.89   0.000     .7604636    .8267045
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8797072   .0188629    -5.98   0.000     .8435026    .9174657
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_onsnoncoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 21:04:29
-------------------------------------------------------------------------------
