-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_covidtest.log
  log type:  text
 opened on:   1 Mar 2021, 21:11:56

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   222,284     58,123 |   280,407 
             |     79.27      20.73 |    100.00 
-------------+----------------------+----------
warfarin use |    76,985     15,354 |    92,339 
             |     83.37      16.63 |    100.00 
-------------+----------------------+----------
       Total |   299,269     73,477 |   372,746 
             |     80.29      19.71 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -933329.37
Iteration 1:   log likelihood = -932916.64
Iteration 2:   log likelihood = -932915.03
Iteration 3:   log likelihood = -932915.03
Refining estimates:
Iteration 0:   log likelihood = -932915.03

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       73,477
Time at risk    =   70828897.5
                                                LR chi2(1)       =      828.68
Log likelihood  =   -932915.03                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7749194   .0070317   -28.10   0.000     .7612594    .7888244
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_univar.ster not found
> )
file /workspace/output/warfarin_tempdata/covidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -933329.37
Iteration 1:   log likelihood = -930721.06
Iteration 2:   log likelihood = -930565.22
Iteration 3:   log likelihood =  -930564.7
Iteration 4:   log likelihood =  -930564.7
Refining estimates:
Iteration 0:   log likelihood =  -930564.7

Cox regression -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       73,477
Time at risk    =   70828897.5
                                                LR chi2(5)       =     5529.34
Log likelihood  =    -930564.7                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7646822   .0069711   -29.43   0.000     .7511404    .7784681
      1.male |   1.004322    .007631     0.57   0.570     .9894759     1.01939
        age1 |   .9829973   .0012372   -13.62   0.000     .9805754    .9854253
        age2 |   1.036898   .0024389    15.40   0.000     1.032128    1.041689
        age3 |   .9872794    .015319    -0.83   0.409     .9577068    1.017765
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar1.ster not fo
> und)
file /workspace/output/warfarin_tempdata/covidtest_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -377750.32
Iteration 1:   log likelihood = -370570.67
Iteration 2:   log likelihood = -368823.34
Iteration 3:   log likelihood =  -368796.1
Iteration 4:   log likelihood = -368796.07
Refining estimates:
Iteration 0:   log likelihood = -368796.07

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       73,477
Time at risk    =   70828897.5
                                                LR chi2(27)      =    17908.50
Log likelihood  =   -368796.07                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .799822   .0075066   -23.80   0.000     .7852439    .8146707
      1.male |   .9941417   .0079411    -0.74   0.462     .9786987    1.009828
        age1 |   .9820625   .0012689   -14.01   0.000     .9795787    .9845525
        age2 |    1.03592   .0024688    14.81   0.000     1.031092     1.04077
        age3 |   .9238397   .0144851    -5.05   0.000     .8958812    .9526708
             |
         imd |
          2  |   1.022528   .0132526     1.72   0.086     .9968808    1.048836
          3  |   1.046378   .0139135     3.41   0.001     1.019461    1.074007
          4  |   1.084233   .0150782     5.82   0.000     1.055079    1.114192
5 most de..  |   1.109559   .0164856     7.00   0.000     1.077714    1.142345
             |
   obese4cat |
Obese I ..)  |    .922965   .0091407    -8.09   0.000     .9052223    .9410555
Obese II..)  |    .964995    .013813    -2.49   0.013     .9382984    .9924513
Obese II..)  |   .9951755   .0190797    -0.25   0.801     .9584738    1.033283
             |
smoke_nomiss |
     Former  |   1.106293   .0091461    12.22   0.000     1.088512    1.124365
    Current  |   1.181716   .0199994     9.87   0.000     1.143161    1.221571
             |
     diabcat |
Controlle..  |   1.092068    .010142     9.48   0.000      1.07237    1.112128
Uncontrol..  |   1.232409   .0163544    15.75   0.000     1.200769    1.264884
Diabetes,..  |   1.023674   .0656833     0.36   0.715     .9027027    1.160856
             |
1.myocardi~t |   1.148527   .0131229    12.12   0.000     1.123093    1.174538
       1.pad |   1.232801   .0185066    13.94   0.000     1.197057    1.269612
1.hyperten~n |   1.028462   .0088937     3.25   0.001     1.011177    1.046041
1.heart_f~re |   1.225578   .0101654    24.52   0.000     1.205815    1.245665
1.stroke_tia |   1.146501   .0100402    15.61   0.000      1.12699    1.166349
       1.vte |   1.241226   .0159635    16.80   0.000     1.210329    1.272912
 1.oestrogen |   1.221138   .0586125     4.16   0.000     1.111497    1.341593
1.antiplat~t |    1.20406   .0175903    12.71   0.000     1.170073    1.239035
1.flu_vac~ne |   .9981066   .0097251    -0.19   0.846     .9792266    1.017351
1.care_ho~ce |   5.653471    .086536   113.17   0.000     5.486383    5.825649
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar2.ster not fo
> und)
file /workspace/output/warfarin_tempdata/covidtest_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -377750.32
Iteration 1:   log likelihood = -368171.63
Iteration 2:   log likelihood = -365807.84
Iteration 3:   log likelihood = -365780.22
Iteration 4:   log likelihood = -365780.19
Refining estimates:
Iteration 0:   log likelihood = -365780.19

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,741                  Number of obs    =     372,741
No. of failures =       73,477
Time at risk    =   70828897.5
                                                LR chi2(34)      =    23940.27
Log likelihood  =   -365780.19                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8534771   .0080471   -16.80   0.000     .8378499    .8693958
      1.male |   1.011638   .0080827     1.45   0.148     .9959194    1.027604
        age1 |   .9833879   .0012697   -12.97   0.000     .9809025    .9858796
        age2 |   1.025534   .0024489    10.56   0.000     1.020745    1.030345
        age3 |   .9823242   .0154357    -1.13   0.256     .9525319    1.013048
             |
         imd |
          2  |   1.019967   .0132271     1.52   0.127     .9943693    1.046224
          3  |   1.037837   .0138081     2.79   0.005     1.011123    1.065256
          4  |   1.066629   .0148486     4.63   0.000     1.037919    1.096132
5 most de..  |   1.076698   .0160345     4.96   0.000     1.045725    1.108588
             |
   obese4cat |
Obese I ..)  |   .9303048    .009224    -7.29   0.000     .9124005    .9485603
Obese II..)  |   .9714771   .0139209    -2.02   0.043     .9445721    .9991484
Obese II..)  |   .9915251   .0190251    -0.44   0.657      .954929    1.029524
             |
smoke_nomiss |
     Former  |   1.059657   .0089053     6.90   0.000     1.042346    1.077256
    Current  |    1.09307   .0188828     5.15   0.000      1.05668    1.130713
             |
     diabcat |
Controlle..  |   1.076608     .01002     7.93   0.000     1.057147    1.096427
Uncontrol..  |   1.198907   .0159734    13.62   0.000     1.168005    1.230626
Diabetes,..  |   1.023956   .0656749     0.37   0.712      .902998    1.161117
             |
1.myocardi~t |   1.118702    .012794     9.81   0.000     1.093906    1.144061
       1.pad |   1.191184   .0179084    11.64   0.000     1.156597    1.226807
1.hyperten~n |   1.027093   .0089052     3.08   0.002     1.009787    1.044696
1.heart_f~re |   1.164018   .0097979    18.04   0.000     1.144972    1.183381
1.stroke_tia |   1.114685   .0097772    12.38   0.000     1.095686    1.134014
       1.vte |     1.1684    .015075    12.06   0.000     1.139224    1.198323
 1.oestrogen |   1.134896   .0546154     2.63   0.009     1.032745    1.247151
1.antiplat~t |   1.125896   .0164846     8.10   0.000     1.094046    1.158674
1.flu_vac~ne |   .9887564   .0096795    -1.16   0.248     .9699657    1.007911
             |
         ckd |
        CKD  |   1.065361   .0089919     7.50   0.000     1.047882    1.083131
      1.copd |   1.222302   .0137722    17.82   0.000     1.195604    1.249595
1.other_re~y |   1.199241   .0178018    12.24   0.000     1.164853    1.234645
1.immunode~y |   1.165294   .0514515     3.46   0.001     1.068691    1.270629
    1.cancer |   1.232358   .0114397    22.51   0.000     1.210139    1.254984
1.ae_atten~r |   1.697296   .0133213    67.41   0.000     1.671387    1.723607
1.gp_consult |   .8576377   .0223717    -5.89   0.000      .814892    .9026257
1.care_ho~ce |   5.373084   .0830831   108.74   0.000     5.212687    5.538417
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar3.ster not fo
> und)
file /workspace/output/warfarin_tempdata/covidtest_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table2_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7749194   .0070317   -28.10   0.000     .7612594    .7888244
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7646822   .0069711   -29.43   0.000     .7511404    .7784681
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .799822   .0075066   -23.80   0.000     .7852439    .8146707
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8534771   .0080471   -16.80   0.000     .8378499    .8693958
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_covidtest.log
  log type:  text
 closed on:   1 Mar 2021, 21:14:26
-------------------------------------------------------------------------------
