-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_onscoviddea
> th.log
  log type:  text
 opened on:   1 Mar 2021, 20:52:12

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(96,632 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   206,549      1,345 |   207,894 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    67,902        318 |    68,220 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   274,451      1,663 |   276,114 
             |     99.40       0.60 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20805.963
Iteration 1:   log likelihood = -20790.771
Iteration 2:   log likelihood = -20790.666
Iteration 3:   log likelihood = -20790.666
Refining estimates:
Iteration 0:   log likelihood = -20790.666

Cox regression -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     276,110
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(1)       =       30.59
Log likelihood  =   -20790.666                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7163532   .0446682    -5.35   0.000     .6339435    .8094759
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_univar_ethn.ster 
> not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20805.963
Iteration 1:   log likelihood = -20420.077
Iteration 2:   log likelihood =  -20259.42
Iteration 3:   log likelihood = -20255.013
Iteration 4:   log likelihood = -20255.005
Refining estimates:
Iteration 0:   log likelihood = -20255.005

Cox regression -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     276,110
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(5)       =     1101.92
Log likelihood  =   -20255.005                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6494653   .0406231    -6.90   0.000     .5745325    .7341711
      1.male |   1.493367   .0759418     7.89   0.000     1.351701     1.64988
        age1 |   1.043186   .0209569     2.10   0.035     1.002909     1.08508
        age2 |   1.084367   .0306156     2.87   0.004     1.025992    1.146064
        age3 |   .6657819   .0977962    -2.77   0.006     .4992289    .8879005
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar1_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar1_ethn.ster save
> d

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood = -7419.5829
Iteration 2:   log likelihood = -7142.7748
Iteration 3:   log likelihood = -7140.2494
Iteration 4:   log likelihood = -7140.1637
Iteration 5:   log likelihood = -7140.1636
Refining estimates:
Iteration 0:   log likelihood = -7140.1636

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     276,110
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(31)      =     1987.92
Log likelihood  =   -7140.1636                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7330289   .0478907    -4.75   0.000      .644926    .8331675
      1.male |   1.545954   .0845889     7.96   0.000     1.388743    1.720962
        age1 |   1.053741   .0218161     2.53   0.011     1.011838    1.097379
        age2 |   1.071556   .0310837     2.38   0.017     1.012333    1.134244
        age3 |   .6320774   .0951533    -3.05   0.002     .4705761    .8490058
             |
         imd |
          2  |    1.00895   .0978332     0.09   0.927     .8343197    1.220132
          3  |   1.224139   .1178918     2.10   0.036     1.013573    1.478449
          4  |   1.202562   .1213721     1.83   0.068     .9867283    1.465607
5 most de..  |   1.382283   .1408276     3.18   0.001     1.132077    1.687787
             |
   obese4cat |
Obese I ..)  |    1.00427   .0687344     0.06   0.950     .8781978    1.148441
Obese II..)  |   1.346359   .1308808     3.06   0.002     1.112794    1.628947
Obese II..)  |   1.202609   .1890661     1.17   0.241     .8836989    1.636608
             |
smoke_nomiss |
     Former  |   1.416706   .0832116     5.93   0.000     1.262652    1.589557
    Current  |   1.364562   .1801758     2.35   0.019     1.053419    1.767605
             |
     diabcat |
Controlle..  |   1.240448   .0736434     3.63   0.000      1.10419    1.393519
Uncontrol..  |   1.354732   .1173771     3.50   0.000      1.14315    1.605474
Diabetes,..  |    .732972   .3352157    -0.68   0.497     .2990893    1.796279
             |
1.myocardi~t |   1.338443    .089549     4.36   0.000     1.173951    1.525984
       1.pad |   1.597261   .1314414     5.69   0.000     1.359343     1.87682
1.hyperten~n |   1.012119   .0624617     0.20   0.845     .8968105    1.142253
1.heart_f~re |    1.42159   .0753092     6.64   0.000     1.281391    1.577128
1.stroke_tia |   1.253087   .0685569     4.12   0.000     1.125672    1.394925
       1.vte |    1.33535    .106296     3.63   0.000     1.142452    1.560817
 1.oestrogen |   .3540408   .2529006    -1.45   0.146     .0873007    1.435783
1.antiplat~t |   .9370519   .0955002    -0.64   0.524     .7673843    1.144233
1.flu_vac~ne |   .7397169   .0472874    -4.72   0.000     .6526064    .8384548
1.care_ho~ce |   6.792298   .4868277    26.73   0.000     5.902122    7.816734
             |
   ethnicity |
      Mixed  |   1.208575   .5173263     0.44   0.658     .5222999    2.796582
Asian or ..  |   1.389279   .2655812     1.72   0.085     .9551461    2.020734
      Black  |   1.133792   .3101333     0.46   0.646     .6632832    1.938064
      Other  |   1.324365   .4206662     0.88   0.376     .7106165    2.468199
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_ethn.ster save
> d

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood = -7420.9071
Iteration 2:   log likelihood = -7144.5206
Iteration 3:   log likelihood = -7142.0039
Iteration 4:   log likelihood = -7141.9185
Iteration 5:   log likelihood = -7141.9183
Refining estimates:
Iteration 0:   log likelihood = -7141.9183

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     276,110
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(27)      =     1984.41
Log likelihood  =   -7141.9183                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7313071   .0477571    -4.79   0.000     .6434477    .8311634
      1.male |   1.545116   .0845306     7.95   0.000     1.388013    1.720002
        age1 |   1.053102   .0217973     2.50   0.012     1.011235    1.096702
        age2 |   1.072285   .0310961     2.41   0.016     1.013038    1.134998
        age3 |   .6297337   .0947716    -3.07   0.002     .4688733    .8457818
             |
         imd |
          2  |   1.008529   .0977908     0.09   0.930     .8339742    1.219619
          3  |   1.224192   .1178884     2.10   0.036      1.01363    1.478493
          4  |   1.203647   .1214457     1.84   0.066      .987676    1.466843
5 most de..  |   1.384435   .1410102     3.19   0.001     1.133899    1.690327
             |
   obese4cat |
Obese I ..)  |   1.002879   .0686338     0.04   0.966     .8769908    1.146838
Obese II..)  |   1.342077   .1304355     3.03   0.002     1.109302    1.623698
Obese II..)  |   1.193812   .1876219     1.13   0.260     .8773225    1.624473
             |
smoke_nomiss |
     Former  |   1.404696   .0821562     5.81   0.000     1.252559    1.575311
    Current  |   1.352518   .1784365     2.29   0.022     1.044347    1.751626
             |
     diabcat |
Controlle..  |   1.248015   .0739144     3.74   0.000     1.111237    1.401628
Uncontrol..  |   1.370196   .1182901     3.65   0.000     1.156905    1.622809
Diabetes,..  |   .7356718   .3364367    -0.67   0.502     .3002019     1.80283
             |
1.myocardi~t |   1.344715   .0898695     4.43   0.000     1.179622    1.532912
       1.pad |   1.593463    .131087     5.66   0.000      1.35618    1.872261
1.hyperten~n |   1.012452   .0624652     0.20   0.841     .8971355    1.142592
1.heart_f~re |   1.423112    .075366     6.66   0.000     1.282805    1.578765
1.stroke_tia |   1.254002   .0686074     4.14   0.000     1.126492    1.395944
       1.vte |   1.332068   .1060177     3.60   0.000     1.139673    1.556942
 1.oestrogen |   .3526278   .2518785    -1.46   0.144     .0869585    1.429951
1.antiplat~t |   .9401232   .0957953    -0.61   0.545     .7699283     1.14794
1.flu_vac~ne |   .7405458   .0473241    -4.70   0.000     .6533658    .8393584
1.care_ho~ce |   6.773582   .4854383    26.69   0.000      5.88594    7.795087
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_without
> ethn.ster not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_withoutethn.st
> er saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood =  -7287.584
Iteration 2:   log likelihood = -6986.3616
Iteration 3:   log likelihood = -6983.8026
Iteration 4:   log likelihood = -6983.7244
Iteration 5:   log likelihood = -6983.7243
Refining estimates:
Iteration 0:   log likelihood = -6983.7243

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     276,110
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(38)      =     2300.80
Log likelihood  =   -6983.7243                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8112082   .0533372    -3.18   0.001     .7131248    .9227821
      1.male |   1.579609   .0865286     8.35   0.000     1.418803    1.758641
        age1 |   1.054424   .0218072     2.56   0.010     1.012538    1.098044
        age2 |   1.052771   .0305237     1.77   0.076     .9946138    1.114329
        age3 |   .7040727   .1060933    -2.33   0.020     .5240274    .9459778
             |
         imd |
          2  |   1.007703   .0979996     0.08   0.937     .8328235    1.219305
          3  |   1.206593   .1164624     1.95   0.052     .9986228    1.457875
          4  |   1.156346   .1172027     1.43   0.152     .9480113    1.410465
5 most de..  |   1.301993   .1331916     2.58   0.010     1.065448    1.591054
             |
   obese4cat |
Obese I ..)  |   1.013194   .0696606     0.19   0.849     .8854611    1.159353
Obese II..)  |   1.351841   .1318014     3.09   0.002     1.116697      1.6365
Obese II..)  |    1.15984   .1832169     0.94   0.348     .8510131    1.580739
             |
smoke_nomiss |
     Former  |    1.31305   .0786083     4.55   0.000     1.167676    1.476523
    Current  |   1.195678   .1611417     1.33   0.185     .9181159    1.557151
             |
     diabcat |
Controlle..  |   1.207361   .0721345     3.15   0.002     1.073944    1.357353
Uncontrol..  |   1.238578   .1084363     2.44   0.015     1.043282    1.470433
Diabetes,..  |   .7424742   .3394897    -0.65   0.515      .303024    1.819222
             |
1.myocardi~t |   1.274498   .0853562     3.62   0.000     1.117718    1.453269
       1.pad |   1.494763   .1234806     4.87   0.000     1.271323    1.757475
1.hyperten~n |   .9870938    .061292    -0.21   0.834     .8739859     1.11484
1.heart_f~re |   1.263724   .0681567     4.34   0.000     1.136957    1.404625
1.stroke_tia |   1.197643   .0657223     3.29   0.001     1.075515    1.333639
       1.vte |   1.232428   .0985697     2.61   0.009     1.053616    1.441587
 1.oestrogen |   .3563774   .2548447    -1.44   0.149     .0877441    1.447447
1.antiplat~t |   .8588358   .0877657    -1.49   0.136     .7029502     1.04929
1.flu_vac~ne |   .7360325   .0473729    -4.76   0.000      .648801    .8349923
             |
         ckd |
        CKD  |   1.337026   .0730665     5.31   0.000     1.201221    1.488184
      1.copd |    1.32845   .0920206     4.10   0.000       1.1598    1.521623
1.other_re~y |   1.445184   .1200518     4.43   0.000     1.228043    1.700719
1.immunode~y |   1.746864   .4686592     2.08   0.038     1.032508    2.955456
    1.cancer |   .9942473   .0634225    -0.09   0.928     .8773982    1.126658
1.ae_atten~r |   2.173181   .1177421    14.33   0.000     1.954241     2.41665
1.gp_consult |   .7528063   .1039127    -2.06   0.040     .5743659    .9866835
1.care_ho~ce |   6.290233    .459459    25.18   0.000     5.451201    7.258406
             |
   ethnicity |
      Mixed  |   1.202002   .5131121     0.43   0.666     .5206472    2.775027
Asian or ..  |   1.372446   .2639513     1.65   0.100     .9414353    2.000782
      Black  |   1.109699   .3055164     0.38   0.705     .6469295    1.903503
      Other  |   1.273273   .4081127     0.75   0.451     .6793478    2.386442
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_ethn.ster save
> d

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8134.1256
Iteration 1:   log likelihood = -7288.8027
Iteration 2:   log likelihood = -6987.8987
Iteration 3:   log likelihood = -6985.3553
Iteration 4:   log likelihood = -6985.2776
Iteration 5:   log likelihood = -6985.2774
Refining estimates:
Iteration 0:   log likelihood = -6985.2774

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,110                  Number of obs    =     276,110
No. of failures =        1,663
Time at risk    =     56677695
                                                LR chi2(34)      =     2297.70
Log likelihood  =   -6985.2774                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8095163   .0532029    -3.22   0.001     .7116772    .9208059
      1.male |   1.579242   .0864896     8.34   0.000     1.418507    1.758191
        age1 |   1.053891   .0217997     2.54   0.011     1.012019    1.097495
        age2 |    1.05328   .0305434     1.79   0.073     .9950852    1.114878
        age3 |   .7022945   .1058341    -2.35   0.019     .5226912    .9436117
             |
         imd |
          2  |   1.007047   .0979338     0.07   0.942     .8322839    1.218506
          3  |   1.206255   .1164183     1.94   0.052     .9983615    1.457439
          4  |   1.156816   .1172168     1.44   0.151     .9484503    1.410958
5 most de..  |   1.303072   .1332722     2.59   0.010     1.066379    1.592302
             |
   obese4cat |
Obese I ..)  |   1.011802   .0695619     0.17   0.864     .8842493    1.157753
Obese II..)  |   1.347665   .1313622     3.06   0.002       1.1133    1.631368
Obese II..)  |    1.15231   .1819615     0.90   0.369     .8455828    1.570301
             |
smoke_nomiss |
     Former  |   1.302734   .0776928     4.43   0.000     1.159022    1.464266
    Current  |   1.186046   .1597278     1.27   0.205     .9108949    1.544312
             |
     diabcat |
Controlle..  |   1.213551   .0723583     3.25   0.001     1.079705     1.36399
Uncontrol..  |   1.252538   .1092208     2.58   0.010     1.055764    1.485989
Diabetes,..  |   .7436719   .3400523    -0.65   0.517     .3035008    1.822228
             |
1.myocardi~t |   1.279833   .0856315     3.69   0.000     1.122538     1.45917
       1.pad |   1.492156    .123208     4.85   0.000       1.2692    1.754277
1.hyperten~n |   .9875564   .0613026    -0.20   0.840     .8744269    1.115322
1.heart_f~re |   1.265289   .0682099     4.36   0.000     1.138421    1.406296
1.stroke_tia |   1.198804   .0657782     3.30   0.001     1.076571    1.334915
       1.vte |   1.229816   .0983421     2.59   0.010     1.051415    1.438489
 1.oestrogen |   .3551423   .2539491    -1.45   0.148     .0874459    1.442331
1.antiplat~t |   .8616299   .0880358    -1.46   0.145     .7052621    1.052667
1.flu_vac~ne |   .7370942    .047424    -4.74   0.000     .6497667    .8361585
             |
         ckd |
        CKD  |   1.337943   .0731084     5.33   0.000     1.202059    1.489187
      1.copd |   1.327661   .0919651     4.09   0.000     1.159112    1.520717
1.other_re~y |   1.444893   .1200233     4.43   0.000     1.227803    1.700367
1.immunode~y |   1.742649    .467555     2.07   0.038     1.029987    2.948414
    1.cancer |   .9915136   .0632173    -0.13   0.894      .875039    1.123492
1.ae_atten~r |   2.175338   .1178515    14.35   0.000     1.956194    2.419032
1.gp_consult |   .7540076   .1040702    -2.05   0.041     .5752949    .9882366
1.care_ho~ce |   6.272886   .4580415    25.15   0.000     5.436424    7.238049
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_without
> ethn.ster not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_withoutethn.st
> er saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table3_onscoviddeath.txt not foun
> d)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    207,894    4.26e+07           0   4.26e+07   4.26e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,220    1.41e+07           0   1.41e+07   1.41e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7163532   .0446682    -5.35   0.000     .6339435    .8094759
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6494653   .0406231    -6.90   0.000     .5745325    .7341711
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7330289   .0478907    -4.75   0.000      .644926    .8331675
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7313071   .0477571    -4.79   0.000     .6434477    .8311634
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8112082   .0533372    -3.18   0.001     .7131248    .9227821
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8095163   .0532029    -3.22   0.001     .7116772    .9208059
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_onscoviddea
> th.log
  log type:  text
 closed on:   1 Mar 2021, 20:55:00
-------------------------------------------------------------------------------
