-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/08b_an_model_checks_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:00:04

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.03249        34.64        1         0.0000
      ------------+---------------------------------------------------
      global test |                     34.64        1         0.0000
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
0

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot1.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot1.svg written in SV
> G format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -418579.63
Iteration 1:   log likelihood = -417056.27
Iteration 2:   log likelihood = -416950.91
Iteration 3:   log likelihood = -416950.43
Iteration 4:   log likelihood = -416950.43
Refining estimates:
Iteration 0:   log likelihood = -416950.43

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(5)       =     3258.38
Log likelihood  =   -416950.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7753066   .0105488   -18.70   0.000     .7549046    .7962599
      1.male |   1.014252   .0115197     1.25   0.213     .9919234    1.037083
        age1 |   .9874289   .0020131    -6.21   0.000     .9834911    .9913825
        age2 |   1.044968   .0038546    11.92   0.000      1.03744     1.05255
        age3 |   .9186611   .0217632    -3.58   0.000      .876981     .962322
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.03415        38.24        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |     -0.00361         0.43        1         0.5122
      age1        |      0.01617         8.19        1         0.0042
      age2        |     -0.02562        20.80        1         0.0000
      age3        |      0.00548         0.97        1         0.3252
      ------------+---------------------------------------------------
      global test |                    514.39        5         0.0000
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot2.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot2.svg written in SV
> G format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist ,strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -170200.5
Iteration 1:   log likelihood = -166348.85
Iteration 2:   log likelihood = -165852.72
Iteration 3:   log likelihood = -165851.86
Iteration 4:   log likelihood = -165851.86
Refining estimates:
Iteration 0:   log likelihood = -165851.86

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(27)      =     8697.29
Log likelihood  =   -165851.86                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .791474   .0110756   -16.71   0.000     .7700612    .8134822
      1.male |   1.008314   .0120537     0.69   0.489     .9849634    1.032218
        age1 |   .9869987   .0020665    -6.25   0.000     .9829569    .9910572
        age2 |   1.044352   .0039087    11.59   0.000     1.036719    1.052041
        age3 |   .8684832   .0208087    -5.89   0.000     .8286418    .9102402
             |
         imd |
          2  |   1.023435   .0201735     1.18   0.240       .98465    1.063748
          3  |   1.045709   .0209903     2.23   0.026     1.005367    1.087669
          4  |   1.077725   .0226106     3.57   0.000     1.034308    1.122965
5 most de..  |   1.179541   .0257579     7.56   0.000     1.130122    1.231122
             |
   obese4cat |
Obese I ..)  |   .9105797     .01357    -6.29   0.000     .8843677    .9375687
Obese II..)  |   .9929419   .0212273    -0.33   0.740     .9521967    1.035431
Obese II..)  |   1.003647   .0290936     0.13   0.900     .9482146    1.062321
             |
smoke_nomiss |
     Former  |   1.107897   .0137421     8.26   0.000     1.081288    1.135161
    Current  |   1.188085   .0304714     6.72   0.000     1.129838    1.249334
             |
     diabcat |
Controlle..  |   1.125274   .0154564     8.59   0.000     1.095385     1.15598
Uncontrol..  |   1.320761   .0254155    14.46   0.000     1.271875    1.371525
Diabetes,..  |   1.016458   .1109241     0.15   0.881     .8207284    1.258866
             |
1.myocardi~t |   1.151474   .0192108     8.45   0.000      1.11443    1.189748
       1.pad |   1.327182   .0280582    13.39   0.000     1.273313    1.383331
1.hyperten~n |   1.020068   .0132992     1.52   0.128     .9943322     1.04647
1.heart_f~re |   1.270075   .0155381    19.54   0.000     1.239983    1.300897
1.stroke_tia |   1.162855   .0149901    11.70   0.000     1.133843    1.192609
       1.vte |   1.251139   .0237667    11.79   0.000     1.205414    1.298599
 1.oestrogen |    1.19566   .0923526     2.31   0.021     1.027687    1.391087
1.antiplat~t |   1.213723   .0264603     8.88   0.000     1.162954    1.266708
1.flu_vac~ne |   .9695667   .0141842    -2.11   0.035     .9421609    .9977696
1.care_ho~ce |     4.0266   .0872195    64.31   0.000     3.859231    4.201228
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00947         2.95        1         0.0860
      0b.male     |            .            .        1             .
      1.male      |     -0.01865        11.61        1         0.0007
      age1        |      0.00816         2.12        1         0.1452
      age2        |     -0.02241        16.05        1         0.0001
      age3        |      0.01443         6.74        1         0.0094
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00168         0.09        1         0.7603
      3.imd       |     -0.00999         3.30        1         0.0693
      4.imd       |     -0.01029         3.49        1         0.0617
      5.imd       |     -0.01383         6.24        1         0.0125
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00598         1.18        1         0.2775
      3.obese4cat |     -0.01022         3.44        1         0.0635
      4.obese4cat |     -0.02472        20.14        1         0.0000
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01003         3.29        1         0.0698
      3.smoke_no~s|     -0.01600         8.45        1         0.0036
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00734         1.78        1         0.1822
      3.diabcat   |     -0.02470        20.04        1         0.0000
      4.diabcat   |      0.00893         2.64        1         0.1043
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00481         0.77        1         0.3804
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00687         1.56        1         0.2110
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|     -0.00133         0.06        1         0.8093
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.02025        13.56        1         0.0002
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02107        14.68        1         0.0001
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00624         1.28        1         0.2575
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00649         1.39        1         0.2389
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.01017         3.43        1         0.0639
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.02531        21.14        1         0.0000
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|     -0.11830       482.09        1         0.0000
      ------------+---------------------------------------------------
      global test |                   1028.73       27         0.0000
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot3.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot3.svg written in SV
> G format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -170200.5
Iteration 1:   log likelihood = -165049.35
Iteration 2:   log likelihood = -164232.54
Iteration 3:   log likelihood =  -164231.3
Iteration 4:   log likelihood =  -164231.3
Refining estimates:
Iteration 0:   log likelihood =  -164231.3

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(34)      =    11938.40
Log likelihood  =    -164231.3                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8485411   .0119271   -11.68   0.000     .8254835    .8722429
      1.male |   1.027522   .0122862     2.27   0.023     1.003722    1.051887
        age1 |   .9882108   .0020639    -5.68   0.000     .9841739    .9922642
        age2 |   1.032901   .0038669     8.65   0.000      1.02535    1.040508
        age3 |   .9291243   .0222901    -3.06   0.002     .8864476    .9738555
             |
         imd |
          2  |   1.020874   .0201309     1.05   0.295     .9821713    1.061103
          3  |   1.035592   .0207955     1.74   0.082     .9956255    1.077163
          4  |   1.058226   .0222256     2.69   0.007     1.015549    1.102696
5 most de..  |   1.139127    .024929     5.95   0.000       1.0913     1.18905
             |
   obese4cat |
Obese I ..)  |   .9188542   .0137084    -5.67   0.000     .8923752    .9461189
Obese II..)  |   .9962068   .0213212    -0.18   0.859     .9552823    1.038885
Obese II..)  |   1.001795   .0290686     0.06   0.951     .9464119     1.06042
             |
smoke_nomiss |
     Former  |   1.056647   .0133288     4.37   0.000     1.030843    1.083097
    Current  |   1.091695   .0286013     3.35   0.001     1.037052    1.149217
             |
     diabcat |
Controlle..  |   1.107374   .0152466     7.41   0.000     1.077891    1.137664
Uncontrol..  |   1.277603   .0246921    12.68   0.000     1.230112    1.326926
Diabetes,..  |   1.015121   .1107043     0.14   0.891     .8197662    1.257031
             |
1.myocardi~t |   1.121093   .0187166     6.85   0.000     1.085003    1.158384
       1.pad |   1.277026   .0270466    11.55   0.000     1.225101    1.331152
1.hyperten~n |   1.019163   .0133254     1.45   0.147     .9933775    1.045618
1.heart_f~re |   1.195812   .0148678    14.38   0.000     1.167024     1.22531
1.stroke_tia |     1.1288   .0145726     9.38   0.000     1.100596    1.157726
       1.vte |   1.167655   .0222623     8.13   0.000     1.124827    1.212114
 1.oestrogen |   1.115758   .0863614     1.42   0.157     .9587069    1.298537
1.antiplat~t |   1.128578   .0246513     5.54   0.000     1.081282    1.177943
1.flu_vac~ne |   .9612219   .0141231    -2.69   0.007     .9339358    .9893051
             |
         ckd |
        CKD  |   1.088838   .0135524     6.84   0.000     1.062597    1.115727
      1.copd |   1.217676   .0202423    11.85   0.000     1.178641    1.258004
1.other_re~y |   1.259699    .027079    10.74   0.000     1.207727    1.313906
1.immunode~y |   1.260025   .0790297     3.69   0.000     1.114272    1.424843
    1.cancer |   1.242053   .0170776    15.77   0.000     1.209028    1.275979
1.ae_atten~r |   1.798132   .0214381    49.21   0.000     1.756601    1.840645
1.gp_consult |   .8225537   .0314523    -5.11   0.000     .7631616    .8865679
1.care_ho~ce |   3.815076    .083534    61.15   0.000     3.654816    3.982363
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00350         0.40        1         0.5259
      0b.male     |            .            .        1             .
      1.male      |     -0.01909        12.10        1         0.0005
      age1        |      0.00675         1.44        1         0.2303
      age2        |     -0.01910        11.60        1         0.0007
      age3        |      0.01125         4.08        1         0.0433
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00091         0.03        1         0.8689
      3.imd       |     -0.00904         2.70        1         0.1002
      4.imd       |     -0.00802         2.12        1         0.1451
      5.imd       |     -0.01060         3.67        1         0.0554
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00501         0.83        1         0.3627
      3.obese4cat |     -0.01034         3.52        1         0.0606
      4.obese4cat |     -0.02432        19.51        1         0.0000
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00437         0.62        1         0.4293
      3.smoke_no~s|     -0.01003         3.31        1         0.0687
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00628         1.30        1         0.2537
      3.diabcat   |     -0.02226        16.29        1         0.0001
      4.diabcat   |      0.00915         2.76        1         0.0967
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00232         0.18        1         0.6724
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00486         0.78        1         0.3772
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|     -0.00139         0.06        1         0.8009
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.01355         6.07        1         0.0137
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01836        11.14        1         0.0008
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00256         0.22        1         0.6418
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00663         1.44        1         0.2294
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.01400         6.50        1         0.0108
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.02374        18.68        1         0.0000
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.00414         0.57        1         0.4499
      0b.copd     |            .            .        1             .
      1.copd      |     -0.01527         7.77        1         0.0053
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.01455         7.06        1         0.0079
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.01071         3.76        1         0.0524
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.01589         8.34        1         0.0039
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.05602       103.35        1         0.0000
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.01255         5.32        1         0.0210
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|     -0.11280       439.22        1         0.0000
      ------------+---------------------------------------------------
      global test |                   1165.51       34         0.0000
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot4.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot4.svg written in SV
> G format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table5_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02946        21.11        1         0.0000
      ------------+---------------------------------------------------
      global test |                     21.11        1         0.0000
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
0

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot1_completecas
> e.svg not found)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot1_completecase.svg 
> written in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302768.67
Iteration 1:   log likelihood = -301658.57
Iteration 2:   log likelihood = -301582.47
Iteration 3:   log likelihood = -301582.11
Iteration 4:   log likelihood = -301582.11
Refining estimates:
Iteration 0:   log likelihood = -301582.11

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(5)       =     2373.10
Log likelihood  =   -301582.11                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7702259   .0122085   -16.47   0.000     .7466655    .7945297
      1.male |   1.008142   .0132918     0.62   0.539     .9824238    1.034533
        age1 |   .9866547   .0022747    -5.83   0.000     .9822065    .9911231
        age2 |   1.047051   .0044125    10.91   0.000     1.038438    1.055735
        age3 |   .9050856   .0247659    -3.64   0.000      .857824    .9549511
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.03130        23.82        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |     -0.00733         1.31        1         0.2521
      age1        |      0.01739         6.94        1         0.0084
      age2        |     -0.02480        14.30        1         0.0002
      age3        |      0.00306         0.22        1         0.6378
      ------------+---------------------------------------------------
      global test |                    365.03        5         0.0000
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot2_completecas
> e.svg not found)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot2_completecase.svg 
> written in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302768.67
Iteration 1:   log likelihood = -299929.29
Iteration 2:   log likelihood =  -299451.2
Iteration 3:   log likelihood = -299448.44
Iteration 4:   log likelihood = -299448.44
Refining estimates:
Iteration 0:   log likelihood = -299448.44

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(31)      =     6640.46
Log likelihood  =   -299448.44                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8028321    .012827   -13.75   0.000     .7780813    .8283703
      1.male |   .9946512   .0137155    -0.39   0.697     .9681293      1.0219
        age1 |   .9872552   .0023352    -5.42   0.000     .9826888    .9918428
        age2 |   1.044315    .004454    10.17   0.000     1.035622    1.053081
        age3 |    .855692   .0235826    -5.65   0.000     .8106971    .9031843
             |
         imd |
          2  |   1.011098   .0216875     0.51   0.607     .9694721     1.05451
          3  |   1.025227   .0217246     1.18   0.240     .9835199    1.068703
          4  |   1.104424   .0230808     4.75   0.000     1.060101    1.150601
5 most de..  |   1.208024    .024696     9.24   0.000     1.160578     1.25741
             |
   obese4cat |
Obese I ..)  |   .9070223    .015537    -5.70   0.000     .8770759    .9379912
Obese II..)  |   1.010204   .0245668     0.42   0.676     .9631833     1.05952
Obese II..)  |    1.01793   .0337125     0.54   0.592     .9539541    1.086197
             |
smoke_nomiss |
     Former  |   1.103201   .0157864     6.86   0.000      1.07269    1.134579
    Current  |   1.187321     .03465     5.88   0.000     1.121314    1.257213
             |
     diabcat |
Controlle..  |    1.14185    .017652     8.58   0.000     1.107771    1.176976
Uncontrol..  |   1.350404   .0295779    13.72   0.000     1.293659    1.409638
Diabetes,..  |   .8881586    .110444    -0.95   0.340     .6960529    1.133284
             |
1.myocardi~t |   1.158613   .0221882     7.69   0.000     1.115931    1.202927
       1.pad |   1.362808   .0329399    12.81   0.000     1.299753    1.428923
1.hyperten~n |   1.013809   .0152799     0.91   0.363     .9842989    1.044204
1.heart_f~re |   1.271847   .0177855    17.20   0.000     1.237462    1.307188
1.stroke_tia |   1.187076   .0176194    11.55   0.000      1.15304    1.222117
       1.vte |   1.226098   .0269172     9.28   0.000      1.17446    1.280006
 1.oestrogen |   1.161797   .1014131     1.72   0.086     .9791039    1.378578
1.antiplat~t |   1.146881   .0288248     5.45   0.000     1.091755    1.204791
1.flu_vac~ne |   .9613153   .0163005    -2.33   0.020     .9298919    .9938006
1.care_ho~ce |   4.005754   .0973238    57.12   0.000     3.819474     4.20112
             |
   ethnicity |
      Mixed  |   1.036197   .1351881     0.27   0.785     .8023979    1.338119
Asian or ..  |    1.19749   .0549687     3.93   0.000     1.094458    1.310222
      Black  |   1.138964    .089467     1.66   0.098     .9764432    1.328535
      Other  |   1.271296   .1039742     2.93   0.003     1.083004    1.492323
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.01481         5.33        1         0.0210
      0b.male     |            .            .        1             .
      1.male      |     -0.02041        10.35        1         0.0013
      age1        |      0.01152         3.13        1         0.0770
      age2        |     -0.02368        13.22        1         0.0003
      age3        |      0.01385         4.59        1         0.0321
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00062         0.01        1         0.9226
      3.imd       |     -0.00315         0.24        1         0.6228
      4.imd       |     -0.00177         0.08        1         0.7828
      5.imd       |     -0.02262        12.51        1         0.0004
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00789         1.52        1         0.2175
      3.obese4cat |     -0.00537         0.70        1         0.4013
      4.obese4cat |     -0.01971         9.50        1         0.0021
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00875         1.85        1         0.1735
      3.smoke_no~s|     -0.01916         8.96        1         0.0028
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01620         6.38        1         0.0115
      3.diabcat   |     -0.02291        12.77        1         0.0004
      4.diabcat   |      0.00073         0.01        1         0.9092
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00888         1.95        1         0.1621
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00849         1.76        1         0.1850
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|     -0.00424         0.44        1         0.5078
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.01773         7.66        1         0.0056
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01822         8.11        1         0.0044
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00979         2.33        1         0.1265
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.01002         2.45        1         0.1178
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00156         0.06        1         0.8063
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.03538        30.65        1         0.0000
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|     -0.12624       405.71        1         0.0000
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00764         1.42        1         0.2333
      3.ethnicity |     -0.01454         5.14        1         0.0234
      4.ethnicity |     -0.00832         1.68        1         0.1945
      5.ethnicity |     -0.00639         0.99        1         0.3187
      ------------+---------------------------------------------------
      global test |                    892.46       31         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot3_completecas
> e_ethn.svg not found)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot3_completecase_ethn
> .svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302768.67
Iteration 1:   log likelihood = -299939.27
Iteration 2:   log likelihood = -299463.41
Iteration 3:   log likelihood = -299460.69
Iteration 4:   log likelihood = -299460.68
Refining estimates:
Iteration 0:   log likelihood = -299460.68

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(27)      =     6615.96
Log likelihood  =   -299460.68                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8010802   .0127928   -13.89   0.000     .7763951    .8265502
      1.male |   .9938895   .0137037    -0.44   0.657     .9673904    1.021114
        age1 |   .9868049   .0023319    -5.62   0.000     .9822451    .9913859
        age2 |   1.044727   .0044548    10.26   0.000     1.036032    1.053494
        age3 |   .8542322   .0235434    -5.72   0.000     .8093122    .9016454
             |
         imd |
          2  |   1.011556   .0216966     0.54   0.592     .9699132    1.054987
          3  |    1.02704   .0217582     1.26   0.208     .9852684    1.070584
          4  |   1.108921    .023149     4.95   0.000     1.064465    1.155233
5 most de..  |   1.216227   .0247831     9.61   0.000      1.16861    1.265784
             |
   obese4cat |
Obese I ..)  |   .9050501   .0154985    -5.83   0.000     .8751778    .9359421
Obese II..)  |   1.006232   .0244578     0.26   0.798     .9594196    1.055329
Obese II..)  |   1.011648    .033481     0.35   0.726     .9481095    1.079445
             |
smoke_nomiss |
     Former  |   1.096689   .0156154     6.48   0.000     1.066506    1.127726
    Current  |   1.178856    .034341     5.65   0.000     1.113434    1.248122
             |
     diabcat |
Controlle..  |   1.150552   .0176816     9.13   0.000     1.116413    1.185735
Uncontrol..  |   1.360096   .0297059    14.08   0.000     1.303102    1.419582
Diabetes,..  |   .8956002   .1113557    -0.89   0.375     .7019058    1.142745
             |
1.myocardi~t |   1.160469   .0222152     7.77   0.000     1.117735    1.204837
       1.pad |   1.359627   .0328578    12.71   0.000     1.296728    1.425576
1.hyperten~n |   1.015885   .0153026     1.05   0.295     .9863308    1.046325
1.heart_f~re |   1.272288   .0177907    17.22   0.000     1.237893     1.30764
1.stroke_tia |   1.187914   .0176306    11.60   0.000     1.153856    1.222977
       1.vte |   1.224527   .0268788     9.23   0.000     1.172963    1.278358
 1.oestrogen |    1.15996   .1012531     1.70   0.089     .9775553    1.376399
1.antiplat~t |   1.151163   .0289183     5.60   0.000     1.095857     1.20926
1.flu_vac~ne |   .9606928   .0162882    -2.37   0.018     .9292931    .9931535
1.care_ho~ce |   3.990634   .0968905    57.00   0.000     3.805179    4.185127
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.01541         5.77        1         0.0163
      0b.male     |            .            .        1             .
      1.male      |     -0.02024        10.18        1         0.0014
      age1        |      0.01242         3.63        1         0.0566
      age2        |     -0.02413        13.73        1         0.0002
      age3        |      0.01414         4.79        1         0.0287
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00073         0.01        1         0.9089
      3.imd       |     -0.00350         0.30        1         0.5850
      4.imd       |     -0.00259         0.16        1         0.6865
      5.imd       |     -0.02410        14.20        1         0.0002
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00837         1.71        1         0.1912
      3.obese4cat |     -0.00478         0.56        1         0.4544
      4.obese4cat |     -0.01909         8.91        1         0.0028
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00711         1.23        1         0.2680
      3.smoke_no~s|     -0.01813         8.04        1         0.0046
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01818         8.03        1         0.0046
      3.diabcat   |     -0.02431        14.35        1         0.0002
      4.diabcat   |      0.00047         0.01        1         0.9410
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00923         2.11        1         0.1460
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00812         1.61        1         0.2044
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|     -0.00477         0.55        1         0.4565
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.01781         7.72        1         0.0055
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01844         8.31        1         0.0039
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00956         2.23        1         0.1355
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00998         2.42        1         0.1195
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00099         0.02        1         0.8764
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.03552        30.91        1         0.0000
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|     -0.12563       401.64        1         0.0000
      ------------+---------------------------------------------------
      global test |                    883.03       27         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot3_completecas
> e.svg not found)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot3_completecase.svg 
> written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(pract
> ice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -118898.9
Iteration 1:   log likelihood =  -115105.8
Iteration 2:   log likelihood = -114517.26
Iteration 3:   log likelihood = -114516.52
Iteration 4:   log likelihood = -114516.52
Refining estimates:
Iteration 0:   log likelihood = -114516.52

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(38)      =     8764.76
Log likelihood  =   -114516.52                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8509642   .0139683    -9.83   0.000     .8240226    .8787866
      1.male |   1.029835   .0143232     2.11   0.035     1.002141    1.058294
        age1 |   .9881681    .002351    -5.00   0.000      .983571    .9927867
        age2 |   1.034159    .004448     7.81   0.000     1.025478    1.042914
        age3 |    .916898   .0255336    -3.12   0.002     .8681943    .9683339
             |
         imd |
          2  |    1.03524   .0243118     1.47   0.140     .9886694    1.084004
          3  |   1.040398   .0249153     1.65   0.098     .9926931    1.090395
          4  |    1.05895   .0263124     2.31   0.021     1.008615    1.111798
5 most de..  |   1.136079   .0291761     4.97   0.000      1.08031    1.194727
             |
   obese4cat |
Obese I ..)  |   .9163637   .0158367    -5.05   0.000     .8858441    .9479349
Obese II..)  |   1.024222   .0251236     0.98   0.329     .9761452    1.074666
Obese II..)  |   1.015977    .033916     0.47   0.635     .9516308    1.084674
             |
smoke_nomiss |
     Former  |   1.049005    .015515     3.23   0.001     1.019033    1.079859
    Current  |   1.101896   .0332329     3.22   0.001     1.038648    1.168995
             |
     diabcat |
Controlle..  |   1.106357   .0177066     6.32   0.000     1.072191    1.141611
Uncontrol..  |   1.272427   .0283543    10.81   0.000      1.21805    1.329232
Diabetes,..  |    1.07272   .1355972     0.56   0.579      .837318    1.374304
             |
1.myocardi~t |   1.117832   .0216506     5.75   0.000     1.076193    1.161082
       1.pad |   1.285522   .0315844    10.22   0.000     1.225085    1.348941
1.hyperten~n |   1.016558   .0156096     1.07   0.285     .9864192    1.047617
1.heart_f~re |   1.190965    .017251    12.07   0.000     1.157629    1.225261
1.stroke_tia |   1.140833   .0171384     8.77   0.000     1.107732    1.174923
       1.vte |   1.156519   .0257416     6.53   0.000     1.107151    1.208088
 1.oestrogen |   1.136668   .1003564     1.45   0.147     .9560511    1.351407
1.antiplat~t |   1.102133   .0281046     3.81   0.000     1.048402    1.158616
1.flu_vac~ne |   .9487613    .016404    -3.04   0.002     .9171486    .9814636
             |
         ckd |
        CKD  |   1.091275   .0158673     6.01   0.000     1.060614    1.122822
      1.copd |   1.215877   .0232257    10.23   0.000     1.171197    1.262261
1.other_re~y |   1.266717   .0312565     9.58   0.000     1.206914    1.329485
1.immunode~y |   1.250738   .0907834     3.08   0.002     1.084883    1.441949
    1.cancer |   1.218202   .0196918    12.21   0.000     1.180211    1.257415
1.ae_atten~r |   1.811776    .025169    42.78   0.000     1.763112    1.861784
1.gp_consult |   .8218091   .0373723    -4.32   0.000     .7517303     .898421
1.care_ho~ce |    3.79953   .0977245    51.90   0.000     3.612741    3.995977
             |
   ethnicity |
      Mixed  |   1.030175   .1372037     0.22   0.823      .793494    1.337451
Asian or ..  |   1.300472   .0731703     4.67   0.000     1.164686     1.45209
      Black  |    1.22628   .1023308     2.44   0.015     1.041258    1.444178
      Other  |   1.092259    .097763     0.99   0.324      .916513    1.301706
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00141         0.05        1         0.8257
      0b.male     |            .            .        1             .
      1.male      |     -0.02194        11.89        1         0.0006
      age1        |      0.00428         0.43        1         0.5122
      age2        |     -0.01487         5.21        1         0.0225
      age3        |      0.00653         1.02        1         0.3126
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00213         0.11        1         0.7399
      3.imd       |     -0.00701         1.20        1         0.2727
      4.imd       |     -0.00732         1.31        1         0.2529
      5.imd       |     -0.00983         2.35        1         0.1256
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00629         0.97        1         0.3253
      3.obese4cat |     -0.00390         0.37        1         0.5427
      4.obese4cat |     -0.01936         9.17        1         0.0025
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00618         0.93        1         0.3356
      3.smoke_no~s|     -0.01561         5.96        1         0.0146
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01094         2.94        1         0.0865
      3.diabcat   |     -0.01897         8.77        1         0.0031
      4.diabcat   |      0.00602         0.89        1         0.3462
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00466         0.54        1         0.4625
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00395         0.38        1         0.5362
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00012         0.00        1         0.9854
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00754         1.39        1         0.2380
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01676         6.88        1         0.0087
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00549         0.74        1         0.3909
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00770         1.45        1         0.2288
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00970         2.32        1         0.1274
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.03119        24.04        1         0.0000
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.00376         0.35        1         0.5533
      0b.copd     |            .            .        1             .
      1.copd      |     -0.00979         2.36        1         0.1243
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00820         1.66        1         0.1972
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.01518         5.59        1         0.0181
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.01203         3.55        1         0.0596
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.06151        92.09        1         0.0000
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.00767         1.47        1         0.2252
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|     -0.11396       334.18        1         0.0000
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.00050         0.01        1         0.9382
      3.ethnicity |     -0.00418         0.42        1         0.5151
      4.ethnicity |      0.00324         0.26        1         0.6076
      5.ethnicity |     -0.00363         0.32        1         0.5739
      ------------+---------------------------------------------------
      global test |                    851.47       38         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot4_completecas
> e_ethn.svg not found)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot4_completecase_ethn
> .svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -118898.9
Iteration 1:   log likelihood = -115115.61
Iteration 2:   log likelihood = -114529.83
Iteration 3:   log likelihood =  -114529.1
Iteration 4:   log likelihood =  -114529.1
Refining estimates:
Iteration 0:   log likelihood =  -114529.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(34)      =     8739.61
Log likelihood  =    -114529.1                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8499624     .01395    -9.90   0.000     .8230559    .8777485
      1.male |   1.029398   .0143164     2.08   0.037     1.001718    1.057844
        age1 |   .9878451   .0023493    -5.14   0.000     .9832513    .9924603
        age2 |   1.034448   .0044493     7.87   0.000     1.025764    1.043206
        age3 |   .9155262   .0254978    -3.17   0.002     .8668909      .96689
             |
         imd |
          2  |   1.035103   .0243086     1.47   0.142     .9885391    1.083861
          3  |   1.040624   .0249198     1.66   0.096     .9929111    1.090631
          4  |   1.059387   .0263218     2.32   0.020     1.009033    1.112254
5 most de..  |   1.138093   .0292166     5.04   0.000     1.082246    1.196822
             |
   obese4cat |
Obese I ..)  |   .9150102   .0158102    -5.14   0.000     .8845416    .9465284
Obese II..)  |   1.021635   .0250539     0.87   0.383     .9736914    1.071939
Obese II..)  |   1.011203   .0337431     0.33   0.738     .9471843    1.079549
             |
smoke_nomiss |
     Former  |   1.043956   .0153991     2.92   0.004     1.014206    1.074578
    Current  |   1.094093   .0329611     2.98   0.003     1.031361    1.160641
             |
     diabcat |
Controlle..  |   1.110798   .0177482     6.58   0.000     1.076551    1.146134
Uncontrol..  |   1.279897   .0284723    11.09   0.000     1.225291    1.336936
Diabetes,..  |   1.077131   .1361503     0.59   0.557     .8407674    1.379943
             |
1.myocardi~t |   1.120483   .0216907     5.88   0.000     1.078766    1.163813
       1.pad |   1.284003   .0315454    10.18   0.000      1.22364    1.347344
1.hyperten~n |   1.017794    .015625     1.15   0.251     .9876256    1.048884
1.heart_f~re |   1.191447   .0172566    12.09   0.000       1.1581    1.225754
1.stroke_tia |   1.141753   .0171511     8.82   0.000     1.108627    1.175868
       1.vte |   1.155753    .025721     6.50   0.000     1.106425    1.207281
 1.oestrogen |   1.134399   .1001562     1.43   0.153     .9541423     1.34871
1.antiplat~t |   1.103995   .0281488     3.88   0.000      1.05018    1.160568
1.flu_vac~ne |   .9488851   .0164048    -3.03   0.002      .917271    .9815889
             |
         ckd |
        CKD  |   1.092142   .0158793     6.06   0.000     1.061459    1.123713
      1.copd |    1.21424    .023191    10.16   0.000     1.169626    1.260555
1.other_re~y |   1.266954    .031261     9.59   0.000     1.207142     1.32973
1.immunode~y |   1.249949   .0907271     3.07   0.002     1.084197    1.441042
    1.cancer |   1.216483   .0196586    12.13   0.000     1.178556     1.25563
1.ae_atten~r |    1.81323   .0251866    42.84   0.000     1.764531    1.863273
1.gp_consult |   .8212349   .0373417    -4.33   0.000     .7512131    .8977836
1.care_ho~ce |   3.789669   .0974632    51.80   0.000      3.60338     3.98559
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00150         0.05        1         0.8147
      0b.male     |            .            .        1             .
      1.male      |     -0.02202        11.97        1         0.0005
      age1        |      0.00444         0.46        1         0.4962
      age2        |     -0.01496         5.27        1         0.0217
      age3        |      0.00661         1.05        1         0.3062
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00208         0.11        1         0.7450
      3.imd       |     -0.00703         1.21        1         0.2711
      4.imd       |     -0.00730         1.30        1         0.2543
      5.imd       |     -0.00978         2.32        1         0.1276
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00636         0.99        1         0.3199
      3.obese4cat |     -0.00369         0.33        1         0.5637
      4.obese4cat |     -0.01916         8.97        1         0.0027
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00585         0.83        1         0.3623
      3.smoke_no~s|     -0.01530         5.73        1         0.0167
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01118         3.07        1         0.0798
      3.diabcat   |     -0.01935         9.13        1         0.0025
      4.diabcat   |      0.00600         0.88        1         0.3475
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00495         0.61        1         0.4354
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00387         0.37        1         0.5446
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00007         0.00        1         0.9915
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00756         1.40        1         0.2368
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01681         6.92        1         0.0085
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00538         0.71        1         0.4008
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00764         1.43        1         0.2322
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00961         2.28        1         0.1312
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.03109        23.89        1         0.0000
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.00371         0.34        1         0.5590
      0b.copd     |            .            .        1             .
      1.copd      |     -0.00982         2.38        1         0.1231
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00816         1.65        1         0.1991
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.01518         5.59        1         0.0181
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.01224         3.68        1         0.0551
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.06159        92.32        1         0.0000
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.00752         1.41        1         0.2346
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|     -0.11386       333.73        1         0.0000
      ------------+---------------------------------------------------
      global test |                    849.58       34         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/covidtest_schoenplot4_completecas
> e.svg not found)
(file /workspace/output/warfarin_tabfig/covidtest_schoenplot4_completecase.svg 
> written in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table6_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/08b_an_model_checks_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:22:23
-------------------------------------------------------------------------------
