-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_positivecovidtes
> t.log
  log type:  text
 opened on:   1 Mar 2021, 21:20:30

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -27185.908                     Number of obs     =    372,741

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .7890295   .0298375    -6.27   0.000     .7326637    .8497316
    _Imale_1 |   1.249643   .0392006     7.10   0.000     1.175126    1.328886
     _Iimd_2 |   1.067684   .0539434     1.30   0.195     .9670228    1.178823
     _Iimd_3 |   1.094458   .0545583     1.81   0.070     .9925837    1.206789
     _Iimd_4 |   1.189398   .0581846     3.55   0.000     1.080655    1.309084
     _Iimd_5 |   1.598237   .0738896    10.14   0.000     1.459784    1.749822
_Iobese4ca~2 |   .9998579   .0394096    -0.00   0.997     .9255246    1.080161
_Iobese4ca~3 |   1.200834    .066731     3.29   0.001     1.076914    1.339012
_Iobese4ca~4 |   1.324204   .0994823     3.74   0.000     1.142898    1.534272
_Ismoke_no~2 |   1.111324   .0365138     3.21   0.001     1.042014    1.185244
_Ismoke_no~3 |   .9067492   .0698222    -1.27   0.204     .7797266    1.054465
 _Idiabcat_2 |   1.239655   .0425239     6.26   0.000      1.15905    1.325866
 _Idiabcat_3 |   1.528313   .0729906     8.88   0.000     1.391746    1.678281
 _Idiabcat_4 |    .967241   .2504867    -0.13   0.898     .5822357    1.606832
_Imyocardi~1 |   1.079598   .0459058     1.80   0.072     .9932715    1.173427
     _Ipad_1 |   1.260887   .0659852     4.43   0.000      1.13797    1.397081
_Ihyperten~1 |   1.060875   .0370944     1.69   0.091     .9906064    1.136128
_Iheart_fa~1 |   1.184059   .0372708     5.37   0.000     1.113217    1.259409
_Istroke_t~1 |   1.123107   .0365497     3.57   0.000     1.053707    1.197077
     _Ivte_1 |   1.281074   .0587356     5.40   0.000     1.170976    1.401525
_Ioestroge~1 |   1.014317   .2283976     0.06   0.950     .6523874    1.577038
_Iantiplat~1 |   .9265935    .055579    -1.27   0.204     .8238202    1.042188
_Iflu_vacc~1 |   .8174805   .0298456    -5.52   0.000     .7610281    .8781206
     _Ickd_1 |   1.101501   .0345648     3.08   0.002     1.035797    1.171374
    _Icopd_1 |   1.254719   .0529721     5.37   0.000     1.155075    1.362959
_Iother_re~1 |   1.340519    .068984     5.69   0.000     1.211908    1.482779
_Iimmunode~1 |    1.13505   .2081945     0.69   0.490     .7922915    1.626092
  _Icancer_1 |   1.026304   .0379907     0.70   0.483     .9544807    1.103532
_Iae_atten~1 |   2.064435    .062324    24.01   0.000     1.945826    2.190274
_Igp_consu~1 |    .831574   .0548644    -2.80   0.005     .7307041    .9463684
_Icare_hom~1 |    6.30804   .2580116    45.03   0.000     5.822086    6.834556
        age1 |   .9754451   .0058508    -4.14   0.000     .9640449      .98698
        age2 |   1.105916   .0117103     9.51   0.000     1.083201    1.129108
        age3 |   .6111641    .039627    -7.59   0.000      .538229    .6939826
       _rcs1 |   1.886843   .0185801    64.48   0.000     1.850776    1.923613
       _rcs2 |   1.459191    .010022    55.02   0.000     1.439679    1.478966
       _cons |   .0126717   .0048682   -11.37   0.000     .0059679     .026906
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    372,741    203.9052    32.13803         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(372,534 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .01404881   .01362193   .01448906 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .01114171   .01043715   .01189384 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00290709         -.00375982         -.00205437 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_positivecovidtest.gph not found)
(file adj_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_positivecovidtest.svg 
> not found)
(file /workspace/output/warfarin_tabfig/adj_curves_positivecovidtest.svg writte
> n in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_positivecovidtest.gph not found)
(file diff_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_positivecovidtest.svg
>  not found)
(file /workspace/output/warfarin_tabfig/diff_curves_positivecovidtest.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_positivecovidtes
> t.log
  log type:  text
 closed on:   1 Mar 2021, 21:37:58
-------------------------------------------------------------------------------
