-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_admitcovid.log
  log type:  text
 opened on:   1 Mar 2021, 21:00:23

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -16033.477                     Number of obs     =    372,741

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8272385   .0419408    -3.74   0.000     .7489882     .913664
    _Imale_1 |   1.418416   .0623342     7.95   0.000     1.301357    1.546004
     _Iimd_2 |   1.051717   .0757724     0.70   0.484     .9132151    1.211225
     _Iimd_3 |   1.139442   .0801612     1.86   0.064     .9926797    1.307902
     _Iimd_4 |   1.349661   .0914894     4.42   0.000     1.181746    1.541434
     _Iimd_5 |   1.649992   .1075936     7.68   0.000     1.452032     1.87494
_Iobese4ca~2 |    .984795   .0532578    -0.28   0.777     .8857534    1.094911
_Iobese4ca~3 |   1.264688    .093048     3.19   0.001     1.094856    1.460863
_Iobese4ca~4 |   1.328929   .1350296     2.80   0.005     1.088963    1.621775
_Ismoke_no~2 |    1.18644   .0562557     3.61   0.000     1.081149    1.301985
_Ismoke_no~3 |   .9510271   .0984001    -0.49   0.627     .7764642    1.164835
 _Idiabcat_2 |   1.264764   .0598768     4.96   0.000     1.152687    1.387737
 _Idiabcat_3 |   1.692996   .1065215     8.37   0.000     1.496577    1.915193
 _Idiabcat_4 |   .6667328   .2987627    -0.90   0.366     .2770312     1.60463
_Imyocardi~1 |    1.15469   .0649429     2.56   0.011     1.034169    1.289257
     _Ipad_1 |   1.293453    .089962     3.70   0.000     1.128621    1.482358
_Ihyperten~1 |   1.041829   .0504824     0.85   0.398      .947438    1.145623
_Iheart_fa~1 |   1.197239   .0519384     4.15   0.000     1.099649    1.303489
_Istroke_t~1 |   1.092421   .0499955     1.93   0.053     .9986982     1.19494
     _Ivte_1 |   1.307811   .0828615     4.24   0.000     1.155085    1.480731
_Ioestroge~1 |   .8675691    .308372    -0.40   0.689     .4322648    1.741239
_Iantiplat~1 |   1.034103   .0785405     0.44   0.659     .8910762    1.200088
_Iflu_vacc~1 |   .8606397   .0447962    -2.88   0.004     .7771708    .9530733
     _Ickd_1 |   1.206579   .0525109     4.31   0.000     1.107926    1.314015
    _Icopd_1 |   1.511606   .0814743     7.67   0.000     1.360064    1.680032
_Iother_re~1 |   1.488073    .098035     6.03   0.000     1.307816    1.693175
_Iimmunode~1 |   1.028556   .2667317     0.11   0.914     .6187121    1.709885
  _Icancer_1 |   1.017217   .0519138     0.33   0.738     .9203911    1.124229
_Iae_atten~1 |   2.220458   .0934872    18.95   0.000     2.044582    2.411462
_Igp_consu~1 |   1.056732   .1156832     0.50   0.614      .852671    1.309628
_Icare_hom~1 |   3.648057   .2452831    19.25   0.000     3.197641    4.161918
        age1 |   .9932004   .0093695    -0.72   0.470     .9750053    1.011735
        age2 |   1.086952   .0171272     5.29   0.000     1.053896    1.121044
        age3 |   .6184589   .0588029    -5.05   0.000      .513309    .7451485
       _rcs1 |   1.692166     .01843    48.30   0.000     1.656426    1.728676
       _rcs2 |   1.392084    .010416    44.21   0.000     1.371818     1.41265
       _cons |   .0012193   .0007453   -10.98   0.000      .000368    .0040401
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    372,741    204.4712    30.86812         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(372,534 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +----------------------------------+
  |     _at1    _at1_lci    _at1_uci |
  |----------------------------------|
  | .0071889   .00688032   .00751133 |
  +----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00595638   .00545589   .00650277 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00123253         -.00184631         -.00061874 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_admitcovid.gph not found)
(file adj_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_admitcovid.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/adj_curves_admitcovid.svg written in SV
> G format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_admitcovid.gph not found)
(file diff_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_admitcovid.svg not fo
> und)
(file /workspace/output/warfarin_tabfig/diff_curves_admitcovid.svg written in S
> VG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_admitcovid.log
  log type:  text
 closed on:   1 Mar 2021, 21:17:07
-------------------------------------------------------------------------------
