-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 13:09:58

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -15676.851                     Number of obs     =    371,546

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8235963   .0423291    -3.78   0.000     .7446744    .9108824
    _Imale_1 |   1.423067    .063369     7.92   0.000     1.304132    1.552849
     _Iimd_2 |    1.04531   .0767351     0.60   0.546     .9052303    1.207065
     _Iimd_3 |   1.150878   .0815799     1.98   0.047     1.001594    1.322411
     _Iimd_4 |   1.338938   .0921609     4.24   0.000      1.16996    1.532321
     _Iimd_5 |   1.663951   .1098448     7.71   0.000     1.462005    1.893791
_Iobese4ca~2 |   .9910908   .0541395    -0.16   0.870     .8904624    1.103091
_Iobese4ca~3 |   1.310242   .0961656     3.68   0.000     1.134691    1.512954
_Iobese4ca~4 |   1.282186   .1341357     2.38   0.018     1.044486    1.573981
_Ismoke_no~2 |   1.203516   .0579495     3.85   0.000     1.095132    1.322627
_Ismoke_no~3 |   .9489899    .099843    -0.50   0.619     .7721593    1.166316
 _Idiabcat_2 |   1.260223   .0604266     4.82   0.000     1.147184      1.3844
 _Idiabcat_3 |   1.673753   .1068474     8.07   0.000     1.476908    1.896835
 _Idiabcat_4 |   .6881059   .3083544    -0.83   0.404     .2859002    1.656137
_Imyocardi~1 |   1.167103   .0662557     2.72   0.006     1.044208    1.304462
     _Ipad_1 |    1.30655   .0916861     3.81   0.000     1.138659    1.499196
_Ihyperten~1 |   1.038216   .0509009     0.76   0.444     .9430955    1.142931
_Iheart_fa~1 |    1.19236   .0523858     4.00   0.000     1.093983    1.299585
_Istroke_t~1 |   1.077275   .0500863     1.60   0.109     .9834478    1.180054
     _Ivte_1 |   1.292376   .0832908     3.98   0.000     1.139018    1.466381
_Ioestroge~1 |   .8918362   .3170547    -0.32   0.747        .4443    1.790168
_Iantiplat~1 |   1.030444   .0792318     0.39   0.697     .8862879    1.198048
_Iflu_vacc~1 |   .8702681   .0460018    -2.63   0.009     .7846195    .9652661
     _Ickd_1 |   1.224019   .0539904     4.58   0.000     1.122645    1.334547
    _Icopd_1 |   1.514732   .0825814     7.62   0.000     1.361223    1.685552
_Iother_re~1 |   1.468292    .098291     5.74   0.000     1.287748    1.674148
_Iimmunode~1 |   .9823895   .2636536    -0.07   0.947     .5805482    1.662375
  _Icancer_1 |     1.0242    .052852     0.46   0.643     .9256784    1.133208
_Iae_atten~1 |   2.244635   .0957798    18.95   0.000     2.064546    2.440434
_Igp_consu~1 |   1.003276   .1131817     0.03   0.977     .8042567    1.251545
_Icare_hom~1 |   3.578185   .2447654    18.64   0.000     3.129222    4.091562
        age1 |   .9915414   .0093537    -0.90   0.368      .973377    1.010045
        age2 |   1.086745   .0171987     5.26   0.000     1.053553    1.120982
        age3 |   .6271057   .0600229    -4.88   0.000     .5198388    .7565067
       _rcs1 |   1.689284   .0185393    47.77   0.000     1.653336    1.726014
       _rcs2 |   1.391586   .0104757    43.90   0.000     1.371205    1.412271
       _cons |   .0013827   .0008454   -10.77   0.000     .0004172    .0045834
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    371,546    204.4723    30.86146         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(371,339 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00703786   .00673204   .00735758 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00580553   .00531105   .00634606 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00123233         -.00183956          -.0006251 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_admitcovid.gph not found)
(file adj_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_admitcovid.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/adj_curves_admitcovid.svg written in SV
> G format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_admitcovid.gph not found)
(file diff_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_admitcovid.svg not fo
> und)
(file /workspace/output/warfarin_tabfig/diff_curves_admitcovid.svg written in S
> VG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 13:31:11
-------------------------------------------------------------------------------
