-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_onsnoncoviddeath
> .log
  log type:  text
 opened on:   1 Mar 2021, 21:05:22

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -67881.513                     Number of obs     =    372,741

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8807828   .0183941    -6.08   0.000     .8454588    .9175825
    _Imale_1 |    1.17711   .0212814     9.02   0.000     1.136129    1.219569
     _Iimd_2 |   1.003165   .0279883     0.11   0.910     .9497817    1.059548
     _Iimd_3 |   1.064115     .02915     2.27   0.023     1.008489     1.12281
     _Iimd_4 |   1.098728   .0299715     3.45   0.001     1.041527    1.159069
     _Iimd_5 |   1.224219   .0327643     7.56   0.000     1.161657     1.29015
_Iobese4ca~2 |    .791606   .0196583    -9.41   0.000     .7539991    .8310885
_Iobese4ca~3 |   .9208651    .034222    -2.22   0.027     .8561757    .9904423
_Iobese4ca~4 |   1.171651   .0587249     3.16   0.002     1.062025    1.292593
_Ismoke_no~2 |   1.137685   .0219793     6.68   0.000     1.095412     1.18159
_Ismoke_no~3 |    1.76534   .0677035    14.82   0.000     1.637508    1.903151
 _Idiabcat_2 |   1.147799   .0229236     6.90   0.000     1.103737    1.193619
 _Idiabcat_3 |    1.36913   .0400585    10.74   0.000     1.292825    1.449938
 _Idiabcat_4 |   1.175954   .1591084     1.20   0.231     .9020312    1.533061
_Imyocardi~1 |   1.122491   .0266202     4.87   0.000     1.071511    1.175898
     _Ipad_1 |   1.351805   .0388034    10.50   0.000     1.277852    1.430038
_Ihyperten~1 |   1.099676   .0225698     4.63   0.000     1.056317    1.144813
_Iheart_fa~1 |   1.502821   .0266408    22.98   0.000     1.451503    1.555954
_Istroke_t~1 |   1.159528   .0215881     7.95   0.000     1.117979    1.202622
     _Ivte_1 |   1.156222   .0317841     5.28   0.000     1.095575    1.220227
_Ioestroge~1 |   1.030658   .1249833     0.25   0.803     .8126305    1.307182
_Iantiplat~1 |    1.01137   .0338607     0.34   0.736     .9471346    1.079962
_Iflu_vacc~1 |   .7672298   .0162851   -12.48   0.000     .7359663    .7998213
     _Ickd_1 |   1.113588   .0200011     5.99   0.000     1.075069    1.153488
    _Icopd_1 |   1.322627   .0315188    11.73   0.000     1.262272    1.385868
_Iother_re~1 |   1.427044   .0411144    12.34   0.000     1.348694    1.509945
_Iimmunode~1 |   1.617135   .1422554     5.46   0.000     1.361032    1.921429
  _Icancer_1 |   1.582543   .0299239    24.28   0.000     1.524966    1.642293
_Iae_atten~1 |   1.997738   .0348521    39.67   0.000     1.930583    2.067228
_Igp_consu~1 |   .8611847   .0346221    -3.72   0.000     .7959313    .9317878
_Icare_hom~1 |   2.980912   .0808674    40.26   0.000     2.826555    3.143698
        age1 |   1.042415   .0066449     6.52   0.000     1.029472    1.055521
        age2 |   1.038806   .0095258     4.15   0.000     1.020303    1.057645
        age3 |   .8936835   .0432121    -2.32   0.020     .8128787    .9825208
       _rcs1 |   1.408528   .0044323   108.86   0.000     1.399868    1.417242
       _rcs2 |   1.009968   .0024245     4.13   0.000     1.005227    1.014731
       _rcs3 |   .9968618   .0008423    -3.72   0.000     .9952122    .9985141
       _cons |   .0003383    .000141   -19.18   0.000     .0001495    .0007657
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    372,741    204.9929    29.43771         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(372,534 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .03974216   .03904821   .04044844 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .03524966   .03406265   .03647803 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    -.0044925         -.00589784         -.00308716 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_onsnoncoviddeath.gph not found)
(file adj_curves_onsnoncoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_onsnoncoviddeath.svg n
> ot found)
(file /workspace/output/warfarin_tabfig/adj_curves_onsnoncoviddeath.svg written
>  in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_onsnoncoviddeath.gph not found)
(file diff_curves_onsnoncoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_onsnoncoviddeath.svg 
> not found)
(file /workspace/output/warfarin_tabfig/diff_curves_onsnoncoviddeath.svg writte
> n in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_onsnoncoviddeath
> .log
  log type:  text
 closed on:   1 Mar 2021, 21:23:12
-------------------------------------------------------------------------------
