-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/02aii_cr_create_population_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 02:42:06

. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. use $tempdir/cr_dataset_af , clear

. 
. noi di "DROP MISSING ATRIAL FIBRILLATION:"
DROP MISSING ATRIAL FIBRILLATION:

. *DONE BY PYTHON
. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. drop if inlist(sex,"I", "U")
([REDACTED] observations deleted)

. 
. noi di "DROP AGE <18:" 
DROP AGE <18:

. *DONE BY PYTHON
. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. *DONE BY PYTHON
. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. *DONE BY PYTHON
. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. *DONE BY PYTHON
. 
. noi di "KEEP PATIENTS WITH CHA2DS2_VASc_score==2"
KEEP PATIENTS WITH CHA2DS2_VASc_score==2

. datacheck CHA2DS2_VASc_score !=., nol

. 
. keep if CHA2DS2_VASc_score == 2
(448,723 observations deleted)

. 
. noi di "PEOPLE PRESCRIBED INJECTABLE ANTICOAGULANT"
PEOPLE PRESCRIBED INJECTABLE ANTICOAGULANT

. drop if lmwh_last_four_months_date != .
(210 observations deleted)

. 
. noi di "DROP IF END OF STUDY PERIOD BEFORE INDEX"
DROP IF END OF STUDY PERIOD BEFORE INDEX

. drop if stime_`outcome' < date("$indexdate", "DMY")
(0 observations deleted)

. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: atrial fibrillation diagnosis before 1 March 2020 (everyone sh
> ould have a date for this variable)
. datacheck af_date != . , nol

. 
. * INCLUSION 2: >=18 and <=110 at 1 March 2020 
. assert age < .

. datacheck age >= 18, nol

. datacheck age <= 110, nol

.  
. * INCLUSION 3: M or F gender at 1 March 2020 
. assert inlist(sex, "M", "F")

. 
. * INCLUSION 4: CHA2DS2_VASc_score = 2
. datacheck CHA2DS2_VASc_score == 2 , nol

. 
. * EXCLUSION 1: 12 months or baseline time 
. * [VARIABLE NOT EXPORTED, CANNOT QUANTIFY]
. 
. * EXCLUSION 2: MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUSION 3: EXCLUDE PEOPLE WITH INJECTABLE ANTICOAGULANT
. datacheck lmwh_last_four_months_date == ., nol

. 
. /* SAVE DATA=================================================================
> =*/                
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_tempdata/analysis_dataset_covidtest.dta not f
> ound)
file /workspace/output/oac_tempdata/analysis_dataset_covidtest.dta saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  covidtest != 0 & covidtest < .
obs. time interval:  (stime_covidtest[_n-1], stime_covidtest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     70,266  total observations
          0  exclusions
------------------------------------------------------------------------------
     70,266  observations remaining, representing
     70,266  subjects
      4,425  failures in single-failure-per-subject data
 14269610.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_tempdata/analysis_dataset_STSET_covidtest.dta
>  not found)
file /workspace/output/oac_tempdata/analysis_dataset_STSET_covidtest.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/02aii_cr_create_population_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 02:42:09
-------------------------------------------------------------------------------
