-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/05a_an_models_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 02:43:03

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |  outcome: ONS covid
  Treatment |         death
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    17,929         55 |    17,984 
            |     99.69       0.31 |    100.00 
------------+----------------------+----------
current use |    52,152        130 |    52,282 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Total |    70,081        185 |    70,266 
            |     99.74       0.26 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2062.9964
Iteration 1:   log likelihood = -2062.1548
Iteration 2:   log likelihood = -2062.1526
Iteration 3:   log likelihood = -2062.1526
Refining estimates:
Iteration 0:   log likelihood = -2062.1526

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(1)       =        1.69
Log likelihood  =   -2062.1526                  Prob > chi2      =      0.1939

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8088682     .13011    -1.32   0.187     .5901443    1.108657
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/onscoviddeath_univar.ster not found)
file /workspace/output/oac_tempdata/onscoviddeath_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2062.9964
Iteration 1:   log likelihood =  -2006.562
Iteration 2:   log likelihood =  -1959.407
Iteration 3:   log likelihood = -1955.9529
Iteration 4:   log likelihood = -1955.8836
Iteration 5:   log likelihood = -1955.8835
Refining estimates:
Iteration 0:   log likelihood = -1955.8835

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(5)       =      214.23
Log likelihood  =   -1955.8835                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7778617   .1265261    -1.54   0.122     .5655186    1.069936
      1.male |   1.577982   .4920713     1.46   0.144     .8563808    2.907617
        age1 |   .9986386    .028376    -0.05   0.962     .9445429    1.055832
        age2 |   1.166855    .057605     3.13   0.002     1.059242    1.285402
        age3 |   .4826784   .1489999    -2.36   0.018     .2635707    .8839314
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/onscoviddeath_multivar1.ster not fou
> nd)
file /workspace/output/oac_tempdata/onscoviddeath_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2062.9964
Iteration 1:   log likelihood = -1995.2229
Iteration 2:   log likelihood = -1943.3584
Iteration 3:   log likelihood = -1939.1862
Iteration 4:   log likelihood = -1939.0021
Iteration 5:   log likelihood = -1938.9559
Iteration 6:   log likelihood = -1938.9389
Iteration 7:   log likelihood = -1938.9327
Iteration 8:   log likelihood = -1938.9304
Iteration 9:   log likelihood = -1938.9296
Iteration 10:  log likelihood = -1938.9293
Iteration 11:  log likelihood = -1938.9291
Iteration 12:  log likelihood = -1938.9291
Iteration 13:  log likelihood = -1938.9291
Iteration 14:  log likelihood = -1938.9291
Iteration 15:  log likelihood = -1938.9291
Iteration 16:  log likelihood = -1938.9291
Iteration 17:  log likelihood = -1938.9291
Iteration 18:  log likelihood = -1938.9291
Iteration 19:  log likelihood = -1938.9291
Iteration 20:  log likelihood = -1938.9291
Iteration 21:  log likelihood = -1938.9291
Iteration 22:  log likelihood = -1938.9291
Iteration 23:  log likelihood = -1938.9291
Iteration 24:  log likelihood = -1938.9291
Iteration 25:  log likelihood = -1938.9291
Iteration 26:  log likelihood = -1938.9291
Iteration 27:  log likelihood = -1938.9291
Iteration 28:  log likelihood = -1938.9291
Iteration 29:  log likelihood = -1938.9291
Iteration 30:  log likelihood = -1938.9291
Iteration 31:  log likelihood = -1938.9291
Iteration 32:  log likelihood = -1938.9291
Iteration 33:  log likelihood = -1938.9291
Iteration 34:  log likelihood = -1938.9291
Iteration 35:  log likelihood = -1938.9291
Iteration 36:  log likelihood = -1938.9291
Iteration 37:  log likelihood = -1938.9291
Iteration 38:  log likelihood = -1938.9291
Iteration 39:  log likelihood = -1938.9291
Iteration 40:  log likelihood = -1938.9291
Iteration 41:  log likelihood = -1938.9291
Iteration 42:  log likelihood = -1938.9291
Iteration 43:  log likelihood = -1938.9291
Iteration 44:  log likelihood = -1938.9291
Iteration 45:  log likelihood = -1938.9291
Refining estimates:
Iteration 0:   log likelihood = -1938.9291

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(23)      =      248.13
Log likelihood  =   -1938.9291                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6891623   .1178728    -2.18   0.030     .4928717    .9636275
      1.male |    1.12356   .5063952     0.26   0.796     .4644669    2.717928
        age1 |   1.031499    .037716     0.85   0.396     .9601639    1.108134
        age2 |   1.171764   .0684471     2.71   0.007     1.045005    1.313899
        age3 |   .4139601   .1672218    -2.18   0.029      .187547    .9137066
             |
         imd |
          2  |   .8914359   .1979543    -0.52   0.605     .5768599    1.377558
          3  |   .7399393   .1748001    -1.27   0.202      .465706    1.175656
          4  |   .8393253   .2008746    -0.73   0.464     .5250654    1.341675
5 most de..  |   1.508556   .3272492     1.90   0.058     .9860782    2.307871
             |
   obese4cat |
Obese I ..)  |    .928836   .2172503    -0.32   0.752     .5872825    1.469031
Obese II..)  |   1.392208   .4625557     1.00   0.319      .725932    2.670008
Obese II..)  |   1.617113   .7222999     1.08   0.282     .6738176    3.880951
             |
smoke_nomiss |
     Former  |   1.379484   .2316873     1.92   0.055     .9925572    1.917246
    Current  |   1.328475   .4525214     0.83   0.404     .6814076    2.590002
             |
     diabcat |
Controlle..  |   1.206324   .6466746     0.35   0.726     .4218519    3.449593
Uncontrol..  |   2.674122   1.463268     1.80   0.072     .9149714    7.815467
Diabetes,..  |   5.44e-19          .        .       .            .           .
             |
1.myocardi~t |   2.561291   1.450839     1.66   0.097     .8439127    7.773569
       1.pad |   1.361589   1.414642     0.30   0.766     .1776962    10.43311
1.hyperten~n |   1.023551   .4044145     0.06   0.953     .4718365    2.220379
1.heart_f~re |   2.270735   1.021745     1.82   0.068     .9400652    5.484978
1.stroke_tia |   1.09e-19          .        .       .            .           .
       1.vte |   2.791293   3.444665     0.83   0.406     .2485186    31.35104
 1.oestrogen |   6.33e-20          .        .       .            .           .
1.antiplat~t |   .6179701   .1888413    -1.58   0.115     .3395115    1.124813
1.flu_vac~ne |    1.06332   .1954895     0.33   0.738     .7416044      1.5246
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/onscoviddeath_multivar2.ster not fou
> nd)
file /workspace/output/oac_tempdata/onscoviddeath_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -661.74897
Iteration 1:   log likelihood = -627.94921
Iteration 2:   log likelihood = -583.55578
Iteration 3:   log likelihood = -518.56082
Iteration 4:   log likelihood = -512.64022
Iteration 5:   log likelihood = -512.59961
Iteration 6:   log likelihood = -512.59056
Iteration 7:   log likelihood = -512.58724
Iteration 8:   log likelihood = -512.58602
Iteration 9:   log likelihood = -512.58557
Iteration 10:  log likelihood =  -512.5854
Iteration 11:  log likelihood = -512.58534
Iteration 12:  log likelihood = -512.58532
Iteration 13:  log likelihood = -512.58531
Iteration 14:  log likelihood = -512.58531
Iteration 15:  log likelihood = -512.58531
Iteration 16:  log likelihood = -512.58531
Iteration 17:  log likelihood = -512.58531
Iteration 18:  log likelihood = -512.58531
Iteration 19:  log likelihood = -512.58531
Iteration 20:  log likelihood = -512.58531
Iteration 21:  log likelihood = -512.58531
Iteration 22:  log likelihood = -512.58531
Iteration 23:  log likelihood = -512.58531
Iteration 24:  log likelihood = -512.58531
Iteration 25:  log likelihood = -512.58531
Iteration 26:  log likelihood = -512.58531
Iteration 27:  log likelihood = -512.58531
Iteration 28:  log likelihood = -512.58531
Iteration 29:  log likelihood = -512.58531
Iteration 30:  log likelihood = -512.58531
Iteration 31:  log likelihood = -512.58531
Iteration 32:  log likelihood = -512.58531
Iteration 33:  log likelihood = -512.58531
Iteration 34:  log likelihood = -512.58531
Iteration 35:  log likelihood = -512.58531
Iteration 36:  log likelihood = -512.58531
Iteration 37:  log likelihood = -512.58531
Iteration 38:  log likelihood = -512.58531
Iteration 39:  log likelihood = -512.58531
Iteration 40:  log likelihood = -512.58531
Iteration 41:  log likelihood = -512.58531
Refining estimates:
Iteration 0:   log likelihood = -512.58531
Iteration 1:   log likelihood = -512.58531
Iteration 2:   log likelihood = -512.58531

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(31)      =      298.33
Log likelihood  =   -512.58531                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6627938   .1248821    -2.18   0.029     .4581387    .9588703
      1.male |    1.05532   .4912425     0.12   0.908     .4237963    2.627915
        age1 |   1.035276   .0402734     0.89   0.373     .9592762    1.117298
        age2 |    1.17652   .0741602     2.58   0.010     1.039788    1.331231
        age3 |   .3805317   .1671057    -2.20   0.028      .160915    .8998813
             |
         imd |
          2  |    .818679    .207774    -0.79   0.431     .4978353    1.346299
          3  |   .7650965   .2101597    -0.97   0.330     .4465858    1.310773
          4  |   .7703807   .2172506    -0.93   0.355     .4432645    1.338899
5 most de..  |   1.476879   .4417638     1.30   0.192     .8217388    2.654338
             |
   obese4cat |
Obese I ..)  |   .8744908   .2150893    -0.55   0.586     .5400005    1.416173
Obese II..)  |   1.382194    .476122     0.94   0.347     .7036506    2.715069
Obese II..)  |   1.711007   .7937337     1.16   0.247     .6892558    4.247398
             |
smoke_nomiss |
     Former  |   1.290757   .2389909     1.38   0.168     .8979248     1.85545
    Current  |   1.127627   .4200049     0.32   0.747     .5434007    2.339972
             |
     diabcat |
Controlle..  |   1.071008   .6094328     0.12   0.904     .3511043    3.267004
Uncontrol..  |   2.486047   1.434449     1.58   0.114     .8023545     7.70287
Diabetes,..  |   5.36e-19          .        .       .            .           .
             |
1.myocardi~t |   2.410641    1.40394     1.51   0.131     .7698373    7.548596
       1.pad |   .9174933   .9761029    -0.08   0.935     .1140319     7.38209
1.hyperten~n |   1.125542   .4628492     0.29   0.774     .5027218    2.519972
1.heart_f~re |   2.247448   1.062401     1.71   0.087     .8898454    5.676295
1.stroke_tia |   5.26e-19   9.64e-10    -0.00   1.000            0           .
       1.vte |   2.812209   3.549503     0.82   0.413     .2369633    33.37444
 1.oestrogen |   2.58e-19          .        .       .            .           .
1.antiplat~t |   .6367581   .2052026    -1.40   0.161     .3385829    1.197523
1.flu_vac~ne |   1.142322    .232693     0.65   0.514     .7662972    1.702863
             |
         ckd |
        CKD  |   1.232992   .2303675     1.12   0.262     .8549194    1.778261
      1.copd |   1.800273   .4007749     2.64   0.008      1.16371    2.785043
1.other_re~y |   1.641517   .4731951     1.72   0.086     .9329792    2.888142
1.immunode~y |    2.15321   1.636583     1.01   0.313     .4854187    9.551165
    1.cancer |   1.231352   .2391893     1.07   0.284     .8414669    1.801887
1.ae_atten~r |   2.418593   .3990421     5.35   0.000     1.750345    3.341966
1.gp_consult |    .398181   .1463757    -2.50   0.012     .1937178    .8184487
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/onscoviddeath_multivar3.ster not fou
> nd)
file /workspace/output/oac_tempdata/onscoviddeath_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table2_onscoviddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8088682     .13011    -1.32   0.187     .5901443    1.108657
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7778617   .1265261    -1.54   0.122     .5655186    1.069936
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6891623   .1178728    -2.18   0.030     .4928717    .9636275
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6627938   .1248821    -2.18   0.029     .4581387    .9588703
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/05a_an_models_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 02:44:04
-------------------------------------------------------------------------------
