-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/06a_an_models_ethnicity_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 02:46:59

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(18,087 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt | outcome: first covid
  Treatment |         test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    12,509        870 |    13,379 
            |     93.50       6.50 |    100.00 
------------+----------------------+----------
current use |    36,341      2,459 |    38,800 
            |     93.66       6.34 |    100.00 
------------+----------------------+----------
      Total |    48,850      3,329 |    52,179 
            |     93.62       6.38 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood = -36013.769
Iteration 2:   log likelihood = -36013.769
Refining estimates:
Iteration 0:   log likelihood = -36013.769

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(1)       =        0.89
Log likelihood  =   -36013.769                  Prob > chi2      =      0.3457

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9633753   .0380027    -0.95   0.344     .8916981    1.040814
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_tempdata/covidtest_univar_ethn.ster not found
> )
file /workspace/output/oac_tempdata/covidtest_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood = -35957.028
Iteration 2:   log likelihood = -35924.404
Iteration 3:   log likelihood = -35922.926
Iteration 4:   log likelihood = -35922.922
Iteration 5:   log likelihood = -35922.922
Refining estimates:
Iteration 0:   log likelihood = -35922.922

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(5)       =      182.58
Log likelihood  =   -35922.922                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9921007   .0396398    -0.20   0.843     .9173722    1.072916
      1.male |   .9873321   .0431532    -0.29   0.771     .9062748    1.075639
        age1 |   .9787647   .0036492    -5.76   0.000     .9716384    .9859433
        age2 |   1.035131   .0098576     3.63   0.000     1.015989    1.054633
        age3 |   1.118465   .0880093     1.42   0.155     .9586136    1.304973
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_tempdata/covidtest_multivar1_ethn.ster not fo
> und)
file /workspace/output/oac_tempdata/covidtest_multivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood = -35904.133
Iteration 2:   log likelihood = -35871.794
Iteration 3:   log likelihood =  -35870.43
Iteration 4:   log likelihood = -35870.426
Iteration 5:   log likelihood = -35870.426
Refining estimates:
Iteration 0:   log likelihood = -35870.426

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(30)      =      287.58
Log likelihood  =   -35870.426                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9900663   .0419614    -0.24   0.814     .9111467    1.075822
      1.male |    .891499   .0669623    -1.53   0.126     .7694588    1.032896
        age1 |   .9878981   .0044707    -2.69   0.007     .9791744    .9966996
        age2 |   1.038388    .012366     3.16   0.002     1.014431     1.06291
        age3 |   1.047382   .1049899     0.46   0.644     .8605582    1.274764
             |
         imd |
          2  |     1.0331   .0592725     0.57   0.570     .9232215    1.156056
          3  |   1.087275   .0617075     1.47   0.140     .9728148    1.215203
          4  |   1.265149   .0705548     4.22   0.000     1.134154    1.411275
5 most de..  |   1.304538   .0733587     4.73   0.000     1.168398    1.456541
             |
   obese4cat |
Obese I ..)  |   .9177052   .0427423    -1.84   0.065     .8376418    1.005421
Obese II..)  |    .984482   .0639307    -0.24   0.810     .8668264    1.118107
Obese II..)  |   .9632878   .0795455    -0.45   0.651     .8193441     1.13252
             |
smoke_nomiss |
     Former  |   1.095462   .0419902     2.38   0.017     1.016178    1.180932
    Current  |   1.202825   .0791846     2.81   0.005     1.057221    1.368481
             |
     diabcat |
Controlle..  |   1.048715   .0894432     0.56   0.577     .8872786    1.239525
Uncontrol..  |   1.345154   .1326699     3.01   0.003     1.108714    1.632016
Diabetes,..  |   .4944742   .2875858    -1.21   0.226      .158156    1.545972
             |
1.myocardi~t |   1.045968   .1192546     0.39   0.693     .8365076    1.307877
       1.pad |   1.562951     .25421     2.75   0.006     1.136317    2.149766
1.hyperten~n |   1.046784    .073762     0.65   0.516     .9117522    1.201814
1.heart_f~re |   1.166125   .0972154     1.84   0.065     .9903388    1.373114
1.stroke_tia |   1.196095   .1979578     1.08   0.279     .8647464    1.654407
       1.vte |   1.469686   .2665565     2.12   0.034     1.030012     2.09704
 1.oestrogen |   1.209376   .2120488     1.08   0.278     .8576575    1.705331
1.antiplat~t |   .9927913   .0646271    -0.11   0.912     .8738721    1.127893
1.flu_vac~ne |   1.032246   .0423572     0.77   0.439     .9524776    1.118694
             |
   ethnicity |
      Mixed  |   1.250906   .3627759     0.77   0.440     .7085446    2.208422
Asian or ..  |   1.664198   .1845536     4.59   0.000      1.33909    2.068237
      Black  |   1.027873   .2218199     0.13   0.899     .6733585    1.569036
      Other  |   1.451461   .2816602     1.92   0.055     .9922638    2.123164
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/covidtest_multivar2_ethn.ster not fo
> und)
file /workspace/output/oac_tempdata/covidtest_multivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist      

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood =  -35914.04
Iteration 2:   log likelihood = -35882.667
Iteration 3:   log likelihood = -35881.262
Iteration 4:   log likelihood = -35881.258
Iteration 5:   log likelihood = -35881.258
Refining estimates:
Iteration 0:   log likelihood = -35881.258

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(26)      =      265.91
Log likelihood  =   -35881.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9891487    .041922    -0.26   0.797     .9103032    1.074823
      1.male |   .8870299    .066651    -1.60   0.111     .7655604    1.027773
        age1 |    .985838   .0044287    -3.18   0.001      .977196    .9945565
        age2 |   1.040551   .0123747     3.34   0.001     1.016577    1.065089
        age3 |   1.039036   .1041276     0.38   0.702     .8537426    1.264545
             |
         imd |
          2  |   1.034322   .0593411     0.59   0.556     .9243161    1.157419
          3  |   1.091515   .0619335     1.54   0.123     .9766337    1.219909
          4  |    1.27689   .0711245     4.39   0.000     1.144828    1.424185
5 most de..  |    1.32386   .0742085     5.00   0.000     1.186119    1.477597
             |
   obese4cat |
Obese I ..)  |   .9124762   .0424891    -1.97   0.049     .8328863    .9996718
Obese II..)  |    .969568   .0629036    -0.48   0.634     .8537959    1.101038
Obese II..)  |   .9432942   .0778138    -0.71   0.479     .8024727    1.108828
             |
smoke_nomiss |
     Former  |   1.082605   .0413327     2.08   0.038     1.004551    1.166724
    Current  |   1.182358   .0776632     2.55   0.011     1.039531    1.344807
             |
     diabcat |
Controlle..  |     1.0755   .0915449     0.86   0.392     .9102429    1.270759
Uncontrol..  |   1.369055   .1349799     3.19   0.001     1.128491    1.660902
Diabetes,..  |   .5091118    .296055    -1.16   0.246     .1628653    1.591467
             |
1.myocardi~t |   1.043684   .1190127     0.37   0.708     .8346521    1.305067
       1.pad |   1.542732   .2509416     2.67   0.008     1.121589     2.12201
1.hyperten~n |   1.047411   .0738241     0.66   0.511     .9122681    1.202575
1.heart_f~re |    1.15996   .0967367     1.78   0.075     .9850443    1.365936
1.stroke_tia |   1.180912   .1959696     1.00   0.316     .8530267    1.634829
       1.vte |   1.445464   .2627155     2.03   0.043     1.012278    2.064023
 1.oestrogen |   1.187313   .2081186     0.98   0.327     .8420972     1.67405
1.antiplat~t |   1.004866   .0653511     0.07   0.940     .8846076    1.141473
1.flu_vac~ne |   1.031665    .042328     0.76   0.447     .9519512    1.118053
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/covidtest_multivar2_withoutethn.ster
>  not found)
file /workspace/output/oac_tempdata/covidtest_multivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10769.327
Iteration 1:   log likelihood = -10473.112
Iteration 2:   log likelihood = -10445.578
Iteration 3:   log likelihood = -10445.231
Iteration 4:   log likelihood = -10445.231
Refining estimates:
Iteration 0:   log likelihood = -10445.231

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(37)      =      648.19
Log likelihood  =   -10445.231                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .980183   .0436939    -0.45   0.653      .898179    1.069674
      1.male |   .9390739   .0725979    -0.81   0.416     .8070401    1.092709
        age1 |   .9895357   .0047529    -2.19   0.029     .9802638    .9988952
        age2 |   1.029322   .0128145     2.32   0.020      1.00451    1.054747
        age3 |   1.085111   .1140244     0.78   0.437     .8831396    1.333274
             |
         imd |
          2  |   1.026364    .065598     0.41   0.684     .9055215    1.163334
          3  |   1.100197   .0724804     1.45   0.147     .9669267    1.251835
          4  |   1.170678    .080149     2.30   0.021     1.023673    1.338795
5 most de..  |   1.226694   .0883106     2.84   0.005     1.065265    1.412586
             |
   obese4cat |
Obese I ..)  |   .9242086   .0446309    -1.63   0.103     .8407457    1.015957
Obese II..)  |   1.016912   .0685183     0.25   0.803     .8911083    1.160476
Obese II..)  |   .9881497   .0846283    -0.14   0.889      .835455    1.168752
             |
smoke_nomiss |
     Former  |   1.051306   .0424662     1.24   0.215     .9712837    1.137922
    Current  |   1.152636   .0810384     2.02   0.043     1.004261    1.322932
             |
     diabcat |
Controlle..  |   1.028186   .0918562     0.31   0.756     .8630319    1.224945
Uncontrol..  |   1.275297   .1314689     2.36   0.018     1.041986    1.560848
Diabetes,..  |   .4721654   .2808848    -1.26   0.207     .1471384    1.515174
             |
1.myocardi~t |   .9900858   .1174607    -0.08   0.933     .7846734    1.249271
       1.pad |   1.612643   .2746866     2.81   0.005     1.154916    2.251781
1.hyperten~n |   1.077827   .0783292     1.03   0.302     .9347375    1.242822
1.heart_f~re |     1.1589    .100562     1.70   0.089     .9776516     1.37375
1.stroke_tia |   1.216283   .2079978     1.14   0.252     .8699012     1.70059
       1.vte |   1.420718    .266019     1.88   0.061     .9842979    2.050638
 1.oestrogen |    1.25242   .2283257     1.23   0.217     .8761316    1.790319
1.antiplat~t |   .9557795   .0648787    -0.67   0.505     .8367155    1.091786
1.flu_vac~ne |   .9764851   .0423978    -0.55   0.584     .8968245    1.063222
             |
         ckd |
        CKD  |   1.206039   .0586987     3.85   0.000     1.096309    1.326753
      1.copd |   1.198322   .0703632     3.08   0.002     1.068053    1.344481
1.other_re~y |   1.242025   .1019527     2.64   0.008     1.057448    1.458821
1.immunode~y |   1.342124   .2004223     1.97   0.049     1.001569    1.798475
    1.cancer |   1.383862    .064912     6.93   0.000      1.26231    1.517119
1.ae_atten~r |   1.925453   .0748105    16.86   0.000     1.784271    2.077806
1.gp_consult |   1.216573   .1607444     1.48   0.138     .9390088    1.576182
             |
   ethnicity |
      Mixed  |    1.43272   .4420351     1.17   0.244     .7826026    2.622897
Asian or ..  |   1.630071   .2268892     3.51   0.000     1.240875    2.141338
      Black  |   1.095328   .2586609     0.39   0.700     .6894987    1.740022
      Other  |   1.646422   .3488369     2.35   0.019     1.086906    2.493963
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/covidtest_multivar3_ethn.ster not fo
> und)
file /workspace/output/oac_tempdata/covidtest_multivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10769.327
Iteration 1:   log likelihood = -10481.453
Iteration 2:   log likelihood = -10453.891
Iteration 3:   log likelihood = -10453.541
Iteration 4:   log likelihood = -10453.541
Refining estimates:
Iteration 0:   log likelihood = -10453.541

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(33)      =      631.57
Log likelihood  =   -10453.541                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9776506   .0435157    -0.51   0.612     .8959757    1.066771
      1.male |   .9382373   .0725428    -0.82   0.410     .8063049    1.091757
        age1 |   .9879839   .0047076    -2.54   0.011     .9788002    .9972538
        age2 |   1.030405   .0128106     2.41   0.016       1.0056    1.055822
        age3 |    1.08193     .11365     0.75   0.453      .880614    1.329268
             |
         imd |
          2  |   1.027309   .0656398     0.42   0.673     .9063868    1.164363
          3  |   1.099488   .0724415     1.44   0.150     .9662908    1.251046
          4  |   1.172661   .0802614     2.33   0.020     1.025447     1.34101
5 most de..  |   1.226617   .0882925     2.84   0.005     1.065219    1.412469
             |
   obese4cat |
Obese I ..)  |   .9225593   .0445137    -1.67   0.095     .8393124    1.014063
Obese II..)  |    1.00607   .0677378     0.09   0.928     .8816933    1.147992
Obese II..)  |   .9743061   .0833204    -0.30   0.761     .8239533    1.152095
             |
smoke_nomiss |
     Former  |   1.042547   .0419852     1.03   0.301     .9634211    1.128171
    Current  |   1.140623    .080073     1.87   0.061     .9940008    1.308873
             |
     diabcat |
Controlle..  |   1.042501   .0929447     0.47   0.641     .8753614    1.241555
Uncontrol..  |   1.287154   .1325027     2.45   0.014     1.051976    1.574908
Diabetes,..  |   .4744302   .2823647    -1.25   0.210     .1477631    1.523276
             |
1.myocardi~t |   .9897216   .1172979    -0.09   0.931     .7845706    1.248516
       1.pad |   1.612354    .274534     2.81   0.005     1.154854    2.251094
1.hyperten~n |   1.073722    .078015     0.98   0.328     .9312042    1.238052
1.heart_f~re |    1.15108   .0998211     1.62   0.105     .9711574    1.364336
1.stroke_tia |   1.198804   .2050806     1.06   0.289     .8572988    1.676347
       1.vte |   1.392804   .2608703     1.77   0.077     .9648531    2.010569
 1.oestrogen |   1.233033    .224806     1.15   0.251     .8625494    1.762647
1.antiplat~t |   .9577745   .0649655    -0.64   0.525     .8385453    1.093956
1.flu_vac~ne |    .977299   .0424027    -0.53   0.597     .8976267    1.064043
             |
         ckd |
        CKD  |   1.210446   .0588672     3.93   0.000     1.100396    1.331501
      1.copd |   1.195783   .0701874     3.05   0.002     1.065836    1.341573
1.other_re~y |   1.238602   .1016363     2.61   0.009     1.054592    1.454719
1.immunode~y |   1.342899   .2005453     1.97   0.048     1.002136    1.799532
    1.cancer |    1.38141   .0647633     6.89   0.000     1.260134    1.514358
1.ae_atten~r |   1.928833   .0749139    16.91   0.000     1.787454    2.081395
1.gp_consult |   1.212335   .1600964     1.46   0.145     .9358715    1.570468
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/covidtest_multivar3_withoutethn.ster
>  not found)
file /workspace/output/oac_tempdata/covidtest_multivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table3_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,379     2698693           0    2698693    2698693

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,800     7905480           0    7905480    7905480

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9633753   .0380027    -0.95   0.344     .8916981    1.040814
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9921007   .0396398    -0.20   0.843     .9173722    1.072916
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9900663   .0419614    -0.24   0.814     .9111467    1.075822
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9891487    .041922    -0.26   0.797     .9103032    1.074823
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .980183   .0436939    -0.45   0.653      .898179    1.069674
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9776506   .0435157    -0.51   0.612     .8959757    1.066771
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/06a_an_models_ethnicity_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 02:47:25
-------------------------------------------------------------------------------
