-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/06a_an_models_ethnicity_positivecovidtes
> t.log
  log type:  text
 opened on:  31 Dec 2020, 02:47:50

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(18,087 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |    outcome: first
  Treatment |  positive covid test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    13,271        108 |    13,379 
            |     99.19       0.81 |    100.00 
------------+----------------------+----------
current use |    38,550        250 |    38,800 
            |     99.36       0.64 |    100.00 
------------+----------------------+----------
      Total |    51,821        358 |    52,179 
            |     99.31       0.69 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3884.4953
Iteration 1:   log likelihood = -3882.5413
Iteration 2:   log likelihood = -3882.5351
Iteration 3:   log likelihood = -3882.5351
Refining estimates:
Iteration 0:   log likelihood = -3882.5351

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          358
Time at risk    =     10837899
                                                LR chi2(1)       =        3.92
Log likelihood  =   -3882.5351                  Prob > chi2      =      0.0477

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7931885   .0913349    -2.01   0.044     .6329383    .9940115
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_univar_ethn.ster n
> ot found)
file /workspace/output/oac_tempdata/positivecovidtest_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3884.4953
Iteration 1:   log likelihood =   -3832.55
Iteration 2:   log likelihood = -3823.2848
Iteration 3:   log likelihood = -3823.0504
Iteration 4:   log likelihood = -3823.0501
Refining estimates:
Iteration 0:   log likelihood = -3823.0501

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          358
Time at risk    =     10837899
                                                LR chi2(5)       =      122.89
Log likelihood  =   -3823.0501                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8135229   .0950688    -1.77   0.077     .6469903     1.02292
      1.male |    1.38147   .2152888     2.07   0.038     1.017864    1.874964
        age1 |   .9632177   .0106368    -3.39   0.001     .9425939    .9842927
        age2 |    1.09142   .0292608     3.26   0.001     1.035551    1.150304
        age3 |   .9446796   .1927784    -0.28   0.780     .6332599    1.409247
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar1_ethn.ste
> r not found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3884.4953
Iteration 1:   log likelihood =  -3805.098
Iteration 2:   log likelihood = -3789.7467
Iteration 3:   log likelihood = -3789.3743
Iteration 4:   log likelihood = -3789.3439
Iteration 5:   log likelihood = -3789.3328
Iteration 6:   log likelihood = -3789.3288
Iteration 7:   log likelihood = -3789.3273
Iteration 8:   log likelihood = -3789.3267
Iteration 9:   log likelihood = -3789.3265
Iteration 10:  log likelihood = -3789.3265
Iteration 11:  log likelihood = -3789.3264
Iteration 12:  log likelihood = -3789.3264
Iteration 13:  log likelihood = -3789.3264
Iteration 14:  log likelihood = -3789.3264
Iteration 15:  log likelihood = -3789.3264
Iteration 16:  log likelihood = -3789.3264
Iteration 17:  log likelihood = -3789.3264
Iteration 18:  log likelihood = -3789.3264
Iteration 19:  log likelihood = -3789.3264
Iteration 20:  log likelihood = -3789.3264
Iteration 21:  log likelihood = -3789.3264
Iteration 22:  log likelihood = -3789.3264
Iteration 23:  log likelihood = -3789.3264
Iteration 24:  log likelihood = -3789.3264
Iteration 25:  log likelihood = -3789.3264
Iteration 26:  log likelihood = -3789.3264
Iteration 27:  log likelihood = -3789.3264
Iteration 28:  log likelihood = -3789.3264
Iteration 29:  log likelihood = -3789.3264
Iteration 30:  log likelihood = -3789.3264
Iteration 31:  log likelihood = -3789.3264
Iteration 32:  log likelihood = -3789.3264
Iteration 33:  log likelihood = -3789.3264
Refining estimates:
Iteration 0:   log likelihood = -3789.3264
Iteration 1:   log likelihood = -3789.3264

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          358
Time at risk    =     10837899
                                                LR chi2(30)      =      190.34
Log likelihood  =   -3789.3264                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .743099    .091661    -2.41   0.016      .583514    .9463289
      1.male |   .9238489   .2266732    -0.32   0.747     .5711528     1.49434
        age1 |   .9901506    .013919    -0.70   0.481     .9632423    1.017811
        age2 |   1.119955   .0397441     3.19   0.001     1.044705    1.200624
        age3 |     .69393   .1931377    -1.31   0.189     .4021661    1.197363
             |
         imd |
          2  |   1.115536   .2048273     0.60   0.552       .77838    1.598732
          3  |   1.192669    .216294     0.97   0.331     .8358954    1.701719
          4  |   1.224523   .2253875     1.10   0.271     .8536773    1.756469
5 most de..  |   2.139871   .3588327     4.54   0.000     1.540461     2.97252
             |
   obese4cat |
Obese I ..)  |   1.015927   .1478938     0.11   0.914     .7637452    1.351376
Obese II..)  |   .9058269   .2033676    -0.44   0.660     .5833667     1.40653
Obese II..)  |   1.541223   .3574967     1.86   0.062     .9781911    2.428327
             |
smoke_nomiss |
     Former  |   1.190546   .1416212     1.47   0.143     .9429566    1.503145
    Current  |   1.168602   .2448721     0.74   0.457     .7750029    1.762097
             |
     diabcat |
Controlle..  |   1.234017   .3399671     0.76   0.445      .719148    2.117503
Uncontrol..  |   2.105931   .6148315     2.55   0.011     1.188321     3.73211
Diabetes,..  |   3.58e-15   8.84e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   1.872243   .6418005     1.83   0.067     .9562522    3.665659
       1.pad |   1.315377   .7912261     0.46   0.649      .404609    4.276272
1.hyperten~n |    1.34675   .3032278     1.32   0.186     .8662324     2.09382
1.heart_f~re |   1.217704   .3382474     0.71   0.478     .7064796    2.098863
1.stroke_tia |   3.782927   1.690282     2.98   0.003      1.57578    9.081561
       1.vte |   2.384105   1.245018     1.66   0.096     .8566713    6.634932
 1.oestrogen |    .460196   .4639512    -0.77   0.441     .0637963    3.319633
1.antiplat~t |   .6965437   .1452156    -1.73   0.083     .4629026    1.048111
1.flu_vac~ne |   1.039418   .1309572     0.31   0.759     .8119826    1.330559
             |
   ethnicity |
      Mixed  |   3.301771   1.929757     2.04   0.041     1.050153    10.38105
Asian or ..  |   2.068808   .6568625     2.29   0.022     1.110343    3.854635
      Black  |   .4231796   .4252741    -0.86   0.392     .0590351    3.033466
      Other  |   2.829253   1.283813     2.29   0.022     1.162591    6.885199
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar2_ethn.ste
> r not found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist      

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3884.4953
Iteration 1:   log likelihood = -3810.5855
Iteration 2:   log likelihood = -3795.6817
Iteration 3:   log likelihood = -3795.3176
Iteration 4:   log likelihood = -3795.2876
Iteration 5:   log likelihood = -3795.2766
Iteration 6:   log likelihood = -3795.2726
Iteration 7:   log likelihood = -3795.2711
Iteration 8:   log likelihood = -3795.2706
Iteration 9:   log likelihood = -3795.2704
Iteration 10:  log likelihood = -3795.2703
Iteration 11:  log likelihood = -3795.2703
Iteration 12:  log likelihood = -3795.2703
Iteration 13:  log likelihood = -3795.2703
Iteration 14:  log likelihood = -3795.2703
Iteration 15:  log likelihood = -3795.2703
Iteration 16:  log likelihood = -3795.2703
Iteration 17:  log likelihood = -3795.2703
Iteration 18:  log likelihood = -3795.2703
Iteration 19:  log likelihood = -3795.2703
Iteration 20:  log likelihood = -3795.2703
Iteration 21:  log likelihood = -3795.2703
Iteration 22:  log likelihood = -3795.2703
Iteration 23:  log likelihood = -3795.2703
Iteration 24:  log likelihood = -3795.2703
Iteration 25:  log likelihood = -3795.2703
Iteration 26:  log likelihood = -3795.2703
Iteration 27:  log likelihood = -3795.2703
Iteration 28:  log likelihood = -3795.2703
Iteration 29:  log likelihood = -3795.2703
Iteration 30:  log likelihood = -3795.2703
Iteration 31:  log likelihood = -3795.2703
Iteration 32:  log likelihood = -3795.2703
Iteration 33:  log likelihood = -3795.2703
Iteration 34:  log likelihood = -3795.2703
Iteration 35:  log likelihood = -3795.2703
Iteration 36:  log likelihood = -3795.2703
Iteration 37:  log likelihood = -3795.2703
Iteration 38:  log likelihood = -3795.2703
Iteration 39:  log likelihood = -3795.2703
Iteration 40:  log likelihood = -3795.2703
Iteration 41:  log likelihood = -3795.2703
Iteration 42:  log likelihood = -3795.2703
Iteration 43:  log likelihood = -3795.2703
Iteration 44:  log likelihood = -3795.2703
Refining estimates:
Iteration 0:   log likelihood = -3795.2703

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          358
Time at risk    =     10837899
                                                LR chi2(25)      =      178.45
Log likelihood  =   -3795.2703                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .743739   .0916916    -2.40   0.016     .5840909    .9470232
      1.male |   .9184226   .2257866    -0.35   0.729     .5672593    1.486974
        age1 |   .9863541   .0137852    -0.98   0.326     .9597022    1.013746
        age2 |   1.122913     .03983     3.27   0.001       1.0475    1.203756
        age3 |   .6890677   .1918284    -1.34   0.181     .3992983    1.189122
             |
         imd |
          2  |   1.117508   .2051827     0.61   0.545      .779765    1.601539
          3  |    1.19847   .2172711     1.00   0.318     .8400637    1.709786
          4  |    1.23533   .2271764     1.15   0.250      .861485    1.771408
5 most de..  |   2.179385   .3645606     4.66   0.000     1.570174    3.024964
             |
   obese4cat |
Obese I ..)  |   1.005373   .1463732     0.04   0.971     .7557878    1.337379
Obese II..)  |   .8785359   .1971076    -0.58   0.564     .5659586    1.363749
Obese II..)  |   1.481791   .3433725     1.70   0.090     .9408921    2.333642
             |
smoke_nomiss |
     Former  |   1.171881   .1388016     1.34   0.181     .9291043    1.478097
    Current  |   1.144277   .2393938     0.64   0.519     .7593663    1.724291
             |
     diabcat |
Controlle..  |   1.288819   .3541583     0.92   0.356     .7521214    2.208493
Uncontrol..  |   2.172713   .6345648     2.66   0.008     1.225743    3.851281
Diabetes,..  |   1.63e-19          .        .       .            .           .
             |
1.myocardi~t |   1.850219   .6345126     1.79   0.073     .9447414    3.623544
       1.pad |    1.27848   .7692777     0.41   0.683     .3931112    4.157888
1.hyperten~n |   1.340203   .3021361     1.30   0.194     .8615392    2.084807
1.heart_f~re |   1.195778   .3326836     0.64   0.520       .69316    2.062851
1.stroke_tia |   3.706033   1.663579     2.92   0.004     1.537512    8.933055
       1.vte |   2.323238   1.218285     1.61   0.108     .8312491    6.493159
 1.oestrogen |   .4515845   .4551546    -0.79   0.430     .0626337    3.255892
1.antiplat~t |   .7128365   .1484367    -1.63   0.104     .4739592    1.072109
1.flu_vac~ne |   1.039224   .1309817     0.31   0.760      .811756    1.330433
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar2_withoute
> thn.ster not found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar2_withoutethn.ste
> r saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1147.1209
Iteration 1:   log likelihood = -1097.8693
Iteration 2:   log likelihood = -1044.9164
Iteration 3:   log likelihood = -1044.2314
Iteration 4:   log likelihood = -1044.2063
Iteration 5:   log likelihood = -1044.1973
Iteration 6:   log likelihood = -1044.1939
Iteration 7:   log likelihood = -1044.1927
Iteration 8:   log likelihood = -1044.1922
Iteration 9:   log likelihood = -1044.1921
Iteration 10:  log likelihood =  -1044.192
Iteration 11:  log likelihood =  -1044.192
Iteration 12:  log likelihood =  -1044.192
Iteration 13:  log likelihood =  -1044.192
Iteration 14:  log likelihood =  -1044.192
Iteration 15:  log likelihood =  -1044.192
Iteration 16:  log likelihood =  -1044.192
Iteration 17:  log likelihood =  -1044.192
Iteration 18:  log likelihood =  -1044.192
Iteration 19:  log likelihood =  -1044.192
Iteration 20:  log likelihood =  -1044.192
Iteration 21:  log likelihood =  -1044.192
Iteration 22:  log likelihood =  -1044.192
Iteration 23:  log likelihood =  -1044.192
Iteration 24:  log likelihood =  -1044.192
Iteration 25:  log likelihood =  -1044.192
Iteration 26:  log likelihood =  -1044.192
Iteration 27:  log likelihood =  -1044.192
Iteration 28:  log likelihood =  -1044.192
Iteration 29:  log likelihood =  -1044.192
Iteration 30:  log likelihood =  -1044.192
Refining estimates:
Iteration 0:   log likelihood =  -1044.192
Iteration 1:   log likelihood =  -1044.192
Iteration 2:   log likelihood =  -1044.192

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          358
Time at risk    =     10837899
                                                LR chi2(37)      =      205.86
Log likelihood  =    -1044.192                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .713563   .0953648    -2.53   0.012     .5491269    .9272395
      1.male |   .8804525   .2252735    -0.50   0.619     .5332326    1.453768
        age1 |   .9992058   .0145949    -0.05   0.957      .971006    1.028225
        age2 |    1.11593   .0423589     2.89   0.004     1.035922    1.202119
        age3 |   .6801748   .2048902    -1.28   0.201     .3768874    1.227522
             |
         imd |
          2  |   1.068908   .2202669     0.32   0.746      .713733     1.60083
          3  |   1.231246   .2548108     1.01   0.315     .8207022    1.847158
          4  |    1.14928   .2545945     0.63   0.530     .7444973    1.774142
5 most de..  |   1.720131    .376208     2.48   0.013     1.120459    2.640747
             |
   obese4cat |
Obese I ..)  |   1.090569   .1666403     0.57   0.570     .8083296    1.471356
Obese II..)  |    .929559   .2174688    -0.31   0.755     .5876785    1.470328
Obese II..)  |   1.640998   .4040256     2.01   0.044     1.012829    2.658765
             |
smoke_nomiss |
     Former  |   1.139937   .1475125     1.01   0.311     .8845697    1.469027
    Current  |   1.065489   .2397912     0.28   0.778     .6854623    1.656205
             |
     diabcat |
Controlle..  |   1.362889   .3994518     1.06   0.291     .7673268    2.420699
Uncontrol..  |   1.844206   .5795771     1.95   0.051     .9961001    3.414411
Diabetes,..  |   1.49e-14   1.49e-07    -0.00   1.000            0           .
             |
1.myocardi~t |   2.079918   .7515271     2.03   0.043     1.024437    4.222862
       1.pad |    1.12865   .7031966     0.19   0.846     .3328317    3.827311
1.hyperten~n |   1.478116    .348046     1.66   0.097     .9317069    2.344971
1.heart_f~re |    1.30447   .3730373     0.93   0.353      .744762    2.284815
1.stroke_tia |   5.233211   2.518061     3.44   0.001     2.037963    13.43818
       1.vte |   2.902919   1.578056     1.96   0.050      1.00026    8.424744
 1.oestrogen |   .4833308   .4974292    -0.71   0.480     .0643005    3.633079
1.antiplat~t |   .6263313   .1397768    -2.10   0.036     .4044302    .9699842
1.flu_vac~ne |   1.001348   .1359548     0.01   0.992     .7673897    1.306635
             |
         ckd |
        CKD  |   1.209651   .1781185     1.29   0.196     .9064056     1.61435
      1.copd |   1.546389   .2569145     2.62   0.009      1.11661    2.141588
1.other_re~y |   .6173255   .1826282    -1.63   0.103     .3456978    1.102381
1.immunode~y |   .6376913   .4647157    -0.62   0.537     .1528621    2.660242
    1.cancer |   1.038689   .1615488     0.24   0.807      .765768    1.408881
1.ae_atten~r |   1.884389   .2205539     5.41   0.000      1.49811    2.370268
1.gp_consult |   .9283133   .3116567    -0.22   0.825     .4807576    1.792516
             |
   ethnicity |
      Mixed  |   4.482473   3.422473     1.96   0.049     1.003703    20.01843
Asian or ..  |   2.587871   1.047651     2.35   0.019     1.170441     5.72184
      Black  |   .3857602   .3993113    -0.92   0.357     .0507241     2.93373
      Other  |   3.870738   2.061471     2.54   0.011     1.362895    10.99323
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar3_ethn.ste
> r not found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1147.1209
Iteration 1:   log likelihood = -1105.4643
Iteration 2:   log likelihood = -1051.5926
Iteration 3:   log likelihood =  -1050.886
Iteration 4:   log likelihood = -1050.8585
Iteration 5:   log likelihood = -1050.8485
Iteration 6:   log likelihood = -1050.8448
Iteration 7:   log likelihood = -1050.8435
Iteration 8:   log likelihood =  -1050.843
Iteration 9:   log likelihood = -1050.8428
Iteration 10:  log likelihood = -1050.8427
Iteration 11:  log likelihood = -1050.8427
Iteration 12:  log likelihood = -1050.8427
Iteration 13:  log likelihood = -1050.8427
Iteration 14:  log likelihood = -1050.8427
Iteration 15:  log likelihood = -1050.8427
Iteration 16:  log likelihood = -1050.8427
Iteration 17:  log likelihood = -1050.8427
Iteration 18:  log likelihood = -1050.8427
Iteration 19:  log likelihood = -1050.8427
Iteration 20:  log likelihood = -1050.8427
Iteration 21:  log likelihood = -1050.8427
Iteration 22:  log likelihood = -1050.8427
Iteration 23:  log likelihood = -1050.8427
Iteration 24:  log likelihood = -1050.8427
Iteration 25:  log likelihood = -1050.8427
Iteration 26:  log likelihood = -1050.8427
Iteration 27:  log likelihood = -1050.8427
Iteration 28:  log likelihood = -1050.8427
Iteration 29:  log likelihood = -1050.8427
Iteration 30:  log likelihood = -1050.8427
Iteration 31:  log likelihood = -1050.8427
Refining estimates:
Iteration 0:   log likelihood = -1050.8427
Iteration 1:   log likelihood = -1050.8427

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          358
Time at risk    =     10837899
                                                LR chi2(33)      =      192.56
Log likelihood  =   -1050.8427                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7185185   .0955483    -2.49   0.013     .5536631    .9324604
      1.male |   .8873233   .2270238    -0.47   0.640     .5374028    1.465088
        age1 |   .9971998   .0144865    -0.19   0.847     .9692072    1.026001
        age2 |   1.113055   .0422438     2.82   0.005     1.033263    1.199009
        age3 |    .694667   .2092914    -1.21   0.227     .3848789    1.253803
             |
         imd |
          2  |   1.083597   .2221166     0.39   0.695     .7250833    1.619376
          3  |   1.225418    .252838     0.99   0.325     .8178197    1.836162
          4  |   1.122578   .2483241     0.52   0.601      .727651    1.731848
5 most de..  |   1.723802   .3761515     2.50   0.013     1.123948    2.643799
             |
   obese4cat |
Obese I ..)  |   1.063844   .1620031     0.41   0.684     .7893254    1.433836
Obese II..)  |   .8872562   .2071559    -0.51   0.608     .5614501    1.402126
Obese II..)  |   1.552814    .379409     1.80   0.072     .9619225    2.506681
             |
smoke_nomiss |
     Former  |    1.11628   .1429504     0.86   0.390     .8684974    1.434755
    Current  |   1.037665   .2323971     0.17   0.869     .6689919     1.60951
             |
     diabcat |
Controlle..  |   1.399773   .4081989     1.15   0.249     .7903724    2.479038
Uncontrol..  |   2.000234   .6219781     2.23   0.026      1.08742    3.679292
Diabetes,..  |   1.52e-14   1.45e-07    -0.00   1.000            0           .
             |
1.myocardi~t |    2.03994   .7359325     1.98   0.048     1.005858    4.137123
       1.pad |   1.081326   .6734021     0.13   0.900      .319055    3.664776
1.hyperten~n |   1.470674   .3460045     1.64   0.101     .9273736    2.332266
1.heart_f~re |   1.267416   .3629135     0.83   0.408     .7230781    2.221536
1.stroke_tia |   4.889988   2.358247     3.29   0.001     1.900234    12.58371
       1.vte |   2.689699   1.469883     1.81   0.070     .9215818    7.850069
 1.oestrogen |   .4501729   .4630506    -0.78   0.438     .0599554    3.380107
1.antiplat~t |   .6459051   .1430079    -1.97   0.048     .4185108     .996852
1.flu_vac~ne |   1.000209    .135402     0.00   0.999     .7671145     1.30413
             |
         ckd |
        CKD  |    1.22287   .1791438     1.37   0.170     .9176643    1.629584
      1.copd |   1.523588    .252026     2.55   0.011     1.101704    2.107026
1.other_re~y |    .620365   .1828286    -1.62   0.105     .3481677    1.105366
1.immunode~y |    .661512   .4800864    -0.57   0.569     .1595092    2.743403
    1.cancer |   1.032252   .1599082     0.20   0.838     .7619468    1.398451
1.ae_atten~r |   1.901964   .2218574     5.51   0.000     1.513257    2.390518
1.gp_consult |   .8983623   .3007356    -0.32   0.749     .4661261    1.731409
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar3_withoute
> thn.ster not found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar3_withoutethn.ste
> r saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table3_positivecovidtest.txt not found
> )

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,379     2761915           0    2761915    2761915

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,800     8075985           0    8075985    8075985

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7931885   .0913349    -2.01   0.044     .6329383    .9940115
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8135229   .0950688    -1.77   0.077     .6469903     1.02292
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .743099    .091661    -2.41   0.016      .583514    .9463289
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .743739   .0916916    -2.40   0.016     .5840909    .9470232
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .713563   .0953648    -2.53   0.012     .5491269    .9272395
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7185185   .0955483    -2.49   0.013     .5536631    .9324604
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/06a_an_models_ethnicity_positivecovidtes
> t.log
  log type:  text
 closed on:  31 Dec 2020, 02:49:19
-------------------------------------------------------------------------------
