-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/08a_an_model_checks_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 02:47:07

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05991        15.88        1         0.0001
      ------------+---------------------------------------------------
      global test |                     15.88        1         0.0001
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
0

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot1.svg not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot1.svg written in SVG for
> mat)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -49183.563
Iteration 1:   log likelihood = -49099.871
Iteration 2:   log likelihood =  -49058.38
Iteration 3:   log likelihood = -49056.777
Iteration 4:   log likelihood = -49056.773
Refining estimates:
Iteration 0:   log likelihood = -49056.773

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =        4,425
Time at risk    =   14269610.5
                                                LR chi2(5)       =      253.58
Log likelihood  =   -49056.773                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.004598   .0349453     0.13   0.895     .9383889    1.075478
      1.male |   1.001411   .0388544     0.04   0.971     .9280811    1.080534
        age1 |   .9792727    .003257    -6.30   0.000     .9729098    .9856772
        age2 |   1.034614   .0085463     4.12   0.000     1.017998    1.051501
        age3 |   1.109145   .0743774     1.54   0.122      .972542    1.264936
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05290        12.47        1         0.0004
      0b.male     |            .            .        1             .
      1.male      |      0.00078         0.00        1         0.9589
      age1        |      0.04128         6.74        1         0.0094
      age2        |     -0.03493         5.10        1         0.0240
      age3        |      0.00296         0.04        1         0.8461
      ------------+---------------------------------------------------
      global test |                     61.74        5         0.0000
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot2.svg not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot2.svg written in SVG for
> mat)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -49183.563
Iteration 1:   log likelihood = -49056.476
Iteration 2:   log likelihood = -49016.142
Iteration 3:   log likelihood = -49014.571
Iteration 4:   log likelihood = -49014.567
Iteration 5:   log likelihood = -49014.567
Refining estimates:
Iteration 0:   log likelihood = -49014.567

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =        4,425
Time at risk    =   14269610.5
                                                LR chi2(26)      =      337.99
Log likelihood  =   -49014.567                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.00565   .0370742     0.15   0.879     .9355488    1.081004
      1.male |    .918177   .0604672    -1.30   0.195     .8069933    1.044679
        age1 |   .9862019   .0039569    -3.46   0.001     .9784769    .9939879
        age2 |   1.035947   .0105998     3.45   0.001     1.015379    1.056932
        age3 |   1.064979   .0907205     0.74   0.460     .9012205    1.258493
             |
         imd |
          2  |   1.026152   .0496121     0.53   0.593     .9333792    1.128146
          3  |   1.038256   .0502729     0.78   0.438      .944254    1.141616
          4  |   1.217193   .0580458     4.12   0.000      1.10858    1.336447
5 most de..  |   1.275531   .0618821     5.02   0.000     1.159833    1.402772
             |
   obese4cat |
Obese I ..)  |   .9367883   .0381086    -1.61   0.108     .8649968    1.014538
Obese II..)  |   .9621167   .0554175    -0.67   0.503     .8594071    1.077101
Obese II..)  |   1.002073   .0716871     0.03   0.977     .8709745    1.152904
             |
smoke_nomiss |
     Former  |   1.077095   .0354597     2.26   0.024      1.00979    1.148886
    Current  |   1.169034   .0672564     2.71   0.007     1.044374    1.308574
             |
     diabcat |
Controlle..  |    1.09759   .0814991     1.25   0.210     .9489345    1.269534
Uncontrol..  |   1.258337   .1117185     2.59   0.010     1.057366    1.497507
Diabetes,..  |   .8981032   .3436054    -0.28   0.779     .4242921    1.901024
             |
1.myocardi~t |   1.114397   .1085291     1.11   0.266     .9207524    1.348767
       1.pad |   1.450966   .2081631     2.59   0.009     1.095316    1.922096
1.hyperten~n |   1.001833   .0617701     0.03   0.976     .8877949    1.130519
1.heart_f~re |   1.106521   .0808898     1.38   0.166      .958814    1.276982
1.stroke_tia |   1.239188   .1770758     1.50   0.133      .936491    1.639725
       1.vte |   1.390646   .2197049     2.09   0.037     1.020322    1.895378
 1.oestrogen |   1.101858   .1777093     0.60   0.548      .803235    1.511502
1.antiplat~t |   1.022013   .0575195     0.39   0.699     .9152723    1.141202
1.flu_vac~ne |   1.033968   .0365125     0.95   0.344     .9648248    1.108066
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05809        15.37        1         0.0001
      0b.male     |            .            .        1             .
      1.male      |      0.00355         0.06        1         0.8075
      age1        |      0.01050         0.47        1         0.4942
      age2        |     -0.02048         1.86        1         0.1721
      age3        |      0.00057         0.00        1         0.9698
      1b.imd      |            .            .        1             .
      2.imd       |      0.00408         0.07        1         0.7862
      3.imd       |      0.00219         0.02        1         0.8843
      4.imd       |     -0.00628         0.17        1         0.6763
      5.imd       |     -0.00989         0.44        1         0.5086
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.02196         2.16        1         0.1421
      3.obese4cat |     -0.01325         0.79        1         0.3752
      4.obese4cat |     -0.01597         1.15        1         0.2839
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02340         2.42        1         0.1198
      3.smoke_no~s|     -0.02500         2.81        1         0.0937
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00591         0.16        1         0.6937
      3.diabcat   |     -0.04675         9.70        1         0.0018
      4.diabcat   |     -0.01190         0.63        1         0.4282
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00473         0.10        1         0.7506
      0b.pad      |            .            .        1             .
      1.pad       |      0.00033         0.00        1         0.9824
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00842         0.34        1         0.5619
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00344         0.06        1         0.8141
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01685         1.35        1         0.2448
      0b.vte      |            .            .        1             .
      1.vte       |     -0.01717         1.42        1         0.2330
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00872         0.34        1         0.5624
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.03929         7.00        1         0.0082
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.02871         3.66        1         0.0558
      ------------+---------------------------------------------------
      global test |                    104.25       26         0.0000
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot3.svg not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot3.svg written in SVG for
> mat)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -15589.461
Iteration 1:   log likelihood = -15217.375
Iteration 2:   log likelihood = -15178.019
Iteration 3:   log likelihood = -15177.425
Iteration 4:   log likelihood = -15177.425
Refining estimates:
Iteration 0:   log likelihood = -15177.425

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =        4,425
Time at risk    =   14269610.5
                                                LR chi2(33)      =      824.07
Log likelihood  =   -15177.425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.007926   .0386268     0.21   0.837     .9349927    1.086549
      1.male |   .9558146   .0644883    -0.67   0.503     .8374204    1.090947
        age1 |   .9887631   .0041853    -2.67   0.008     .9805941    .9970003
        age2 |   1.027396   .0108902     2.55   0.011     1.006272    1.048964
        age3 |   1.083039   .0956133     0.90   0.366      .910957    1.287627
             |
         imd |
          2  |   1.029479   .0547686     0.55   0.585     .9275417     1.14262
          3  |   1.045713   .0578041     0.81   0.419     .9383402    1.165371
          4  |   1.143495   .0658413     2.33   0.020     1.021464    1.280105
5 most de..  |   1.181491   .0725882     2.71   0.007     1.047453    1.332681
             |
   obese4cat |
Obese I ..)  |   .9445719   .0394428    -1.37   0.172     .8703443     1.02513
Obese II..)  |   .9869837   .0583438    -0.22   0.825     .8790078    1.108223
Obese II..)  |    1.00818   .0743183     0.11   0.912     .8725524    1.164889
             |
smoke_nomiss |
     Former  |   1.036473   .0356997     1.04   0.298     .9688122    1.108859
    Current  |   1.102132   .0670668     1.60   0.110     .9782193     1.24174
             |
     diabcat |
Controlle..  |   1.074916   .0830543     0.93   0.350     .9238592    1.250672
Uncontrol..  |   1.214647   .1111943     2.12   0.034     1.015143    1.453359
Diabetes,..  |    .892356   .3517317    -0.29   0.773      .412124    1.932184
             |
1.myocardi~t |   1.046812   .1050397     0.46   0.648     .8599177    1.274325
       1.pad |    1.50181    .222866     2.74   0.006     1.122789    2.008777
1.hyperten~n |   1.021624   .0646456     0.34   0.735     .9024634     1.15652
1.heart_f~re |   1.092159   .0823628     1.17   0.242     .9420942    1.266127
1.stroke_tia |   1.278683   .1874512     1.68   0.094      .959355    1.704302
       1.vte |   1.336004   .2183563     1.77   0.076     .9698116    1.840467
 1.oestrogen |   1.165161   .1929932     0.92   0.356     .8421626    1.612041
1.antiplat~t |   1.002044   .0581517     0.04   0.972     .8943118    1.122754
1.flu_vac~ne |    .986739    .036482    -0.36   0.718     .9177649    1.060897
             |
         ckd |
        CKD  |   1.187488    .049571     4.12   0.000     1.094199     1.28873
      1.copd |   1.212951   .0619112     3.78   0.000     1.097479    1.340572
1.other_re~y |   1.283805   .0899704     3.56   0.000     1.119041    1.472829
1.immunode~y |   1.319515    .173127     2.11   0.035     1.020311    1.706461
    1.cancer |    1.37243   .0549871     7.90   0.000     1.268781    1.484548
1.ae_atten~r |   1.904171   .0635281    19.30   0.000     1.783641    2.032844
1.gp_consult |   1.083593   .1162198     0.75   0.454     .8781552    1.337091
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.06490        19.41        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |      0.00282         0.04        1         0.8467
      age1        |      0.00297         0.04        1         0.8455
      age2        |     -0.01408         0.88        1         0.3480
      age3        |      0.00137         0.01        1         0.9270
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01035         0.48        1         0.4896
      3.imd       |     -0.01170         0.60        1         0.4372
      4.imd       |     -0.01480         0.96        1         0.3265
      5.imd       |     -0.02248         2.21        1         0.1370
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01794         1.44        1         0.2302
      3.obese4cat |     -0.01012         0.46        1         0.4997
      4.obese4cat |     -0.01837         1.51        1         0.2193
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00756         0.26        1         0.6134
      3.smoke_no~s|     -0.01140         0.58        1         0.4460
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00080         0.00        1         0.9572
      3.diabcat   |     -0.04498         8.86        1         0.0029
      4.diabcat   |     -0.00945         0.43        1         0.5116
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00441         0.09        1         0.7663
      0b.pad      |            .            .        1             .
      1.pad       |      0.00565         0.14        1         0.7037
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01125         0.59        1         0.4409
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.01038         0.50        1         0.4804
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01491         1.04        1         0.3073
      0b.vte      |            .            .        1             .
      1.vte       |     -0.01554         1.17        1         0.2788
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.01236         0.68        1         0.4082
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.04487         9.14        1         0.0025
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.02828         3.60        1         0.0579
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.02795         3.56        1         0.0592
      0b.copd     |            .            .        1             .
      1.copd      |     -0.04600         9.47        1         0.0021
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00552         0.13        1         0.7143
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.02838         3.59        1         0.0582
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.02280         2.31        1         0.1282
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.06049        16.27        1         0.0001
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.03165         4.27        1         0.0387
      ------------+---------------------------------------------------
      global test |                    139.12       33         0.0000
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot4.svg not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot4.svg written in SVG for
> mat)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table5_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(18,087 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05388         9.66        1         0.0019
      ------------+---------------------------------------------------
      global test |                      9.66        1         0.0019
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
0

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot1_completecase.svg
>  not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot1_completecase.svg writt
> en in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood = -35957.028
Iteration 2:   log likelihood = -35924.404
Iteration 3:   log likelihood = -35922.926
Iteration 4:   log likelihood = -35922.922
Iteration 5:   log likelihood = -35922.922
Refining estimates:
Iteration 0:   log likelihood = -35922.922

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(5)       =      182.58
Log likelihood  =   -35922.922                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9921007   .0396398    -0.20   0.843     .9173722    1.072916
      1.male |   .9873321   .0431532    -0.29   0.771     .9062748    1.075639
        age1 |   .9787647   .0036492    -5.76   0.000     .9716384    .9859433
        age2 |   1.035131   .0098576     3.63   0.000     1.015989    1.054633
        age3 |   1.118465   .0880093     1.42   0.155     .9586136    1.304973
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.04795         7.74        1         0.0054
      0b.male     |            .            .        1             .
      1.male      |     -0.00492         0.08        1         0.7771
      age1        |      0.03787         4.30        1         0.0381
      age2        |     -0.02855         2.59        1         0.1078
      age3        |     -0.00190         0.01        1         0.9133
      ------------+---------------------------------------------------
      global test |                     38.13        5         0.0000
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot2_completecase.svg
>  not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot2_completecase.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood = -35904.133
Iteration 2:   log likelihood = -35871.794
Iteration 3:   log likelihood =  -35870.43
Iteration 4:   log likelihood = -35870.426
Iteration 5:   log likelihood = -35870.426
Refining estimates:
Iteration 0:   log likelihood = -35870.426

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(30)      =      287.58
Log likelihood  =   -35870.426                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9900663   .0419614    -0.24   0.814     .9111467    1.075822
      1.male |    .891499   .0669623    -1.53   0.126     .7694588    1.032896
        age1 |   .9878981   .0044707    -2.69   0.007     .9791744    .9966996
        age2 |   1.038388    .012366     3.16   0.002     1.014431     1.06291
        age3 |   1.047382   .1049899     0.46   0.644     .8605582    1.274764
             |
         imd |
          2  |     1.0331   .0592725     0.57   0.570     .9232215    1.156056
          3  |   1.087275   .0617075     1.47   0.140     .9728148    1.215203
          4  |   1.265149   .0705548     4.22   0.000     1.134154    1.411275
5 most de..  |   1.304538   .0733587     4.73   0.000     1.168398    1.456541
             |
   obese4cat |
Obese I ..)  |   .9177052   .0427423    -1.84   0.065     .8376418    1.005421
Obese II..)  |    .984482   .0639307    -0.24   0.810     .8668264    1.118107
Obese II..)  |   .9632878   .0795455    -0.45   0.651     .8193441     1.13252
             |
smoke_nomiss |
     Former  |   1.095462   .0419902     2.38   0.017     1.016178    1.180932
    Current  |   1.202825   .0791846     2.81   0.005     1.057221    1.368481
             |
     diabcat |
Controlle..  |   1.048715   .0894432     0.56   0.577     .8872786    1.239525
Uncontrol..  |   1.345154   .1326699     3.01   0.003     1.108714    1.632016
Diabetes,..  |   .4944742   .2875858    -1.21   0.226      .158156    1.545972
             |
1.myocardi~t |   1.045968   .1192546     0.39   0.693     .8365076    1.307877
       1.pad |   1.562951     .25421     2.75   0.006     1.136317    2.149766
1.hyperten~n |   1.046784    .073762     0.65   0.516     .9117522    1.201814
1.heart_f~re |   1.166125   .0972154     1.84   0.065     .9903388    1.373114
1.stroke_tia |   1.196095   .1979578     1.08   0.279     .8647464    1.654407
       1.vte |   1.469686   .2665565     2.12   0.034     1.030012     2.09704
 1.oestrogen |   1.209376   .2120488     1.08   0.278     .8576575    1.705331
1.antiplat~t |   .9927913   .0646271    -0.11   0.912     .8738721    1.127893
1.flu_vac~ne |   1.032246   .0423572     0.77   0.439     .9524776    1.118694
             |
   ethnicity |
      Mixed  |   1.250906   .3627759     0.77   0.440     .7085446    2.208422
Asian or ..  |   1.664198   .1845536     4.59   0.000      1.33909    2.068237
      Black  |   1.027873   .2218199     0.13   0.899     .6733585    1.569036
      Other  |   1.451461   .2816602     1.92   0.055     .9922638    2.123164
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.04999         8.63        1         0.0033
      0b.male     |            .            .        1             .
      1.male      |      0.00170         0.01        1         0.9187
      age1        |      0.00322         0.03        1         0.8549
      age2        |     -0.01310         0.58        1         0.4458
      age3        |     -0.00449         0.07        1         0.7928
      1b.imd      |            .            .        1             .
      2.imd       |      0.01689         0.95        1         0.3297
      3.imd       |      0.00809         0.22        1         0.6403
      4.imd       |      0.00371         0.05        1         0.8306
      5.imd       |      0.00158         0.01        1         0.9272
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01370         0.63        1         0.4260
      3.obese4cat |     -0.00470         0.07        1         0.7849
      4.obese4cat |     -0.02496         2.11        1         0.1460
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03662         4.46        1         0.0347
      3.smoke_no~s|     -0.02522         2.15        1         0.1425
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00555         0.10        1         0.7471
      3.diabcat   |     -0.04700         7.36        1         0.0067
      4.diabcat   |     -0.02761         2.52        1         0.1123
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01226         0.51        1         0.4734
      0b.pad      |            .            .        1             .
      1.pad       |      0.01077         0.39        1         0.5330
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01296         0.61        1         0.4351
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00692         0.17        1         0.6814
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02236         1.78        1         0.1821
      0b.vte      |            .            .        1             .
      1.vte       |     -0.02285         1.92        1         0.1662
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.00413         0.06        1         0.8116
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.03104         3.32        1         0.0686
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.04544         6.87        1         0.0088
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.03208         3.44        1         0.0638
      3.ethnicity |      0.00195         0.01        1         0.9107
      4.ethnicity |     -0.00006         0.00        1         0.9970
      5.ethnicity |     -0.02190         1.60        1         0.2057
      ------------+---------------------------------------------------
      global test |                     85.94       30         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot3_completecase_eth
> n.svg not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot3_completecase_ethn.svg 
> written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -36014.214
Iteration 1:   log likelihood =  -35914.04
Iteration 2:   log likelihood = -35882.667
Iteration 3:   log likelihood = -35881.262
Iteration 4:   log likelihood = -35881.258
Iteration 5:   log likelihood = -35881.258
Refining estimates:
Iteration 0:   log likelihood = -35881.258

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(26)      =      265.91
Log likelihood  =   -35881.258                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9891487    .041922    -0.26   0.797     .9103032    1.074823
      1.male |   .8870299    .066651    -1.60   0.111     .7655604    1.027773
        age1 |    .985838   .0044287    -3.18   0.001      .977196    .9945565
        age2 |   1.040551   .0123747     3.34   0.001     1.016577    1.065089
        age3 |   1.039036   .1041276     0.38   0.702     .8537426    1.264545
             |
         imd |
          2  |   1.034322   .0593411     0.59   0.556     .9243161    1.157419
          3  |   1.091515   .0619335     1.54   0.123     .9766337    1.219909
          4  |    1.27689   .0711245     4.39   0.000     1.144828    1.424185
5 most de..  |    1.32386   .0742085     5.00   0.000     1.186119    1.477597
             |
   obese4cat |
Obese I ..)  |   .9124762   .0424891    -1.97   0.049     .8328863    .9996718
Obese II..)  |    .969568   .0629036    -0.48   0.634     .8537959    1.101038
Obese II..)  |   .9432942   .0778138    -0.71   0.479     .8024727    1.108828
             |
smoke_nomiss |
     Former  |   1.082605   .0413327     2.08   0.038     1.004551    1.166724
    Current  |   1.182358   .0776632     2.55   0.011     1.039531    1.344807
             |
     diabcat |
Controlle..  |     1.0755   .0915449     0.86   0.392     .9102429    1.270759
Uncontrol..  |   1.369055   .1349799     3.19   0.001     1.128491    1.660902
Diabetes,..  |   .5091118    .296055    -1.16   0.246     .1628653    1.591467
             |
1.myocardi~t |   1.043684   .1190127     0.37   0.708     .8346521    1.305067
       1.pad |   1.542732   .2509416     2.67   0.008     1.121589     2.12201
1.hyperten~n |   1.047411   .0738241     0.66   0.511     .9122681    1.202575
1.heart_f~re |    1.15996   .0967367     1.78   0.075     .9850443    1.365936
1.stroke_tia |   1.180912   .1959696     1.00   0.316     .8530267    1.634829
       1.vte |   1.445464   .2627155     2.03   0.043     1.012278    2.064023
 1.oestrogen |   1.187313   .2081186     0.98   0.327     .8420972     1.67405
1.antiplat~t |   1.004866   .0653511     0.07   0.940     .8846076    1.141473
1.flu_vac~ne |   1.031665    .042328     0.76   0.447     .9519512    1.118053
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.04983         8.58        1         0.0034
      0b.male     |            .            .        1             .
      1.male      |      0.00174         0.01        1         0.9167
      age1        |      0.00469         0.07        1         0.7900
      age2        |     -0.01333         0.60        1         0.4379
      age3        |     -0.00450         0.07        1         0.7921
      1b.imd      |            .            .        1             .
      2.imd       |      0.01702         0.96        1         0.3261
      3.imd       |      0.00784         0.20        1         0.6508
      4.imd       |      0.00384         0.05        1         0.8250
      5.imd       |      0.00093         0.00        1         0.9572
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01392         0.65        1         0.4186
      3.obese4cat |     -0.00405         0.06        1         0.8141
      4.obese4cat |     -0.02428         2.00        1         0.1572
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03645         4.42        1         0.0354
      3.smoke_no~s|     -0.02513         2.15        1         0.1430
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00625         0.13        1         0.7168
      3.diabcat   |     -0.04702         7.39        1         0.0066
      4.diabcat   |     -0.02749         2.50        1         0.1140
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01172         0.47        1         0.4926
      0b.pad      |            .            .        1             .
      1.pad       |      0.01091         0.40        1         0.5277
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01311         0.62        1         0.4295
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00717         0.18        1         0.6700
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02218         1.76        1         0.1841
      0b.vte      |            .            .        1             .
      1.vte       |     -0.02246         1.87        1         0.1720
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.00410         0.06        1         0.8133
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.03087         3.28        1         0.0702
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.04576         6.97        1         0.0083
      ------------+---------------------------------------------------
      global test |                     80.85       26         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot3_completecase.svg
>  not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot3_completecase.svg writt
> en in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(pract
> ice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10769.327
Iteration 1:   log likelihood = -10473.112
Iteration 2:   log likelihood = -10445.578
Iteration 3:   log likelihood = -10445.231
Iteration 4:   log likelihood = -10445.231
Refining estimates:
Iteration 0:   log likelihood = -10445.231

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(37)      =      648.19
Log likelihood  =   -10445.231                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .980183   .0436939    -0.45   0.653      .898179    1.069674
      1.male |   .9390739   .0725979    -0.81   0.416     .8070401    1.092709
        age1 |   .9895357   .0047529    -2.19   0.029     .9802638    .9988952
        age2 |   1.029322   .0128145     2.32   0.020      1.00451    1.054747
        age3 |   1.085111   .1140244     0.78   0.437     .8831396    1.333274
             |
         imd |
          2  |   1.026364    .065598     0.41   0.684     .9055215    1.163334
          3  |   1.100197   .0724804     1.45   0.147     .9669267    1.251835
          4  |   1.170678    .080149     2.30   0.021     1.023673    1.338795
5 most de..  |   1.226694   .0883106     2.84   0.005     1.065265    1.412586
             |
   obese4cat |
Obese I ..)  |   .9242086   .0446309    -1.63   0.103     .8407457    1.015957
Obese II..)  |   1.016912   .0685183     0.25   0.803     .8911083    1.160476
Obese II..)  |   .9881497   .0846283    -0.14   0.889      .835455    1.168752
             |
smoke_nomiss |
     Former  |   1.051306   .0424662     1.24   0.215     .9712837    1.137922
    Current  |   1.152636   .0810384     2.02   0.043     1.004261    1.322932
             |
     diabcat |
Controlle..  |   1.028186   .0918562     0.31   0.756     .8630319    1.224945
Uncontrol..  |   1.275297   .1314689     2.36   0.018     1.041986    1.560848
Diabetes,..  |   .4721654   .2808848    -1.26   0.207     .1471384    1.515174
             |
1.myocardi~t |   .9900858   .1174607    -0.08   0.933     .7846734    1.249271
       1.pad |   1.612643   .2746866     2.81   0.005     1.154916    2.251781
1.hyperten~n |   1.077827   .0783292     1.03   0.302     .9347375    1.242822
1.heart_f~re |     1.1589    .100562     1.70   0.089     .9776516     1.37375
1.stroke_tia |   1.216283   .2079978     1.14   0.252     .8699012     1.70059
       1.vte |   1.420718    .266019     1.88   0.061     .9842979    2.050638
 1.oestrogen |    1.25242   .2283257     1.23   0.217     .8761316    1.790319
1.antiplat~t |   .9557795   .0648787    -0.67   0.505     .8367155    1.091786
1.flu_vac~ne |   .9764851   .0423978    -0.55   0.584     .8968245    1.063222
             |
         ckd |
        CKD  |   1.206039   .0586987     3.85   0.000     1.096309    1.326753
      1.copd |   1.198322   .0703632     3.08   0.002     1.068053    1.344481
1.other_re~y |   1.242025   .1019527     2.64   0.008     1.057448    1.458821
1.immunode~y |   1.342124   .2004223     1.97   0.049     1.001569    1.798475
    1.cancer |   1.383862    .064912     6.93   0.000      1.26231    1.517119
1.ae_atten~r |   1.925453   .0748105    16.86   0.000     1.784271    2.077806
1.gp_consult |   1.216573   .1607444     1.48   0.138     .9390088    1.576182
             |
   ethnicity |
      Mixed  |    1.43272   .4420351     1.17   0.244     .7826026    2.622897
Asian or ..  |   1.630071   .2268892     3.51   0.000     1.240875    2.141338
      Black  |   1.095328   .2586609     0.39   0.700     .6894987    1.740022
      Other  |   1.646422   .3488369     2.35   0.019     1.086906    2.493963
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05503        10.58        1         0.0011
      0b.male     |            .            .        1             .
      1.male      |     -0.00138         0.01        1         0.9343
      age1        |     -0.00462         0.07        1         0.7947
      age2        |     -0.00703         0.17        1         0.6843
      age3        |     -0.00163         0.01        1         0.9241
      1b.imd      |            .            .        1             .
      2.imd       |      0.00439         0.07        1         0.7983
      3.imd       |     -0.00838         0.23        1         0.6286
      4.imd       |     -0.00827         0.23        1         0.6329
      5.imd       |     -0.01076         0.38        1         0.5353
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00690         0.16        1         0.6878
      3.obese4cat |     -0.00432         0.06        1         0.8018
      4.obese4cat |     -0.02817         2.65        1         0.1032
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02562         2.19        1         0.1390
      3.smoke_no~s|     -0.01979         1.31        1         0.2521
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00126         0.01        1         0.9415
      3.diabcat   |     -0.03983         5.24        1         0.0221
      4.diabcat   |     -0.02438         2.11        1         0.1465
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01189         0.49        1         0.4832
      0b.pad      |            .            .        1             .
      1.pad       |      0.01097         0.41        1         0.5195
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01612         0.92        1         0.3385
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.01262         0.55        1         0.4573
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01576         0.86        1         0.3537
      0b.vte      |            .            .        1             .
      1.vte       |     -0.02249         1.83        1         0.1761
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00075         0.00        1         0.9652
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.03598         4.50        1         0.0338
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.03590         4.36        1         0.0368
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.02508         2.13        1         0.1449
      0b.copd     |            .            .        1             .
      1.copd      |     -0.02724         2.48        1         0.1152
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00350         0.04        1         0.8409
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.03153         3.41        1         0.0648
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.02068         1.44        1         0.2306
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.06058        12.21        1         0.0005
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.03192         3.23        1         0.0722
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.02585         2.09        1         0.1480
      3.ethnicity |     -0.00459         0.07        1         0.7886
      4.ethnicity |     -0.00223         0.02        1         0.8987
      5.ethnicity |     -0.03096         3.16        1         0.0752
      ------------+---------------------------------------------------
      global test |                     95.23       37         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot4_completecase_eth
> n.svg not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot4_completecase_ethn.svg 
> written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10769.327
Iteration 1:   log likelihood = -10481.453
Iteration 2:   log likelihood = -10453.891
Iteration 3:   log likelihood = -10453.541
Iteration 4:   log likelihood = -10453.541
Refining estimates:
Iteration 0:   log likelihood = -10453.541

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =        3,329
Time at risk    =   10604172.5
                                                LR chi2(33)      =      631.57
Log likelihood  =   -10453.541                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9776506   .0435157    -0.51   0.612     .8959757    1.066771
      1.male |   .9382373   .0725428    -0.82   0.410     .8063049    1.091757
        age1 |   .9879839   .0047076    -2.54   0.011     .9788002    .9972538
        age2 |   1.030405   .0128106     2.41   0.016       1.0056    1.055822
        age3 |    1.08193     .11365     0.75   0.453      .880614    1.329268
             |
         imd |
          2  |   1.027309   .0656398     0.42   0.673     .9063868    1.164363
          3  |   1.099488   .0724415     1.44   0.150     .9662908    1.251046
          4  |   1.172661   .0802614     2.33   0.020     1.025447     1.34101
5 most de..  |   1.226617   .0882925     2.84   0.005     1.065219    1.412469
             |
   obese4cat |
Obese I ..)  |   .9225593   .0445137    -1.67   0.095     .8393124    1.014063
Obese II..)  |    1.00607   .0677378     0.09   0.928     .8816933    1.147992
Obese II..)  |   .9743061   .0833204    -0.30   0.761     .8239533    1.152095
             |
smoke_nomiss |
     Former  |   1.042547   .0419852     1.03   0.301     .9634211    1.128171
    Current  |   1.140623    .080073     1.87   0.061     .9940008    1.308873
             |
     diabcat |
Controlle..  |   1.042501   .0929447     0.47   0.641     .8753614    1.241555
Uncontrol..  |   1.287154   .1325027     2.45   0.014     1.051976    1.574908
Diabetes,..  |   .4744302   .2823647    -1.25   0.210     .1477631    1.523276
             |
1.myocardi~t |   .9897216   .1172979    -0.09   0.931     .7845706    1.248516
       1.pad |   1.612354    .274534     2.81   0.005     1.154854    2.251094
1.hyperten~n |   1.073722    .078015     0.98   0.328     .9312042    1.238052
1.heart_f~re |    1.15108   .0998211     1.62   0.105     .9711574    1.364336
1.stroke_tia |   1.198804   .2050806     1.06   0.289     .8572988    1.676347
       1.vte |   1.392804   .2608703     1.77   0.077     .9648531    2.010569
 1.oestrogen |   1.233033    .224806     1.15   0.251     .8625494    1.762647
1.antiplat~t |   .9577745   .0649655    -0.64   0.525     .8385453    1.093956
1.flu_vac~ne |    .977299   .0424027    -0.53   0.597     .8976267    1.064043
             |
         ckd |
        CKD  |   1.210446   .0588672     3.93   0.000     1.100396    1.331501
      1.copd |   1.195783   .0701874     3.05   0.002     1.065836    1.341573
1.other_re~y |   1.238602   .1016363     2.61   0.009     1.054592    1.454719
1.immunode~y |   1.342899   .2005453     1.97   0.048     1.002136    1.799532
    1.cancer |    1.38141   .0647633     6.89   0.000     1.260134    1.514358
1.ae_atten~r |   1.928833   .0749139    16.91   0.000     1.787454    2.081395
1.gp_consult |   1.212335   .1600964     1.46   0.145     .9358715    1.570468
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.05528        10.65        1         0.0011
      0b.male     |            .            .        1             .
      1.male      |     -0.00167         0.01        1         0.9205
      age1        |     -0.00397         0.05        1         0.8233
      age2        |     -0.00672         0.15        1         0.6979
      age3        |     -0.00207         0.01        1         0.9039
      1b.imd      |            .            .        1             .
      2.imd       |      0.00506         0.09        1         0.7687
      3.imd       |     -0.00807         0.22        1         0.6413
      4.imd       |     -0.00733         0.18        1         0.6720
      5.imd       |     -0.01094         0.40        1         0.5284
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00788         0.21        1         0.6463
      3.obese4cat |     -0.00251         0.02        1         0.8840
      4.obese4cat |     -0.02748         2.52        1         0.1122
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02408         1.94        1         0.1641
      3.smoke_no~s|     -0.01844         1.14        1         0.2853
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00214         0.02        1         0.9011
      3.diabcat   |     -0.04054         5.40        1         0.0202
      4.diabcat   |     -0.02435         2.11        1         0.1465
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01165         0.47        1         0.4928
      0b.pad      |            .            .        1             .
      1.pad       |      0.01137         0.45        1         0.5044
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01561         0.86        1         0.3539
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.01316         0.60        1         0.4377
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01547         0.83        1         0.3620
      0b.vte      |            .            .        1             .
      1.vte       |     -0.02175         1.72        1         0.1901
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.00010         0.00        1         0.9956
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.03716         4.79        1         0.0286
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.03655         4.51        1         0.0337
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.02526         2.15        1         0.1424
      0b.copd     |            .            .        1             .
      1.copd      |     -0.02653         2.35        1         0.1253
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00315         0.03        1         0.8564
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.03132         3.39        1         0.0656
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.02094         1.47        1         0.2248
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.06155        12.60        1         0.0004
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.03163         3.17        1         0.0752
      ------------+---------------------------------------------------
      global test |                     89.94       33         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/covidtest_schoenplot4_completecase.svg
>  not found)
(file /workspace/output/oac_tabfig/covidtest_schoenplot4_completecase.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table6_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/08a_an_model_checks_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 02:51:02
-------------------------------------------------------------------------------
