-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/08a_an_model_checks_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 02:43:21

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.11349         2.38        1         0.1226
      ------------+---------------------------------------------------
      global test |                      2.38        1         0.1226
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
.123

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot1.svg not foun
> d)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot1.svg written in SVG
>  format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2062.9964
Iteration 1:   log likelihood =  -2006.562
Iteration 2:   log likelihood =  -1959.407
Iteration 3:   log likelihood = -1955.9529
Iteration 4:   log likelihood = -1955.8836
Iteration 5:   log likelihood = -1955.8835
Refining estimates:
Iteration 0:   log likelihood = -1955.8835

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(5)       =      214.23
Log likelihood  =   -1955.8835                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7778617   .1265261    -1.54   0.122     .5655186    1.069936
      1.male |   1.577982   .4920713     1.46   0.144     .8563808    2.907617
        age1 |   .9986386    .028376    -0.05   0.962     .9445429    1.055832
        age2 |   1.166855    .057605     3.13   0.002     1.059242    1.285402
        age3 |   .4826784   .1489999    -2.36   0.018     .2635707    .8839314
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.10863         2.29        1         0.1306
      0b.male     |            .            .        1             .
      1.male      |      0.03267         0.21        1         0.6488
      age1        |     -0.02338         0.07        1         0.7971
      age2        |     -0.01899         0.05        1         0.8248
      age3        |      0.03419         0.18        1         0.6730
      ------------+---------------------------------------------------
      global test |                      3.58        5         0.6107
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot2.svg not foun
> d)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot2.svg written in SVG
>  format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2062.9964
Iteration 1:   log likelihood = -1995.2229
Iteration 2:   log likelihood = -1943.3584
Iteration 3:   log likelihood = -1939.1862
Iteration 4:   log likelihood = -1939.0021
Iteration 5:   log likelihood = -1938.9559
Iteration 6:   log likelihood = -1938.9389
Iteration 7:   log likelihood = -1938.9327
Iteration 8:   log likelihood = -1938.9304
Iteration 9:   log likelihood = -1938.9296
Iteration 10:  log likelihood = -1938.9293
Iteration 11:  log likelihood = -1938.9291
Iteration 12:  log likelihood = -1938.9291
Iteration 13:  log likelihood = -1938.9291
Iteration 14:  log likelihood = -1938.9291
Iteration 15:  log likelihood = -1938.9291
Iteration 16:  log likelihood = -1938.9291
Iteration 17:  log likelihood = -1938.9291
Iteration 18:  log likelihood = -1938.9291
Iteration 19:  log likelihood = -1938.9291
Iteration 20:  log likelihood = -1938.9291
Iteration 21:  log likelihood = -1938.9291
Iteration 22:  log likelihood = -1938.9291
Iteration 23:  log likelihood = -1938.9291
Iteration 24:  log likelihood = -1938.9291
Iteration 25:  log likelihood = -1938.9291
Iteration 26:  log likelihood = -1938.9291
Iteration 27:  log likelihood = -1938.9291
Iteration 28:  log likelihood = -1938.9291
Iteration 29:  log likelihood = -1938.9291
Iteration 30:  log likelihood = -1938.9291
Iteration 31:  log likelihood = -1938.9291
Iteration 32:  log likelihood = -1938.9291
Iteration 33:  log likelihood = -1938.9291
Iteration 34:  log likelihood = -1938.9291
Iteration 35:  log likelihood = -1938.9291
Iteration 36:  log likelihood = -1938.9291
Iteration 37:  log likelihood = -1938.9291
Iteration 38:  log likelihood = -1938.9291
Iteration 39:  log likelihood = -1938.9291
Iteration 40:  log likelihood = -1938.9291
Iteration 41:  log likelihood = -1938.9291
Iteration 42:  log likelihood = -1938.9291
Iteration 43:  log likelihood = -1938.9291
Iteration 44:  log likelihood = -1938.9291
Iteration 45:  log likelihood = -1938.9291
Refining estimates:
Iteration 0:   log likelihood = -1938.9291

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(23)      =      248.13
Log likelihood  =   -1938.9291                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6891623   .1178728    -2.18   0.030     .4928717    .9636275
      1.male |    1.12356   .5063952     0.26   0.796     .4644669    2.717928
        age1 |   1.031499    .037716     0.85   0.396     .9601639    1.108134
        age2 |   1.171764   .0684471     2.71   0.007     1.045005    1.313899
        age3 |   .4139601   .1672218    -2.18   0.029      .187547    .9137066
             |
         imd |
          2  |   .8914359   .1979543    -0.52   0.605     .5768599    1.377558
          3  |   .7399393   .1748001    -1.27   0.202      .465706    1.175656
          4  |   .8393253   .2008746    -0.73   0.464     .5250654    1.341675
5 most de..  |   1.508556   .3272492     1.90   0.058     .9860782    2.307871
             |
   obese4cat |
Obese I ..)  |    .928836   .2172503    -0.32   0.752     .5872825    1.469031
Obese II..)  |   1.392208   .4625557     1.00   0.319      .725932    2.670008
Obese II..)  |   1.617113   .7222999     1.08   0.282     .6738176    3.880951
             |
smoke_nomiss |
     Former  |   1.379484   .2316873     1.92   0.055     .9925572    1.917246
    Current  |   1.328475   .4525214     0.83   0.404     .6814076    2.590002
             |
     diabcat |
Controlle..  |   1.206324   .6466746     0.35   0.726     .4218519    3.449593
Uncontrol..  |   2.674122   1.463268     1.80   0.072     .9149714    7.815467
Diabetes,..  |   5.44e-19          .        .       .            .           .
             |
1.myocardi~t |   2.561291   1.450839     1.66   0.097     .8439127    7.773569
       1.pad |   1.361589   1.414642     0.30   0.766     .1776962    10.43311
1.hyperten~n |   1.023551   .4044145     0.06   0.953     .4718365    2.220379
1.heart_f~re |   2.270735   1.021745     1.82   0.068     .9400652    5.484978
1.stroke_tia |   1.09e-19          .        .       .            .           .
       1.vte |   2.791293   3.444665     0.83   0.406     .2485186    31.35104
 1.oestrogen |   6.33e-20          .        .       .            .           .
1.antiplat~t |   .6179701   .1888413    -1.58   0.115     .3395115    1.124813
1.flu_vac~ne |    1.06332   .1954895     0.33   0.738     .7416044      1.5246
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.02466         0.11        1         0.7371
      0b.male     |            .            .        1             .
      1.male      |     -0.07267         0.85        1         0.3572
      age1        |      0.04467         0.25        1         0.6147
      age2        |      0.04008         0.27        1         0.6000
      age3        |     -0.05173         0.47        1         0.4932
      1b.imd      |            .            .        1             .
      2.imd       |      0.00963         0.02        1         0.8956
      3.imd       |     -0.01481         0.04        1         0.8398
      4.imd       |      0.08745         1.41        1         0.2355
      5.imd       |      0.12210         2.73        1         0.0982
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.04401         0.37        1         0.5436
      3.obese4cat |     -0.06929         0.88        1         0.3474
      4.obese4cat |      0.00199         0.00        1         0.9770
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.04606         0.39        1         0.5324
      3.smoke_no~s|      0.09739         1.74        1         0.1874
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01948         0.06        1         0.8065
      3.diabcat   |      0.11400         2.09        1         0.1482
      4.diabcat   |            .            .        1             .
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.02503         0.10        1         0.7471
      0b.pad      |            .            .        1             .
      1.pad       |      0.05478         0.57        1         0.4494
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.12772         2.61        1         0.1060
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.10720         2.32        1         0.1276
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|            .            .        1             .
      0b.vte      |            .            .        1             .
      1.vte       |      0.01613         0.05        1         0.8216
      0b.oestrogen|            .            .        1             .
      1.oestrogen |            .            .        1             .
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.29261        15.50        1         0.0001
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.08570         1.44        1         0.2303
      ------------+---------------------------------------------------
      global test |                     36.23       23         0.0390
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot3.svg not foun
> d)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot3.svg written in SVG
>  format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -661.74897
Iteration 1:   log likelihood = -627.94921
Iteration 2:   log likelihood = -583.55578
Iteration 3:   log likelihood = -518.56082
Iteration 4:   log likelihood = -512.64022
Iteration 5:   log likelihood = -512.59961
Iteration 6:   log likelihood = -512.59056
Iteration 7:   log likelihood = -512.58724
Iteration 8:   log likelihood = -512.58602
Iteration 9:   log likelihood = -512.58557
Iteration 10:  log likelihood =  -512.5854
Iteration 11:  log likelihood = -512.58534
Iteration 12:  log likelihood = -512.58532
Iteration 13:  log likelihood = -512.58531
Iteration 14:  log likelihood = -512.58531
Iteration 15:  log likelihood = -512.58531
Iteration 16:  log likelihood = -512.58531
Iteration 17:  log likelihood = -512.58531
Iteration 18:  log likelihood = -512.58531
Iteration 19:  log likelihood = -512.58531
Iteration 20:  log likelihood = -512.58531
Iteration 21:  log likelihood = -512.58531
Iteration 22:  log likelihood = -512.58531
Iteration 23:  log likelihood = -512.58531
Iteration 24:  log likelihood = -512.58531
Iteration 25:  log likelihood = -512.58531
Iteration 26:  log likelihood = -512.58531
Iteration 27:  log likelihood = -512.58531
Iteration 28:  log likelihood = -512.58531
Iteration 29:  log likelihood = -512.58531
Iteration 30:  log likelihood = -512.58531
Iteration 31:  log likelihood = -512.58531
Iteration 32:  log likelihood = -512.58531
Iteration 33:  log likelihood = -512.58531
Iteration 34:  log likelihood = -512.58531
Iteration 35:  log likelihood = -512.58531
Iteration 36:  log likelihood = -512.58531
Iteration 37:  log likelihood = -512.58531
Iteration 38:  log likelihood = -512.58531
Iteration 39:  log likelihood = -512.58531
Iteration 40:  log likelihood = -512.58531
Iteration 41:  log likelihood = -512.58531
Refining estimates:
Iteration 0:   log likelihood = -512.58531
Iteration 1:   log likelihood = -512.58531
Iteration 2:   log likelihood = -512.58531

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          185
Time at risk    =     14618548
                                                LR chi2(31)      =      298.33
Log likelihood  =   -512.58531                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6627938   .1248821    -2.18   0.029     .4581387    .9588703
      1.male |    1.05532   .4912425     0.12   0.908     .4237963    2.627915
        age1 |   1.035276   .0402734     0.89   0.373     .9592762    1.117298
        age2 |    1.17652   .0741602     2.58   0.010     1.039788    1.331231
        age3 |   .3805317   .1671057    -2.20   0.028      .160915    .8998813
             |
         imd |
          2  |    .818679    .207774    -0.79   0.431     .4978353    1.346299
          3  |   .7650965   .2101597    -0.97   0.330     .4465858    1.310773
          4  |   .7703807   .2172506    -0.93   0.355     .4432645    1.338899
5 most de..  |   1.476879   .4417638     1.30   0.192     .8217388    2.654338
             |
   obese4cat |
Obese I ..)  |   .8744908   .2150893    -0.55   0.586     .5400005    1.416173
Obese II..)  |   1.382194    .476122     0.94   0.347     .7036506    2.715069
Obese II..)  |   1.711007   .7937337     1.16   0.247     .6892558    4.247398
             |
smoke_nomiss |
     Former  |   1.290757   .2389909     1.38   0.168     .8979248     1.85545
    Current  |   1.127627   .4200049     0.32   0.747     .5434007    2.339972
             |
     diabcat |
Controlle..  |   1.071008   .6094328     0.12   0.904     .3511043    3.267004
Uncontrol..  |   2.486047   1.434449     1.58   0.114     .8023545     7.70287
Diabetes,..  |   5.36e-19          .        .       .            .           .
             |
1.myocardi~t |   2.410641    1.40394     1.51   0.131     .7698373    7.548596
       1.pad |   .9174933   .9761029    -0.08   0.935     .1140319     7.38209
1.hyperten~n |   1.125542   .4628492     0.29   0.774     .5027218    2.519972
1.heart_f~re |   2.247448   1.062401     1.71   0.087     .8898454    5.676295
1.stroke_tia |   5.26e-19   9.64e-10    -0.00   1.000            0           .
       1.vte |   2.812209   3.549503     0.82   0.413     .2369633    33.37444
 1.oestrogen |   2.58e-19          .        .       .            .           .
1.antiplat~t |   .6367581   .2052026    -1.40   0.161     .3385829    1.197523
1.flu_vac~ne |   1.142322    .232693     0.65   0.514     .7662972    1.702863
             |
         ckd |
        CKD  |   1.232992   .2303675     1.12   0.262     .8549194    1.778261
      1.copd |   1.800273   .4007749     2.64   0.008      1.16371    2.785043
1.other_re~y |   1.641517   .4731951     1.72   0.086     .9329792    2.888142
1.immunode~y |    2.15321   1.636583     1.01   0.313     .4854187    9.551165
    1.cancer |   1.231352   .2391893     1.07   0.284     .8414669    1.801887
1.ae_atten~r |   2.418593   .3990421     5.35   0.000     1.750345    3.341966
1.gp_consult |    .398181   .1463757    -2.50   0.012     .1937178    .8184487
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.06667         0.84        1         0.3593
      0b.male     |            .            .        1             .
      1.male      |     -0.07679         0.95        1         0.3309
      age1        |      0.07261         0.76        1         0.3842
      age2        |      0.02113         0.08        1         0.7735
      age3        |     -0.03156         0.19        1         0.6650
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01610         0.05        1         0.8246
      3.imd       |     -0.01998         0.08        1         0.7741
      4.imd       |      0.07127         0.89        1         0.3450
      5.imd       |      0.06839         0.92        1         0.3388
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.04281         0.34        1         0.5588
      3.obese4cat |     -0.07142         0.86        1         0.3535
      4.obese4cat |      0.00836         0.01        1         0.9029
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.07270         0.99        1         0.3209
      3.smoke_no~s|      0.12051         2.77        1         0.0960
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01049         0.02        1         0.8968
      3.diabcat   |      0.09007         1.45        1         0.2293
      4.diabcat   |            .            .        1             .
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.03162         0.15        1         0.6997
      0b.pad      |            .            .        1             .
      1.pad       |      0.04240         0.29        1         0.5926
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.14313         3.37        1         0.0663
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.12610         3.32        1         0.0684
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.10364         0.00        1         1.0000
      0b.vte      |            .            .        1             .
      1.vte       |      0.03368         0.22        1         0.6417
      0b.oestrogen|            .            .        1             .
      1.oestrogen |            .            .        1             .
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.26461        11.44        1         0.0007
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.07512         1.22        1         0.2701
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.03446         0.26        1         0.6077
      0b.copd     |            .            .        1             .
      1.copd      |     -0.13946         3.88        1         0.0488
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.03170         0.22        1         0.6407
      0b.immunod~y|            .            .        1             .
      1.immunode~y|      0.13369         3.42        1         0.0645
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.12280         2.80        1         0.0942
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|      0.02180         0.09        1         0.7592
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.08623         1.38        1         0.2404
      ------------+---------------------------------------------------
      global test |                     44.48       31         0.0554
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot4.svg not foun
> d)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot4.svg written in SVG
>  format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table5_onscoviddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(18,087 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.19483         4.82        1         0.0281
      ------------+---------------------------------------------------
      global test |                      4.82        1         0.0281
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
.123

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot1_completecase
> .svg not found)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot1_completecase.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1378.5349
Iteration 1:   log likelihood = -1363.8122
Iteration 2:   log likelihood = -1307.6955
Iteration 3:   log likelihood = -1303.3275
Iteration 4:   log likelihood = -1303.1743
Iteration 5:   log likelihood = -1303.1742
Refining estimates:
Iteration 0:   log likelihood = -1303.1742

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          127
Time at risk    =     10871241
                                                LR chi2(5)       =      150.72
Log likelihood  =   -1303.1742                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8573804   .1721952    -0.77   0.444      .578388    1.270948
      1.male |   2.003739   .7817491     1.78   0.075     .9327155    4.304605
        age1 |   .9913803   .0314714    -0.27   0.785     .9315772    1.055022
        age2 |   1.170478   .0665312     2.77   0.006     1.047081    1.308418
        age3 |   .5014974   .1816752    -1.91   0.057     .2465515    1.020069
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.19190         4.96        1         0.0260
      0b.male     |            .            .        1             .
      1.male      |      0.11738         1.84        1         0.1748
      age1        |     -0.03198         0.09        1         0.7630
      age2        |     -0.02680         0.07        1         0.7895
      age3        |      0.03784         0.16        1         0.6910
      ------------+---------------------------------------------------
      global test |                      7.80        5         0.1674
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot2_completecase
> .svg not found)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot2_completecase.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1378.5349
Iteration 1:   log likelihood = -1350.9113
Iteration 2:   log likelihood = -1292.7564
Iteration 3:   log likelihood = -1286.0254
Iteration 4:   log likelihood = -1285.8104
Iteration 5:   log likelihood = -1285.7675
Iteration 6:   log likelihood = -1285.7517
Iteration 7:   log likelihood = -1285.7459
Iteration 8:   log likelihood = -1285.7437
Iteration 9:   log likelihood =  -1285.743
Iteration 10:  log likelihood = -1285.7427
Iteration 11:  log likelihood = -1285.7426
Iteration 12:  log likelihood = -1285.7425
Iteration 13:  log likelihood = -1285.7425
Iteration 14:  log likelihood = -1285.7425
Iteration 15:  log likelihood = -1285.7425
Iteration 16:  log likelihood = -1285.7425
Iteration 17:  log likelihood = -1285.7425
Iteration 18:  log likelihood = -1285.7425
Iteration 19:  log likelihood = -1285.7425
Iteration 20:  log likelihood = -1285.7425
Iteration 21:  log likelihood = -1285.7425
Iteration 22:  log likelihood = -1285.7425
Iteration 23:  log likelihood = -1285.7425
Iteration 24:  log likelihood = -1285.7425
Iteration 25:  log likelihood = -1285.7425
Iteration 26:  log likelihood = -1285.7425
Iteration 27:  log likelihood = -1285.7425
Iteration 28:  log likelihood = -1285.7425
Refining estimates:
Iteration 0:   log likelihood = -1285.7425
Iteration 1:   log likelihood = -1285.7425
Iteration 2:   log likelihood = -1285.7425
Iteration 3:   log likelihood = -1285.7425
Iteration 4:   log likelihood = -1285.7425

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          127
Time at risk    =     10871241
                                                LR chi2(30)      =      185.58
Log likelihood  =   -1285.7425                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7421109   .1573465    -1.41   0.160     .4897702    1.124463
      1.male |   1.318943   .7233987     0.50   0.614     .4501618    3.864411
        age1 |   1.018589   .0416915     0.45   0.653     .9400668     1.10367
        age2 |   1.208352   .0823735     2.78   0.005     1.057223    1.381083
        age3 |   .3598753   .1731395    -2.12   0.034     .1401621    .9240032
             |
         imd |
          2  |   .9674129   .2687582    -0.12   0.905     .5612269    1.667574
          3  |   .8631241   .2488231    -0.51   0.610     .4905545    1.518655
          4  |   .9286726   .2718688    -0.25   0.800     .5232069    1.648359
5 most de..  |   1.513182   .4044934     1.55   0.121     .8960947    2.555221
             |
   obese4cat |
Obese I ..)  |   1.267242   .3222767     0.93   0.352      .769817    2.086083
Obese II..)  |   1.568144   .6153327     1.15   0.252     .7267384    3.383714
Obese II..)  |   2.065344   1.026782     1.46   0.145     .7795057    5.472245
             |
smoke_nomiss |
     Former  |   1.727148   .3773088     2.50   0.012     1.125584    2.650215
    Current  |   1.884204    .743056     1.61   0.108     .8698559    4.081392
             |
     diabcat |
Controlle..  |   1.209468   .7362755     0.31   0.755     .3667899    3.988151
Uncontrol..  |   2.044964   1.348299     1.09   0.278     .5616505    7.445697
Diabetes,..  |   2.09e-14   5.37e-07    -0.00   1.000            0           .
             |
1.myocardi~t |   2.779496   1.794504     1.58   0.113     .7841728    9.851909
       1.pad |   1.842054   1.939234     0.58   0.562     .2339886    14.50141
1.hyperten~n |   1.230284   .5675709     0.45   0.653     .4981017    3.038736
1.heart_f~re |   2.178441   1.171672     1.45   0.148     .7591501    6.251205
1.stroke_tia |   3.45e-14   2.85e-07    -0.00   1.000            0           .
       1.vte |   3.55e-14   3.70e-07    -0.00   1.000            0           .
 1.oestrogen |   2.15e-14   2.42e-07    -0.00   1.000            0           .
1.antiplat~t |   .5945755   .2196829    -1.41   0.159     .2882081    1.226613
1.flu_vac~ne |   1.074256    .243209     0.32   0.752     .6892834     1.67424
             |
   ethnicity |
      Mixed  |   5.905006   5.967274     1.76   0.079     .8147849    42.79547
Asian or ..  |    2.10936   1.529786     1.03   0.303      .509129    8.739241
      Black  |   2.99e-14   2.56e-07    -0.00   1.000            0           .
      Other  |   5.406532   3.892094     2.34   0.019      1.31871    22.16604
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.06924         0.62        1         0.4306
      0b.male     |            .            .        1             .
      1.male      |      0.01139         0.01        1         0.9031
      age1        |      0.03074         0.09        1         0.7658
      age2        |      0.02081         0.05        1         0.8152
      age3        |     -0.03187         0.13        1         0.7163
      1b.imd      |            .            .        1             .
      2.imd       |      0.05685         0.42        1         0.5194
      3.imd       |      0.01480         0.03        1         0.8661
      4.imd       |      0.13264         2.27        1         0.1321
      5.imd       |      0.18110         4.21        1         0.0401
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03984         0.21        1         0.6457
      3.obese4cat |     -0.12569         1.86        1         0.1723
      4.obese4cat |      0.01410         0.03        1         0.8676
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00376         0.00        1         0.9658
      3.smoke_no~s|      0.10917         1.50        1         0.2207
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.11565         1.38        1         0.2407
      3.diabcat   |      0.15704         2.77        1         0.0963
      4.diabcat   |      0.00111         0.00        1         1.0000
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.04063         0.21        1         0.6430
      0b.pad      |            .            .        1             .
      1.pad       |      0.03427         0.15        1         0.6946
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.10899         1.40        1         0.2369
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.07539         0.88        1         0.3490
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.03820         0.00        1         1.0000
      0b.vte      |            .            .        1             .
      1.vte       |      0.04086         0.00        1         1.0000
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.07565         0.00        1         1.0000
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.37795        18.56        1         0.0000
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.12032         1.93        1         0.1642
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.09250         1.06        1         0.3028
      3.ethnicity |      0.00959         0.01        1         0.9129
      4.ethnicity |     -0.17661         0.00        1         1.0000
      5.ethnicity |     -0.13473         2.15        1         0.1429
      ------------+---------------------------------------------------
      global test |                     51.84       30         0.0079
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot3_completecase
> _ethn.svg not found)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot3_completecase_ethn.
> svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1378.5349
Iteration 1:   log likelihood = -1353.8885
Iteration 2:   log likelihood = -1295.8221
Iteration 3:   log likelihood = -1289.4623
Iteration 4:   log likelihood = -1289.2867
Iteration 5:   log likelihood =  -1289.257
Iteration 6:   log likelihood = -1289.2461
Iteration 7:   log likelihood =  -1289.242
Iteration 8:   log likelihood = -1289.2406
Iteration 9:   log likelihood =   -1289.24
Iteration 10:  log likelihood = -1289.2398
Iteration 11:  log likelihood = -1289.2397
Iteration 12:  log likelihood = -1289.2397
Iteration 13:  log likelihood = -1289.2397
Iteration 14:  log likelihood = -1289.2397
Iteration 15:  log likelihood = -1289.2397
Iteration 16:  log likelihood = -1289.2397
Iteration 17:  log likelihood = -1289.2397
Iteration 18:  log likelihood = -1289.2397
Iteration 19:  log likelihood = -1289.2397
Iteration 20:  log likelihood = -1289.2397
Iteration 21:  log likelihood = -1289.2397
Iteration 22:  log likelihood = -1289.2397
Iteration 23:  log likelihood = -1289.2397
Iteration 24:  log likelihood = -1289.2397
Iteration 25:  log likelihood = -1289.2397
Iteration 26:  log likelihood = -1289.2397
Iteration 27:  log likelihood = -1289.2397
Iteration 28:  log likelihood = -1289.2397
Iteration 29:  log likelihood = -1289.2397
Iteration 30:  log likelihood = -1289.2397
Iteration 31:  log likelihood = -1289.2397
Iteration 32:  log likelihood = -1289.2397
Iteration 33:  log likelihood = -1289.2397
Iteration 34:  log likelihood = -1289.2397
Iteration 35:  log likelihood = -1289.2397
Iteration 36:  log likelihood = -1289.2397
Iteration 37:  log likelihood = -1289.2397
Iteration 38:  log likelihood = -1289.2397
Iteration 39:  log likelihood = -1289.2397
Iteration 40:  log likelihood = -1289.2397
Iteration 41:  log likelihood = -1289.2397
Iteration 42:  log likelihood = -1289.2397
Iteration 43:  log likelihood = -1289.2397
Iteration 44:  log likelihood = -1289.2397
Refining estimates:
Iteration 0:   log likelihood = -1289.2397

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          127
Time at risk    =     10871241
                                                LR chi2(22)      =      178.59
Log likelihood  =   -1289.2397                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7449527    .157712    -1.39   0.164     .4919523    1.128066
      1.male |   1.327911   .7293975     0.52   0.606     .4525005    3.896894
        age1 |   1.012994   .0412442     0.32   0.751     .9352984    1.097145
        age2 |   1.210429   .0823712     2.81   0.005     1.059288    1.383136
        age3 |   .3619653   .1738914    -2.12   0.034     .1411699    .9280938
             |
         imd |
          2  |   .9650642   .2680471    -0.13   0.898     .5599311    1.663328
          3  |   .8619412   .2483242    -0.52   0.606     .4900581     1.51603
          4  |   .9277927   .2713751    -0.26   0.798     .5229719    1.645976
5 most de..  |   1.525488   .4073492     1.58   0.114     .9038858    2.574566
             |
   obese4cat |
Obese I ..)  |   1.254979   .3191254     0.89   0.372     .7624067    2.065791
Obese II..)  |    1.52181   .5972865     1.07   0.285     .7051429    3.284306
Obese II..)  |   1.982306   .9846214     1.38   0.168      .748815    5.247673
             |
smoke_nomiss |
     Former  |   1.724698   .3760787     2.50   0.012     1.124876    2.644367
    Current  |   1.885979   .7437658     1.61   0.108     .8706666    4.085279
             |
     diabcat |
Controlle..  |    1.25641   .7613444     0.38   0.706     .3831161    4.120334
Uncontrol..  |   2.077568   1.371028     1.11   0.268     .5699418    7.573206
Diabetes,..  |   9.27e-19          .        .       .            .           .
             |
1.myocardi~t |   2.675507   1.727343     1.52   0.127      .754847    9.483165
       1.pad |   1.783218   1.878093     0.55   0.583     .2263158    14.05057
1.hyperten~n |   1.208036   .5574134     0.41   0.682     .4890099    2.984299
1.heart_f~re |   2.100503   1.130178     1.38   0.168     .7317005    6.029943
1.stroke_tia |   1.95e-19          .        .       .            .           .
       1.vte |   1.98e-19          .        .       .            .           .
 1.oestrogen |   1.27e-19          .        .       .            .           .
1.antiplat~t |   .6081551   .2244509    -1.35   0.178     .2950276     1.25362
1.flu_vac~ne |   1.066672   .2412919     0.29   0.775     .6846693     1.66181
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.07295         0.69        1         0.4065
      0b.male     |            .            .        1             .
      1.male      |      0.00854         0.01        1         0.9269
      age1        |      0.04517         0.19        1         0.6643
      age2        |      0.01986         0.05        1         0.8236
      age3        |     -0.03429         0.15        1         0.6950
      1b.imd      |            .            .        1             .
      2.imd       |      0.06104         0.48        1         0.4891
      3.imd       |      0.01702         0.04        1         0.8460
      4.imd       |      0.13654         2.40        1         0.1212
      5.imd       |      0.18217         4.22        1         0.0400
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03796         0.19        1         0.6621
      3.obese4cat |     -0.11738         1.65        1         0.1986
      4.obese4cat |      0.01829         0.05        1         0.8276
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00718         0.01        1         0.9352
      3.smoke_no~s|      0.10569         1.41        1         0.2358
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.11710         1.43        1         0.2310
      3.diabcat   |      0.15776         2.85        1         0.0911
      4.diabcat   |            .            .        1             .
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.03465         0.16        1         0.6916
      0b.pad      |            .            .        1             .
      1.pad       |      0.03495         0.16        1         0.6886
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.11419         1.55        1         0.2128
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.08110         1.02        1         0.3128
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|            .            .        1             .
      0b.vte      |            .            .        1             .
      1.vte       |            .            .        1             .
      0b.oestrogen|            .            .        1             .
      1.oestrogen |            .            .        1             .
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.37680        18.35        1         0.0000
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.11616         1.79        1         0.1806
      ------------+---------------------------------------------------
      global test |                     48.72       22         0.0009
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot3_completecase
> .svg not found)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot3_completecase.svg w
> ritten in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(pract
> ice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -419.51409
Iteration 1:   log likelihood = -367.48655
Iteration 2:   log likelihood = -337.65405
Iteration 3:   log likelihood = -323.43513
Iteration 4:   log likelihood = -315.74962
Iteration 5:   log likelihood = -315.66105
Iteration 6:   log likelihood = -315.64855
Iteration 7:   log likelihood = -315.64396
Iteration 8:   log likelihood = -315.64227
Iteration 9:   log likelihood = -315.64165
Iteration 10:  log likelihood = -315.64142
Iteration 11:  log likelihood = -315.64134
Iteration 12:  log likelihood = -315.64131
Iteration 13:  log likelihood = -315.64129
Iteration 14:  log likelihood = -315.64129
Iteration 15:  log likelihood = -315.64129
Iteration 16:  log likelihood = -315.64129
Iteration 17:  log likelihood = -315.64129
Iteration 18:  log likelihood = -315.64129
Iteration 19:  log likelihood = -315.64129
Iteration 20:  log likelihood = -315.64129
Iteration 21:  log likelihood = -315.64129
Iteration 22:  log likelihood = -315.64129
Iteration 23:  log likelihood = -315.64129
Iteration 24:  log likelihood = -315.64129
Iteration 25:  log likelihood = -315.64129
Iteration 26:  log likelihood = -315.64129
Iteration 27:  log likelihood = -315.64129
Iteration 28:  log likelihood = -315.64129
Iteration 29:  log likelihood = -315.64129
Iteration 30:  log likelihood = -315.64129
Iteration 31:  log likelihood = -315.64129
Iteration 32:  log likelihood = -315.64129
Refining estimates:
Iteration 0:   log likelihood = -315.64129
Iteration 1:   log likelihood = -315.64129
Iteration 2:   log likelihood = -315.64129
Iteration 3:   log likelihood = -315.64129
Iteration 4:   log likelihood = -315.64129
Iteration 5:   log likelihood = -315.64129
Iteration 6:   log likelihood = -315.64129

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          127
Time at risk    =     10871241
                                                LR chi2(37)      =      207.75
Log likelihood  =   -315.64129                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6906075   .1644082    -1.55   0.120     .4331035    1.101212
      1.male |   1.247178   .7207472     0.38   0.702     .4018068    3.871149
        age1 |   1.034077   .0471806     0.73   0.463     .9456189     1.13081
        age2 |   1.202087   .0929036     2.38   0.017      1.03312     1.39869
        age3 |    .345515   .1881995    -1.95   0.051      .118802    1.004871
             |
         imd |
          2  |   .8969414   .2959619    -0.33   0.742     .4697804    1.712511
          3  |    .927442   .3158668    -0.22   0.825     .4757577    1.807955
          4  |   .9181374   .3317002    -0.24   0.813     .4522616    1.863913
5 most de..  |   1.413168   .5458229     0.90   0.371      .662865    3.012745
             |
   obese4cat |
Obese I ..)  |   1.277654   .3526955     0.89   0.375     .7437719    2.194759
Obese II..)  |   1.622694   .6800684     1.16   0.248     .7136736    3.689554
Obese II..)  |   2.508297   1.334311     1.73   0.084      .884249    7.115139
             |
smoke_nomiss |
     Former  |   1.859547    .457164     2.52   0.012     1.148529    3.010735
    Current  |   1.779966   .8024511     1.28   0.201     .7356478     4.30679
             |
     diabcat |
Controlle..  |   1.312042   .8674498     0.41   0.681     .3590707     4.79419
Uncontrol..  |   2.226341   1.624193     1.10   0.273     .5328571    9.301919
Diabetes,..  |   5.49e-17   2.31e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   2.626006   1.802158     1.41   0.159     .6841301    10.07982
       1.pad |   .9901349   1.103033    -0.01   0.993     .1115415    8.789258
1.hyperten~n |   1.481518   .7299294     0.80   0.425     .5640642    3.891218
1.heart_f~re |   2.600421   1.458679     1.70   0.088     .8661059    7.807576
1.stroke_tia |   6.93e-17   1.28e-08    -0.00   1.000            0           .
       1.vte |   8.91e-17   1.97e-08    -0.00   1.000            0           .
 1.oestrogen |   3.38e-17   1.27e-08    -0.00   1.000            0           .
1.antiplat~t |   .6850539   .2789912    -0.93   0.353     .3083679     1.52188
1.flu_vac~ne |   1.193285   .3026851     0.70   0.486     .7258235    1.961812
             |
         ckd |
        CKD  |   1.231585   .2828691     0.91   0.364     .7851661    1.931824
      1.copd |   1.843768   .4949608     2.28   0.023     1.089433    3.120412
1.other_re~y |   1.372613   .5205239     0.84   0.404     .6527613    2.886302
1.immunode~y |   3.639614   2.929378     1.61   0.108     .7515492    17.62597
    1.cancer |   1.608362   .3694701     2.07   0.039     1.025291    2.523018
1.ae_atten~r |   2.189498    .449672     3.82   0.000     1.463955    3.274625
1.gp_consult |   .4484583   .2100112    -1.71   0.087     .1791051    1.122888
             |
   ethnicity |
      Mixed  |    10.8032   16.08215     1.60   0.110     .5840011     199.844
Asian or ..  |   1.389201    1.23212     0.37   0.711     .2442366    7.901673
      Black  |   2.48e-17   4.55e-09    -0.00   1.000            0           .
      Other  |   38.54685   36.16535     3.89   0.000     6.128814    242.4384
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.08849         1.04        1         0.3078
      0b.male     |            .            .        1             .
      1.male      |      0.00600         0.00        1         0.9471
      age1        |      0.05366         0.27        1         0.6054
      age2        |      0.00708         0.01        1         0.9341
      age3        |     -0.00768         0.01        1         0.9272
      1b.imd      |            .            .        1             .
      2.imd       |      0.06346         0.55        1         0.4598
      3.imd       |     -0.00505         0.00        1         0.9514
      4.imd       |      0.11457         1.64        1         0.2006
      5.imd       |      0.16666         3.85        1         0.0497
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02353         0.07        1         0.7859
      3.obese4cat |     -0.14829         2.55        1         0.1106
      4.obese4cat |      0.00026         0.00        1         0.9975
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.05118         0.33        1         0.5657
      3.smoke_no~s|      0.16902         3.57        1         0.0588
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.10594         1.00        1         0.3175
      3.diabcat   |      0.12816         1.92        1         0.1660
      4.diabcat   |     -0.06989         0.00        1         1.0000
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.00603         0.00        1         0.9461
      0b.pad      |            .            .        1             .
      1.pad       |      0.00619         0.00        1         0.9542
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.14978         2.74        1         0.0976
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.09619         1.27        1         0.2597
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.01469         0.00        1         1.0000
      0b.vte      |            .            .        1             .
      1.vte       |      0.08433         0.00        1         1.0000
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.07391         0.00        1         1.0000
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.32387        13.69        1         0.0002
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.09561         1.23        1         0.2666
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.07927         1.03        1         0.3094
      0b.copd     |            .            .        1             .
      1.copd      |     -0.15275         3.34        1         0.0675
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.05223         0.45        1         0.5007
      0b.immunod~y|            .            .        1             .
      1.immunode~y|      0.12283         1.80        1         0.1800
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.05021         0.32        1         0.5728
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.02479         0.08        1         0.7740
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.05600         0.41        1         0.5241
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.04312         0.08        1         0.7793
      3.ethnicity |      0.03749         0.13        1         0.7192
      4.ethnicity |     -0.09319         0.00        1         1.0000
      5.ethnicity |     -0.11237         1.53        1         0.2156
      ------------+---------------------------------------------------
      global test |                     57.90       37         0.0155
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot4_completecase
> _ethn.svg not found)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot4_completecase_ethn.
> svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -419.51409
Iteration 1:   log likelihood = -373.99125
Iteration 2:   log likelihood = -344.05791
Iteration 3:   log likelihood = -330.76713
Iteration 4:   log likelihood =   -321.682
Iteration 5:   log likelihood = -321.56133
Iteration 6:   log likelihood =  -321.5529
Iteration 7:   log likelihood =  -321.5498
Iteration 8:   log likelihood = -321.54866
Iteration 9:   log likelihood = -321.54824
Iteration 10:  log likelihood = -321.54809
Iteration 11:  log likelihood = -321.54803
Iteration 12:  log likelihood = -321.54801
Iteration 13:  log likelihood =   -321.548
Iteration 14:  log likelihood =   -321.548
Iteration 15:  log likelihood =   -321.548
Iteration 16:  log likelihood =   -321.548
Iteration 17:  log likelihood =   -321.548
Iteration 18:  log likelihood =   -321.548
Iteration 19:  log likelihood =   -321.548
Iteration 20:  log likelihood =   -321.548
Iteration 21:  log likelihood =   -321.548
Iteration 22:  log likelihood =   -321.548
Iteration 23:  log likelihood =   -321.548
Iteration 24:  log likelihood =   -321.548
Iteration 25:  log likelihood =   -321.548
Iteration 26:  log likelihood =   -321.548
Iteration 27:  log likelihood =   -321.548
Iteration 28:  log likelihood =   -321.548
Iteration 29:  log likelihood =   -321.548
Iteration 30:  log likelihood =   -321.548
Iteration 31:  log likelihood =   -321.548
Iteration 32:  log likelihood =   -321.548
Refining estimates:
Iteration 0:   log likelihood =   -321.548
Iteration 1:   log likelihood =   -321.548
Iteration 2:   log likelihood =   -321.548
Iteration 3:   log likelihood =   -321.548
Iteration 4:   log likelihood =   -321.548
Iteration 5:   log likelihood =   -321.548

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          127
Time at risk    =     10871241
                                                LR chi2(33)      =      195.93
Log likelihood  =     -321.548                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6964269   .1647169    -1.53   0.126     .4380784    1.107132
      1.male |   1.336958   .7665683     0.51   0.613     .4345766    4.113098
        age1 |   1.017419   .0443387     0.40   0.692     .9341245    1.108141
        age2 |   1.208176   .0913835     2.50   0.012     1.041711    1.401241
        age3 |   .3530937   .1896406    -1.94   0.053     .1232322    1.011709
             |
         imd |
          2  |   .9143225   .2976999    -0.28   0.783     .4830048    1.730802
          3  |   .8940633   .3027037    -0.33   0.741     .4604434    1.736042
          4  |   .9096913   .3267374    -0.26   0.792     .4499504    1.839177
5 most de..  |   1.385201   .5270666     0.86   0.392      .657101    2.920072
             |
   obese4cat |
Obese I ..)  |   1.257908   .3466404     0.83   0.405     .7329666    2.158806
Obese II..)  |   1.520863   .6329776     1.01   0.314     .6727024    3.438405
Obese II..)  |   2.168421   1.143866     1.47   0.142     .7711263     6.09764
             |
smoke_nomiss |
     Former  |   1.832089    .446362     2.49   0.013     1.136484    2.953449
    Current  |   1.672804   .7430883     1.16   0.247     .7003688    3.995429
             |
     diabcat |
Controlle..  |   1.302064   .8448197     0.41   0.684     .3650448    4.644281
Uncontrol..  |   2.080612   1.464597     1.04   0.298       .52361    8.267499
Diabetes,..  |   1.46e-16   3.59e-08    -0.00   1.000            0           .
             |
1.myocardi~t |     2.6005   1.764184     1.41   0.159     .6880184    9.829097
       1.pad |   .9544265    1.05253    -0.04   0.966     .1099126    8.287763
1.hyperten~n |   1.466233   .7146523     0.79   0.432     .5640549    3.811401
1.heart_f~re |   2.267928   1.252805     1.48   0.138     .7681127     6.69628
1.stroke_tia |   1.52e-16   1.72e-08    -0.00   1.000            0           .
       1.vte |   1.89e-16   2.56e-08    -0.00   1.000            0           .
 1.oestrogen |   6.60e-17   1.49e-08    -0.00   1.000            0           .
1.antiplat~t |   .6644934   .2693485    -1.01   0.313     .3002349    1.470687
1.flu_vac~ne |   1.201929   .3074336     0.72   0.472     .7280401    1.984276
             |
         ckd |
        CKD  |   1.264811   .2896057     1.03   0.305     .8074671    1.981192
      1.copd |   1.839738   .4897564     2.29   0.022     1.091837    3.099947
1.other_re~y |   1.372797    .519705     0.84   0.403     .6536778    2.883028
1.immunode~y |   2.842343   2.271247     1.31   0.191     .5936111    13.60977
    1.cancer |   1.583483   .3601331     2.02   0.043     1.013967     2.47288
1.ae_atten~r |   2.161926   .4391329     3.80   0.000     1.451923    3.219125
1.gp_consult |   .4556543   .2119524    -1.69   0.091     .1831008    1.133916
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.08709         1.01        1         0.3141
      0b.male     |            .            .        1             .
      1.male      |     -0.01397         0.02        1         0.8782
      age1        |      0.11265         1.17        1         0.2790
      age2        |     -0.01482         0.03        1         0.8666
      age3        |     -0.00139         0.00        1         0.9871
      1b.imd      |            .            .        1             .
      2.imd       |      0.06173         0.50        1         0.4792
      3.imd       |     -0.00639         0.01        1         0.9387
      4.imd       |      0.10740         1.42        1         0.2329
      5.imd       |      0.17106         4.04        1         0.0443
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01909         0.05        1         0.8257
      3.obese4cat |     -0.12496         1.69        1         0.1935
      4.obese4cat |      0.02643         0.11        1         0.7445
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.05235         0.33        1         0.5644
      3.smoke_no~s|      0.16578         3.54        1         0.0600
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.10411         0.92        1         0.3375
      3.diabcat   |      0.13408         2.26        1         0.1326
      4.diabcat   |     -0.05910         0.00        1         1.0000
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00937         0.01        1         0.9196
      0b.pad      |            .            .        1             .
      1.pad       |      0.01194         0.01        1         0.9085
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.14978         2.64        1         0.1044
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.11007         1.76        1         0.1845
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.03349         0.00        1         1.0000
      0b.vte      |            .            .        1             .
      1.vte       |      0.11472         0.00        1         1.0000
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.11509         0.00        1         1.0000
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.33042        14.40        1         0.0001
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.10490         1.55        1         0.2128
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.08707         1.26        1         0.2614
      0b.copd     |            .            .        1             .
      1.copd      |     -0.16243         3.76        1         0.0526
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.04730         0.37        1         0.5411
      0b.immunod~y|            .            .        1             .
      1.immunode~y|      0.12864         2.09        1         0.1485
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.06087         0.46        1         0.4973
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.00218         0.00        1         0.9799
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.05053         0.33        1         0.5656
      ------------+---------------------------------------------------
      global test |                     55.41       33         0.0086
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/onscoviddeath_schoenplot4_completecase
> .svg not found)
(file /workspace/output/oac_tabfig/onscoviddeath_schoenplot4_completecase.svg w
> ritten in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table6_onscoviddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/08a_an_model_checks_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 02:48:24
-------------------------------------------------------------------------------
