-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 13:09:13

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -1640.6589                     Number of obs     =     70,266

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8368066   .1353261    -1.10   0.271     .6094964    1.148892
    _Imale_1 |   2.125888   .7644295     2.10   0.036     1.050665    4.301466
     _Iimd_2 |   .8539581    .180936    -0.75   0.456     .5637474    1.293566
     _Iimd_3 |   .8171948   .1749005    -0.94   0.346     .5372134    1.243095
     _Iimd_4 |   1.019903     .21069     0.10   0.924     .6803289    1.528969
     _Iimd_5 |   1.063165   .2228472     0.29   0.770     .7049893    1.603314
_Iobese4ca~2 |   1.026238   .1949139     0.14   0.892     .7072596    1.489077
_Iobese4ca~3 |    1.38548   .3527134     1.28   0.200     .8412068    2.281907
_Iobese4ca~4 |   1.722745   .5230199     1.79   0.073      .950165    3.123511
_Ismoke_no~2 |   1.092935   .1680433     0.58   0.563     .8085715    1.477305
_Ismoke_no~3 |   1.386796   .3531875     1.28   0.199     .8418404    2.284523
 _Idiabcat_2 |   1.817369   .5960908     1.82   0.069     .9555464    3.456482
 _Idiabcat_3 |   1.708524   .6803575     1.35   0.179     .7828183    3.728903
 _Idiabcat_4 |   .0000131   .0072256    -0.02   0.984            0           .
_Imyocardi~1 |   2.019314   .7995792     1.77   0.076     .9293027    4.387837
     _Ipad_1 |   1.581692    .972543     0.75   0.456     .4739575    5.278427
_Ihyperten~1 |   .9753795   .2849105    -0.09   0.932     .5502193    1.729066
_Iheart_fa~1 |    1.34757   .4531161     0.89   0.375     .6971684    2.604745
_Istroke_t~1 |   1.946897   1.239495     1.05   0.295     .5590163    6.780499
     _Ivte_1 |   2.223875   1.510291     1.18   0.239     .5875403      8.4175
_Ioestroge~1 |   2.646038   1.935585     1.33   0.183     .6308694     11.0982
_Iantiplat~1 |   .7798007   .1946317    -1.00   0.319     .4781134    1.271851
_Iflu_vacc~1 |   1.097799   .1806831     0.57   0.571     .7951089    1.515721
     _Ickd_1 |   1.733507   .2714704     3.51   0.000      1.27534    2.356272
    _Icopd_1 |   1.784074   .3352951     3.08   0.002     1.234355    2.578612
_Iother_re~1 |   .7303765   .2353462    -0.98   0.330     .3883896    1.373491
_Iimmunode~1 |   1.180855    .694162     0.28   0.777     .3730956    3.737428
  _Icancer_1 |   1.125928   .1927551     0.69   0.488     .8049849    1.574829
_Iae_atten~1 |    1.98434   .2711821     5.01   0.000     1.518064    2.593834
_Igp_consu~1 |   .7394452   .2331358    -0.96   0.338      .398598    1.371756
        age1 |    .989805   .0195956    -0.52   0.605     .9521339    1.028967
        age2 |   1.095371   .0497977     2.00   0.045     1.001991    1.197453
        age3 |   .7307701   .2568147    -0.89   0.372     .3669804    1.455187
       _rcs1 |   1.411714   .0337914    14.41   0.000     1.347014    1.479522
       _rcs2 |   1.212675   .0183837    12.72   0.000     1.177174    1.249247
       _cons |   .0013539   .0018303    -4.89   0.000     .0000957    .0191578
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     70,266    207.7536    21.92679         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(70,054 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00374603   .00286892   .00489129 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +---------------------------------+
  |     _at2   _at2_lci    _at2_uci |
  |---------------------------------|
  | .0031369   .0026891   .00365928 |
  +---------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00060912         -.00174397          .00052573 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_admitcovid.gph not found)
(file adj_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/adj_curves_admitcovid.svg not found)
(file /workspace/output/oac_tabfig/adj_curves_admitcovid.svg written in SVG for
> mat)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_admitcovid.gph not found)
(file diff_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/diff_curves_admitcovid.svg not found)
(file /workspace/output/oac_tabfig/diff_curves_admitcovid.svg written in SVG fo
> rmat)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 13:13:16
-------------------------------------------------------------------------------
