-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 13:09:29

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -3179.4403                     Number of obs     =     70,266

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .7007924   .0740103    -3.37   0.001     .5697632    .8619545
    _Imale_1 |   1.025195   .2182647     0.12   0.907     .6754374    1.556066
     _Iimd_2 |   1.018337   .1532074     0.12   0.904     .7582801    1.367583
     _Iimd_3 |   1.026611   .1544157     0.17   0.861     .7644936    1.378598
     _Iimd_4 |   1.055593   .1614799     0.35   0.724     .7821379    1.424654
     _Iimd_5 |   1.656182   .2355561     3.55   0.000     1.253265    2.188633
_Iobese4ca~2 |   .9385175   .1223131    -0.49   0.626     .7269572    1.211646
_Iobese4ca~3 |   1.027897   .1882798     0.15   0.881     .7178522    1.471852
_Iobese4ca~4 |   1.424652    .289694     1.74   0.082     .9563621    2.122244
_Ismoke_no~2 |    1.03389   .1049686     0.33   0.743     .8473319    1.261522
_Ismoke_no~3 |   .8144531   .1579392    -1.06   0.290     .5569299    1.191054
 _Idiabcat_2 |   1.372523   .3192508     1.36   0.173     .8700191    2.165261
 _Idiabcat_3 |   1.933615   .5020529     2.54   0.011     1.162412    3.216473
 _Idiabcat_4 |   1.560148   1.586221     0.44   0.662     .2126863    11.44438
_Imyocardi~1 |   1.472377   .4482234     1.27   0.204     .8107648    2.673888
     _Ipad_1 |   1.460642   .6892838     0.80   0.422     .5792387    3.683238
_Ihyperten~1 |   1.069793   .2090942     0.35   0.730     .7293395    1.569168
_Iheart_fa~1 |   1.118981    .264433     0.48   0.634     .7041585    1.778178
_Istroke_t~1 |    2.93409   1.151242     2.74   0.006     1.359845    6.330783
     _Ivte_1 |   1.791767   .8232881     1.27   0.204     .7280618    4.409557
_Ioestroge~1 |   1.028098   .6037779     0.05   0.962     .3251947    3.250314
_Iantiplat~1 |    .701409   .1256626    -1.98   0.048     .4937104    .9964841
_Iflu_vacc~1 |   .9150277   .0974348    -0.83   0.404     .7426699    1.127386
     _Ickd_1 |   1.237311   .1461958     1.80   0.072     .9815311    1.559744
    _Icopd_1 |   1.520676   .2129463     2.99   0.003     1.155685    2.000939
_Iother_re~1 |   .9973243   .2080631    -0.01   0.990     .6626094    1.501119
_Iimmunode~1 |   .6023556   .3506349    -0.87   0.384     .1924701    1.885135
  _Icancer_1 |   .9055233   .1164998    -0.77   0.440     .7037017    1.165227
_Iae_atten~1 |   1.907358   .1793343     6.87   0.000     1.586355    2.293318
_Igp_consu~1 |   .9375801   .2089253    -0.29   0.772     .6058028     1.45106
        age1 |   .9883506   .0119887    -0.97   0.334     .9651303     1.01213
        age2 |   1.083337   .0330512     2.62   0.009     1.020457    1.150092
        age3 |   .8446606    .202271    -0.70   0.481     .5282565    1.350578
       _rcs1 |   1.637414   .0520404    15.52   0.000     1.538529    1.742655
       _rcs2 |   1.334849   .0359125    10.74   0.000     1.266286    1.407125
       _rcs3 |   .9699432   .0048884    -6.06   0.000     .9604092    .9795719
       _cons |   .0073372   .0060998    -5.91   0.000     .0014384    .0374263
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     70,266    207.4183    22.99921         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(70,054 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00902263   .00762501   .01067643 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00633932   .00568657   .00706701 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00268331         -.00438557         -.00098105 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_positivecovidtest.gph not found)
(file adj_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/adj_curves_positivecovidtest.svg not f
> ound)
(file /workspace/output/oac_tabfig/adj_curves_positivecovidtest.svg written in 
> SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_positivecovidtest.gph not found)
(file diff_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/diff_curves_positivecovidtest.svg not 
> found)
(file /workspace/output/oac_tabfig/diff_curves_positivecovidtest.svg written in
>  SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 13:14:03
-------------------------------------------------------------------------------
