-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/05c_an_models_admi
> tcovid.log
  log type:  text
 opened on:  31 Dec 2020, 11:46:22

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |
 indicating |   Failure/censoring
        the |     indicator for
   exposure |  outcome: SUS covid
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   486,856      1,390 |   488,246 
            |     99.72       0.28 |    100.00 
------------+----------------------+----------
current use |    49,265        158 |    49,423 
            |     99.68       0.32 |    100.00 
------------+----------------------+----------
      Total |   536,121      1,548 |   537,669 
            |     99.71       0.29 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3664.2128
Iteration 1:   log likelihood = -3663.6515
Iteration 2:   log likelihood = -3663.6507
Refining estimates:
Iteration 0:   log likelihood = -3663.6507

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        1,548
Time at risk    =    112080833
                                                LR chi2(1)       =        1.12
Log likelihood  =   -3663.6507                  Prob > chi2      =      0.2890

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.094625   .0922404     1.07   0.283     .9279779      1.2912
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_uni
> var.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_univar.ste
> r saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3664.2128
Iteration 1:   log likelihood = -3660.8035
Iteration 2:   log likelihood = -3660.7724
Iteration 3:   log likelihood = -3660.7724
Refining estimates:
Iteration 0:   log likelihood = -3660.7724

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        1,548
Time at risk    =    112080833
                                                LR chi2(4)       =        6.88
Log likelihood  =   -3660.7724                  Prob > chi2      =      0.1423

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.333018   .1804232     2.12   0.034     1.022413    1.737984
      1.male |          1  (omitted)
        age1 |   .8399005   .1379462    -1.06   0.288     .6087312    1.158858
        age2 |   1.237025    .131079     2.01   0.045     1.005038     1.52256
        age3 |   .7826455    .163746    -1.17   0.241     .5193687    1.179382
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar1.
> ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3664.2128
Iteration 1:   log likelihood = -3518.4866
Iteration 2:   log likelihood =  -3512.923
Iteration 3:   log likelihood = -3512.9203
Refining estimates:
Iteration 0:   log likelihood = -3512.9203

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        1,548
Time at risk    =    112080833
                                                LR chi2(25)      =      302.58
Log likelihood  =   -3512.9203                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.297544   .1793695     1.88   0.060     .9895871    1.701337
      1.male |          1  (omitted)
        age1 |    .984618   .1637684    -0.09   0.926     .7107061    1.364098
        age2 |   1.141023   .1226504     1.23   0.220     .9242667    1.408612
        age3 |   .6873187   .1488939    -1.73   0.083     .4495337    1.050882
             |
         imd |
          2  |   1.194736   .1222158     1.74   0.082     .9776832    1.459976
          3  |   1.314015   .1367587     2.62   0.009     1.071544    1.611354
          4  |   1.476135    .157533     3.65   0.000     1.197528    1.819559
5 most de..  |   1.676311   .1823245     4.75   0.000     1.354483    2.074607
             |
   obese4cat |
Obese I ..)  |   1.131621   .0806219     1.74   0.083     .9841413    1.301201
Obese II..)  |   1.763535   .1807258     5.54   0.000     1.442625     2.15583
Obese II..)  |    1.45429   .2626822     2.07   0.038      1.02071    2.072049
             |
smoke_nomiss |
     Former  |   1.347597   .0864802     4.65   0.000     1.188325    1.528216
    Current  |   .8496496   .1002776    -1.38   0.167      .674185    1.070781
             |
     diabcat |
Controlle..  |   1.457978   .1037766     5.30   0.000      1.26813    1.676248
Uncontrol..  |   1.883608   .1697313     7.03   0.000     1.578662     2.24746
Diabetes,..  |   .5893902   .4319598    -0.72   0.471     .1401405    2.478805
             |
1.myocardi~t |   1.213598   .1179708     1.99   0.046     1.003071    1.468311
       1.pad |   1.248252    .157459     1.76   0.079     .9748297    1.598365
1.hyperten~n |   .9583483   .0568619    -0.72   0.473     .8531372    1.076534
1.heart_f~re |   1.378837   .1498946     2.95   0.003     1.114238     1.70627
1.stroke_tia |   1.621388   .1412153     5.55   0.000     1.366946    1.923192
       1.vte |   1.394487   .1958255     2.37   0.018     1.058965    1.836316
 1.oestrogen |   1.181577   .5481251     0.36   0.719     .4759875     2.93311
1.antiplat~t |   1.095162   .0814614     1.22   0.222     .9465934    1.267049
1.flu_vac~ne |   .8816357   .0584081    -1.90   0.057     .7742787    1.003878
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar2.
> ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3664.2128
Iteration 1:   log likelihood = -3384.4428
Iteration 2:   log likelihood = -3374.2242
Iteration 3:   log likelihood = -3374.2211
Iteration 4:   log likelihood = -3374.2211
Refining estimates:
Iteration 0:   log likelihood = -3374.2211

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      537,669                  Number of obs    =     537,669
No. of failures =        1,548
Time at risk    =    112080833
                                                LR chi2(32)      =      579.98
Log likelihood  =   -3374.2211                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.264572   .1773961     1.67   0.094     .9605849     1.66476
      1.male |          1  (omitted)
        age1 |    .874735    .147981    -0.79   0.429     .6278801    1.218643
        age2 |   1.232054   .1354873     1.90   0.058     .9931717    1.528394
        age3 |   .6361894   .1400487    -2.05   0.040     .4132431    .9794159
             |
         imd |
          2  |   1.167027   .1205576     1.50   0.135     .9531229    1.428935
          3  |   1.232073   .1300872     1.98   0.048     1.001759    1.515339
          4  |   1.379044   .1489127     2.98   0.003     1.115997    1.704092
5 most de..  |   1.514368   .1672274     3.76   0.000     1.219651      1.8803
             |
   obese4cat |
Obese I ..)  |   1.137451   .0820375     1.79   0.074     .9875085    1.310162
Obese II..)  |   1.792185   .1865312     5.61   0.000     1.461469     2.19774
Obese II..)  |    1.39659   .2546032     1.83   0.067      .976994    1.996392
             |
smoke_nomiss |
     Former  |   1.245405   .0820606     3.33   0.001     1.094521    1.417088
    Current  |   .7457181   .0904917    -2.42   0.016      .587872    .9459465
             |
     diabcat |
Controlle..  |   1.399768   .1013083     4.65   0.000     1.214648    1.613102
Uncontrol..  |   1.730067   .1593545     5.95   0.000     1.444308    2.072365
Diabetes,..  |   .5364291   .4002562    -0.83   0.404     .1242764    2.315452
             |
1.myocardi~t |   1.184643   .1162075     1.73   0.084      .977437    1.435774
       1.pad |   1.138612   .1471479     1.00   0.315     .8838348    1.466832
1.hyperten~n |   .9520251   .0574516    -0.81   0.415     .8458263    1.071558
1.heart_f~re |   1.135441     .12659     1.14   0.255     .9125666    1.412749
1.stroke_tia |   1.471366   .1303124     4.36   0.000     1.236897    1.750282
       1.vte |   1.257083   .1790016     1.61   0.108     .9509495    1.661767
 1.oestrogen |   1.113523   .5089458     0.24   0.814      .454621    2.727398
1.antiplat~t |   1.040373   .0782748     0.53   0.599     .8977326    1.205677
1.flu_vac~ne |    .854539   .0574786    -2.34   0.019      .748993    .9749583
             |
         ckd |
        CKD  |   1.399063    .095648     4.91   0.000     1.223613    1.599669
      1.copd |   1.474034   .1197264     4.78   0.000     1.257099    1.728403
1.other_re~y |   1.521728   .1660381     3.85   0.000     1.228743    1.884573
1.immunode~y |   .8233697   .2639515    -0.61   0.544     .4392596    1.543365
    1.cancer |   1.262115   .0864708     3.40   0.001     1.103522    1.443501
1.ae_atten~r |   2.214539   .1335182    13.19   0.000     1.967718    2.492319
1.gp_consult |   .5784466    .338329    -0.94   0.349     .1838239    1.820223
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar3.
> ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_2/table2_admitcovi
> d.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.094625   .0922404     1.07   0.283     .9279779      1.2912
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.333018   .1804232     2.12   0.034     1.022413    1.737984
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.297544   .1793695     1.88   0.060     .9895871    1.701337
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.264572   .1773961     1.67   0.094     .9605849     1.66476
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/05c_an_models_admi
> tcovid.log
  log type:  text
 closed on:  31 Dec 2020, 11:48:51
-------------------------------------------------------------------------------
