-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/06c_an_models_ethn
> icity_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:50:47

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(127,160 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   371,817      2,083 |   373,900 
            |     99.44       0.56 |    100.00 
------------+----------------------+----------
current use |    36,374        235 |    36,609 
            |     99.36       0.64 |    100.00 
------------+----------------------+----------
      Total |   408,191      2,318 |   410,509 
            |     99.44       0.56 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4978.3104
Iteration 1:   log likelihood =  -4977.358
Iteration 2:   log likelihood = -4977.3567
Refining estimates:
Iteration 0:   log likelihood = -4977.3567

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        2,318
Time at risk    =   85539120.5
                                                LR chi2(1)       =        1.91
Log likelihood  =   -4977.3567                  Prob > chi2      =      0.1672

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.103609    .077836     1.40   0.162     .9611279    1.267212
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_univar_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_uni
> var_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4978.3104
Iteration 1:   log likelihood = -4975.7765
Iteration 2:   log likelihood = -4975.7654
Iteration 3:   log likelihood = -4975.7654
Refining estimates:
Iteration 0:   log likelihood = -4975.7654

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        2,318
Time at risk    =   85539120.5
                                                LR chi2(4)       =        5.09
Log likelihood  =   -4975.7654                  Prob > chi2      =      0.2782

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.211402   .1282996     1.81   0.070     .9843228    1.490868
      1.male |          1  (omitted)
        age1 |   .9146898   .1230933    -0.66   0.508     .7026263    1.190757
        age2 |   1.140427   .1025684     1.46   0.144     .9561182    1.360264
        age3 |   .8325636   .1538258    -0.99   0.321     .5796262    1.195878
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar1_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4978.3104
Iteration 1:   log likelihood = -4792.6241
Iteration 2:   log likelihood = -4788.7925
Iteration 3:   log likelihood = -4788.7916
Refining estimates:
Iteration 0:   log likelihood = -4788.7916

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        2,318
Time at risk    =   85539120.5
                                                LR chi2(29)      =      379.04
Log likelihood  =   -4788.7916                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.232107   .1338564     1.92   0.055     .9958034    1.524485
      1.male |          1  (omitted)
        age1 |   1.035679   .1417761     0.26   0.798     .7919592    1.354403
        age2 |   1.069724    .097824     0.74   0.461     .8941931    1.279713
        age3 |   .7442939   .1422513    -1.55   0.122     .5117533    1.082501
             |
         imd |
          2  |   1.312495   .1157606     3.08   0.002     1.104136    1.560173
          3  |   1.342039   .1200117     3.29   0.001      1.12628     1.59913
          4  |   1.541027   .1409039     4.73   0.000     1.288192    1.843486
5 most de..  |   1.902227   .1750926     6.99   0.000     1.588227    2.278307
             |
   obese4cat |
Obese I ..)  |   1.048282   .0622281     0.79   0.427     .9331445    1.177625
Obese II..)  |   1.246777   .1148342     2.39   0.017     1.040852    1.493442
Obese II..)  |   1.338423   .1916268     2.04   0.042     1.010936    1.771997
             |
smoke_nomiss |
     Former  |   1.281259   .0672868     4.72   0.000      1.15594    1.420165
    Current  |   .6688343   .0665603    -4.04   0.000     .5503128     .812882
             |
     diabcat |
Controlle..  |   1.355189   .0826944     4.98   0.000     1.202427    1.527357
Uncontrol..  |   1.702787   .1341262     6.76   0.000     1.459192    1.987048
Diabetes,..  |   .8473561   .4262346    -0.33   0.742     .3161528    2.271093
             |
1.myocardi~t |   1.018942   .0897076     0.21   0.831     .8574515    1.210846
       1.pad |   1.358893   .1536163     2.71   0.007     1.088832    1.695936
1.hyperten~n |   1.003631   .0497943     0.07   0.942     .9106309    1.106129
1.heart_f~re |   1.199526    .117574     1.86   0.063     .9898682     1.45359
1.stroke_tia |   1.745527   .1307487     7.44   0.000     1.507188    2.021556
       1.vte |   1.464303   .1695078     3.29   0.001     1.167067    1.837241
 1.oestrogen |    1.30441   .4086502     0.85   0.396     .7059058    2.410358
1.antiplat~t |   1.046609   .0677533     0.70   0.482     .9218939    1.188195
1.flu_vac~ne |   .8564693   .0468076    -2.83   0.005     .7694707    .9533041
             |
   ethnicity |
      Mixed  |   .9139285   .2966219    -0.28   0.782      .483781    1.726536
Asian or ..  |   1.872931   .2181716     5.39   0.000     1.490624     2.35329
      Black  |   1.735917   .2921856     3.28   0.001     1.248121    2.414356
      Other  |   1.146516   .2918773     0.54   0.591     .6961188    1.888326
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar2_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4978.3104
Iteration 1:   log likelihood = -4809.0078
Iteration 2:   log likelihood = -4805.6349
Iteration 3:   log likelihood = -4805.6339
Refining estimates:
Iteration 0:   log likelihood = -4805.6339

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        2,318
Time at risk    =   85539120.5
                                                LR chi2(25)      =      345.35
Log likelihood  =   -4805.6339                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.206505      .1306     1.73   0.083     .9758643    1.491656
      1.male |          1  (omitted)
        age1 |   1.035742   .1414634     0.26   0.797     .7924886    1.353662
        age2 |   1.067485   .0975243     0.71   0.475      .892477    1.276811
        age3 |   .7365913   .1407812    -1.60   0.110     .5064545    1.071304
             |
         imd |
          2  |   1.318033   .1162259     3.13   0.002     1.108833    1.566702
          3  |   1.342583   .1200089     3.30   0.001     1.126822    1.599658
          4  |   1.550491   .1416646     4.80   0.000     1.296275    1.854562
5 most de..  |   1.922032   .1767334     7.11   0.000     1.605061      2.3016
             |
   obese4cat |
Obese I ..)  |   1.029555   .0609524     0.49   0.623     .9167611    1.156227
Obese II..)  |   1.210663   .1111511     2.08   0.037     1.011287    1.449346
Obese II..)  |   1.286452   .1838975     1.76   0.078     .9721085    1.702442
             |
smoke_nomiss |
     Former  |   1.240993   .0645668     4.15   0.000     1.120683    1.374219
    Current  |   .6380336   .0631912    -4.54   0.000     .5254605     .774724
             |
     diabcat |
Controlle..  |   1.399947   .0847835     5.56   0.000     1.243258    1.576384
Uncontrol..  |   1.810981   .1406943     7.64   0.000     1.555193    2.108839
Diabetes,..  |   .8808011   .4365342    -0.26   0.798     .3334368     2.32671
             |
1.myocardi~t |   1.023071   .0899153     0.26   0.795      .861183     1.21539
       1.pad |   1.348108   .1523308     2.64   0.008     1.080295    1.682314
1.hyperten~n |   1.011575   .0501124     0.23   0.816     .9179743     1.11472
1.heart_f~re |   1.201438   .1176239     1.87   0.061     .9916687     1.45558
1.stroke_tia |   1.757999   .1313473     7.55   0.000     1.518525    2.035239
       1.vte |   1.464028   .1692274     3.30   0.001     1.167237    1.836285
 1.oestrogen |   1.292169   .4039574     0.82   0.412     .7001919    2.384633
1.antiplat~t |   1.052063   .0679486     0.79   0.432     .9269711    1.194037
1.flu_vac~ne |   .8499903   .0463387    -2.98   0.003      .763852    .9458422
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar2_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4978.3104
Iteration 1:   log likelihood = -4642.4359
Iteration 2:   log likelihood = -4634.7683
Iteration 3:   log likelihood = -4634.7673
Refining estimates:
Iteration 0:   log likelihood = -4634.7673

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        2,318
Time at risk    =   85539120.5
                                                LR chi2(36)      =      687.09
Log likelihood  =   -4634.7673                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.155775   .1272474     1.31   0.189     .9314481    1.434129
      1.male |          1  (omitted)
        age1 |   .9859939    .135701    -0.10   0.918     .7528778     1.29129
        age2 |   1.089459   .1001905     0.93   0.352     .9097692    1.304639
        age3 |   .7199472   .1384505    -1.71   0.088      .493866    1.049524
             |
         imd |
          2  |   1.277682   .1137563     2.75   0.006     1.073093    1.521276
          3  |   1.291801    .117081     2.82   0.005     1.081553     1.54292
          4  |   1.445115   .1342764     3.96   0.000     1.204512     1.73378
5 most de..  |   1.763261   .1650281     6.06   0.000     1.467744    2.118277
             |
   obese4cat |
Obese I ..)  |   1.057143   .0635299     0.92   0.355     .9396805    1.189289
Obese II..)  |   1.263114   .1178968     2.50   0.012     1.051945    1.516674
Obese II..)  |   1.232374   .1786309     1.44   0.149     .9276031    1.637281
             |
smoke_nomiss |
     Former  |    1.22518   .0659754     3.77   0.000     1.102461     1.36156
    Current  |   .6117449   .0623937    -4.82   0.000     .5009032     .747114
             |
     diabcat |
Controlle..  |   1.308719   .0810829     4.34   0.000     1.159069     1.47769
Uncontrol..  |    1.60156   .1289419     5.85   0.000     1.367769    1.875312
Diabetes,..  |   .7581391    .381629    -0.55   0.582     .2826666    2.033402
             |
1.myocardi~t |   .9789898   .0872637    -0.24   0.812      .822063    1.165873
       1.pad |   1.257787   .1458511     1.98   0.048     1.002081    1.578742
1.hyperten~n |   .9956433   .0502227    -0.09   0.931      .901918    1.099108
1.heart_f~re |   1.017452   .1020026     0.17   0.863     .8359461    1.238367
1.stroke_tia |   1.612358   .1226464     6.28   0.000     1.389036    1.871585
       1.vte |    1.29607   .1528144     2.20   0.028     1.028648    1.633015
 1.oestrogen |   1.332497   .4181879     0.91   0.360     .7203225    2.464935
1.antiplat~t |   .9911604   .0649581    -0.14   0.892     .8716826    1.127015
1.flu_vac~ne |   .8419295   .0465896    -3.11   0.002     .7553932    .9383794
             |
         ckd |
        CKD  |   1.287288   .0780994     4.16   0.000     1.142966    1.449832
      1.copd |   1.243488   .0905869     2.99   0.003     1.078034    1.434335
1.other_re~y |    1.51777   .1463146     4.33   0.000     1.256462    1.833423
1.immunode~y |   .9092556   .2355199    -0.37   0.713     .5472724    1.510666
    1.cancer |   1.152924   .0700098     2.34   0.019     1.023558     1.29864
1.ae_atten~r |   2.158902   .1091715    15.22   0.000     1.955191    2.383837
1.gp_consult |   2.055137   1.328545     1.11   0.265     .5788692    7.296271
             |
   ethnicity |
      Mixed  |   .9685492   .3168004    -0.10   0.922     .5101574     1.83882
Asian or ..  |   1.849745    .218538     5.21   0.000     1.467394    2.331724
      Black  |   1.691081   .2881173     3.08   0.002     1.210992    2.361498
      Other  |   1.234854   .3166917     0.82   0.411     .7469918    2.041341
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar3_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4978.3104
Iteration 1:   log likelihood = -4657.6636
Iteration 2:   log likelihood = -4650.2729
Iteration 3:   log likelihood = -4650.2721
Refining estimates:
Iteration 0:   log likelihood = -4650.2721

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        2,318
Time at risk    =   85539120.5
                                                LR chi2(32)      =      656.08
Log likelihood  =   -4650.2721                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.133742   .1244041     1.14   0.253     .9143507    1.405774
      1.male |          1  (omitted)
        age1 |   .9862267   .1355796    -0.10   0.920     .7532853    1.291201
        age2 |    1.08774   .1000093     0.91   0.360     .9083717    1.302526
        age3 |   .7138392   .1373792    -1.75   0.080     .4895371    1.040915
             |
         imd |
          2  |   1.284055   .1143049     2.81   0.005     1.078477    1.528821
          3  |   1.293098   .1171529     2.84   0.005     1.082714    1.544362
          4  |   1.456443   .1352022     4.05   0.000      1.21416    1.747072
5 most de..  |   1.781347   .1665486     6.18   0.000     1.483081    2.139599
             |
   obese4cat |
Obese I ..)  |   1.038099   .0622373     0.62   0.533     .9230102    1.167538
Obese II..)  |    1.22574   .1140495     2.19   0.029     1.021405    1.470953
Obese II..)  |    1.18507   .1715073     1.17   0.241     .8923909    1.573739
             |
smoke_nomiss |
     Former  |   1.187148   .0633428     3.22   0.001      1.06927    1.318022
    Current  |   .5837328   .0592634    -5.30   0.000     .4784053    .7122495
             |
     diabcat |
Controlle..  |   1.350584    .083089     4.89   0.000     1.197168    1.523661
Uncontrol..  |   1.703395   .1351923     6.71   0.000     1.458003    1.990087
Diabetes,..  |    .778889   .3877605    -0.50   0.616     .2935723    2.066503
             |
1.myocardi~t |   .9808357   .0872661    -0.22   0.828     .8238799    1.167693
       1.pad |    1.24834   .1443786     1.92   0.055     .9951439    1.565957
1.hyperten~n |   1.003607   .0505444     0.07   0.943     .9092739    1.107726
1.heart_f~re |   1.018264   .1019984     0.18   0.857     .8367513    1.239151
1.stroke_tia |   1.620017   .1229478     6.36   0.000     1.396109    1.879835
       1.vte |   1.294321   .1524813     2.19   0.029     1.027457    1.630498
 1.oestrogen |   1.323322   .4145047     0.89   0.371     .7162151     2.44505
1.antiplat~t |   .9978507   .0652698    -0.03   0.974     .8777851    1.134339
1.flu_vac~ne |   .8350719   .0461016    -3.26   0.001     .7494312     .930499
             |
         ckd |
        CKD  |   1.292941   .0783215     4.24   0.000     1.148196    1.455932
      1.copd |   1.243353   .0904649     2.99   0.003     1.078107    1.433926
1.other_re~y |   1.509493   .1453038     4.28   0.000     1.249955     1.82292
1.immunode~y |   .9473852   .2437617    -0.21   0.834     .5721539    1.568701
    1.cancer |   1.146424   .0694866     2.25   0.024     1.018011    1.291035
1.ae_atten~r |   2.165779   .1093111    15.31   0.000     1.961789     2.39098
1.gp_consult |   2.087014   1.343932     1.14   0.253     .5907375    7.373206
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidt
> est_multivar3_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/positivecovidtest_mul
> tivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_2/table3_positivec
> ovidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    373,900    7.79e+07           0   7.79e+07   7.79e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     36,609     7620817           0    7620817    7620817

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.103609    .077836     1.40   0.162     .9611279    1.267212
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.211402   .1282996     1.81   0.070     .9843228    1.490868
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.232107   .1338564     1.92   0.055     .9958034    1.524485
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.206505      .1306     1.73   0.083     .9758643    1.491656
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.155775   .1272474     1.31   0.189     .9314481    1.434129
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.133742   .1244041     1.14   0.253     .9143507    1.405774
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/06c_an_models_ethn
> icity_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:53:42
-------------------------------------------------------------------------------
