-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/06c_an_models_ethn
> icity_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 11:45:39

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(127,160 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |  outcome: ONS covid
   exposure |         death
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   373,156        744 |   373,900 
            |     99.80       0.20 |    100.00 
------------+----------------------+----------
current use |    36,518         91 |    36,609 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Total |   409,674        835 |   410,509 
            |     99.80       0.20 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -1768.287
Iteration 1:   log likelihood = -1766.8001
Iteration 2:   log likelihood = -1766.7905
Iteration 3:   log likelihood = -1766.7905
Refining estimates:
Iteration 0:   log likelihood = -1766.7905

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =          835
Time at risk    =   85749269.5
                                                LR chi2(1)       =        2.99
Log likelihood  =   -1766.7905                  Prob > chi2      =      0.0836

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.22396   .1396209     1.77   0.076      .978741    1.530616
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_
> univar_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_univar_
> ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -1768.287
Iteration 1:   log likelihood =  -1764.649
Iteration 2:   log likelihood = -1764.5061
Iteration 3:   log likelihood =  -1764.506
Refining estimates:
Iteration 0:   log likelihood =  -1764.506

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =          835
Time at risk    =   85749269.5
                                                LR chi2(4)       =        7.56
Log likelihood  =    -1764.506                  Prob > chi2      =      0.1090

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.579681   .3232591     2.23   0.025      1.05775     2.35915
      1.male |          1  (omitted)
        age1 |   .6856085   .1378998    -1.88   0.061     .4622424     1.01691
        age2 |    1.30302    .160982     2.14   0.032     1.022796    1.660019
        age3 |   .7436523   .1755589    -1.25   0.210      .468189    1.181187
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_
> multivar1_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_multiva
> r1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -1768.287
Iteration 1:   log likelihood = -1648.4073
Iteration 2:   log likelihood = -1643.9885
Iteration 3:   log likelihood = -1643.9874
Refining estimates:
Iteration 0:   log likelihood = -1643.9874

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =          835
Time at risk    =   85749269.5
                                                LR chi2(29)      =      248.60
Log likelihood  =   -1643.9874                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.529249   .3197286     2.03   0.042     1.015109    2.303794
      1.male |          1  (omitted)
        age1 |   .8788604   .1798614    -0.63   0.528     .5884628    1.312565
        age2 |   1.175501   .1477054     1.29   0.198     .9188968    1.503762
        age3 |   .6027306   .1490125    -2.05   0.041     .3712629    .9785093
             |
         imd |
          2  |   1.187886   .1729157     1.18   0.237     .8930357    1.580086
          3  |   1.207537   .1750902     1.30   0.193      .908821    1.604438
          4  |   1.541674    .228946     2.91   0.004     1.152352    2.062529
5 most de..  |   1.977439   .2994747     4.50   0.000     1.469577    2.660811
             |
   obese4cat |
Obese I ..)  |   1.086997   .1102317     0.82   0.411     .8910636    1.326015
Obese II..)  |   1.520669   .2476509     2.57   0.010     1.105124    2.092466
Obese II..)  |   1.943479   .5197709     2.48   0.013     1.150619    3.282677
             |
smoke_nomiss |
     Former  |   1.589115   .1524609     4.83   0.000     1.316711    1.917875
    Current  |   1.112476   .1947544     0.61   0.543      .789362    1.567853
             |
     diabcat |
Controlle..  |   1.598056   .1584423     4.73   0.000     1.315825    1.940823
Uncontrol..  |   2.238343   .2813173     6.41   0.000     1.749632    2.863561
Diabetes,..  |   1.604513   1.328328     0.57   0.568      .316708     8.12882
             |
1.myocardi~t |   1.224888   .1620468     1.53   0.125     .9451185    1.587472
       1.pad |   1.374908   .2285803     1.92   0.055     .9925681    1.904527
1.hyperten~n |   1.083279   .0935107     0.93   0.354      .914667    1.282973
1.heart_f~re |   1.685975   .2334192     3.77   0.000     1.285299    2.211556
1.stroke_tia |   1.916267   .2186296     5.70   0.000     1.532291    2.396464
       1.vte |   1.475238   .2767449     2.07   0.038     1.021368    2.130796
 1.oestrogen |   1.652492   1.315147     0.63   0.528     .3473003    7.862735
1.antiplat~t |   .8794083   .0900355    -1.26   0.209     .7195201    1.074826
1.flu_vac~ne |    .998283   .0981899    -0.02   0.986     .8232477    1.210533
             |
   ethnicity |
      Mixed  |   .5570315   .4173484    -0.78   0.435      .128271    2.418974
Asian or ..  |   1.766356   .3698031     2.72   0.007     1.171848    2.662473
      Black  |   1.687613   .4760042     1.86   0.064     .9709237     2.93333
      Other  |   .8472748   .4110287    -0.34   0.733      .327409    2.192593
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_
> multivar2_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_multiva
> r2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -1768.287
Iteration 1:   log likelihood = -1653.3176
Iteration 2:   log likelihood = -1649.1697
Iteration 3:   log likelihood = -1649.1687
Refining estimates:
Iteration 0:   log likelihood = -1649.1687

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =          835
Time at risk    =   85749269.5
                                                LR chi2(25)      =      238.24
Log likelihood  =   -1649.1687                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.483298   .3089157     1.89   0.058     .9861769    2.231012
      1.male |          1  (omitted)
        age1 |   .8916546   .1819435    -0.56   0.574     .5977336    1.330104
        age2 |   1.168263   .1467411     1.24   0.216      .913323    1.494365
        age3 |   .5939908   .1468318    -2.11   0.035     .3659035    .9642569
             |
         imd |
          2  |   1.181154   .1721687     1.14   0.253     .8876314    1.571738
          3  |   1.206593   .1748412     1.30   0.195     .9082753    1.602891
          4  |   1.537577   .2283495     2.90   0.004     1.149272    2.057079
5 most de..  |   1.992886   .3017497     4.55   0.000      1.48115    2.681426
             |
   obese4cat |
Obese I ..)  |   1.066544   .1078273     0.64   0.524      .874828    1.300275
Obese II..)  |   1.492055   .2421974     2.47   0.014      1.08546    2.050954
Obese II..)  |   1.862559   .4971136     2.33   0.020     1.103891    3.142637
             |
smoke_nomiss |
     Former  |   1.533885   .1453831     4.51   0.000      1.27384    1.847015
    Current  |    1.05741   .1836076     0.32   0.748     .7523874     1.48609
             |
     diabcat |
Controlle..  |   1.641877   .1614333     5.04   0.000     1.354093    1.990824
Uncontrol..  |   2.349233   .2912913     6.89   0.000     1.842392    2.995505
Diabetes,..  |    1.57603   1.302906     0.55   0.582     .3117994    7.966247
             |
1.myocardi~t |   1.228617    .162326     1.56   0.119     .9483201    1.591762
       1.pad |    1.37366   .2281419     1.91   0.056     .9919936    1.902171
1.hyperten~n |   1.096203   .0944592     1.07   0.286     .9258563    1.297892
1.heart_f~re |   1.715438   .2370351     3.91   0.000     1.308453    2.249013
1.stroke_tia |   1.926327   .2193664     5.76   0.000      1.54098    2.408037
       1.vte |   1.473185   .2760404     2.07   0.039      1.02038    2.126927
 1.oestrogen |   1.576437   1.250275     0.57   0.566     .3331097    7.460466
1.antiplat~t |   .8774791   .0896351    -1.28   0.201     .7182671    1.071982
1.flu_vac~ne |   .9940758   .0976562    -0.06   0.952      .819972    1.205147
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_
> multivar2_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_multiva
> r2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -1768.287
Iteration 1:   log likelihood = -1545.7889
Iteration 2:   log likelihood = -1538.5517
Iteration 3:   log likelihood = -1538.5411
Iteration 4:   log likelihood = -1538.5411
Refining estimates:
Iteration 0:   log likelihood = -1538.5411

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =          835
Time at risk    =   85749269.5
                                                LR chi2(36)      =      459.49
Log likelihood  =   -1538.5411                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.359891   .2970595     1.41   0.159     .8862667    2.086621
      1.male |          1  (omitted)
        age1 |   .8423097   .1757919    -0.82   0.411      .559531    1.268001
        age2 |   1.193353   .1535133     1.37   0.169     .9274066    1.535563
        age3 |   .5828762   .1481062    -2.12   0.034     .3542337    .9590975
             |
         imd |
          2  |   1.101268   .1641951     0.65   0.518     .8222087    1.475041
          3  |   1.093984   .1625053     0.60   0.545     .8176543    1.463701
          4  |   1.372623   .2102632     2.07   0.039     1.016626    1.853281
5 most de..  |   1.713123   .2670492     3.45   0.001     1.262117    2.325293
             |
   obese4cat |
Obese I ..)  |   1.150315    .120629     1.34   0.182     .9366007    1.412794
Obese II..)  |   1.668241   .2815329     3.03   0.002     1.198422    2.322244
Obese II..)  |   1.921084   .5340345     2.35   0.019     1.114101    3.312596
             |
smoke_nomiss |
     Former  |   1.489076   .1479394     4.01   0.000     1.225604    1.809188
    Current  |   1.018174   .1835998     0.10   0.920     .7150416    1.449816
             |
     diabcat |
Controlle..  |   1.545545   .1578969     4.26   0.000     1.265088    1.888177
Uncontrol..  |   2.021651   .2641644     5.39   0.000     1.564882    2.611745
Diabetes,..  |   1.374801   1.157608     0.38   0.705     .2639443    7.160893
             |
1.myocardi~t |   1.186929       .161     1.26   0.206     .9098386    1.548408
       1.pad |    1.31406   .2254025     1.59   0.111     .9388747    1.839175
1.hyperten~n |   1.085763   .0963809     0.93   0.354     .9123802    1.292095
1.heart_f~re |   1.317574   .1914963     1.90   0.058     .9909717    1.751817
1.stroke_tia |   1.741893   .2056438     4.70   0.000     1.382072    2.195393
       1.vte |   1.348958   .2605163     1.55   0.121     .9238698    1.969635
 1.oestrogen |   1.630652   1.279293     0.62   0.533     .3504042     7.58845
1.antiplat~t |   .8322828   .0874703    -1.75   0.081     .6773487    1.022656
1.flu_vac~ne |   .9726355   .0985564    -0.27   0.784     .7974409     1.18632
             |
         ckd |
        CKD  |   1.374214   .1267393     3.45   0.001     1.146967    1.646486
      1.copd |   1.156099   .1322229     1.27   0.205     .9239385    1.446594
1.other_re~y |   2.136357   .3040911     5.33   0.000     1.616266    2.823804
1.immunode~y |   1.538033   .5950473     1.11   0.266     .7205193    3.283112
    1.cancer |   1.384436   .1302748     3.46   0.001     1.151265    1.664833
1.ae_atten~r |   2.620775    .220321    11.46   0.000     2.222653    3.090209
1.gp_consult |      .3551    .269149    -1.37   0.172     .0803859    1.568633
             |
   ethnicity |
      Mixed  |   .6045566   .4560683    -0.67   0.505     .1378172    2.651981
Asian or ..  |   1.929861   .4215503     3.01   0.003     1.257748    2.961139
      Black  |   1.788668   .5220744     1.99   0.046     1.009443    3.169403
      Other  |   .8552412    .431437    -0.31   0.757     .3181922    2.298729
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_
> multivar3_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_multiva
> r3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -1768.287
Iteration 1:   log likelihood = -1551.6569
Iteration 2:   log likelihood = -1544.5398
Iteration 3:   log likelihood = -1544.5288
Iteration 4:   log likelihood = -1544.5288
Refining estimates:
Iteration 0:   log likelihood = -1544.5288

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =          835
Time at risk    =   85749269.5
                                                LR chi2(32)      =      447.52
Log likelihood  =   -1544.5288                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.31618   .2860498     1.26   0.206     .8596487    2.015162
      1.male |          1  (omitted)
        age1 |   .8540333   .1775054    -0.76   0.448     .5682743    1.283487
        age2 |   1.189259   .1526726     1.35   0.177     .9247032    1.529503
        age3 |   .5721471      .1452    -2.20   0.028     .3479277    .9408631
             |
         imd |
          2  |   1.097233   .1639271     0.62   0.535     .8187083    1.470513
          3  |    1.09696   .1627954     0.62   0.533     .8201012    1.467284
          4  |    1.37545   .2105942     2.08   0.037     1.018868    1.856828
5 most de..  |    1.73509   .2703488     3.54   0.000      1.27848    2.354777
             |
   obese4cat |
Obese I ..)  |   1.124846    .117503     1.13   0.260     .9165903    1.380418
Obese II..)  |    1.62607   .2735442     2.89   0.004     1.169356    2.261163
Obese II..)  |   1.837191   .5098309     2.19   0.028     1.066452    3.164955
             |
smoke_nomiss |
     Former  |   1.431868   .1406447     3.65   0.000      1.18112    1.735849
    Current  |   .9631813   .1722359    -0.21   0.834     .6784163    1.367476
             |
     diabcat |
Controlle..  |   1.586492   .1609983     4.55   0.000     1.300342    1.935613
Uncontrol..  |   2.138561   .2752964     5.90   0.000     1.661677    2.752305
Diabetes,..  |   1.358025   1.142485     0.36   0.716     .2610991    7.063341
             |
1.myocardi~t |   1.187461   .1607434     1.27   0.204     .9107403    1.548261
       1.pad |    1.31779   .2255096     1.61   0.107     .9422856    1.842934
1.hyperten~n |   1.099873   .0974304     1.07   0.283     .9245708    1.308413
1.heart_f~re |   1.349159    .195511     2.07   0.039     1.015577    1.792312
1.stroke_tia |   1.748545   .2060999     4.74   0.000     1.387862    2.202964
       1.vte |    1.34676   .2601738     1.54   0.123     .9222541    1.966661
 1.oestrogen |   1.542001   1.206925     0.55   0.580     .3325439    7.150239
1.antiplat~t |    .832661   .0873066    -1.75   0.081     .6779812    1.022631
1.flu_vac~ne |   .9652969   .0976859    -0.35   0.727     .7916282    1.177065
             |
         ckd |
        CKD  |    1.37419   .1264055     3.46   0.001      1.14749    1.645679
      1.copd |   1.151045   .1313005     1.23   0.218     .9204394    1.439427
1.other_re~y |   2.133198   .3034692     5.33   0.000     1.614132    2.819183
1.immunode~y |   1.656933   .6297632     1.33   0.184     .7866512    3.490018
    1.cancer |   1.378321   .1294814     3.42   0.001     1.146535    1.656965
1.ae_atten~r |   2.594926   .2174802    11.38   0.000     2.201841    3.058187
1.gp_consult |   .3747506   .2847553    -1.29   0.196      .084519    1.661614
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_
> multivar3_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/onscoviddeath_multiva
> r3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_2/table3_onscovidd
> eath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    373,900    7.81e+07           0   7.81e+07   7.81e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     36,609     7641924           0    7641924    7641924

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.22396   .1396209     1.77   0.076      .978741    1.530616
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.579681   .3232591     2.23   0.025      1.05775     2.35915
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.529249   .3197286     2.03   0.042     1.015109    2.303794
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.483298   .3089157     1.89   0.058     .9861769    2.231012
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.359891   .2970595     1.41   0.159     .8862667    2.086621
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.31618   .2860498     1.26   0.206     .8596487    2.015162
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/06c_an_models_ethn
> icity_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 11:48:55
-------------------------------------------------------------------------------
