-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/06c_an_models_ethn
> icity_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 11:46:49

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(127,160 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |
 indicating |   Failure/censoring
        the |     indicator for
   exposure |  outcome: SUS covid
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   372,814      1,086 |   373,900 
            |     99.71       0.29 |    100.00 
------------+----------------------+----------
current use |    36,496        113 |    36,609 
            |     99.69       0.31 |    100.00 
------------+----------------------+----------
      Total |   409,310      1,199 |   410,509 
            |     99.71       0.29 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2579.8937
Iteration 1:   log likelihood = -2579.8465
Iteration 2:   log likelihood = -2579.8465
Refining estimates:
Iteration 0:   log likelihood = -2579.8465

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        1,199
Time at risk    =     85639763
                                                LR chi2(1)       =        0.09
Log likelihood  =   -2579.8465                  Prob > chi2      =      0.7586

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.03175   .1045457     0.31   0.758     .8459091     1.25842
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_uni
> var_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_univar_eth
> n.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2579.8937
Iteration 1:   log likelihood = -2577.2521
Iteration 2:   log likelihood = -2577.2206
Iteration 3:   log likelihood = -2577.2206
Refining estimates:
Iteration 0:   log likelihood = -2577.2206

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        1,199
Time at risk    =     85639763
                                                LR chi2(4)       =        5.35
Log likelihood  =   -2577.2206                  Prob > chi2      =      0.2536

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.147082   .1931972     0.81   0.415     .8245764    1.595725
      1.male |          1  (omitted)
        age1 |   .8216159    .162401    -0.99   0.320     .5577248    1.210369
        age2 |   1.296153   .1706262     1.97   0.049     1.001391    1.677679
        age3 |    .585657   .1522946    -2.06   0.040     .3518004    .9749678
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar1_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar1_
> ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2579.8937
Iteration 1:   log likelihood = -2442.8759
Iteration 2:   log likelihood =  -2439.302
Iteration 3:   log likelihood = -2439.3015
Refining estimates:
Iteration 0:   log likelihood = -2439.3015

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        1,199
Time at risk    =     85639763
                                                LR chi2(29)      =      281.18
Log likelihood  =   -2439.3015                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.165842   .2009998     0.89   0.373     .8315463    1.634531
      1.male |          1  (omitted)
        age1 |   .9593815   .1923625    -0.21   0.836     .6476192    1.421225
        age2 |   1.219679   .1622171     1.49   0.135     .9398008    1.582906
        age3 |    .481873   .1290732    -2.73   0.006     .2850572     .814579
             |
         imd |
          2  |   1.252239     .15269     1.84   0.065     .9860463    1.590294
          3  |   1.284355   .1600694     2.01   0.045     1.006004    1.639723
          4  |   1.453141   .1848793     2.94   0.003     1.132431    1.864678
5 most de..  |   1.691967    .217079     4.10   0.000     1.315779    2.175709
             |
   obese4cat |
Obese I ..)  |   1.140592   .0939683     1.60   0.110     .9705181     1.34047
Obese II..)  |   1.736421   .2096349     4.57   0.000     1.370538    2.199982
Obese II..)  |    1.48972   .3109212     1.91   0.056     .9895765    2.242642
             |
smoke_nomiss |
     Former  |   1.500123   .1139945     5.34   0.000      1.29254    1.741044
    Current  |   .9337195   .1303646    -0.49   0.623     .7101873    1.227609
             |
     diabcat |
Controlle..  |   1.473134   .1229347     4.64   0.000     1.250859    1.734906
Uncontrol..  |   1.846523   .1934949     5.85   0.000      1.50369     2.26752
Diabetes,..  |   .8788118   .6740032    -0.17   0.866     .1954647    3.951149
             |
1.myocardi~t |   1.188763   .1339602     1.53   0.125     .9531794    1.482573
       1.pad |   1.127745   .1716942     0.79   0.430     .8367955    1.519857
1.hyperten~n |    1.01805   .0705872     0.26   0.796     .8886902     1.16624
1.heart_f~re |   1.351584   .1751854     2.32   0.020      1.04837    1.742495
1.stroke_tia |   1.714024   .1728001     5.34   0.000     1.406704    2.088484
       1.vte |   1.490816   .2393531     2.49   0.013     1.088334    2.042142
 1.oestrogen |    1.71293   .8795859     1.05   0.295      .626108    4.686297
1.antiplat~t |   1.057967   .0915573     0.65   0.515     .8929116    1.253533
1.flu_vac~ne |   .8907908   .0692733    -1.49   0.137     .7648584    1.037458
             |
   ethnicity |
      Mixed  |   1.093544   .5317427     0.18   0.854     .4216329     2.83621
Asian or ..  |   2.198891   .3494146     4.96   0.000     1.610436    3.002367
      Black  |   2.231116    .476516     3.76   0.000     1.467995    3.390936
      Other  |   .7407316   .2959298    -0.75   0.453     .3385301    1.620782
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar2_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar2_
> ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2579.8937
Iteration 1:   log likelihood = -2458.5631
Iteration 2:   log likelihood = -2455.4471
Iteration 3:   log likelihood = -2455.4465
Refining estimates:
Iteration 0:   log likelihood = -2455.4465

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        1,199
Time at risk    =     85639763
                                                LR chi2(25)      =      248.89
Log likelihood  =   -2455.4465                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.121556   .1921235     0.67   0.503     .8016955    1.569034
      1.male |          1  (omitted)
        age1 |   .9794018   .1950093    -0.10   0.917     .6629452    1.446919
        age2 |   1.209257   .1598678     1.44   0.151     .9332264    1.566933
        age3 |   .4773145    .127499    -2.77   0.006     .2827704    .8057036
             |
         imd |
          2  |   1.253808   .1529282     1.85   0.064     .9872093    1.592403
          3  |   1.284214   .1599881     2.01   0.045     1.005991    1.639383
          4  |    1.46447   .1861388     3.00   0.003     1.141538    1.878759
5 most de..  |   1.715863   .2200536     4.21   0.000     1.334501    2.206208
             |
   obese4cat |
Obese I ..)  |   1.109396   .0909564     1.27   0.205     .9447108     1.30279
Obese II..)  |   1.669674   .2004307     4.27   0.000     1.319629    2.112571
Obese II..)  |   1.422193   .2967561     1.69   0.091     .9448136    2.140775
             |
smoke_nomiss |
     Former  |   1.438025   .1081591     4.83   0.000     1.240922    1.666436
    Current  |   .8667936   .1202761    -1.03   0.303      .660394    1.137701
             |
     diabcat |
Controlle..  |   1.530173    .126491     5.15   0.000     1.301297    1.799305
Uncontrol..  |   1.981637    .204962     6.61   0.000     1.618019     2.42697
Diabetes,..  |    .835963   .6398791    -0.23   0.815     .1864849    3.747402
             |
1.myocardi~t |   1.192761    .134026     1.57   0.117     .9569895    1.486619
       1.pad |   1.123421   .1707252     0.77   0.444     .8340393    1.513209
1.hyperten~n |   1.031394   .0713155     0.45   0.655     .9006756    1.181084
1.heart_f~re |    1.35121   .1748208     2.33   0.020      1.04856    1.741213
1.stroke_tia |   1.728133   .1734531     5.45   0.000     1.419521    2.103838
       1.vte |   1.486244   .2382954     2.47   0.013      1.08546    2.035011
 1.oestrogen |   1.709984   .8757741     1.05   0.295     .6266804    4.665926
1.antiplat~t |   1.061592   .0914511     0.69   0.488     .8966657    1.256853
1.flu_vac~ne |   .8774569   .0677282    -1.69   0.090     .7542654    1.020769
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar2_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar2_
> withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2579.8937
Iteration 1:   log likelihood = -2348.0338
Iteration 2:   log likelihood = -2342.5824
Iteration 3:   log likelihood =  -2342.581
Refining estimates:
Iteration 0:   log likelihood =  -2342.581

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        1,199
Time at risk    =     85639763
                                                LR chi2(36)      =      474.63
Log likelihood  =    -2342.581                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.134576   .1985885     0.72   0.471     .8050909    1.598903
      1.male |          1  (omitted)
        age1 |    .846108   .1722772    -0.82   0.412     .5676903    1.261073
        age2 |   1.321823   .1786067     2.06   0.039     1.014279    1.722618
        age3 |    .437442   .1186691    -3.05   0.002     .2570437    .7444474
             |
         imd |
          2  |   1.214535   .1499584     1.57   0.115     .9534817    1.547062
          3  |   1.186507   .1503687     1.35   0.177     .9255408    1.521055
          4  |   1.334376   .1722622     2.23   0.025     1.036076     1.71856
5 most de..  |   1.538912   .2004971     3.31   0.001     1.192107     1.98661
             |
   obese4cat |
Obese I ..)  |    1.15616   .0969012     1.73   0.083     .9810164    1.362573
Obese II..)  |     1.7754   .2179315     4.68   0.000      1.39576    2.258301
Obese II..)  |   1.390396   .2937044     1.56   0.119     .9190358     2.10351
             |
smoke_nomiss |
     Former  |    1.39594   .1089656     4.27   0.000     1.197906    1.626712
    Current  |   .8127071   .1170574    -1.44   0.150     .6128189    1.077795
             |
     diabcat |
Controlle..  |   1.406109   .1190707     4.02   0.000     1.191073    1.659967
Uncontrol..  |   1.661301   .1781732     4.73   0.000     1.346349     2.04993
Diabetes,..  |   .7830409   .6037716    -0.32   0.751     .1727655    3.549049
             |
1.myocardi~t |   1.164562   .1329355     1.33   0.182     .9311019    1.456558
       1.pad |   .9739867   .1535237    -0.17   0.867      .715127    1.326548
1.hyperten~n |   1.003646   .0709603     0.05   0.959      .873773    1.152823
1.heart_f~re |   1.080192    .144236     0.58   0.563     .8314603    1.403332
1.stroke_tia |   1.543668   .1586231     4.23   0.000     1.262079    1.888083
       1.vte |   1.325858   .2168065     1.72   0.085     .9622926    1.826783
 1.oestrogen |   1.434717   .7347797     0.70   0.481     .5258111    3.914739
1.antiplat~t |    1.00529   .0881528     0.06   0.952     .8465458    1.193802
1.flu_vac~ne |   .8574755   .0679367    -1.94   0.052     .7341455    1.001524
             |
         ckd |
        CKD  |   1.517257   .1213075     5.21   0.000     1.297191    1.774656
      1.copd |   1.519606   .1427847     4.45   0.000     1.264011    1.826886
1.other_re~y |   1.475018   .1876088     3.06   0.002     1.149561    1.892615
1.immunode~y |   .7702628   .2921445    -0.69   0.491     .3662655    1.619876
    1.cancer |    1.27725    .102656     3.04   0.002     1.091096    1.495166
1.ae_atten~r |   2.076991   .1478382    10.27   0.000     1.806538    2.387934
1.gp_consult |   .8875126   .6870034    -0.15   0.877     .1946609    4.046415
             |
   ethnicity |
      Mixed  |   1.164408   .5726183     0.31   0.757     .4441313    3.052802
Asian or ..  |   2.195296   .3547792     4.87   0.000     1.599306    3.013386
      Black  |   2.219622   .4798784     3.69   0.000      1.45295     3.39084
      Other  |   .7340044   .3018527    -0.75   0.452     .3278308    1.643416
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar3_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar3_
> ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2579.8937
Iteration 1:   log likelihood = -2363.2544
Iteration 2:   log likelihood = -2358.1713
Iteration 3:   log likelihood = -2358.1703
Refining estimates:
Iteration 0:   log likelihood = -2358.1703

Stratified Cox regr. -- no ties

No. of subjects =      410,509                  Number of obs    =     410,509
No. of failures =        1,199
Time at risk    =     85639763
                                                LR chi2(32)      =      443.45
Log likelihood  =   -2358.1703                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |     1.0938   .1903153     0.52   0.606     .7777386    1.538305
      1.male |          1  (omitted)
        age1 |   .8612764   .1743875    -0.74   0.461     .5791551    1.280826
        age2 |    1.31327   .1767489     2.02   0.043     1.008773    1.709679
        age3 |    .432155   .1172055    -3.09   0.002     .2539708     .735352
             |
         imd |
          2  |    1.21967   .1507255     1.61   0.108     .9573081    1.553935
          3  |   1.191813   .1510175     1.38   0.166     .9297163    1.527798
          4  |   1.352624   .1744578     2.34   0.019     1.050489    1.741658
5 most de..  |   1.564778    .203821     3.44   0.001     1.212214    2.019884
             |
   obese4cat |
Obese I ..)  |   1.125458   .0938539     1.42   0.156     .9557544    1.325295
Obese II..)  |   1.705109   .2080173     4.37   0.000     1.342482    2.165687
Obese II..)  |   1.334917   .2814113     1.37   0.171     .8831087    2.017876
             |
smoke_nomiss |
     Former  |   1.333811   .1029919     3.73   0.000     1.146483    1.551747
    Current  |   .7539954   .1077894    -1.98   0.048     .5697481    .9978252
             |
     diabcat |
Controlle..  |   1.457989   .1224103     4.49   0.000      1.23677    1.718778
Uncontrol..  |   1.783737   .1886949     5.47   0.000     1.449724    2.194705
Diabetes,..  |    .723708   .5582322    -0.42   0.675     .1595839    3.281994
             |
1.myocardi~t |   1.169214   .1329891     1.37   0.169       .93557    1.461206
       1.pad |   .9778569   .1531113    -0.14   0.886     .7194415    1.329092
1.hyperten~n |   1.017818    .071766     0.25   0.802     .8864457    1.168659
1.heart_f~re |   1.076385   .1434855     0.55   0.581     .8288952    1.397769
1.stroke_tia |   1.551695   .1588578     4.29   0.000     1.269589    1.896487
       1.vte |   1.323772   .2163352     1.72   0.086     .9609638    1.823557
 1.oestrogen |   1.468976   .7475792     0.76   0.450     .5417868    3.982916
1.antiplat~t |   1.008377   .0880894     0.10   0.924     .8496969     1.19669
1.flu_vac~ne |   .8425221    .066259    -2.18   0.029     .7221705    .9829307
             |
         ckd |
        CKD  |   1.524745    .121665     5.29   0.000     1.303997    1.782862
      1.copd |   1.523209   .1428116     4.49   0.000     1.267515    1.830482
1.other_re~y |   1.455954   .1846894     2.96   0.003      1.13546     1.86691
1.immunode~y |   .8111454   .3064116    -0.55   0.580     .3868618    1.700754
    1.cancer |   1.271516   .1019305     3.00   0.003      1.08664    1.487846
1.ae_atten~r |   2.081832   .1477546    10.33   0.000     1.811478    2.392535
1.gp_consult |   .9427562   .7254959    -0.08   0.939     .2086215    4.260295
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_mul
> tivar3_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_2/admitcovid_multivar3_
> withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_2/table3_admitcovi
> d.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    373,900    7.80e+07           0   7.80e+07   7.80e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     36,609     7632449           0    7632449    7632449

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.03175   .1045457     0.31   0.758     .8459091     1.25842
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.147082   .1931972     0.81   0.415     .8245764    1.595725
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.165842   .2009998     0.89   0.373     .8315463    1.634531
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.121556   .1921235     0.67   0.503     .8016955    1.569034
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.134576   .1985885     0.72   0.471     .8050909    1.598903
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     1.0938   .1903153     0.52   0.606     .7777386    1.538305
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_2/06c_an_models_ethn
> icity_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 11:49:56
-------------------------------------------------------------------------------
