-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsco
> viddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:54:44

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   278,580      1,827 |   280,407 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    91,877        430 |    92,307 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   370,457      2,257 |   372,714 
             |     99.39       0.61 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -28912.69
Iteration 1:   log likelihood = -28891.137
Iteration 2:   log likelihood = -28890.982
Iteration 3:   log likelihood = -28890.982
Refining estimates:
Iteration 0:   log likelihood = -28890.982

Cox regression -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =        2,257
Time at risk    =   76402730.5
                                                LR chi2(1)       =       43.42
Log likelihood  =   -28890.982                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7108419   .0381009    -6.37   0.000     .6399541    .7895818
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_u
> nivar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_univar.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -28912.69
Iteration 1:   log likelihood = -28385.679
Iteration 2:   log likelihood = -28205.386
Iteration 3:   log likelihood = -28201.176
Iteration 4:   log likelihood = -28201.171
Refining estimates:
Iteration 0:   log likelihood = -28201.171

Cox regression -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =        2,257
Time at risk    =   76402730.5
                                                LR chi2(5)       =     1423.04
Log likelihood  =   -28201.171                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .649346   .0349087    -8.03   0.000     .5844075    .7215004
      1.male |   1.485827   .0648307     9.08   0.000     1.364043    1.618485
        age1 |   1.048566   .0186531     2.67   0.008     1.012636     1.08577
        age2 |   1.073459   .0266354     2.86   0.004     1.022504    1.126954
        age3 |   .6966321   .0892451    -2.82   0.005     .5419468    .8954685
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11675.466
Iteration 1:   log likelihood = -10785.692
Iteration 2:   log likelihood = -10351.521
Iteration 3:   log likelihood = -10348.396
Iteration 4:   log likelihood = -10348.318
Iteration 5:   log likelihood = -10348.317
Refining estimates:
Iteration 0:   log likelihood = -10348.317

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =        2,257
Time at risk    =   76402730.5
                                                LR chi2(27)      =     2654.30
Log likelihood  =   -10348.317                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7379982   .0412406    -5.44   0.000     .6614373    .8234209
      1.male |   1.534323   .0717662     9.15   0.000     1.399919    1.681631
        age1 |   1.056013   .0190839     3.02   0.003     1.019264    1.094087
        age2 |   1.065481   .0268432     2.52   0.012     1.014147    1.119414
        age3 |   .6480414   .0842541    -3.34   0.001     .5022675    .8361235
             |
         imd |
          2  |   1.015927   .0807839     0.20   0.842     .8693147    1.187265
          3  |   1.210752   .0967724     2.39   0.017     1.035192    1.416086
          4  |   1.159948   .0977156     1.76   0.078     .9834046    1.368186
5 most de..  |   1.368276   .1174753     3.65   0.000     1.156359     1.61903
             |
   obese4cat |
Obese I ..)  |   .9647803   .0571739    -0.61   0.545     .8589845    1.083606
Obese II..)  |   1.205786   .1040707     2.17   0.030     1.018131    1.428029
Obese II..)  |   1.357004   .1702383     2.43   0.015     1.061198    1.735264
             |
smoke_nomiss |
     Former  |   1.375912   .0681566     6.44   0.000     1.248608    1.516196
    Current  |   1.355536    .152751     2.70   0.007     1.086906    1.690559
             |
     diabcat |
Controlle..  |   1.245859   .0636507     4.30   0.000     1.127148    1.377072
Uncontrol..  |   1.476102    .107604     5.34   0.000     1.279575    1.702812
Diabetes,..  |   .5404882   .2450219    -1.36   0.175     .2222835    1.314211
             |
1.myocardi~t |   1.326713   .0766071     4.90   0.000      1.18475    1.485686
       1.pad |   1.434011   .1040649     4.97   0.000     1.243888    1.653192
1.hyperten~n |    1.02118   .0530672     0.40   0.687     .9222918    1.130671
1.heart_f~re |   1.485017   .0670443     8.76   0.000     1.359258     1.62241
1.stroke_tia |   1.200132    .056596     3.87   0.000     1.094178    1.316347
       1.vte |   1.393302   .0936368     4.94   0.000     1.221351    1.589463
 1.oestrogen |   .6236057   .2826926    -1.04   0.298     .2564743    1.516269
1.flu_vac~ne |   .8087661     .04455    -3.85   0.000      .725998    .9009704
1.antiplat~t |   .9121375   .0814838    -1.03   0.303      .765632    1.086677
1.care_ho~ce |   6.879591   .4166594    31.84   0.000     6.109561    7.746674
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11675.466
Iteration 1:   log likelihood =  -10613.78
Iteration 2:   log likelihood =  -10149.84
Iteration 3:   log likelihood =  -10146.59
Iteration 4:   log likelihood = -10146.519
Iteration 5:   log likelihood = -10146.519
Refining estimates:
Iteration 0:   log likelihood = -10146.519

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =        2,257
Time at risk    =   76402730.5
                                                LR chi2(34)      =     3057.89
Log likelihood  =   -10146.519                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8093409   .0454456    -3.77   0.000     .7249956    .9034988
      1.male |   1.558216   .0728882     9.48   0.000     1.421711    1.707828
        age1 |   1.056977   .0190702     3.07   0.002     1.020253    1.095023
        age2 |   1.047841   .0263869     1.86   0.063     .9973794    1.100856
        age3 |   .7161775   .0932275    -2.56   0.010     .5549023    .9243253
             |
         imd |
          2  |   1.015117    .080863     0.19   0.851     .8683808    1.186647
          3  |   1.196029   .0957332     2.24   0.025     1.022373    1.399181
          4  |   1.121683   .0948103     1.36   0.174     .9504351    1.323787
5 most de..  |   1.300736   .1120915     3.05   0.002     1.098592    1.540075
             |
   obese4cat |
Obese I ..)  |   .9713153    .057759    -0.49   0.625     .8644577    1.091382
Obese II..)  |   1.202341   .1039831     2.13   0.033     1.014875    1.424436
Obese II..)  |   1.324339   .1666518     2.23   0.026     1.034871    1.694777
             |
smoke_nomiss |
     Former  |   1.289759   .0649848     5.05   0.000     1.168478    1.423629
    Current  |   1.209958   .1390076     1.66   0.097     .9660041     1.51552
             |
     diabcat |
Controlle..  |   1.213478   .0622962     3.77   0.000     1.097322    1.341931
Uncontrol..  |   1.367826   .1005388     4.26   0.000     1.184309    1.579779
Diabetes,..  |   .5428245   .2461331    -1.35   0.178     .2232025     1.32014
             |
1.myocardi~t |   1.268915   .0732747     4.12   0.000     1.133128    1.420974
       1.pad |   1.353873   .0985657     4.16   0.000     1.173838    1.561521
1.hyperten~n |   .9994686   .0522051    -0.01   0.992     .9022116     1.10721
1.heart_f~re |   1.332759   .0611944     6.26   0.000     1.218058     1.45826
1.stroke_tia |   1.149592   .0543073     2.95   0.003      1.04793    1.261115
       1.vte |   1.290556   .0869581     3.79   0.000     1.130896    1.472757
 1.oestrogen |   .6130136   .2787762    -1.08   0.282     .2514055    1.494739
1.flu_vac~ne |   .8088493   .0447625    -3.83   0.000     .7257071     .901517
             |
         ckd |
        CKD  |   1.280965   .0595478     5.33   0.000     1.169413    1.403159
      1.copd |   1.246729   .0756275     3.64   0.000     1.106974    1.404127
1.other_re~y |   1.505913    .108034     5.71   0.000     1.308382    1.733265
1.immunode~y |   1.612098   .3789823     2.03   0.042     1.016917    2.555626
    1.cancer |   1.022754   .0549531     0.42   0.675     .9205257    1.136336
1.ae_atten~r |    2.15197   .0992944    16.61   0.000     1.965897    2.355655
1.gp_consult |   .7507874   .0876911    -2.45   0.014     .5971695    .9439225
1.antiplat~t |   .8342838   .0746653    -2.02   0.043     .7000588    .9942444
1.care_ho~ce |   6.382643   .3931971    30.09   0.000     5.656698     7.20175
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table2_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7108419   .0381009    -6.37   0.000     .6399541    .7895818
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .649346   .0349087    -8.03   0.000     .5844075    .7215004
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7379982   .0412406    -5.44   0.000     .6614373    .8234209
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8093409   .0454456    -3.77   0.000     .7249956    .9034988
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsco
> viddeath.log
  log type:  text
 closed on:   1 Mar 2021, 21:56:45
-------------------------------------------------------------------------------
