-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsco
> viddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:24:05

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   277,631      1,825 |   279,456 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    91,635        428 |    92,063 
             |     99.54       0.46 |    100.00 
-------------+----------------------+----------
       Total |   369,266      2,253 |   371,519 
             |     99.39       0.61 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28854.135
Iteration 1:   log likelihood =   -28832.1
Iteration 2:   log likelihood = -28831.938
Iteration 3:   log likelihood = -28831.938
Refining estimates:
Iteration 0:   log likelihood = -28831.938

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,253
Time at risk    =   76155476.5
                                                LR chi2(1)       =       44.39
Log likelihood  =   -28831.938                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7077631   .0380115    -6.44   0.000     .6370489    .7863267
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_u
> nivar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_univar.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28854.135
Iteration 1:   log likelihood = -28326.149
Iteration 2:   log likelihood = -28141.922
Iteration 3:   log likelihood = -28137.581
Iteration 4:   log likelihood = -28137.575
Refining estimates:
Iteration 0:   log likelihood = -28137.575

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,253
Time at risk    =   76155476.5
                                                LR chi2(5)       =     1433.12
Log likelihood  =   -28137.575                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6463705   .0348177    -8.10   0.000     .5816078    .7183445
      1.male |   1.489645   .0650609     9.12   0.000     1.367433    1.622779
        age1 |   1.049387   .0188296     2.69   0.007     1.013123    1.086949
        age2 |   1.072925   .0267983     2.82   0.005     1.021667    1.126756
        age3 |   .6984875   .0899051    -2.79   0.005     .5427466    .8989182
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11656.399
Iteration 1:   log likelihood = -10763.582
Iteration 2:   log likelihood = -10329.737
Iteration 3:   log likelihood = -10326.611
Iteration 4:   log likelihood =  -10326.53
Iteration 5:   log likelihood =  -10326.53
Refining estimates:
Iteration 0:   log likelihood =  -10326.53

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,253
Time at risk    =   76155476.5
                                                LR chi2(27)      =     2659.74
Log likelihood  =    -10326.53                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7349274   .0411482    -5.50   0.000      .658546    .8201678
      1.male |   1.537058   .0719698     9.18   0.000     1.402278    1.684791
        age1 |   1.056755   .0192562     3.03   0.002      1.01968    1.095179
        age2 |   1.064504   .0269882     2.47   0.014     1.012901    1.118736
        age3 |   .6516061   .0851017    -3.28   0.001     .5044472    .8416947
             |
         imd |
          2  |   1.007771   .0802167     0.10   0.923     .8621997     1.17792
          3  |   1.189977   .0947525     2.18   0.029     1.018032    1.390964
          4  |   1.140225   .0959765     1.56   0.119     .9668125    1.344742
5 most de..  |   1.344732   .1153384     3.45   0.001     1.136652    1.590903
             |
   obese4cat |
Obese I ..)  |   .9648593   .0571429    -0.60   0.546      .859117    1.083617
Obese II..)  |   1.185895   .1028686     1.97   0.049     1.000484    1.405667
Obese II..)  |   1.339706   .1690897     2.32   0.020     1.046107    1.715707
             |
smoke_nomiss |
     Former  |   1.374256   .0681221     6.41   0.000      1.24702    1.514474
    Current  |   1.360701    .153374     2.73   0.006     1.090983    1.697101
             |
     diabcat |
Controlle..  |   1.251968   .0639546     4.40   0.000      1.13269    1.383806
Uncontrol..  |   1.463464    .107233     5.20   0.000     1.267685    1.689478
Diabetes,..  |   .5475741   .2482443    -1.33   0.184     .2251895    1.331489
             |
1.myocardi~t |   1.333143   .0769974     4.98   0.000     1.190459    1.492929
       1.pad |   1.441835   .1046473     5.04   0.000     1.250651    1.662245
1.hyperten~n |   1.028681   .0535756     0.54   0.587     .9288566    1.139234
1.heart_f~re |   1.483848    .067056     8.73   0.000     1.358073    1.621271
1.stroke_tia |   1.197403   .0565343     3.82   0.000      1.09157    1.313497
       1.vte |   1.398448   .0939975     4.99   0.000     1.225836    1.595366
 1.oestrogen |   .6306592   .2859938    -1.02   0.309     .2592917    1.533914
1.flu_vac~ne |   .8065304   .0444386    -3.90   0.000     .7239706    .8985053
1.antiplat~t |   .8988476   .0807798    -1.19   0.235     .7536822    1.071973
1.care_ho~ce |   6.865598   .4156345    31.82   0.000     6.097443    7.730526
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11656.399
Iteration 1:   log likelihood = -10591.226
Iteration 2:   log likelihood = -10127.924
Iteration 3:   log likelihood = -10124.668
Iteration 4:   log likelihood = -10124.594
Iteration 5:   log likelihood = -10124.594
Refining estimates:
Iteration 0:   log likelihood = -10124.594

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,253
Time at risk    =   76155476.5
                                                LR chi2(34)      =     3063.61
Log likelihood  =   -10124.594                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8061553   .0453518    -3.83   0.000     .7219926    .9001289
      1.male |   1.560438   .0730641     9.50   0.000      1.42361    1.710418
        age1 |   1.057651   .0192367     3.08   0.002     1.020612    1.096034
        age2 |   1.046934   .0265258     1.81   0.070     .9962141    1.100236
        age3 |   .7200267   .0941411    -2.51   0.012     .5572587    .9303372
             |
         imd |
          2  |    1.00806   .0803836     0.10   0.920     .8622053    1.178588
          3  |   1.174011   .0936024     2.01   0.044     1.004169    1.372579
          4  |   1.101494   .0930263     1.14   0.252     .9334564     1.29978
5 most de..  |   1.278218   .1100374     2.85   0.004     1.079762     1.51315
             |
   obese4cat |
Obese I ..)  |   .9699854    .057641    -0.51   0.608      .863342    1.089802
Obese II..)  |   1.179314   .1025302     1.90   0.058     .9945471    1.398406
Obese II..)  |   1.309441   .1657852     2.13   0.033     1.021686    1.678242
             |
smoke_nomiss |
     Former  |   1.288553   .0649709     5.03   0.000     1.167302    1.422398
    Current  |   1.215519   .1396907     1.70   0.089     .9703749    1.522595
             |
     diabcat |
Controlle..  |   1.220319   .0626372     3.88   0.000     1.103525    1.349473
Uncontrol..  |   1.358123   .1003221     4.14   0.000     1.175066    1.569697
Diabetes,..  |   .5504188   .2496003    -1.32   0.188     .2263059    1.338722
             |
1.myocardi~t |   1.274792   .0736298     4.20   0.000     1.138349     1.42759
       1.pad |    1.35972   .0990162     4.22   0.000     1.178866    1.568321
1.hyperten~n |   1.007423   .0527408     0.14   0.888     .9091795    1.116283
1.heart_f~re |   1.331111   .0611815     6.22   0.000      1.21644    1.456592
1.stroke_tia |   1.147154   .0542533     2.90   0.004     1.045599    1.258573
       1.vte |   1.295148   .0872834     3.84   0.000     1.134892    1.478032
 1.oestrogen |   .6183739   .2812969    -1.06   0.291      .253537    1.508207
1.flu_vac~ne |   .8070504   .0446808    -3.87   0.000     .7240615     .899551
             |
         ckd |
        CKD  |   1.280076   .0595594     5.31   0.000     1.168507    1.402299
      1.copd |   1.245456   .0757022     3.61   0.000     1.105579    1.403029
1.other_re~y |   1.517396   .1087987     5.82   0.000      1.31846    1.746349
1.immunode~y |   1.622278   .3814627     2.06   0.040      1.02323    2.572035
    1.cancer |   1.022488   .0550003     0.41   0.679     .9201775    1.136174
1.ae_atten~r |   2.148225   .0991768    16.56   0.000     1.962377    2.351674
1.gp_consult |   .7331991   .0850838    -2.67   0.007     .5840426    .9204482
1.antiplat~t |   .8228398   .0740817    -2.17   0.030     .6897316     .981636
1.care_ho~ce |   6.356009   .3914291    30.03   0.000     5.633315    7.171417
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table2_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7077631   .0380115    -6.44   0.000     .6370489    .7863267
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6463705   .0348177    -8.10   0.000     .5816078    .7183445
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7349274   .0411482    -5.50   0.000      .658546    .8201678
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8061553   .0453518    -3.83   0.000     .7219926    .9001289
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsco
> viddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:25:58
-------------------------------------------------------------------------------
