-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:58:05

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   269,219     11,188 |   280,407 
             |     96.01       3.99 |    100.00 
-------------+----------------------+----------
warfarin use |    89,302      3,005 |    92,307 
             |     96.74       3.26 |    100.00 
-------------+----------------------+----------
       Total |   358,521     14,193 |   372,714 
             |     96.19       3.81 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -181688.25
Iteration 1:   log likelihood = -181633.63
Iteration 2:   log likelihood = -181633.47
Iteration 3:   log likelihood = -181633.47
Refining estimates:
Iteration 0:   log likelihood = -181633.47

Cox regression -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =       14,193
Time at risk    =   76402730.5
                                                LR chi2(1)       =      109.56
Log likelihood  =   -181633.47                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8099023   .0166407   -10.26   0.000     .7779351    .8431831
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_univa
> r.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -181688.25
Iteration 1:   log likelihood = -179363.65
Iteration 2:   log likelihood = -177319.81
Iteration 3:   log likelihood = -177256.58
Iteration 4:   log likelihood =  -177256.4
Iteration 5:   log likelihood =  -177256.4
Refining estimates:
Iteration 0:   log likelihood =  -177256.4

Cox regression -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =       14,193
Time at risk    =   76402730.5
                                                LR chi2(5)       =     8863.71
Log likelihood  =    -177256.4                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7583348   .0156359   -13.42   0.000     .7282998    .7896083
      1.male |   1.205028   .0207383    10.84   0.000     1.165059    1.246367
        age1 |   1.035803   .0065191     5.59   0.000     1.023104    1.048659
        age2 |   1.061944   .0096318     6.63   0.000     1.043233    1.080991
        age3 |   .8347096   .0399327    -3.78   0.000     .7600002     .916763
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -74748.67
Iteration 1:   log likelihood = -69550.094
Iteration 2:   log likelihood = -68410.189
Iteration 3:   log likelihood = -68386.438
Iteration 4:   log likelihood = -68385.822
Iteration 5:   log likelihood = -68385.821
Refining estimates:
Iteration 0:   log likelihood = -68385.821

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =       14,193
Time at risk    =   76402730.5
                                                LR chi2(27)      =    12725.70
Log likelihood  =   -68385.821                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7927042   .0168941   -10.90   0.000     .7602743    .8265174
      1.male |   1.188258   .0217371     9.43   0.000     1.146409    1.231635
        age1 |   1.045377   .0067407     6.88   0.000     1.032249    1.058673
        age2 |   1.050244   .0097283     5.29   0.000     1.031348    1.069485
        age3 |   .8238787   .0402156    -3.97   0.000     .7487106    .9065934
             |
         imd |
          2  |   1.006919    .030597     0.23   0.821     .9487003    1.068709
          3  |    1.06562   .0328471     2.06   0.039     1.003147    1.131984
          4  |    1.13133   .0363541     3.84   0.000     1.062275    1.204875
5 most de..  |   1.304064   .0440244     7.86   0.000      1.22057    1.393269
             |
   obese4cat |
Obese I ..)  |   .7753253   .0193906   -10.17   0.000     .7382368     .814277
Obese II..)  |   .9058837   .0338717    -2.64   0.008     .8418706    .9747641
Obese II..)  |   1.170169   .0589839     3.12   0.002      1.06009    1.291679
             |
smoke_nomiss |
     Former  |    1.22605   .0237157    10.54   0.000     1.180438    1.273424
    Current  |   1.998816   .0757265    18.28   0.000     1.855771    2.152886
             |
     diabcat |
Controlle..  |   1.186867   .0245091     8.30   0.000     1.139789     1.23589
Uncontrol..  |   1.424979   .0421036    11.99   0.000     1.344802    1.509937
Diabetes,..  |   1.137973   .1574122     0.93   0.350     .8677364    1.492368
             |
1.myocardi~t |   1.154496   .0277364     5.98   0.000     1.101394    1.210159
       1.pad |   1.441284   .0419757    12.55   0.000     1.361317    1.525949
1.hyperten~n |   1.104305   .0229678     4.77   0.000     1.060194    1.150251
1.heart_f~re |   1.666697   .0296503    28.72   0.000     1.609585    1.725836
1.stroke_tia |   1.208001   .0227273    10.04   0.000     1.164268    1.253377
       1.vte |   1.277659   .0354526     8.83   0.000     1.210029    1.349069
 1.oestrogen |   1.283333   .1570728     2.04   0.042     1.009618    1.631255
1.flu_vac~ne |   .7724358    .016636   -11.99   0.000     .7405084    .8057398
1.antiplat~t |   1.092399   .0370525     2.61   0.009     1.022138    1.167488
1.care_ho~ce |   3.192757   .0902972    41.05   0.000     3.020593    3.374733
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -74748.67
Iteration 1:   log likelihood = -68320.082
Iteration 2:   log likelihood = -66957.775
Iteration 3:   log likelihood = -66934.782
Iteration 4:   log likelihood = -66934.253
Iteration 5:   log likelihood = -66934.252
Refining estimates:
Iteration 0:   log likelihood = -66934.252

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      372,709                  Number of obs    =     372,709
No. of failures =       14,193
Time at risk    =   76402730.5
                                                LR chi2(34)      =    15628.84
Log likelihood  =   -66934.252                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .879547   .0188647    -5.98   0.000     .8433392    .9173093
      1.male |    1.18095    .021597     9.09   0.000      1.13937    1.224047
        age1 |   1.043245   .0066911     6.60   0.000     1.030213    1.056442
        age2 |   1.036156   .0095674     3.85   0.000     1.017573    1.055078
        age3 |   .9073307   .0442517    -1.99   0.046     .8246153    .9983431
             |
         imd |
          2  |   1.003316   .0305425     0.11   0.913     .9452042       1.065
          3  |   1.050962   .0324477     1.61   0.107     .9892515    1.116522
          4  |   1.103192   .0355062     3.05   0.002      1.03575    1.175025
5 most de..  |   1.245488   .0422285     6.47   0.000     1.165412    1.331066
             |
   obese4cat |
Obese I ..)  |   .7875798   .0197362    -9.53   0.000     .7498321    .8272277
Obese II..)  |   .9126547   .0341745    -2.44   0.015     .8480727    .9821546
Obese II..)  |   1.157395   .0584393     2.89   0.004     1.048341    1.277793
             |
smoke_nomiss |
     Former  |   1.138062   .0224206     6.56   0.000     1.094956    1.182865
    Current  |   1.763344   .0685149    14.60   0.000     1.634043    1.902876
             |
     diabcat |
Controlle..  |    1.15558   .0239465     6.98   0.000     1.109586    1.203481
Uncontrol..  |   1.357424   .0403144    10.29   0.000     1.280665    1.438784
Diabetes,..  |   1.130641   .1563717     0.89   0.375      .862185    1.482685
             |
1.myocardi~t |    1.11597   .0268393     4.56   0.000     1.064587    1.169834
       1.pad |   1.367272   .0399306    10.71   0.000     1.291207    1.447817
1.hyperten~n |   1.103096    .023012     4.70   0.000     1.058903    1.149133
1.heart_f~re |   1.530682    .027713    23.51   0.000     1.477318    1.585973
1.stroke_tia |   1.160209   .0218885     7.88   0.000     1.118092    1.203912
       1.vte |   1.152746   .0321357     5.10   0.000     1.091451    1.217484
 1.oestrogen |   1.037229   .1274912     0.30   0.766     .8151713    1.319776
1.flu_vac~ne |   .7620294    .016501   -12.55   0.000     .7303646    .7950669
             |
         ckd |
        CKD  |   1.121701   .0207463     6.21   0.000     1.081767    1.163109
      1.copd |    1.32443   .0319605    11.64   0.000     1.263247    1.388576
1.other_re~y |   1.436581   .0421091    12.36   0.000     1.356374     1.52153
1.immunode~y |    1.60686   .1432686     5.32   0.000     1.349225     1.91369
    1.cancer |   1.600217   .0306588    24.54   0.000     1.541241    1.661449
1.ae_atten~r |   2.080606    .037918    40.20   0.000       2.0076    2.156267
1.gp_consult |   .7719877   .0393766    -5.07   0.000     .6985433    .8531539
1.antiplat~t |   1.007122   .0342394     0.21   0.835     .9422007    1.076516
1.care_ho~ce |   3.004316   .0860269    38.42   0.000     2.840351    3.177747
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table2_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8099023   .0166407   -10.26   0.000     .7779351    .8431831
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7583348   .0156359   -13.42   0.000     .7282998    .7896083
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7927042   .0168941   -10.90   0.000     .7602743    .8265174
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .879547   .0188647    -5.98   0.000     .8433392    .9173093
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 22:00:15
-------------------------------------------------------------------------------
