-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_onsnoncoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 22:00:30

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(96,626 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   200,094      7,800 |   207,894 
             |     96.25       3.75 |    100.00 
-------------+----------------------+----------
warfarin use |    66,087      2,107 |    68,194 
             |     96.91       3.09 |    100.00 
-------------+----------------------+----------
       Total |   266,181      9,907 |   276,088 
             |     96.41       3.59 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -123861.94
Iteration 1:   log likelihood = -123827.09
Iteration 2:   log likelihood =    -123827
Iteration 3:   log likelihood =    -123827
Refining estimates:
Iteration 0:   log likelihood =    -123827

Cox regression -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        9,907
Time at risk    =     56672291
                                                LR chi2(1)       =       69.87
Log likelihood  =      -123827                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8175875   .0200736    -8.20   0.000     .7791755    .8578931
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_univar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_univa
> r_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -123861.94
Iteration 1:   log likelihood = -122280.13
Iteration 2:   log likelihood = -120805.37
Iteration 3:   log likelihood =  -120754.8
Iteration 4:   log likelihood = -120754.62
Iteration 5:   log likelihood = -120754.62
Refining estimates:
Iteration 0:   log likelihood = -120754.62

Cox regression -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        9,907
Time at risk    =     56672291
                                                LR chi2(5)       =     6214.63
Log likelihood  =   -120754.62                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7593632   .0187117   -11.17   0.000     .7235606    .7969374
      1.male |   1.208243   .0248898     9.18   0.000     1.160432    1.258024
        age1 |   1.033485    .007573     4.49   0.000     1.018748    1.048435
        age2 |   1.068581   .0113499     6.25   0.000     1.046566     1.09106
        age3 |   .8006821   .0452015    -3.94   0.000     .7168142    .8943627
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -49435.973
Iteration 1:   log likelihood = -45763.431
Iteration 2:   log likelihood = -44976.651
Iteration 3:   log likelihood = -44959.056
Iteration 4:   log likelihood = -44958.599
Iteration 5:   log likelihood = -44958.599
Refining estimates:
Iteration 0:   log likelihood = -44958.599

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        9,907
Time at risk    =     56672291
                                                LR chi2(31)      =     8954.75
Log likelihood  =   -44958.599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7974666   .0203709    -8.86   0.000     .7585234    .8384093
      1.male |   1.184856   .0259923     7.73   0.000     1.134991    1.236911
        age1 |   1.044434   .0079032     5.75   0.000     1.029058    1.060039
        age2 |   1.053107   .0115038     4.74   0.000       1.0308    1.075897
        age3 |   .8058266   .0466923    -3.73   0.000     .7193167    .9027409
             |
         imd |
          2  |    1.04562   .0390116     1.20   0.232      .971887    1.124946
          3  |   1.083365   .0410532     2.11   0.035     1.005817    1.166891
          4  |   1.122403   .0442622     2.93   0.003     1.038919    1.212596
5 most de..  |   1.322888   .0540334     6.85   0.000     1.221112    1.433146
             |
   obese4cat |
Obese I ..)  |   .7617965   .0227139    -9.13   0.000     .7185538    .8076415
Obese II..)  |   .9139313   .0400916    -2.05   0.040     .8386364    .9959864
Obese II..)  |   1.167137   .0697136     2.59   0.010     1.038196    1.312093
             |
smoke_nomiss |
     Former  |     1.2319   .0288701     8.90   0.000     1.176596    1.289804
    Current  |   2.024003   .0911009    15.66   0.000     1.853098     2.21067
             |
     diabcat |
Controlle..  |   1.214685   .0298019     7.93   0.000     1.157656    1.274523
Uncontrol..  |   1.449912    .050615    10.64   0.000     1.354026    1.552588
Diabetes,..  |   1.236991   .1993712     1.32   0.187     .9019338    1.696517
             |
1.myocardi~t |   1.167741    .033116     5.47   0.000     1.104606    1.234485
       1.pad |   1.457979   .0504729    10.89   0.000     1.362336    1.560338
1.hyperten~n |   1.139808   .0291513     5.12   0.000     1.084081      1.1984
1.heart_f~re |   1.687215   .0359898    24.52   0.000     1.618131    1.759249
1.stroke_tia |   1.241044    .027925     9.60   0.000     1.187502    1.297001
       1.vte |    1.30045   .0428652     7.97   0.000     1.219092    1.387237
 1.oestrogen |   1.109022   .1765219     0.65   0.516     .8118112    1.515043
1.flu_vac~ne |   .7545361   .0196942   -10.79   0.000     .7169068    .7941405
1.antiplat~t |   1.093135   .0441053     2.21   0.027      1.01002     1.18309
1.care_ho~ce |   3.086034   .1061119    32.77   0.000     2.884911    3.301177
             |
   ethnicity |
      Mixed  |   .8907168   .2095185    -0.49   0.623     .5617152    1.412418
Asian or ..  |   1.013468   .1004673     0.13   0.893     .8345044    1.230811
      Black  |   .9525995    .141105    -0.33   0.743     .7125658     1.27349
      Other  |   .8099778   .1529504    -1.12   0.264     .5594204    1.172757
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -49435.973
Iteration 1:   log likelihood = -45763.972
Iteration 2:   log likelihood =  -44977.49
Iteration 3:   log likelihood = -44959.902
Iteration 4:   log likelihood = -44959.445
Iteration 5:   log likelihood = -44959.445
Refining estimates:
Iteration 0:   log likelihood = -44959.445

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        9,907
Time at risk    =     56672291
                                                LR chi2(27)      =     8953.06
Log likelihood  =   -44959.445                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7974838   .0203667    -8.86   0.000     .7585483    .8384178
      1.male |   1.184786   .0259891     7.73   0.000     1.134928    1.236835
        age1 |   1.044548   .0079025     5.76   0.000     1.029173    1.060152
        age2 |   1.052991   .0115002     4.73   0.000      1.03069    1.075774
        age3 |   .8062155   .0467056    -3.72   0.000       .71968    .9031561
             |
         imd |
          2  |   1.045792    .039017     1.20   0.230     .9720493     1.12513
          3  |   1.083553   .0410589     2.12   0.034     1.005995    1.167091
          4  |    1.12255   .0442643     2.93   0.003     1.039061    1.212747
5 most de..  |   1.322549   .0540052     6.85   0.000     1.220826    1.432748
             |
   obese4cat |
Obese I ..)  |   .7617162    .022709    -9.13   0.000     .7184827    .8075511
Obese II..)  |   .9140211   .0400894    -2.05   0.040     .8387299     .996071
Obese II..)  |    1.16708   .0696942     2.59   0.010     1.038173    1.311993
             |
smoke_nomiss |
     Former  |   1.232068    .028803     8.93   0.000     1.176889    1.289834
    Current  |   2.024451   .0910007    15.69   0.000     1.853724    2.210902
             |
     diabcat |
Controlle..  |   1.214298   .0297645     7.92   0.000      1.15734    1.274059
Uncontrol..  |   1.449429   .0505356    10.65   0.000     1.353689    1.551939
Diabetes,..  |   1.237248   .1993976     1.32   0.187     .9021431     1.69683
             |
1.myocardi~t |   1.167811   .0331076     5.47   0.000     1.104691    1.234537
       1.pad |   1.458146   .0504709    10.90   0.000     1.362506      1.5605
1.hyperten~n |   1.139614   .0291424     5.11   0.000     1.083904    1.198188
1.heart_f~re |    1.68737     .03599    24.53   0.000     1.618285    1.759405
1.stroke_tia |   1.240939   .0279215     9.59   0.000     1.187402    1.296888
       1.vte |   1.300688   .0428691     7.98   0.000     1.219322    1.387483
 1.oestrogen |   1.108566   .1764491     0.65   0.517     .8114778     1.51442
1.flu_vac~ne |   .7547401   .0196985   -10.78   0.000     .7171025     .794353
1.antiplat~t |   1.092862   .0440912     2.20   0.028     1.009773    1.182788
1.care_ho~ce |   3.085629    .106064    32.78   0.000     2.884595    3.300673
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -49435.973
Iteration 1:   log likelihood = -48744.417
Iteration 2:   log likelihood = -44041.835
Iteration 3:   log likelihood = -43956.792
Iteration 4:   log likelihood = -43956.697
Iteration 5:   log likelihood = -43956.697
Refining estimates:
Iteration 0:   log likelihood = -43956.697

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        9,907
Time at risk    =     56672291
                                                LR chi2(38)      =    10958.55
Log likelihood  =   -43956.697                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8886879   .0228653    -4.59   0.000      .844984    .9346523
      1.male |   1.180806   .0259073     7.57   0.000     1.131105    1.232691
        age1 |   1.041736   .0078356     5.44   0.000     1.026491    1.057207
        age2 |   1.039352   .0113141     3.55   0.000     1.017411    1.061765
        age3 |   .8884179   .0514408    -2.04   0.041     .7931063    .9951837
             |
         imd |
          2  |   1.041354   .0389344     1.08   0.278     .9677731     1.12053
          3  |   1.072943   .0407449     1.85   0.064     .9959838    1.155848
          4  |   1.098479   .0434221     2.38   0.017     1.016587    1.186968
5 most de..  |   1.260954   .0517515     5.65   0.000     1.163495    1.366576
             |
   obese4cat |
Obese I ..)  |   .7756707    .023178    -8.50   0.000     .7315473    .8224555
Obese II..)  |   .9227023   .0405601    -1.83   0.067     .8465342    1.005724
Obese II..)  |    1.15101   .0688804     2.35   0.019     1.023624    1.294249
             |
smoke_nomiss |
     Former  |   1.138723    .027203     5.44   0.000     1.086635    1.193308
    Current  |    1.76424   .0815722    12.28   0.000     1.611392    1.931587
             |
     diabcat |
Controlle..  |   1.182552   .0291326     6.81   0.000      1.12681    1.241052
Uncontrol..  |   1.385206   .0486158     9.28   0.000     1.293124    1.483845
Diabetes,..  |   1.238152   .1994854     1.33   0.185     .9028848    1.697914
             |
1.myocardi~t |   1.129111    .032059     4.28   0.000     1.067993    1.193727
       1.pad |   1.384944   .0480708     9.38   0.000     1.293861     1.48244
1.hyperten~n |   1.140183   .0292531     5.11   0.000     1.084266    1.198984
1.heart_f~re |   1.548001    .033636    20.11   0.000      1.48346     1.61535
1.stroke_tia |   1.190299   .0268705     7.72   0.000     1.138782    1.244147
       1.vte |   1.172633   .0388564     4.81   0.000     1.098896    1.251317
 1.oestrogen |   .8992903    .143684    -0.66   0.506     .6575054    1.229987
1.flu_vac~ne |   .7439802   .0195375   -11.26   0.000     .7066562    .7832755
             |
         ckd |
        CKD  |   1.127595   .0250854     5.40   0.000     1.079485    1.177849
      1.copd |   1.338754   .0381602    10.23   0.000     1.266012    1.415675
1.other_re~y |   1.423025   .0495473    10.13   0.000     1.329154    1.523526
1.immunode~y |    1.41759   .1582138     3.13   0.002     1.139069    1.764214
    1.cancer |   1.610981   .0371531    20.68   0.000     1.539783     1.68547
1.ae_atten~r |   2.070224   .0453698    33.20   0.000     1.983183    2.161084
1.gp_consult |   .7999994   .0502805    -3.55   0.000     .7072794    .9048743
1.antiplat~t |   1.010381   .0408768     0.26   0.799     .9333583     1.09376
1.care_ho~ce |   2.915166   .1015237    30.72   0.000     2.722822    3.121097
             |
   ethnicity |
      Mixed  |   .9096389   .2143083    -0.40   0.688     .5732294    1.443476
Asian or ..  |   1.037429   .1034228     0.37   0.712     .8532986    1.261293
      Black  |   .9746898   .1443704    -0.17   0.863     .7290998    1.303004
      Other  |   .8297677    .157275    -0.98   0.325     .5722936    1.203079
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -49435.973
Iteration 1:   log likelihood = -48744.434
Iteration 2:   log likelihood = -44042.519
Iteration 3:   log likelihood = -43957.489
Iteration 4:   log likelihood = -43957.393
Iteration 5:   log likelihood = -43957.393
Refining estimates:
Iteration 0:   log likelihood = -43957.393

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        9,907
Time at risk    =     56672291
                                                LR chi2(34)      =    10957.16
Log likelihood  =   -43957.393                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8885853   .0228579    -4.59   0.000     .8448954    .9345345
      1.male |   1.180796    .025904     7.58   0.000     1.131101    1.232674
        age1 |   1.041801   .0078341     5.45   0.000     1.026559     1.05727
        age2 |   1.039286   .0113109     3.54   0.000     1.017351    1.061693
        age3 |   .8886319   .0514424    -2.04   0.041     .7933162    .9953997
             |
         imd |
          2  |   1.041505   .0389392     1.09   0.277     .9679147     1.12069
          3  |   1.073006   .0407459     1.86   0.064     .9960452    1.155914
          4  |   1.098581   .0434229     2.38   0.017     1.016687    1.187072
5 most de..  |   1.260654   .0517261     5.65   0.000     1.163242    1.366223
             |
   obese4cat |
Obese I ..)  |    .775489   .0231709    -8.51   0.000      .731379    .8222594
Obese II..)  |   .9225643   .0405495    -1.83   0.067     .8464158    1.005564
Obese II..)  |    1.15052   .0688397     2.34   0.019     1.023208    1.293673
             |
smoke_nomiss |
     Former  |   1.138362   .0271329     5.44   0.000     1.086406    1.192804
    Current  |   1.763316   .0814296    12.28   0.000     1.610727    1.930361
             |
     diabcat |
Controlle..  |    1.18257   .0291056     6.81   0.000     1.126878    1.241015
Uncontrol..  |   1.385536   .0485665     9.30   0.000     1.293544    1.484071
Diabetes,..  |   1.239209    .199641     1.33   0.183     .9036763    1.699324
             |
1.myocardi~t |    1.12933   .0320573     4.28   0.000     1.068215    1.193942
       1.pad |   1.384772   .0480597     9.38   0.000     1.293709    1.482245
1.hyperten~n |    1.14022   .0292502     5.12   0.000     1.084308    1.199015
1.heart_f~re |   1.548262   .0336393    20.12   0.000     1.483714    1.615618
1.stroke_tia |   1.190288   .0268691     7.72   0.000     1.138774    1.244133
       1.vte |   1.172745   .0388583     4.81   0.000     1.099005    1.251434
 1.oestrogen |   .8990645   .1436438    -0.67   0.505     .6573461    1.229667
1.flu_vac~ne |   .7441978   .0195416   -11.25   0.000     .7068658    .7835013
             |
         ckd |
        CKD  |   1.127479   .0250806     5.39   0.000     1.079378    1.177723
      1.copd |   1.338935    .038161    10.24   0.000     1.266192    1.415858
1.other_re~y |   1.423012   .0495447    10.13   0.000     1.329145    1.523508
1.immunode~y |   1.418045   .1582417     3.13   0.002     1.139471    1.764724
    1.cancer |    1.61095   .0371399    20.68   0.000     1.539777    1.685413
1.ae_atten~r |   2.070244    .045367    33.21   0.000     1.983209    2.161099
1.gp_consult |   .7998806   .0502735    -3.55   0.000     .7071737    .9047409
1.antiplat~t |   1.010134   .0408639     0.25   0.803     .9331353    1.093487
1.care_ho~ce |    2.91415   .1014548    30.72   0.000     2.721935    3.119939
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table3_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    207,894    4.26e+07           0   4.26e+07   4.26e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,194    1.41e+07           0   1.41e+07   1.41e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8175875   .0200736    -8.20   0.000     .7791755    .8578931
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7593632   .0187117   -11.17   0.000     .7235606    .7969374
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7974666   .0203709    -8.86   0.000     .7585234    .8384093
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7974838   .0203667    -8.86   0.000     .7585483    .8384178
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8886879   .0228653    -4.59   0.000      .844984    .9346523
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8885853   .0228579    -4.59   0.000     .8448954    .9345345
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_onsnoncoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 22:03:22
-------------------------------------------------------------------------------
