-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:55:24

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(96,626 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   206,549      1,345 |   207,894 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    67,876        318 |    68,194 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   274,425      1,663 |   276,088 
             |     99.40       0.60 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20805.804
Iteration 1:   log likelihood = -20790.648
Iteration 2:   log likelihood = -20790.543
Iteration 3:   log likelihood = -20790.543
Refining estimates:
Iteration 0:   log likelihood = -20790.543

Cox regression -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        1,663
Time at risk    =     56672291
                                                LR chi2(1)       =       30.52
Log likelihood  =   -20790.543                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7166297   .0446855    -5.34   0.000     .6341881    .8097883
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_u
> nivar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_univar_e
> thn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20805.804
Iteration 1:   log likelihood = -20419.957
Iteration 2:   log likelihood = -20259.284
Iteration 3:   log likelihood = -20254.877
Iteration 4:   log likelihood = -20254.869
Refining estimates:
Iteration 0:   log likelihood = -20254.869

Cox regression -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        1,663
Time at risk    =     56672291
                                                LR chi2(5)       =     1101.87
Log likelihood  =   -20254.869                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6497427   .0406404    -6.89   0.000      .574778    .7344847
      1.male |   1.493388   .0759429     7.89   0.000      1.35172    1.649904
        age1 |   1.043188    .020957     2.10   0.035     1.002911    1.085082
        age2 |   1.084367   .0306157     2.87   0.004     1.025991    1.146064
        age3 |   .6657799   .0977955    -2.77   0.006     .4992279    .8878969
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8133.9766
Iteration 1:   log likelihood = -7419.4951
Iteration 2:   log likelihood =  -7142.636
Iteration 3:   log likelihood = -7140.1097
Iteration 4:   log likelihood =  -7140.024
Iteration 5:   log likelihood = -7140.0238
Refining estimates:
Iteration 0:   log likelihood = -7140.0238

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        1,663
Time at risk    =     56672291
                                                LR chi2(31)      =     1987.91
Log likelihood  =   -7140.0238                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7333627    .047913    -4.75   0.000     .6452188    .8335481
      1.male |   1.545898   .0845865     7.96   0.000     1.388692      1.7209
        age1 |   1.053763   .0218177     2.53   0.011     1.011857    1.097405
        age2 |   1.071522   .0310837     2.38   0.017     1.012299    1.134211
        age3 |   .6321888   .0951715    -3.05   0.002      .470657    .8491591
             |
         imd |
          2  |   1.009063   .0978459     0.09   0.926     .8344106    1.220273
          3  |   1.224135   .1178918     2.10   0.036     1.013569    1.478446
          4  |   1.202807   .1213963     1.83   0.067     .9869296    1.465904
5 most de..  |   1.382476   .1408468     3.18   0.001     1.132236    1.688022
             |
   obese4cat |
Obese I ..)  |   1.004287   .0687348     0.06   0.950     .8782143    1.148459
Obese II..)  |   1.346229   .1308677     3.06   0.002     1.112687    1.628789
Obese II..)  |   1.202566   .1890579     1.17   0.241     .8836693    1.636546
             |
smoke_nomiss |
     Former  |   1.416789   .0832166     5.93   0.000     1.262726     1.58965
    Current  |   1.364718   .1801953     2.35   0.019     1.053541    1.767805
             |
     diabcat |
Controlle..  |   1.240423   .0736425     3.63   0.000     1.104167    1.393492
Uncontrol..  |   1.354622   .1173678     3.50   0.000     1.143057    1.605345
Diabetes,..  |   .7329042   .3351844    -0.68   0.497     .2990619    1.796112
             |
1.myocardi~t |   1.338302   .0895395     4.36   0.000     1.173827    1.525822
       1.pad |     1.5972    .131436     5.69   0.000     1.359291    1.876748
1.hyperten~n |   1.012015   .0624569     0.19   0.847     .8967155     1.14214
1.heart_f~re |   1.421755   .0753183     6.64   0.000     1.281539    1.577313
1.stroke_tia |   1.253041   .0685536     4.12   0.000     1.125631    1.394872
       1.vte |   1.335419   .1063019     3.63   0.000     1.142511    1.560899
 1.oestrogen |   .3540298   .2528925    -1.45   0.146     .0872981    1.435737
1.flu_vac~ne |   .7396471    .047283    -4.72   0.000     .6525448     .838376
1.antiplat~t |   .9370923   .0955047    -0.64   0.524     .7674168    1.144283
1.care_ho~ce |   6.792017   .4868094    26.73   0.000     5.901874    7.816414
             |
   ethnicity |
      Mixed  |   1.208427   .5172598     0.44   0.658     .5222383    2.796224
Asian or ..  |    1.38925    .265573     1.72   0.085     .9551293    2.020684
      Black  |   1.134132   .3102365     0.46   0.645     .6634702    1.938678
      Other  |   1.324369   .4206652     0.88   0.376     .7106206    2.468197
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8133.9766
Iteration 1:   log likelihood = -7420.8195
Iteration 2:   log likelihood = -7144.3818
Iteration 3:   log likelihood = -7141.8643
Iteration 4:   log likelihood = -7141.7788
Iteration 5:   log likelihood = -7141.7786
Refining estimates:
Iteration 0:   log likelihood = -7141.7786

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        1,663
Time at risk    =     56672291
                                                LR chi2(27)      =     1984.40
Log likelihood  =   -7141.7786                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |     .73164   .0477793    -4.78   0.000     .6437396     .831543
      1.male |   1.545062   .0845282     7.95   0.000     1.387963    1.719942
        age1 |   1.053124   .0217989     2.50   0.012     1.011254    1.096727
        age2 |   1.072252   .0310962     2.41   0.016     1.013005    1.134965
        age3 |   .6298403    .094789    -3.07   0.002     .4689508    .8459285
             |
         imd |
          2  |   1.008641   .0978034     0.09   0.929      .834064    1.219758
          3  |   1.224188   .1178883     2.10   0.036     1.013627    1.478489
          4  |   1.203893   .1214699     1.84   0.066     .9878785    1.467142
5 most de..  |    1.38463   .1410295     3.20   0.001     1.134059    1.690564
             |
   obese4cat |
Obese I ..)  |   1.002899   .0686344     0.04   0.966     .8770095    1.146859
Obese II..)  |   1.341949   .1304226     3.03   0.002     1.109197    1.623542
Obese II..)  |    1.19376   .1876125     1.13   0.260     .8772863    1.624399
             |
smoke_nomiss |
     Former  |   1.404777   .0821611     5.81   0.000     1.252632    1.575403
    Current  |   1.352669   .1784554     2.29   0.022     1.044465    1.751819
             |
     diabcat |
Controlle..  |   1.247991   .0739137     3.74   0.000     1.111215    1.401603
Uncontrol..  |   1.370086   .1182808     3.65   0.000     1.156813     1.62268
Diabetes,..  |   .7356058   .3364062    -0.67   0.502     .3001752    1.802667
             |
1.myocardi~t |   1.344569   .0898597     4.43   0.000     1.179495    1.532747
       1.pad |   1.593402   .1310816     5.66   0.000     1.356129    1.872189
1.hyperten~n |   1.012349   .0624604     0.20   0.842     .8970408    1.142478
1.heart_f~re |   1.423276   .0753751     6.66   0.000     1.282952    1.578948
1.stroke_tia |   1.253955   .0686041     4.14   0.000     1.126452     1.39589
       1.vte |   1.332132   .1060232     3.60   0.000     1.139727    1.557018
 1.oestrogen |   .3526162     .25187    -1.46   0.144     .0869557    1.429902
1.flu_vac~ne |   .7404778   .0473199    -4.70   0.000     .6533056    .8392815
1.antiplat~t |   .9401657      .0958    -0.61   0.545     .7699625    1.147993
1.care_ho~ce |   6.773304     .48542    26.69   0.000     5.885695     7.79477
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8133.9766
Iteration 1:   log likelihood = -7287.4988
Iteration 2:   log likelihood =  -6986.223
Iteration 3:   log likelihood = -6983.6633
Iteration 4:   log likelihood =  -6983.585
Iteration 5:   log likelihood = -6983.5849
Refining estimates:
Iteration 0:   log likelihood = -6983.5849

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        1,663
Time at risk    =     56672291
                                                LR chi2(38)      =     2300.78
Log likelihood  =   -6983.5849                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8115857   .0533631    -3.18   0.001     .7134548    .9232138
      1.male |   1.579608   .0865288     8.35   0.000     1.418801     1.75864
        age1 |   1.054449   .0218091     2.56   0.010     1.012559    1.098072
        age2 |   1.052736   .0305239     1.77   0.076     .9945779    1.114294
        age3 |   .7041969    .106114    -2.33   0.020     .5241171    .9461498
             |
         imd |
          2  |   1.007885   .0980199     0.08   0.936     .8329693    1.219531
          3  |   1.206554   .1164601     1.95   0.052      .998588    1.457831
          4  |   1.156506   .1172197     1.43   0.151     .9481408    1.410662
5 most de..  |   1.302123    .133206     2.58   0.010     1.065553    1.591216
             |
   obese4cat |
Obese I ..)  |   1.013206   .0696604     0.19   0.849     .8854735    1.159365
Obese II..)  |   1.351705    .131788     3.09   0.002     1.116585    1.636334
Obese II..)  |   1.159788   .1832072     0.94   0.348     .8509763    1.580664
             |
smoke_nomiss |
     Former  |   1.313118   .0786124     4.55   0.000     1.167736    1.476599
    Current  |    1.19594   .1611742     1.33   0.184     .9183221    1.557486
             |
     diabcat |
Controlle..  |   1.207283   .0721303     3.15   0.002     1.073874    1.357266
Uncontrol..  |   1.238447   .1084252     2.44   0.015     1.043171    1.470278
Diabetes,..  |   .7423569   .3394357    -0.65   0.515     .3029764    1.818933
             |
1.myocardi~t |   1.274379   .0853478     3.62   0.000     1.117614    1.453132
       1.pad |   1.494828    .123484     4.87   0.000      1.27138    1.757546
1.hyperten~n |   .9870724   .0612919    -0.21   0.834     .8739649    1.114818
1.heart_f~re |   1.263797   .0681617     4.34   0.000     1.137022    1.404709
1.stroke_tia |    1.19763   .0657208     3.29   0.001     1.075504    1.333622
       1.vte |   1.232545   .0985796     2.61   0.009     1.053715    1.441724
 1.oestrogen |   .3563925   .2548553    -1.44   0.149     .0877479    1.447506
1.flu_vac~ne |   .7359379   .0473676    -4.76   0.000     .6487163    .8348866
             |
         ckd |
        CKD  |   1.336971   .0730628     5.31   0.000     1.201173    1.488122
      1.copd |    1.32851   .0920226     4.10   0.000     1.159856    1.521687
1.other_re~y |   1.445266   .1200577     4.43   0.000     1.228114    1.700814
1.immunode~y |   1.746757   .4686278     2.08   0.038     1.032448    2.955267
    1.cancer |    .994159   .0634173    -0.09   0.927     .8773195    1.126559
1.ae_atten~r |   2.173181   .1177414    14.33   0.000     1.954242    2.416648
1.gp_consult |   .7529471    .103934    -2.06   0.040     .5744706    .9868727
1.antiplat~t |     .85884   .0877667    -1.49   0.136     .7029529    1.049297
1.care_ho~ce |   6.290181   .4594584    25.18   0.000     5.451151    7.258354
             |
   ethnicity |
      Mixed  |   1.201908   .5130697     0.43   0.667     .5206082    2.774799
Asian or ..  |    1.37243   .2639464     1.65   0.100     .9414276    2.000754
      Black  |   1.109985   .3056038     0.38   0.705     .6470863    1.904022
      Other  |   1.273282    .408115     0.75   0.451     .6793529    2.386456
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8133.9766
Iteration 1:   log likelihood = -7288.7178
Iteration 2:   log likelihood = -6987.7601
Iteration 3:   log likelihood =  -6985.216
Iteration 4:   log likelihood = -6985.1382
Iteration 5:   log likelihood = -6985.1381
Refining estimates:
Iteration 0:   log likelihood = -6985.1381

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      276,084                  Number of obs    =     276,084
No. of failures =        1,663
Time at risk    =     56672291
                                                LR chi2(34)      =     2297.68
Log likelihood  =   -6985.1381                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8098926   .0532286    -3.21   0.001     .7120063    .9212362
      1.male |   1.579242   .0864898     8.34   0.000     1.418506    1.758191
        age1 |   1.053915   .0218015     2.54   0.011      1.01204    1.097523
        age2 |   1.053245   .0305437     1.79   0.074     .9950502    1.114844
        age3 |   .7024147   .1058541    -2.34   0.019      .522778    .9437782
             |
         imd |
          2  |   1.007226   .0979539     0.07   0.941     .8324282     1.21873
          3  |   1.206216    .116416     1.94   0.052     .9983269    1.457396
          4  |   1.156977   .1172339     1.44   0.150     .9485809    1.411156
5 most de..  |   1.303204   .1332866     2.59   0.010     1.066485    1.592465
             |
   obese4cat |
Obese I ..)  |   1.011816   .0695619     0.17   0.864     .8842641    1.157768
Obese II..)  |   1.347529   .1313487     3.06   0.002     1.113188    1.631203
Obese II..)  |   1.152253   .1819512     0.90   0.369     .8455422    1.570219
             |
smoke_nomiss |
     Former  |     1.3028   .0776967     4.44   0.000     1.159081     1.46434
    Current  |   1.186303   .1597595     1.27   0.205     .9110967    1.544639
             |
     diabcat |
Controlle..  |   1.213475   .0723543     3.25   0.001     1.079636    1.363905
Uncontrol..  |   1.252408   .1092097     2.58   0.010     1.055653    1.485834
Diabetes,..  |   .7435568   .3399993    -0.65   0.517     .3034542    1.821945
             |
1.myocardi~t |   1.279712    .085623     3.69   0.000     1.122432    1.459031
       1.pad |    1.49222   .1232113     4.85   0.000     1.269257    1.754348
1.hyperten~n |   .9875351   .0613025    -0.20   0.840     .8744059    1.115301
1.heart_f~re |   1.265362   .0682149     4.37   0.000     1.138484    1.406379
1.stroke_tia |    1.19879   .0657767     3.30   0.001      1.07656    1.334897
       1.vte |   1.229929   .0983516     2.59   0.010      1.05151    1.438622
 1.oestrogen |   .3551566   .2539591    -1.45   0.148     .0874496    1.442388
1.flu_vac~ne |   .7370007   .0474187    -4.74   0.000      .649683     .836054
             |
         ckd |
        CKD  |   1.337889   .0731048     5.33   0.000     1.202012    1.489126
      1.copd |   1.327719    .091967     4.09   0.000     1.159167    1.520779
1.other_re~y |   1.444974    .120029     4.43   0.000     1.227874     1.70046
1.immunode~y |   1.742543   .4675237     2.07   0.038     1.029927    2.948225
    1.cancer |   .9914272   .0632123    -0.14   0.893      .874962    1.123395
1.ae_atten~r |   2.175337   .1178508    14.35   0.000     1.956195     2.41903
1.gp_consult |   .7541477   .1040913    -2.04   0.041     .5753991    .9884247
1.antiplat~t |   .8616359   .0880368    -1.46   0.145     .7052662    1.052675
1.care_ho~ce |   6.272833   .4580406    25.15   0.000     5.436372    7.237994
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table3_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    207,894    4.26e+07           0   4.26e+07   4.26e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,194    1.41e+07           0   1.41e+07   1.41e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7166297   .0446855    -5.34   0.000     .6341881    .8097883
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6497427   .0406404    -6.89   0.000      .574778    .7344847
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7333627    .047913    -4.75   0.000     .6452188    .8335481
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .73164   .0477793    -4.78   0.000     .6437396     .831543
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8115857   .0533631    -3.18   0.001     .7134548    .9232138
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8098926   .0532286    -3.21   0.001     .7120063    .9212362
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 21:58:15
-------------------------------------------------------------------------------
