-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:24:20

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,980 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   204,632      1,343 |   205,975 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    67,247        317 |    67,564 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   271,879      1,660 |   273,539 
             |     99.39       0.61 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.671
Iteration 1:   log likelihood = -20737.396
Iteration 2:   log likelihood =  -20737.29
Iteration 3:   log likelihood =  -20737.29
Refining estimates:
Iteration 0:   log likelihood =  -20737.29

Cox regression -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =        1,660
Time at risk    =     56139516
                                                LR chi2(1)       =       30.76
Log likelihood  =    -20737.29                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7154011   .0446721    -5.36   0.000     .6329912      .80854
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_u
> nivar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_univar_e
> thn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.671
Iteration 1:   log likelihood = -20366.897
Iteration 2:   log likelihood = -20201.672
Iteration 3:   log likelihood = -20197.085
Iteration 4:   log likelihood = -20197.076
Refining estimates:
Iteration 0:   log likelihood = -20197.076

Cox regression -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =        1,660
Time at risk    =     56139516
                                                LR chi2(5)       =     1111.19
Log likelihood  =   -20197.076                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6480313   .0405909    -6.93   0.000     .5731642    .7326775
      1.male |   1.496441   .0761639     7.92   0.000     1.354367    1.653419
        age1 |   1.044165   .0212136     2.13   0.033     1.003404    1.086581
        age2 |   1.083902   .0308626     2.83   0.005      1.02507    1.146112
        age3 |   .6670481   .0985645    -2.74   0.006     .4993232    .8911125
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.7237
Iteration 1:   log likelihood = -7395.1925
Iteration 2:   log likelihood = -7119.4207
Iteration 3:   log likelihood = -7116.8786
Iteration 4:   log likelihood = -7116.7881
Iteration 5:   log likelihood = -7116.7879
Refining estimates:
Iteration 0:   log likelihood = -7116.7879

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =        1,660
Time at risk    =     56139516
                                                LR chi2(31)      =     1993.87
Log likelihood  =   -7116.7879                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7315233   .0478626    -4.78   0.000     .6434801    .8316128
      1.male |   1.550801    .084957     8.01   0.000     1.392917    1.726582
        age1 |   1.054844   .0220791     2.55   0.011     1.012446    1.099018
        age2 |    1.07066    .031318     2.33   0.020     1.011005    1.133836
        age3 |   .6343619   .0960775    -3.01   0.003      .471431    .8536032
             |
         imd |
          2  |   1.001072   .0970257     0.01   0.991     .8278759    1.210501
          3  |   1.192769   .1143418     1.84   0.066     .9884575    1.439311
          4  |   1.183565   .1191819     1.67   0.094     .9715798    1.441803
5 most de..  |   1.351208   .1374291     2.96   0.003     1.107001    1.649288
             |
   obese4cat |
Obese I ..)  |   1.005954   .0687835     0.09   0.931     .8797841    1.150218
Obese II..)  |   1.320455   .1291233     2.84   0.004     1.090152    1.599411
Obese II..)  |   1.213079   .1907043     1.23   0.219     .8914039    1.650836
             |
smoke_nomiss |
     Former  |   1.416258   .0832771     5.92   0.000     1.262092    1.589255
    Current  |   1.370409   .1810656     2.38   0.017     1.057755    1.775479
             |
     diabcat |
Controlle..  |   1.245859   .0739284     3.70   0.000     1.109071    1.399519
Uncontrol..  |   1.332537   .1162617     3.29   0.001     1.123086    1.581048
Diabetes,..  |   .7942977   .3634002    -0.50   0.615      .324003    1.947232
             |
1.myocardi~t |   1.342607   .0898553     4.40   0.000     1.177555    1.530793
       1.pad |   1.604346   .1320243     5.74   0.000     1.365373    1.885145
1.hyperten~n |   1.024203   .0634047     0.39   0.699     .9071758    1.156328
1.heart_f~re |   1.423093   .0754324     6.66   0.000     1.282669    1.578891
1.stroke_tia |   1.251706   .0685446     4.10   0.000     1.124319    1.393526
       1.vte |   1.341012   .1067616     3.69   0.000     1.147271    1.567469
 1.oestrogen |   .3618436   .2586092    -1.42   0.155     .0891596    1.468499
1.flu_vac~ne |   .7354166   .0469781    -4.81   0.000      .648872    .8335043
1.antiplat~t |   .9184122   .0943221    -0.83   0.407     .7509624      1.1232
1.care_ho~ce |   6.762544   .4844323    26.68   0.000     5.876715      7.7819
             |
   ethnicity |
      Mixed  |   1.212297   .5188392     0.45   0.653     .5239758     2.80483
Asian or ..  |   1.398993   .2671758     1.76   0.079     .9621785    2.034116
      Black  |   1.201561   .3292539     0.67   0.503     .7022601     2.05586
      Other  |   1.354741   .4310941     0.95   0.340      .726096    2.527658
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.7237
Iteration 1:   log likelihood = -7396.6142
Iteration 2:   log likelihood = -7121.3455
Iteration 3:   log likelihood = -7118.8131
Iteration 4:   log likelihood =  -7118.723
Iteration 5:   log likelihood = -7118.7228
Refining estimates:
Iteration 0:   log likelihood = -7118.7228

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =        1,660
Time at risk    =     56139516
                                                LR chi2(27)      =     1990.00
Log likelihood  =   -7118.7228                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7296454   .0477182    -4.82   0.000     .6418654    .8294298
      1.male |   1.549786   .0848859     8.00   0.000     1.392032    1.725418
        age1 |   1.054124   .0220591     2.52   0.012     1.011764    1.098258
        age2 |   1.071522   .0313364     2.36   0.018     1.011831    1.134735
        age3 |   .6315576   .0956328    -3.03   0.002      .469376    .8497771
             |
         imd |
          2  |   1.000654   .0969849     0.01   0.995     .8275313    1.209996
          3  |   1.192944   .1143467     1.84   0.066     .9886215    1.439494
          4  |   1.184629   .1192572     1.68   0.092     .9725045    1.443023
5 most de..  |   1.354156   .1376816     2.98   0.003     1.109492    1.652773
             |
   obese4cat |
Obese I ..)  |   1.004817   .0687003     0.07   0.944     .8787986    1.148905
Obese II..)  |   1.316171   .1286766     2.81   0.005     1.086661    1.594156
Obese II..)  |    1.20465   .1893281     1.18   0.236     .8852833    1.639228
             |
smoke_nomiss |
     Former  |   1.403653   .0821796     5.79   0.000     1.251482    1.574327
    Current  |   1.357758   .1792434     2.32   0.021     1.048219    1.758706
             |
     diabcat |
Controlle..  |   1.253975    .074236     3.82   0.000     1.116599    1.408252
Uncontrol..  |   1.348927   .1172528     3.44   0.001     1.137626    1.599475
Diabetes,..  |   .7979945   .3650996    -0.49   0.622     .3255044    1.956333
             |
1.myocardi~t |    1.34906   .0901867     4.48   0.000     1.183388    1.537926
       1.pad |    1.60059   .1316681     5.72   0.000     1.362255    1.880623
1.hyperten~n |   1.024698    .063417     0.39   0.693     .9076458    1.156846
1.heart_f~re |   1.424214   .0754677     6.67   0.000     1.283722    1.580082
1.stroke_tia |   1.252587   .0685956     4.11   0.000     1.125106    1.394512
       1.vte |   1.337616   .1064734     3.65   0.000     1.144396    1.563459
 1.oestrogen |    .360263   .2574649    -1.43   0.153     .0887772    1.461968
1.flu_vac~ne |   .7362014   .0470113    -4.80   0.000     .6495936    .8343562
1.antiplat~t |   .9214929   .0946222    -0.80   0.426     .7535075    1.126929
1.care_ho~ce |   6.742671   .4829642    26.64   0.000      5.85952     7.75893
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.7237
Iteration 1:   log likelihood = -7263.1988
Iteration 2:   log likelihood = -6963.7845
Iteration 3:   log likelihood = -6961.2062
Iteration 4:   log likelihood = -6961.1235
Iteration 5:   log likelihood = -6961.1234
Refining estimates:
Iteration 0:   log likelihood = -6961.1234

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =        1,660
Time at risk    =     56139516
                                                LR chi2(38)      =     2305.20
Log likelihood  =   -6961.1234                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8101064   .0533385    -3.20   0.001     .7120292     .921693
      1.male |   1.581575   .0867259     8.36   0.000     1.420411    1.761025
        age1 |   1.055356    .022055     2.58   0.010     1.013002     1.09948
        age2 |   1.052137    .030748     1.74   0.082     .9935658    1.114162
        age3 |   .7058248   .1069674    -2.30   0.022     .5244424    .9499398
             |
         imd |
          2  |   1.000672   .0972814     0.01   0.994     .8270677    1.210715
          3  |   1.173437   .1127337     1.66   0.096     .9720394    1.416563
          4  |   1.136835    .114983     1.27   0.205     .9324039    1.386087
5 most de..  |   1.273915   .1301233     2.37   0.018     1.042786    1.556274
             |
   obese4cat |
Obese I ..)  |   1.013028   .0695851     0.19   0.851     .8854262    1.159019
Obese II..)  |   1.319905    .129491     2.83   0.005     1.089017    1.599746
Obese II..)  |      1.171   .1849814     1.00   0.318     .8591988    1.595953
             |
smoke_nomiss |
     Former  |   1.314113    .078739     4.56   0.000     1.168504    1.477865
    Current  |   1.203031   .1622158     1.37   0.170     .9236369    1.566939
             |
     diabcat |
Controlle..  |    1.21302   .0724448     3.23   0.001     1.079026    1.363653
Uncontrol..  |   1.220815   .1076003     2.26   0.024     1.027133     1.45102
Diabetes,..  |   .8286242   .3787128    -0.41   0.681     .3383188      2.0295
             |
1.myocardi~t |   1.280022   .0857474     3.69   0.000     1.122526    1.459616
       1.pad |   1.502463   .1241246     4.93   0.000     1.277858    1.766547
1.hyperten~n |   .9997207   .0622706    -0.00   0.996     .8848284    1.129531
1.heart_f~re |   1.263823   .0682153     4.34   0.000     1.136953    1.404851
1.stroke_tia |   1.196862   .0657365     3.27   0.001     1.074713    1.332894
       1.vte |   1.237676   .0990197     2.67   0.008     1.058052    1.447795
 1.oestrogen |   .3649141   .2611057    -1.41   0.159     .0897705    1.483364
1.flu_vac~ne |   .7324333   .0471106    -4.84   0.000     .6456813    .8308409
             |
         ckd |
        CKD  |   1.332715   .0728923     5.25   0.000      1.19724     1.48352
      1.copd |   1.324005   .0919272     4.04   0.000     1.155552    1.517013
1.other_re~y |    1.46004   .1211967     4.56   0.000     1.240816    1.717997
1.immunode~y |   1.741575   .4673922     2.07   0.039     1.029207    2.947012
    1.cancer |   .9906642   .0632925    -0.15   0.883     .8740657    1.122817
1.ae_atten~r |   2.164481   .1173295    14.25   0.000     1.946314    2.407103
1.gp_consult |   .7280073   .0996768    -2.32   0.020      .556662    .9520942
1.antiplat~t |   .8422317   .0867376    -1.67   0.095      .688288    1.030607
1.care_ho~ce |   6.245252   .4560134    25.09   0.000     5.412492     7.20614
             |
   ethnicity |
      Mixed  |   1.206274   .5148636     0.44   0.660     .5225582    2.784563
Asian or ..  |   1.383545   .2659179     1.69   0.091     .9492745    2.016483
      Black  |   1.148196   .3169141     0.50   0.617       .66846    1.972225
      Other  |   1.300028   .4173839     0.82   0.414     .6928958    2.439144
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.7237
Iteration 1:   log likelihood = -7264.4914
Iteration 2:   log likelihood = -6965.4537
Iteration 3:   log likelihood = -6962.8927
Iteration 4:   log likelihood = -6962.8107
Iteration 5:   log likelihood = -6962.8105
Refining estimates:
Iteration 0:   log likelihood = -6962.8105

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =        1,660
Time at risk    =     56139516
                                                LR chi2(34)      =     2301.83
Log likelihood  =   -6962.8105                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8082969   .0531962    -3.23   0.001     .7104787    .9195826
      1.male |   1.581168   .0866827     8.36   0.000     1.420082    1.760526
        age1 |   1.054776   .0220481     2.55   0.011     1.012436    1.098887
        age2 |   1.052713   .0307723     1.76   0.079     .9940958    1.114787
        age3 |   .7037816   .1066759    -2.32   0.020     .5228978    .9472377
             |
         imd |
          2  |   .9999813   .0972139    -0.00   1.000     .8264979    1.209879
          3  |   1.173211    .112699     1.66   0.096     .9718727    1.416259
          4  |     1.1372   .1149892     1.27   0.204     .9327535     1.38646
5 most de..  |   1.275461   .1302464     2.38   0.017     1.044107    1.558079
             |
   obese4cat |
Obese I ..)  |   1.011916   .0695048     0.17   0.863     .8844607    1.157738
Obese II..)  |   1.315616    .129038     2.80   0.005      1.08553    1.594471
Obese II..)  |   1.163813   .1837891     0.96   0.337     .8540072    1.586006
             |
smoke_nomiss |
     Former  |   1.303398   .0777972     4.44   0.000     1.159499    1.465155
    Current  |   1.193031     .16075     1.31   0.190     .9161365    1.553615
             |
     diabcat |
Controlle..  |   1.219622   .0726938     3.33   0.001     1.085152    1.370755
Uncontrol..  |   1.235409   .1084387     2.41   0.016     1.040151    1.467323
Diabetes,..  |   .8308931   .3797728    -0.41   0.685     .3392267    2.035168
             |
1.myocardi~t |    1.28556   .0860346     3.75   0.000     1.127526    1.465744
       1.pad |   1.499885   .1238482     4.91   0.000     1.275771    1.763369
1.hyperten~n |   1.000263   .0622849     0.00   0.997     .8853426    1.130102
1.heart_f~re |   1.265144   .0682535     4.36   0.000     1.138199    1.406247
1.stroke_tia |   1.198019   .0657921     3.29   0.001     1.075767    1.334165
       1.vte |   1.234971   .0987829     2.64   0.008     1.055774    1.444584
 1.oestrogen |   .3634795   .2600655    -1.41   0.157     .0894241    1.477424
1.flu_vac~ne |   .7334869   .0471615    -4.82   0.000     .6466393    .8319986
             |
         ckd |
        CKD  |   1.333759   .0729425     5.27   0.000      1.19819    1.484667
      1.copd |   1.323306    .091877     4.03   0.000     1.154945    1.516209
1.other_re~y |   1.459479   .1211394     4.56   0.000     1.240356    1.717312
1.immunode~y |   1.737477   .4663236     2.06   0.040     1.026749    2.940182
    1.cancer |   .9879513   .0630882    -0.19   0.849     .8717258    1.119673
1.ae_atten~r |   2.166875   .1174503    14.27   0.000     1.948482    2.409745
1.gp_consult |   .7292634    .099843    -2.31   0.021     .5576311    .9537223
1.antiplat~t |   .8450172   .0870109    -1.64   0.102     .6905861    1.033983
1.care_ho~ce |   6.227466   .4545611    25.06   0.000     5.397338    7.185269
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_m
> ultivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onscoviddeath_multivar
> 3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table3_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,975    4.22e+07           0   4.22e+07   4.22e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,564    1.39e+07           0   1.39e+07   1.39e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7154011   .0446721    -5.36   0.000     .6329912      .80854
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6480313   .0405909    -6.93   0.000     .5731642    .7326775
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7315233   .0478626    -4.78   0.000     .6434801    .8316128
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7296454   .0477182    -4.82   0.000     .6418654    .8294298
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8101064   .0533385    -3.20   0.001     .7120292     .921693
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8082969   .0531962    -3.23   0.001     .7104787    .9195826
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:26:52
-------------------------------------------------------------------------------
