-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:25:15

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   268,356     11,100 |   279,456 
             |     96.03       3.97 |    100.00 
-------------+----------------------+----------
warfarin use |    89,094      2,969 |    92,063 
             |     96.78       3.22 |    100.00 
-------------+----------------------+----------
       Total |   357,450     14,069 |   371,519 
             |     96.21       3.79 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -180056.06
Iteration 1:   log likelihood = -179999.44
Iteration 2:   log likelihood = -179999.27
Iteration 3:   log likelihood = -179999.27
Refining estimates:
Iteration 0:   log likelihood = -179999.27

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =       14,069
Time at risk    =   76155476.5
                                                LR chi2(1)       =      113.57
Log likelihood  =   -179999.27                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8059287   .0166518   -10.44   0.000     .7739438    .8392356
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_univa
> r.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -180056.06
Iteration 1:   log likelihood = -177743.57
Iteration 2:   log likelihood = -175707.09
Iteration 3:   log likelihood = -175644.17
Iteration 4:   log likelihood = -175643.99
Refining estimates:
Iteration 0:   log likelihood = -175643.99

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =       14,069
Time at risk    =   76155476.5
                                                LR chi2(5)       =     8824.13
Log likelihood  =   -175643.99                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7543569   .0156409   -13.60   0.000     .7243158     .785644
      1.male |   1.207833   .0208792    10.92   0.000     1.167596    1.249457
        age1 |    1.03631   .0065863     5.61   0.000     1.023482      1.0493
        age2 |   1.061832   .0097103     6.56   0.000      1.04297    1.081035
        age3 |   .8340326   .0401794    -3.77   0.000     .7588859    .9166204
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -74079.934
Iteration 1:   log likelihood = -68896.462
Iteration 2:   log likelihood = -67759.195
Iteration 3:   log likelihood =  -67735.36
Iteration 4:   log likelihood = -67734.731
Iteration 5:   log likelihood =  -67734.73
Refining estimates:
Iteration 0:   log likelihood =  -67734.73

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =       14,069
Time at risk    =   76155476.5
                                                LR chi2(27)      =    12690.41
Log likelihood  =    -67734.73                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7893737    .016918   -11.04   0.000     .7569018    .8232386
      1.male |   1.191483   .0218955     9.53   0.000     1.149332     1.23518
        age1 |    1.04588   .0068086     6.89   0.000      1.03262     1.05931
        age2 |   1.049937    .009805     5.22   0.000     1.030895    1.069332
        age3 |   .8239662   .0405007    -3.94   0.000     .7482902    .9072955
             |
         imd |
          2  |   1.009197   .0309494     0.30   0.765     .9503241    1.071716
          3  |   1.071548   .0330319     2.24   0.025     1.008724    1.138286
          4  |    1.13637   .0367013     3.96   0.000     1.066666    1.210629
5 most de..  |    1.31377   .0445863     8.04   0.000     1.229225    1.404129
             |
   obese4cat |
Obese I ..)  |    .767408   .0192881   -10.53   0.000     .7305201    .8061586
Obese II..)  |   .8963902   .0337077    -2.91   0.004     .8327002    .9649516
Obese II..)  |   1.165958   .0590351     3.03   0.002     1.055807      1.2876
             |
smoke_nomiss |
     Former  |   1.224082   .0237801    10.41   0.000      1.17835    1.271589
    Current  |    1.98804   .0757416    18.04   0.000     1.844996    2.142174
             |
     diabcat |
Controlle..  |   1.188488   .0246616     8.32   0.000     1.141122    1.237821
Uncontrol..  |   1.431432   .0424532    12.09   0.000     1.350597    1.517104
Diabetes,..  |    1.14986   .1604043     1.00   0.317     .8747892    1.511426
             |
1.myocardi~t |   1.155762   .0278783     6.00   0.000     1.102393    1.211715
       1.pad |   1.446907   .0422439    12.65   0.000     1.366435    1.532119
1.hyperten~n |   1.103869   .0230499     4.73   0.000     1.059603    1.149983
1.heart_f~re |    1.67209   .0298711    28.78   0.000     1.614557    1.731673
1.stroke_tia |   1.209208   .0228449    10.06   0.000     1.165251    1.254822
       1.vte |   1.279555   .0356522     8.85   0.000     1.211551    1.351375
 1.oestrogen |     1.3037   .1596115     2.17   0.030      1.02557    1.657257
1.flu_vac~ne |   .7723143   .0167096   -11.94   0.000     .7402488    .8057687
1.antiplat~t |   1.092744   .0372442     2.60   0.009     1.022131    1.168235
1.care_ho~ce |   3.190176   .0904431    40.92   0.000     3.017745    3.372458
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -74079.934
Iteration 1:   log likelihood =  -67672.19
Iteration 2:   log likelihood = -66313.681
Iteration 3:   log likelihood = -66290.585
Iteration 4:   log likelihood = -66290.044
Iteration 5:   log likelihood = -66290.043
Refining estimates:
Iteration 0:   log likelihood = -66290.043

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =       14,069
Time at risk    =   76155476.5
                                                LR chi2(34)      =    15579.78
Log likelihood  =   -66290.043                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8761227    .018897    -6.13   0.000     .8398573    .9139541
      1.male |   1.184197    .021755     9.20   0.000     1.142316    1.227613
        age1 |   1.043625   .0067568     6.60   0.000     1.030466    1.056953
        age2 |   1.035984    .009643     3.80   0.000     1.017255    1.055057
        age3 |    .906789   .0445301    -1.99   0.046     .8235803    .9984046
             |
         imd |
          2  |   1.006631   .0309291     0.22   0.830     .9478001    1.069113
          3  |   1.055696   .0325885     1.76   0.079     .9937172     1.12154
          4  |   1.107805   .0358361     3.16   0.002     1.039748    1.180317
5 most de..  |   1.254292   .0427504     6.65   0.000      1.17324    1.340943
             |
   obese4cat |
Obese I ..)  |    .779404     .01963    -9.90   0.000     .7418641    .8188434
Obese II..)  |   .9014248   .0339487    -2.76   0.006     .8372831    .9704803
Obese II..)  |   1.154607    .058561     2.83   0.005      1.04535    1.275283
             |
smoke_nomiss |
     Former  |   1.135815    .022475     6.44   0.000     1.092608     1.18073
    Current  |    1.75303   .0684964    14.37   0.000     1.623791    1.892555
             |
     diabcat |
Controlle..  |   1.156659   .0240849     6.99   0.000     1.110403    1.204841
Uncontrol..  |   1.363492   .0406476    10.40   0.000     1.286107    1.445533
Diabetes,..  |   1.135772   .1584796     0.91   0.362     .8640101    1.493012
             |
1.myocardi~t |   1.117174   .0269744     4.59   0.000     1.065537    1.171314
       1.pad |   1.371958   .0401703    10.80   0.000     1.295442    1.452993
1.hyperten~n |   1.102672   .0230968     4.67   0.000     1.058319    1.148882
1.heart_f~re |   1.535403   .0279152    23.58   0.000     1.481653    1.591102
1.stroke_tia |   1.161033   .0219959     7.88   0.000     1.118712    1.204955
       1.vte |    1.15473   .0323263     5.14   0.000     1.093078    1.219859
 1.oestrogen |   1.052238   .1293799     0.41   0.679     .8268998    1.338983
1.flu_vac~ne |   .7621164   .0165795   -12.49   0.000     .7303042    .7953143
             |
         ckd |
        CKD  |   1.122571   .0208551     6.22   0.000     1.082431    1.164199
      1.copd |    1.32799   .0321805    11.71   0.000     1.266392    1.392584
1.other_re~y |   1.432307    .042172    12.20   0.000     1.351991    1.517394
1.immunode~y |   1.607551   .1438931     5.30   0.000     1.348879    1.915828
    1.cancer |    1.60285   .0308349    24.52   0.000      1.54354    1.664439
1.ae_atten~r |   2.083334     .03815    40.08   0.000     2.009887    2.159464
1.gp_consult |   .7677951   .0392161    -5.17   0.000      .694655    .8486361
1.antiplat~t |   1.007684   .0344233     0.22   0.823     .9424243    1.077462
1.care_ho~ce |   3.001423   .0861735    38.28   0.000      2.83719    3.175163
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeat
> h_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/onsnoncoviddeath_multi
> var3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table2_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8059287   .0166518   -10.44   0.000     .7739438    .8392356
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7543569   .0156409   -13.60   0.000     .7243158     .785644
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7893737    .016918   -11.04   0.000     .7569018    .8232386
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8761227    .018897    -6.13   0.000     .8398573    .9139541
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:27:07
-------------------------------------------------------------------------------
