-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_admit
> covid.log
  log type:  text
 opened on:  31 Dec 2020, 03:24:47

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
 warfarin vs |  outcome: SUS covid
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   277,531      1,925 |   279,456 
             |     99.31       0.69 |    100.00 
-------------+----------------------+----------
warfarin use |    91,573        490 |    92,063 
             |     99.47       0.53 |    100.00 
-------------+----------------------+----------
       Total |   369,104      2,415 |   371,519 
             |     99.35       0.65 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -30929.804
Iteration 1:   log likelihood =  -30915.62
Iteration 2:   log likelihood = -30915.559
Iteration 3:   log likelihood = -30915.559
Refining estimates:
Iteration 0:   log likelihood = -30915.559

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,415
Time at risk    =   75964321.5
                                                LR chi2(1)       =       28.49
Log likelihood  =   -30915.559                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7685148   .0388864    -5.20   0.000     .6959562    .8486381
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_univ
> ar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_univar.ster
>  saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -30929.804
Iteration 1:   log likelihood = -30646.623
Iteration 2:   log likelihood = -30633.828
Iteration 3:   log likelihood = -30633.773
Iteration 4:   log likelihood = -30633.773
Refining estimates:
Iteration 0:   log likelihood = -30633.773

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,415
Time at risk    =   75964321.5
                                                LR chi2(5)       =      592.06
Log likelihood  =   -30633.773                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7158643   .0363552    -6.58   0.000     .6480409    .7907861
      1.male |   1.415565   .0602404     8.17   0.000     1.302286    1.538698
        age1 |   .9895716   .0091033    -1.14   0.254     .9718894    1.007575
        age2 |   1.103624   .0171656     6.34   0.000     1.070488    1.137786
        age3 |   .6033995   .0570378    -5.34   0.000     .5013524    .7262177
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_mult
> ivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_multivar1.s
> ter saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12416.124
Iteration 1:   log likelihood = -11853.288
Iteration 2:   log likelihood = -11740.883
Iteration 3:   log likelihood = -11740.467
Iteration 4:   log likelihood = -11740.467
Refining estimates:
Iteration 0:   log likelihood = -11740.467

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,415
Time at risk    =   75964321.5
                                                LR chi2(27)      =     1351.31
Log likelihood  =   -11740.467                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7508931   .0393526    -5.47   0.000     .6775925    .8321231
      1.male |   1.402326   .0630741     7.52   0.000     1.283995    1.531561
        age1 |   .9948361   .0095683    -0.54   0.590     .9762583    1.013767
        age2 |   1.100356   .0176637     5.96   0.000     1.066274    1.135526
        age3 |    .580951   .0561837    -5.62   0.000       .48064    .7021973
             |
         imd |
          2  |   1.028684    .081365     0.36   0.721      .880958    1.201182
          3  |    1.23619   .0970646     2.70   0.007     1.059863    1.441853
          4  |   1.334972   .1073153     3.59   0.000      1.14037    1.562781
5 most de..  |   1.424854   .1167916     4.32   0.000     1.213388    1.673174
             |
   obese4cat |
Obese I ..)  |   .9878507   .0543983    -0.22   0.824     .8867842    1.100436
Obese II..)  |   1.322767   .0979228     3.78   0.000     1.144116    1.529315
Obese II..)  |   1.310546   .1381101     2.57   0.010     1.065982    1.611221
             |
smoke_nomiss |
     Former  |   1.357988   .0651252     6.38   0.000      1.23616    1.491823
    Current  |   1.132773   .1180104     1.20   0.231     .9235625    1.389376
             |
     diabcat |
Controlle..  |   1.226573    .060745     4.12   0.000      1.11311    1.351601
Uncontrol..  |   1.759228   .1132822     8.77   0.000     1.550638    1.995876
Diabetes,..  |   .6691249   .3025116    -0.89   0.374     .2758536    1.623064
             |
1.myocardi~t |   1.219731   .0701191     3.46   0.001      1.08976    1.365204
       1.pad |   1.431037   .1019037     5.03   0.000     1.244621    1.645374
1.hyperten~n |   1.009493   .0501036     0.19   0.849     .9159167    1.112629
1.heart_f~re |   1.348362   .0592782     6.80   0.000     1.237043    1.469697
1.stroke_tia |   1.141651   .0536284     2.82   0.005     1.041235    1.251752
       1.vte |   1.455455   .0948893     5.76   0.000     1.280868     1.65384
 1.oestrogen |    .968061   .3460582    -0.09   0.928     .4804176    1.950682
1.flu_vac~ne |   .8958925   .0478918    -2.06   0.040     .8067763    .9948524
1.antiplat~t |   1.130683   .0884277     1.57   0.116     .9699979    1.317987
1.care_ho~ce |   3.893252   .2782343    19.02   0.000     3.384393    4.478621
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_mult
> ivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_multivar2.s
> ter saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12416.124
Iteration 1:   log likelihood = -12179.968
Iteration 2:   log likelihood = -11491.215
Iteration 3:   log likelihood = -11478.676
Iteration 4:   log likelihood = -11478.608
Iteration 5:   log likelihood = -11478.608
Refining estimates:
Iteration 0:   log likelihood = -11478.608

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        2,415
Time at risk    =   75964321.5
                                                LR chi2(34)      =     1875.03
Log likelihood  =   -11478.608                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8298536   .0437221    -3.54   0.000     .7484359    .9201281
      1.male |   1.442125   .0649148     8.13   0.000     1.320345    1.575136
        age1 |   .9948325   .0094934    -0.54   0.587     .9763986    1.013614
        age2 |   1.082666   .0173142     4.97   0.000     1.049257    1.117138
        age3 |   .6418395   .0620421    -4.59   0.000     .5310639     .775722
             |
         imd |
          2  |   1.012487   .0802139     0.16   0.876     .8668685    1.182566
          3  |   1.211485    .095182     2.44   0.015     1.038585    1.413168
          4  |    1.27014    .102404     2.97   0.003     1.084487    1.487576
5 most de..  |   1.322447    .108734     3.40   0.001     1.125618    1.553695
             |
   obese4cat |
Obese I ..)  |   .9928675   .0548462    -0.13   0.897     .8909858    1.106399
Obese II..)  |   1.313187   .0974903     3.67   0.000     1.135361    1.518866
Obese II..)  |   1.277315   .1349568     2.32   0.021     1.038396    1.571206
             |
smoke_nomiss |
     Former  |   1.233188   .0604503     4.28   0.000     1.120221    1.357546
    Current  |   .9405605   .1000095    -0.58   0.564     .7636225    1.158497
             |
     diabcat |
Controlle..  |   1.187939   .0591041     3.46   0.001     1.077566    1.309617
Uncontrol..  |   1.640175   .1065311     7.62   0.000     1.444121    1.862844
Diabetes,..  |   .6504926   .2943047    -0.95   0.342     .2679971      1.5789
             |
1.myocardi~t |   1.158312   .0665935     2.56   0.011     1.034876     1.29647
       1.pad |   1.334734   .0953627     4.04   0.000     1.160323    1.535361
1.hyperten~n |   1.003271    .050025     0.07   0.948     .9098623    1.106269
1.heart_f~re |   1.195155   .0534866     3.98   0.000     1.094789    1.304721
1.stroke_tia |    1.08709   .0512019     1.77   0.076     .9912287    1.192222
       1.vte |   1.324366    .086757     4.29   0.000     1.164789    1.505806
 1.oestrogen |   .9478782   .3397921    -0.15   0.881     .4694796    1.913764
1.flu_vac~ne |   .8905143   .0478766    -2.16   0.031     .8014527    .9894729
             |
         ckd |
        CKD  |   1.253249     .05664     4.99   0.000     1.147012    1.369327
      1.copd |   1.503975   .0834459     7.36   0.000     1.349003     1.67675
1.other_re~y |   1.424479   .0977016     5.16   0.000       1.2453    1.629438
1.immunode~y |    .986406   .2666654    -0.05   0.960     .5806862    1.675598
    1.cancer |   1.041049   .0543256     0.77   0.441     .9398368    1.153161
1.ae_atten~r |   2.253029   .0995319    18.39   0.000     2.066157    2.456802
1.gp_consult |   .7611738   .1014071    -2.05   0.041     .5862501    .9882909
1.antiplat~t |   1.029704   .0806867     0.37   0.709     .8831067    1.200638
1.care_ho~ce |   3.564172   .2578308    17.57   0.000     3.093023     4.10709
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_mult
> ivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/admitcovid_multivar3.s
> ter saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table2_admitcovid
> .txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7685148   .0388864    -5.20   0.000     .6959562    .8486381
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7158643   .0363552    -6.58   0.000     .6480409    .7907861
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7508931   .0393526    -5.47   0.000     .6775925    .8321231
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8298536   .0437221    -3.54   0.000     .7484359    .9201281
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_admit
> covid.log
  log type:  text
 closed on:  31 Dec 2020, 03:26:29
-------------------------------------------------------------------------------
