-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:30:49

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   275,583      3,873 |   279,456 
             |     98.61       1.39 |    100.00 
-------------+----------------------+----------
warfarin use |    91,176        887 |    92,063 
             |     99.04       0.96 |    100.00 
-------------+----------------------+----------
       Total |   366,759      4,760 |   371,519 
             |     98.72       1.28 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -60937.705
Iteration 1:   log likelihood = -60884.692
Iteration 2:   log likelihood = -60884.245
Iteration 3:   log likelihood = -60884.245
Refining estimates:
Iteration 0:   log likelihood = -60884.245

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        4,760
Time at risk    =     75750686
                                                LR chi2(1)       =      106.92
Log likelihood  =   -60884.245                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |     .69025   .0256936    -9.96   0.000     .6416846     .742491
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidte
> st_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidtest_univ
> ar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -60937.705
Iteration 1:   log likelihood = -60283.473
Iteration 2:   log likelihood = -60155.291
Iteration 3:   log likelihood = -60152.957
Iteration 4:   log likelihood = -60152.956
Refining estimates:
Iteration 0:   log likelihood = -60152.956

Cox regression -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        4,760
Time at risk    =     75750686
                                                LR chi2(5)       =     1569.50
Log likelihood  =   -60152.956                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6571537   .0245513   -11.24   0.000     .6107536     .707079
      1.male |    1.15317   .0344016     4.78   0.000     1.087678    1.222606
        age1 |   .9703342   .0056428    -5.18   0.000     .9593374    .9814571
        age2 |   1.122143   .0116312    11.12   0.000     1.099576    1.145172
        age3 |    .633279   .0404582    -7.15   0.000      .558746    .7177541
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidte
> st_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidtest_mult
> ivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24598.354
Iteration 1:   log likelihood = -23306.503
Iteration 2:   log likelihood =  -22737.25
Iteration 3:   log likelihood = -22733.587
Iteration 4:   log likelihood = -22733.586
Refining estimates:
Iteration 0:   log likelihood = -22733.586

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        4,760
Time at risk    =     75750686
                                                LR chi2(27)      =     3729.54
Log likelihood  =   -22733.586                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7316253   .0282546    -8.09   0.000     .6782912     .789153
      1.male |   1.230109   .0391195     6.51   0.000     1.155777    1.309222
        age1 |   .9750204   .0059076    -4.18   0.000     .9635101    .9866682
        age2 |   1.119312   .0119361    10.57   0.000      1.09616    1.142952
        age3 |   .5712356   .0372635    -8.58   0.000     .5026765    .6491452
             |
         imd |
          2  |   1.107731   .0611544     1.85   0.064      .994128    1.234317
          3  |   1.201616   .0668424     3.30   0.001     1.077497    1.340034
          4  |   1.295201   .0747449     4.48   0.000     1.156685    1.450305
5 most de..  |   1.473175   .0862811     6.61   0.000     1.313412    1.652371
             |
   obese4cat |
Obese I ..)  |   .9947128   .0395057    -0.13   0.894       .92022    1.075236
Obese II..)  |   1.207728   .0674189     3.38   0.001     1.082562    1.347367
Obese II..)  |   1.325254   .1010606     3.69   0.000      1.14127    1.538897
             |
smoke_nomiss |
     Former  |   1.193278   .0393007     5.37   0.000     1.118683    1.272846
    Current  |   1.001434   .0765917     0.02   0.985      .862027    1.163387
             |
     diabcat |
Controlle..  |   1.207745   .0428871     5.32   0.000     1.126546    1.294796
Uncontrol..  |   1.556307    .075365     9.13   0.000     1.415388    1.711257
Diabetes,..  |   .8810453   .2313977    -0.48   0.630     .5265489    1.474205
             |
1.myocardi~t |   1.106216   .0477958     2.34   0.019     1.016394    1.203975
       1.pad |   1.341259   .0714901     5.51   0.000     1.208212    1.488958
1.hyperten~n |   1.036457   .0367965     1.01   0.313     .9667895    1.111145
1.heart_f~re |   1.280024   .0405326     7.80   0.000     1.202997    1.361984
1.stroke_tia |   1.175166    .038847     4.88   0.000     1.101441    1.253825
       1.vte |   1.399172    .065145     7.21   0.000     1.277143    1.532861
 1.oestrogen |   1.053816   .2395987     0.23   0.818     .6748904    1.645495
1.flu_vac~ne |   .8193707   .0304565    -5.36   0.000     .7617997    .8812926
1.antiplat~t |   1.008517   .0616462     0.14   0.890     .8946494    1.136877
1.care_ho~ce |   6.806739    .293638    44.46   0.000     6.254878     7.40729
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidte
> st_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidtest_mult
> ivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24598.354
Iteration 1:   log likelihood = -23016.327
Iteration 2:   log likelihood = -22378.419
Iteration 3:   log likelihood = -22374.592
Iteration 4:   log likelihood = -22374.592
Refining estimates:
Iteration 0:   log likelihood = -22374.592

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,514                  Number of obs    =     371,514
No. of failures =        4,760
Time at risk    =     75750686
                                                LR chi2(34)      =     4447.53
Log likelihood  =   -22374.592                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7996023   .0310226    -5.76   0.000     .7410535    .8627769
      1.male |   1.254688    .039895     7.14   0.000     1.178882    1.335369
        age1 |   .9776782   .0059025    -3.74   0.000     .9661776    .9893157
        age2 |   1.103162   .0117654     9.21   0.000     1.080341    1.126464
        age3 |   .6199325   .0405189    -7.32   0.000     .5453932    .7046591
             |
         imd |
          2  |   1.099436   .0607633     1.72   0.086     .9865655    1.225219
          3  |   1.181748   .0657643     3.00   0.003     1.059633    1.317935
          4  |   1.255243   .0725783     3.93   0.000     1.120756    1.405867
5 most de..  |    1.39749   .0820416     5.70   0.000     1.245597    1.567904
             |
   obese4cat |
Obese I ..)  |   1.005932   .0400525     0.15   0.882     .9304151    1.087578
Obese II..)  |   1.215854   .0680096     3.49   0.000     1.089605    1.356732
Obese II..)  |    1.31408   .1003603     3.58   0.000     1.131392    1.526267
             |
smoke_nomiss |
     Former  |   1.129437   .0378913     3.63   0.000     1.057561    1.206199
    Current  |   .9033109   .0702742    -1.31   0.191     .7755629    1.052101
             |
     diabcat |
Controlle..  |   1.190012   .0424139     4.88   0.000     1.109719    1.276114
Uncontrol..  |   1.482614   .0722868     8.08   0.000     1.347494    1.631284
Diabetes,..  |    .865542   .2274301    -0.55   0.583     .5171615    1.448605
             |
1.myocardi~t |   1.066411   .0460679     1.49   0.137     .9798369    1.160635
       1.pad |   1.279293   .0683002     4.61   0.000     1.152193    1.420414
1.hyperten~n |   1.030419   .0367324     0.84   0.401     .9608822    1.104988
1.heart_f~re |   1.177298   .0379158     5.07   0.000     1.105282    1.254008
1.stroke_tia |   1.125121   .0372584     3.56   0.000     1.054415    1.200568
       1.vte |   1.296929   .0606394     5.56   0.000     1.183361    1.421396
 1.oestrogen |   1.025402   .2340578     0.11   0.912     .6555403    1.603943
1.flu_vac~ne |   .8237373   .0307728    -5.19   0.000      .765579    .8863138
             |
         ckd |
        CKD  |   1.129517   .0364787     3.77   0.000     1.060236    1.203325
      1.copd |   1.237499   .0532201     4.95   0.000     1.137465    1.346331
1.other_re~y |   1.323046   .0697033     5.31   0.000     1.193247    1.466965
1.immunode~y |   1.151307   .2136014     0.76   0.448     .8003282    1.656205
    1.cancer |   1.041039   .0390793     1.07   0.284     .9671945    1.120521
1.ae_atten~r |   2.120152   .0666203    23.92   0.000     1.993518     2.25483
1.gp_consult |   .7052587   .0574952    -4.28   0.000     .6011121    .8274494
1.antiplat~t |   .9200022   .0563049    -1.36   0.173     .8160085    1.037249
1.care_ho~ce |   6.211952   .2722117    41.68   0.000     5.700696    6.769059
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidte
> st_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/positivecovidtest_mult
> ivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table2_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .69025   .0256936    -9.96   0.000     .6416846     .742491
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6571537   .0245513   -11.24   0.000     .6107536     .707079
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7316253   .0282546    -8.09   0.000     .6782912     .789153
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7996023   .0310226    -5.76   0.000     .7410535    .8627769
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:32:36
-------------------------------------------------------------------------------
