-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:30:20

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,980 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   186,735     19,240 |   205,975 
             |     90.66       9.34 |    100.00 
-------------+----------------------+----------
warfarin use |    62,486      5,078 |    67,564 
             |     92.48       7.52 |    100.00 
-------------+----------------------+----------
       Total |   249,221     24,318 |   273,539 
             |     91.11       8.89 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302766.23
Iteration 1:   log likelihood = -302649.96
Iteration 2:   log likelihood = -302649.56
Iteration 3:   log likelihood = -302649.56
Refining estimates:
Iteration 0:   log likelihood = -302649.56

Cox regression -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =       24,318
Time at risk    =     54216172
                                                LR chi2(1)       =      233.34
Log likelihood  =   -302649.56                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7900356   .0124642   -14.94   0.000       .76598    .8148465
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_univa
> r_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_univar_ethn.
> ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302766.23
Iteration 1:   log likelihood = -301656.47
Iteration 2:   log likelihood = -301580.37
Iteration 3:   log likelihood = -301580.01
Iteration 4:   log likelihood = -301580.01
Refining estimates:
Iteration 0:   log likelihood = -301580.01

Cox regression -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =       24,318
Time at risk    =     54216172
                                                LR chi2(5)       =     2372.44
Log likelihood  =   -301580.01                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7705439   .0122135   -16.44   0.000     .7469738    .7948577
      1.male |   1.008142   .0132919     0.62   0.539      .982424    1.034533
        age1 |   .9866573   .0022747    -5.83   0.000      .982209    .9911257
        age2 |   1.047049   .0044125    10.91   0.000     1.038436    1.055733
        age3 |   .9050958    .024766    -3.64   0.000     .8578339    .9549615
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multi
> var1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multivar1_et
> hn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -118896.55
Iteration 1:   log likelihood = -116067.75
Iteration 2:   log likelihood =  -115721.6
Iteration 3:   log likelihood =  -115721.1
Iteration 4:   log likelihood =  -115721.1
Refining estimates:
Iteration 0:   log likelihood =  -115721.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =       24,318
Time at risk    =     54216172
                                                LR chi2(31)      =     6350.90
Log likelihood  =    -115721.1                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7914401   .0129277   -14.32   0.000     .7665035     .817188
      1.male |    1.00762   .0140088     0.55   0.585     .9805336    1.035454
        age1 |   .9869576   .0023512    -5.51   0.000     .9823601    .9915766
        age2 |   1.045648   .0044918    10.39   0.000     1.036881    1.054489
        age3 |   .8557294   .0237773    -5.61   0.000      .810373    .9036244
             |
         imd |
          2  |   1.037778   .0243614     1.58   0.114     .9911123    1.086641
          3  |   1.049692   .0251195     2.03   0.043     1.001595    1.100098
          4  |   1.079599   .0267906     3.09   0.002     1.028346    1.133405
5 most de..  |   1.178925   .0301983     6.43   0.000     1.121198    1.239623
             |
   obese4cat |
Obese I ..)  |   .9076095   .0156672    -5.62   0.000     .8774161     .938842
Obese II..)  |   1.019918   .0249804     0.81   0.421     .9721141    1.070073
Obese II..)  |   1.019955   .0340106     0.59   0.553     .9554271    1.088841
             |
smoke_nomiss |
     Former  |   1.100776   .0160024     6.60   0.000     1.069854    1.132591
    Current  |   1.205384   .0355349     6.34   0.000     1.137711    1.277082
             |
     diabcat |
Controlle..  |   1.123781    .017941     7.31   0.000     1.089161      1.1595
Uncontrol..  |   1.314422   .0291554    12.33   0.000     1.258503    1.372826
Diabetes,..  |   1.084264   .1371994     0.64   0.523     .8461093    1.389451
             |
1.myocardi~t |   1.145044   .0221583     7.00   0.000     1.102428    1.189308
       1.pad |    1.33916   .0328501    11.91   0.000     1.276299    1.405118
1.hyperten~n |   1.016649   .0155627     1.08   0.281     .9865999    1.047614
1.heart_f~re |   1.266016    .018037    16.56   0.000     1.231153    1.301866
1.stroke_tia |   1.175824   .0176344    10.80   0.000     1.141765      1.2109
       1.vte |   1.239759   .0274895     9.69   0.000     1.187034    1.294825
 1.oestrogen |   1.212496   .1068223     2.19   0.029     1.020207    1.441027
1.flu_vac~ne |   .9562013   .0164505    -2.60   0.009     .9244963    .9889935
1.antiplat~t |   1.183869   .0301208     6.63   0.000     1.126281    1.244402
1.care_ho~ce |   4.030272   .1024226    54.85   0.000     3.834445      4.2361
             |
   ethnicity |
      Mixed  |   1.035957   .1378543     0.27   0.791     .7981286    1.344655
Asian or ..  |   1.309195    .073421     4.80   0.000     1.172919    1.461304
      Black  |   1.238971   .1036679     2.56   0.010     1.051572    1.459767
      Other  |   1.089513    .097669     0.96   0.339      .913959    1.298787
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multi
> var2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multivar2_et
> hn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -118896.55
Iteration 1:   log likelihood = -116078.25
Iteration 2:   log likelihood = -115734.91
Iteration 3:   log likelihood = -115734.42
Iteration 4:   log likelihood = -115734.42
Refining estimates:
Iteration 0:   log likelihood = -115734.42

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =       24,318
Time at risk    =     54216172
                                                LR chi2(27)      =     6324.25
Log likelihood  =   -115734.42                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7904219   .0129092   -14.40   0.000     .7655211    .8161328
      1.male |   1.006942    .013998     0.50   0.619     .9798768    1.034755
        age1 |   .9866097   .0023494    -5.66   0.000     .9820158    .9912251
        age2 |   1.045989    .004493    10.47   0.000     1.037219    1.054832
        age3 |   .8542784   .0237386    -5.67   0.000      .808996    .9020955
             |
         imd |
          2  |   1.037732   .0243602     1.58   0.115     .9910685    1.086593
          3  |   1.050025   .0251266     2.04   0.041     1.001914    1.100445
          4  |   1.080188   .0268039     3.11   0.002      1.02891    1.134021
5 most de..  |   1.181312   .0302479     6.51   0.000      1.12349     1.24211
             |
   obese4cat |
Obese I ..)  |   .9061579   .0156385    -5.71   0.000     .8760195    .9373332
Obese II..)  |   1.017364   .0249116     0.70   0.482     .9696911     1.06738
Obese II..)  |    1.01508   .0338342     0.45   0.653     .9508863    1.083608
             |
smoke_nomiss |
     Former  |   1.095193   .0158756     6.27   0.000     1.064516    1.126755
    Current  |   1.196231   .0352199     6.09   0.000     1.129155    1.267291
             |
     diabcat |
Controlle..  |   1.128448   .0179849     7.58   0.000     1.093743    1.164254
Uncontrol..  |   1.322376   .0292823    12.62   0.000     1.266212    1.381032
Diabetes,..  |   1.088988    .137794     0.67   0.500      .849801    1.395497
             |
1.myocardi~t |   1.147925   .0222019     7.13   0.000     1.105225    1.192276
       1.pad |   1.337282   .0328015    11.85   0.000     1.274513    1.403142
1.hyperten~n |   1.018046   .0155799     1.17   0.243     .9879636    1.049045
1.heart_f~re |   1.266598   .0180441    16.59   0.000     1.231722    1.302463
1.stroke_tia |   1.176948   .0176499    10.86   0.000     1.142859    1.212055
       1.vte |   1.238731    .027463     9.66   0.000     1.186057    1.293744
 1.oestrogen |   1.209662   .1065723     2.16   0.031     1.017823    1.437658
1.flu_vac~ne |     .95613   .0164476    -2.61   0.009     .9244307    .9889163
1.antiplat~t |   1.185967   .0301714     6.70   0.000     1.128283    1.246601
1.care_ho~ce |   4.020135   .1021588    54.75   0.000     3.824812    4.225433
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multi
> var2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multivar2_wi
> thoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -118896.55
Iteration 1:   log likelihood = -115103.42
Iteration 2:   log likelihood = -114514.93
Iteration 3:   log likelihood = -114514.19
Iteration 4:   log likelihood = -114514.19
Refining estimates:
Iteration 0:   log likelihood = -114514.19

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =       24,318
Time at risk    =     54216172
                                                LR chi2(38)      =     8764.71
Log likelihood  =   -114514.19                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8513806   .0139754    -9.80   0.000     .8244253    .8792173
      1.male |   1.029857   .0143234     2.12   0.034     1.002163    1.058316
        age1 |   .9881765   .0023511    -5.00   0.000     .9835793    .9927953
        age2 |   1.034149    .004448     7.81   0.000     1.025467    1.042903
        age3 |   .9169237   .0255343    -3.11   0.002     .8682187    .9683609
             |
         imd |
          2  |   1.035369   .0243158     1.48   0.139     .9887909    1.084141
          3  |   1.040414   .0249162     1.65   0.098     .9927079    1.090414
          4  |    1.05911   .0263173     2.31   0.021     1.008764    1.111967
5 most de..  |    1.13623   .0291809     4.97   0.000     1.080452    1.194887
             |
   obese4cat |
Obese I ..)  |   .9165449   .0158398    -5.04   0.000     .8860194    .9481222
Obese II..)  |   1.024161   .0251219     0.97   0.330     .9760875    1.074602
Obese II..)  |   1.015985   .0339161     0.48   0.635     .9516391    1.084683
             |
smoke_nomiss |
     Former  |    1.04905   .0155157     3.24   0.001     1.019076    1.079905
    Current  |    1.10186   .0332318     3.22   0.001     1.038615    1.168957
             |
     diabcat |
Controlle..  |   1.106285   .0177056     6.31   0.000     1.072121    1.141537
Uncontrol..  |   1.272195   .0283494    10.80   0.000     1.217827     1.32899
Diabetes,..  |   1.072555   .1355766     0.55   0.579     .8371888    1.374093
             |
1.myocardi~t |   1.117731   .0216491     5.75   0.000     1.076095    1.160978
       1.pad |   1.285655   .0315878    10.23   0.000     1.225211    1.349081
1.hyperten~n |   1.016597   .0156104     1.07   0.284     .9864567    1.047657
1.heart_f~re |   1.191098   .0172533    12.07   0.000     1.157758    1.225399
1.stroke_tia |   1.140847   .0171385     8.77   0.000     1.107746    1.174937
       1.vte |   1.156752   .0257466     6.54   0.000     1.107374    1.208331
 1.oestrogen |   1.136653    .100355     1.45   0.147     .9560388    1.351389
1.flu_vac~ne |   .9487106   .0164033    -3.05   0.002     .9170994    .9814114
             |
         ckd |
        CKD  |   1.091262   .0158673     6.01   0.000     1.060601    1.122809
      1.copd |   1.215813   .0232241    10.23   0.000     1.171136    1.262194
1.other_re~y |   1.266736   .0312567     9.58   0.000     1.206932    1.329504
1.immunode~y |   1.250617   .0907746     3.08   0.002     1.084778    1.441809
    1.cancer |   1.218112   .0196905    12.21   0.000     1.180125    1.257323
1.ae_atten~r |   1.811982    .025172    42.79   0.000     1.763311    1.861996
1.gp_consult |   .8218963   .0373759    -4.31   0.000     .7518107    .8985154
1.antiplat~t |    1.10227   .0281087     3.82   0.000     1.048532    1.158762
1.care_ho~ce |   3.799443   .0977222    51.90   0.000     3.612659    3.995885
             |
   ethnicity |
      Mixed  |   1.030068   .1371891     0.22   0.824     .7934124    1.337312
Asian or ..  |   1.300433   .0731673     4.67   0.000     1.164652    1.452044
      Black  |   1.226769   .1023755     2.45   0.014     1.041667    1.444763
      Other  |   1.092206   .0977579     0.99   0.324     .9164687    1.301641
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multi
> var3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multivar3_et
> hn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -118896.55
Iteration 1:   log likelihood = -115113.24
Iteration 2:   log likelihood = -114527.51
Iteration 3:   log likelihood = -114526.78
Iteration 4:   log likelihood = -114526.78
Refining estimates:
Iteration 0:   log likelihood = -114526.78

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,535                  Number of obs    =     273,535
No. of failures =       24,318
Time at risk    =     54216172
                                                LR chi2(34)      =     8739.54
Log likelihood  =   -114526.78                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8503774   .0139572    -9.87   0.000     .8234572    .8781777
      1.male |   1.029421   .0143166     2.08   0.037      1.00174    1.057867
        age1 |   .9878531   .0023493    -5.14   0.000     .9832592    .9924685
        age2 |   1.034439   .0044493     7.87   0.000     1.025755    1.043196
        age3 |   .9155473   .0254983    -3.17   0.002     .8669111    .9669122
             |
         imd |
          2  |   1.035233   .0243126     1.47   0.140     .9886613    1.083998
          3  |   1.040642   .0249207     1.66   0.096     .9929268     1.09065
          4  |   1.059548   .0263268     2.33   0.020     1.009185    1.112425
5 most de..  |   1.138246   .0292214     5.04   0.000      1.08239    1.196985
             |
   obese4cat |
Obese I ..)  |   .9151934   .0158133    -5.13   0.000     .8847188    .9467178
Obese II..)  |   1.021576   .0250524     0.87   0.384     .9736354    1.071877
Obese II..)  |   1.011201   .0337428     0.33   0.739     .9471831    1.079547
             |
smoke_nomiss |
     Former  |      1.044   .0153997     2.92   0.004     1.014249    1.074624
    Current  |   1.094059   .0329599     2.98   0.003     1.031329    1.160604
             |
     diabcat |
Controlle..  |   1.110725   .0177473     6.57   0.000      1.07648    1.146059
Uncontrol..  |   1.279664   .0284674    11.09   0.000     1.225067    1.336693
Diabetes,..  |   1.076965   .1361296     0.59   0.557     .8406376    1.379731
             |
1.myocardi~t |    1.12038   .0216891     5.87   0.000     1.078667    1.163707
       1.pad |   1.284135   .0315487    10.18   0.000     1.223766    1.347482
1.hyperten~n |   1.017833   .0156257     1.15   0.250     .9876634    1.048924
1.heart_f~re |   1.191581   .0172589    12.10   0.000     1.158229    1.225892
1.stroke_tia |   1.141768   .0171513     8.83   0.000     1.108642    1.175883
       1.vte |   1.155982   .0257259     6.51   0.000     1.106644     1.20752
 1.oestrogen |   1.134383   .1001547     1.43   0.153     .9541288     1.34869
1.flu_vac~ne |   .9488363   .0164041    -3.04   0.002     .9172236    .9815387
             |
         ckd |
        CKD  |    1.09213   .0158794     6.06   0.000     1.061447    1.123701
      1.copd |   1.214174   .0231895    10.16   0.000     1.169564    1.260486
1.other_re~y |   1.266971   .0312612     9.59   0.000     1.207158    1.329748
1.immunode~y |   1.249829   .0907184     3.07   0.002     1.084093    1.440903
    1.cancer |   1.216394   .0196572    12.12   0.000     1.178471    1.255538
1.ae_atten~r |   1.813437   .0251896    42.85   0.000     1.764732    1.863486
1.gp_consult |   .8213218   .0373452    -4.33   0.000     .7512933    .8978778
1.antiplat~t |   1.104135   .0281529     3.89   0.000     1.050312    1.160715
1.care_ho~ce |   3.789579   .0974607    51.80   0.000     3.603294    3.985495
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multi
> var3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_3/covidtest_multivar3_wi
> thoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_3/table3_covidtest.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,975    4.07e+07           0   4.07e+07   4.07e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,564    1.36e+07           0   1.36e+07   1.36e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7900356   .0124642   -14.94   0.000       .76598    .8148465
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7705439   .0122135   -16.44   0.000     .7469738    .7948577
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7914401   .0129277   -14.32   0.000     .7665035     .817188
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7904219   .0129092   -14.40   0.000     .7655211    .8161328
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8513806   .0139754    -9.80   0.000     .8244253    .8792173
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8503774   .0139572    -9.87   0.000     .8234572    .8781777
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_3/06b_an_models_ethni
> city_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:32:58
-------------------------------------------------------------------------------
