-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:32:29

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   265,130     10,862 |   275,992 
             |     96.06       3.94 |    100.00 
-------------+----------------------+----------
warfarin use |    89,124      2,971 |    92,095 
             |     96.77       3.23 |    100.00 
-------------+----------------------+----------
       Total |   354,254     13,833 |   368,087 
             |     96.24       3.76 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -176909.92
Iteration 1:   log likelihood = -176858.66
Iteration 2:   log likelihood = -176858.53
Iteration 3:   log likelihood = -176858.53
Refining estimates:
Iteration 0:   log likelihood = -176858.53

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       13,833
Time at risk    =   75472613.5
                                                LR chi2(1)       =      102.78
Log likelihood  =   -176858.53                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8138983   .0168509    -9.95   0.000     .7815324    .8476047
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeat
> h_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeath_univa
> r.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -176909.92
Iteration 1:   log likelihood = -174672.65
Iteration 2:   log likelihood = -172620.03
Iteration 3:   log likelihood = -172556.11
Iteration 4:   log likelihood = -172555.91
Iteration 5:   log likelihood = -172555.91
Refining estimates:
Iteration 0:   log likelihood = -172555.91

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       13,833
Time at risk    =   75472613.5
                                                LR chi2(5)       =     8708.01
Log likelihood  =   -172555.91                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7602538   .0157974   -13.19   0.000     .7299135    .7918552
      1.male |   1.211036   .0211179    10.98   0.000     1.170345    1.253142
        age1 |   1.035585   .0065882     5.50   0.000     1.022753    1.048579
        age2 |    1.06217   .0097436     6.57   0.000     1.043244     1.08144
        age3 |   .8361895   .0404696    -3.70   0.000     .7605164    .9193923
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeat
> h_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeath_multi
> var1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -72709.954
Iteration 1:   log likelihood = -67596.416
Iteration 2:   log likelihood = -66473.532
Iteration 3:   log likelihood = -66450.728
Iteration 4:   log likelihood = -66450.147
Iteration 5:   log likelihood = -66450.146
Refining estimates:
Iteration 0:   log likelihood = -66450.146

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       13,833
Time at risk    =   75472613.5
                                                LR chi2(27)      =    12519.62
Log likelihood  =   -66450.146                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .796485   .0171224   -10.58   0.000     .7636229    .8307613
      1.male |   1.194081   .0221369     9.57   0.000     1.151472    1.238266
        age1 |   1.045183   .0068123     6.78   0.000     1.031916    1.058621
        age2 |   1.050471   .0098432     5.25   0.000     1.031355    1.069942
        age3 |   .8243818   .0407195    -3.91   0.000     .7483146    .9081813
             |
         imd |
          2  |   1.008196    .031206     0.26   0.792      .948852    1.071252
          3  |   1.075389   .0334243     2.34   0.019     1.011834    1.142936
          4  |   1.144849   .0372756     4.15   0.000     1.074073    1.220289
5 most de..  |   1.320368   .0451882     8.12   0.000     1.234706    1.411973
             |
   obese4cat |
Obese I ..)  |   .7681641   .0194677   -10.41   0.000     .7309402    .8072836
Obese II..)  |    .895345   .0339851    -2.91   0.004     .8311528    .9644949
Obese II..)  |   1.167364   .0596492     3.03   0.002     1.056117    1.290329
             |
smoke_nomiss |
     Former  |   1.227866   .0240668    10.47   0.000      1.18159    1.275953
    Current  |   1.992981   .0764915    17.97   0.000      1.84856    2.148685
             |
     diabcat |
Controlle..  |   1.183471    .024799     8.04   0.000      1.13585    1.233088
Uncontrol..  |   1.432197   .0428464    12.01   0.000     1.350635    1.518686
Diabetes,..  |   1.170162   .1633456     1.13   0.260     .8900718    1.538393
             |
1.myocardi~t |   1.160261   .0281892     6.12   0.000     1.106306    1.216847
       1.pad |   1.440862   .0425216    12.38   0.000     1.359886     1.52666
1.hyperten~n |   1.105413     .02327     4.76   0.000     1.060733    1.151975
1.heart_f~re |   1.672225   .0301404    28.53   0.000     1.614182    1.732355
1.stroke_tia |   1.201956   .0229323     9.64   0.000     1.157839    1.247753
       1.vte |   1.279826   .0359797     8.78   0.000     1.211215    1.352324
 1.oestrogen |    1.32177   .1619037     2.28   0.023     1.039662    1.680427
1.flu_vac~ne |   .7714809   .0168235   -11.90   0.000     .7392022    .8051691
1.antiplat~t |   1.095004   .0376038     2.64   0.008     1.023727    1.171243
1.care_ho~ce |    3.20907   .0916603    40.82   0.000     3.034355    3.393845
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeat
> h_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeath_multi
> var2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -72709.954
Iteration 1:   log likelihood = -66388.656
Iteration 2:   log likelihood = -65049.888
Iteration 3:   log likelihood = -65027.767
Iteration 4:   log likelihood = -65027.267
Iteration 5:   log likelihood = -65027.267
Refining estimates:
Iteration 0:   log likelihood = -65027.267

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       13,833
Time at risk    =   75472613.5
                                                LR chi2(34)      =    15365.37
Log likelihood  =   -65027.267                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .882474   .0190915    -5.78   0.000     .8458376    .9206973
      1.male |   1.186917    .021999     9.25   0.000     1.144573    1.230827
        age1 |   1.043016   .0067625     6.50   0.000     1.029845    1.056355
        age2 |   1.036491   .0096824     3.84   0.000     1.017686    1.055642
        age3 |   .9076263   .0447967    -1.96   0.050     .8239394    .9998131
             |
         imd |
          2  |   1.005551   .0311903     0.18   0.858     .9462398    1.068579
          3  |   1.059547   .0329793     1.86   0.063     .9968409    1.126198
          4  |   1.117057   .0364357     3.39   0.001     1.047879    1.190802
5 most de..  |   1.261203   .0433555     6.75   0.000     1.179028    1.349107
             |
   obese4cat |
Obese I ..)  |   .7805352   .0198228    -9.76   0.000     .7426343    .8203703
Obese II..)  |   .9007006   .0342392    -2.75   0.006      .836032    .9703714
Obese II..)  |   1.155383   .0591442     2.82   0.005     1.045088    1.277318
             |
smoke_nomiss |
     Former  |   1.138431   .0227261     6.49   0.000     1.094749    1.183856
    Current  |   1.755986   .0691204    14.30   0.000     1.625606    1.896822
             |
     diabcat |
Controlle..  |   1.151913   .0242247     6.72   0.000     1.105398    1.200384
Uncontrol..  |    1.36471   .0410449    10.34   0.000     1.286589    1.447575
Diabetes,..  |   1.156281   .1614704     1.04   0.298     .8794199    1.520305
             |
1.myocardi~t |   1.122092    .027289     4.74   0.000     1.069861    1.176872
       1.pad |   1.366213   .0404372    10.54   0.000     1.289213    1.447813
1.hyperten~n |   1.104703   .0233274     4.72   0.000     1.059916    1.151383
1.heart_f~re |   1.537197   .0281983    23.44   0.000     1.482911     1.59347
1.stroke_tia |   1.154291   .0220869     7.50   0.000     1.111803    1.198403
       1.vte |   1.155533   .0326351     5.12   0.000     1.093308      1.2213
 1.oestrogen |   1.067929   .1313887     0.53   0.593     .8391084    1.359149
1.flu_vac~ne |   .7612927   .0166933   -12.44   0.000     .7292676    .7947241
             |
         ckd |
        CKD  |   1.117778   .0209549     5.94   0.000     1.077453    1.159613
      1.copd |   1.333727   .0325855    11.79   0.000     1.271366    1.399148
1.other_re~y |   1.429663   .0424537    12.04   0.000      1.34883     1.51534
1.immunode~y |   1.623112   .1458986     5.39   0.000      1.36093    1.935805
    1.cancer |   1.607734    .031186    24.48   0.000     1.547758    1.670034
1.ae_atten~r |   2.078777   .0383552    39.66   0.000     2.004945    2.155327
1.gp_consult |   .7669924   .0393965    -5.16   0.000     .6935363    .8482287
1.antiplat~t |   1.010526   .0347845     0.30   0.761     .9445987    1.081055
1.care_ho~ce |   3.016574   .0872633    38.17   0.000       2.8503    3.192549
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeat
> h_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onsnoncoviddeath_multi
> var3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table2_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8138983   .0168509    -9.95   0.000     .7815324    .8476047
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7602538   .0157974   -13.19   0.000     .7299135    .7918552
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .796485   .0171224   -10.58   0.000     .7636229    .8307613
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .882474   .0190915    -5.78   0.000     .8458376    .9206973
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:34:23
-------------------------------------------------------------------------------
