-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 opened on:   1 Mar 2021, 22:14:01

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   273,123      3,804 |   276,927 
             |     98.63       1.37 |    100.00 
-------------+----------------------+----------
warfarin use |    91,449        890 |    92,339 
             |     99.04       0.96 |    100.00 
-------------+----------------------+----------
       Total |   364,572      4,694 |   369,266 
             |     98.73       1.27 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -60065.387
Iteration 1:   log likelihood = -60015.221
Iteration 2:   log likelihood = -60014.825
Iteration 3:   log likelihood = -60014.825
Refining estimates:
Iteration 0:   log likelihood = -60014.825

Cox regression -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        4,694
Time at risk    =     75317134
                                                LR chi2(1)       =      101.12
Log likelihood  =   -60014.825                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6968943   .0259492    -9.70   0.000     .6478464    .7496556
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_univ
> ar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -60065.387
Iteration 1:   log likelihood =  -59424.02
Iteration 2:   log likelihood = -59298.235
Iteration 3:   log likelihood = -59295.949
Iteration 4:   log likelihood = -59295.947
Refining estimates:
Iteration 0:   log likelihood = -59295.947

Cox regression -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        4,694
Time at risk    =     75317134
                                                LR chi2(5)       =     1538.88
Log likelihood  =   -59295.947                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6627861    .024773   -11.00   0.000     .6159677    .7131629
      1.male |   1.144233   .0343669     4.49   0.000      1.07882    1.213613
        age1 |   .9699446   .0056462    -5.24   0.000     .9589412    .9810742
        age2 |   1.122735   .0116776    11.13   0.000     1.100079    1.145858
        age3 |   .6311171   .0405218    -7.17   0.000     .5564899    .7157522
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24228.527
Iteration 1:   log likelihood = -22958.717
Iteration 2:   log likelihood = -22398.865
Iteration 3:   log likelihood = -22395.197
Iteration 4:   log likelihood = -22395.197
Refining estimates:
Iteration 0:   log likelihood = -22395.197

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        4,694
Time at risk    =     75317134
                                                LR chi2(27)      =     3666.66
Log likelihood  =   -22395.197                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7391118   .0285798    -7.82   0.000     .6851664    .7973046
      1.male |   1.218172   .0389978     6.16   0.000     1.144086    1.297055
        age1 |   .9747617   .0059189    -4.21   0.000     .9632297    .9864317
        age2 |   1.119946    .011994    10.58   0.000     1.096683    1.143702
        age3 |   .5688202   .0373171    -8.60   0.000     .5001871    .6468709
             |
         imd |
          2  |    1.10277   .0612553     1.76   0.078     .9890166    1.229607
          3  |    1.21087   .0680626     3.40   0.001     1.084555    1.351896
          4  |   1.305473   .0758564     4.59   0.000     1.164951    1.462946
5 most de..  |    1.48536   .0876056     6.71   0.000     1.323209    1.667382
             |
   obese4cat |
Obese I ..)  |   .9793718    .039364    -0.52   0.604     .9051805    1.059644
Obese II..)  |   1.202437   .0677128     3.27   0.001     1.076784    1.342753
Obese II..)  |   1.339139   .1022679     3.82   0.000     1.152977    1.555358
             |
smoke_nomiss |
     Former  |   1.204226    .039999     5.59   0.000     1.128326     1.28523
    Current  |    1.01437    .077708     0.19   0.852     .8729475    1.178703
             |
     diabcat |
Controlle..  |   1.203417   .0430652     5.17   0.000     1.121902    1.290853
Uncontrol..  |   1.560448   .0760975     9.12   0.000     1.418206    1.716956
Diabetes,..  |   .8898842   .2338267    -0.44   0.657     .5317054    1.489347
             |
1.myocardi~t |   1.105068   .0480899     2.30   0.022     1.014721    1.203458
       1.pad |   1.333849   .0717938     5.35   0.000     1.200304    1.482252
1.hyperten~n |    1.02899   .0367089     0.80   0.423     .9594998    1.103513
1.heart_f~re |   1.278641   .0407967     7.70   0.000      1.20113    1.361154
1.stroke_tia |   1.179227   .0392408     4.95   0.000     1.104771    1.258701
       1.vte |   1.394159   .0655482     7.07   0.000     1.271428    1.528736
 1.oestrogen |   1.059105   .2408686     0.25   0.801     .6781928    1.653959
1.flu_vac~ne |   .8185572   .0306014    -5.36   0.000     .7607242    .8807868
1.antiplat~t |   1.025598   .0627568     0.41   0.680     .9096861    1.156278
1.care_ho~ce |   6.789088   .2951581    44.06   0.000      6.23455    7.392949
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24228.527
Iteration 1:   log likelihood = -22672.057
Iteration 2:   log likelihood =  -22045.38
Iteration 3:   log likelihood = -22041.541
Iteration 4:   log likelihood =  -22041.54
Refining estimates:
Iteration 0:   log likelihood =  -22041.54

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        4,694
Time at risk    =     75317134
                                                LR chi2(34)      =     4373.97
Log likelihood  =    -22041.54                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8061099   .0313117    -5.55   0.000     .7470179    .8698763
      1.male |   1.243198    .039799     6.80   0.000     1.167591    1.323702
        age1 |   .9774749   .0059178    -3.76   0.000     .9659448    .9891427
        age2 |   1.103617   .0118254     9.20   0.000     1.080682     1.12704
        age3 |   .6181511   .0406458    -7.32   0.000     .5434066    .7031765
             |
         imd |
          2  |   1.095099   .0609001     1.63   0.102     .9820121    1.221209
          3  |   1.191744   .0670193     3.12   0.002     1.067369    1.330612
          4  |   1.267027   .0737717     4.06   0.000     1.130382     1.42019
5 most de..  |   1.409868   .0833702     5.81   0.000     1.255579    1.583116
             |
   obese4cat |
Obese I ..)  |   .9903085   .0399021    -0.24   0.809     .9151101    1.071686
Obese II..)  |   1.212167   .0683812     3.41   0.001     1.085286    1.353882
Obese II..)  |    1.32764   .1015451     3.71   0.000     1.142815    1.542357
             |
smoke_nomiss |
     Former  |   1.137763   .0384983     3.81   0.000     1.064756    1.215777
    Current  |   .9131668   .0711745    -1.17   0.244     .7838002    1.063885
             |
     diabcat |
Controlle..  |   1.186127    .042607     4.75   0.000     1.105491    1.272645
Uncontrol..  |   1.484887   .0729136     8.05   0.000      1.34864    1.634898
Diabetes,..  |   .8687847   .2283664    -0.54   0.593     .5190003    1.454309
             |
1.myocardi~t |   1.064774   .0463366     1.44   0.149     .9777215    1.159578
       1.pad |   1.271164   .0685405     4.45   0.000     1.143682    1.412856
1.hyperten~n |   1.022828   .0366361     0.63   0.529     .9534852    1.097214
1.heart_f~re |   1.177063   .0381954     5.02   0.000     1.104532    1.254356
1.stroke_tia |   1.129835   .0376672     3.66   0.000     1.058369    1.206127
       1.vte |   1.293002   .0610394     5.44   0.000     1.178735    1.418347
 1.oestrogen |   1.031686    .235571     0.14   0.891     .6594586    1.614015
1.flu_vac~ne |   .8220877   .0308856    -5.21   0.000     .7637281    .8849068
             |
         ckd |
        CKD  |    1.13062   .0368003     3.77   0.000     1.060745    1.205097
      1.copd |   1.241774   .0536886     5.01   0.000     1.140881    1.351589
1.other_re~y |   1.332556   .0704858     5.43   0.000     1.201326    1.478121
1.immunode~y |    1.12363   .2120052     0.62   0.537     .7762818    1.626399
    1.cancer |   1.044268   .0394635     1.15   0.252      .969716    1.124552
1.ae_atten~r |    2.11286   .0667846    23.67   0.000     1.985936    2.247895
1.gp_consult |   .7197212   .0590688    -4.01   0.000     .6127802    .8453253
1.antiplat~t |   .9355917   .0573321    -1.09   0.277     .8297086    1.054987
1.care_ho~ce |   6.208072   .2741989    41.34   0.000     5.693256    6.769439
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table2_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6968943   .0259492    -9.70   0.000     .6478464    .7496556
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6627861    .024773   -11.00   0.000     .6159677    .7131629
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7391118   .0285798    -7.82   0.000     .6851664    .7973046
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8061099   .0313117    -5.55   0.000     .7470179    .8698763
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 closed on:   1 Mar 2021, 22:15:54
-------------------------------------------------------------------------------
