-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_onsco
> viddeath.log
  log type:  text
 opened on:   1 Mar 2021, 22:09:59

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   275,135      1,792 |   276,927 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    91,908        431 |    92,339 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   367,043      2,223 |   369,266 
             |     99.40       0.60 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28456.952
Iteration 1:   log likelihood = -28436.611
Iteration 2:   log likelihood = -28436.474
Iteration 3:   log likelihood = -28436.474
Refining estimates:
Iteration 0:   log likelihood = -28436.474

Cox regression -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        2,223
Time at risk    =   75716542.5
                                                LR chi2(1)       =       40.96
Log likelihood  =   -28436.474                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .717328    .038484    -6.19   0.000      .645731    .7968635
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_u
> nivar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_univar.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28456.952
Iteration 1:   log likelihood = -27943.996
Iteration 2:   log likelihood = -27765.606
Iteration 3:   log likelihood = -27761.439
Iteration 4:   log likelihood = -27761.434
Refining estimates:
Iteration 0:   log likelihood = -27761.434

Cox regression -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        2,223
Time at risk    =   75716542.5
                                                LR chi2(5)       =     1391.04
Log likelihood  =   -27761.434                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6541803   .0352047    -7.89   0.000     .5886945    .7269506
      1.male |   1.476665   .0649038     8.87   0.000     1.354781    1.609514
        age1 |   1.048934   .0186846     2.68   0.007     1.012945    1.086202
        age2 |   1.071417   .0266536     2.77   0.006      1.02043    1.124951
        age3 |   .7057686   .0907517    -2.71   0.007     .5485423    .9080601
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11477.778
Iteration 1:   log likelihood = -10602.579
Iteration 2:   log likelihood = -10180.923
Iteration 3:   log likelihood = -10177.829
Iteration 4:   log likelihood = -10177.752
Iteration 5:   log likelihood = -10177.752
Refining estimates:
Iteration 0:   log likelihood = -10177.752

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        2,223
Time at risk    =   75716542.5
                                                LR chi2(27)      =     2600.05
Log likelihood  =   -10177.752                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7427037   .0415789    -5.31   0.000     .6655223    .8288359
      1.male |   1.524923    .071865     8.95   0.000      1.39038    1.672486
        age1 |   1.056819    .019137     3.05   0.002     1.019969       1.095
        age2 |   1.062912   .0268636     2.41   0.016     1.011543    1.116889
        age3 |   .6583067   .0859527    -3.20   0.001     .5096711     .850289
             |
         imd |
          2  |   1.012476   .0813308     0.15   0.877     .8649855    1.185115
          3  |   1.213813   .0979333     2.40   0.016     1.036275    1.421768
          4  |   1.173943   .0996314     1.89   0.059     .9940454    1.386397
5 most de..  |   1.387151   .1200287     3.78   0.000     1.170766    1.643528
             |
   obese4cat |
Obese I ..)  |   .9574839   .0572479    -0.73   0.467      .851605    1.076527
Obese II..)  |   1.201406   .1043796     2.11   0.035     1.013296    1.424436
Obese II..)  |   1.351072   .1707005     2.38   0.017     1.054712    1.730706
             |
smoke_nomiss |
     Former  |   1.377737   .0687792     6.42   0.000     1.249317    1.519357
    Current  |   1.351127   .1530787     2.66   0.008     1.082075    1.687077
             |
     diabcat |
Controlle..  |   1.244298   .0641162     4.24   0.000      1.12477    1.376528
Uncontrol..  |   1.485841   .1090413     5.40   0.000     1.286782    1.715692
Diabetes,..  |   .5389859   .2444186    -1.36   0.173      .221603    1.310929
             |
1.myocardi~t |   1.320235   .0769292     4.77   0.000     1.177748     1.47996
       1.pad |   1.427765   .1047368     4.85   0.000      1.23656    1.648536
1.hyperten~n |   1.011264   .0527899     0.21   0.830     .9129151    1.120209
1.heart_f~re |   1.481311   .0674502     8.63   0.000     1.354838    1.619589
1.stroke_tia |   1.191387   .0567132     3.68   0.000     1.085259    1.307893
       1.vte |   1.398609   .0947114     4.95   0.000      1.22477    1.597123
 1.oestrogen |   .6334102   .2872527    -1.01   0.314     .2604136    1.540659
1.flu_vac~ne |   .8075498   .0447615    -3.86   0.000     .7244164    .9002235
1.antiplat~t |   .9152891   .0823398    -0.98   0.325     .7673329    1.091774
1.care_ho~ce |   6.859599     .41873    31.55   0.000     6.086097    7.731407
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11477.778
Iteration 1:   log likelihood = -10432.959
Iteration 2:   log likelihood = -9982.8237
Iteration 3:   log likelihood = -9979.6058
Iteration 4:   log likelihood = -9979.5356
Iteration 5:   log likelihood = -9979.5356
Refining estimates:
Iteration 0:   log likelihood = -9979.5356

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      369,261                  Number of obs    =     369,261
No. of failures =        2,223
Time at risk    =   75716542.5
                                                LR chi2(34)      =     2996.48
Log likelihood  =   -9979.5356                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8137521   .0457761    -3.66   0.000     .7288017    .9086044
      1.male |   1.550121   .0730652     9.30   0.000     1.413331    1.700149
        age1 |   1.058091   .0191431     3.12   0.002     1.021229    1.096284
        age2 |   1.045024    .026416     1.74   0.081     .9945111    1.098102
        age3 |   .7284789   .0952797    -2.42   0.015     .5637494     .941343
             |
         imd |
          2  |   1.013305    .081544     0.16   0.870     .8654485    1.186422
          3  |   1.198782   .0968755     2.24   0.025     1.023183    1.404518
          4  |   1.136445   .0967916     1.50   0.133     .9617251    1.342906
5 most de..  |   1.319456   .1146272     3.19   0.001     1.112877    1.564382
             |
   obese4cat |
Obese I ..)  |   .9640593   .0578396    -0.61   0.542     .8571073    1.084357
Obese II..)  |   1.196768   .1041994     2.06   0.039     1.009016    1.419456
Obese II..)  |   1.318922   .1671691     2.18   0.029     1.028802    1.690854
             |
smoke_nomiss |
     Former  |   1.290729   .0655484     5.03   0.000     1.168443    1.425813
    Current  |   1.205954   .1393143     1.62   0.105     .9616086    1.512388
             |
     diabcat |
Controlle..  |   1.213717   .0628491     3.74   0.000      1.09658    1.343367
Uncontrol..  |     1.3776   .1019514     4.33   0.000     1.191595     1.59264
Diabetes,..  |   .5404905   .2451391    -1.36   0.175     .2221909     1.31477
             |
1.myocardi~t |    1.26171   .0735344     3.99   0.000     1.125513    1.414389
       1.pad |   1.345722   .0990553     4.03   0.000     1.164932     1.55457
1.hyperten~n |   .9907681   .0519927    -0.18   0.860     .8939298    1.098097
1.heart_f~re |   1.331482    .061655     6.18   0.000     1.215962    1.457977
1.stroke_tia |   1.140876   .0544165     2.76   0.006     1.039055    1.252675
       1.vte |   1.296721   .0880338     3.83   0.000     1.135165     1.48127
 1.oestrogen |   .6290613   .2862231    -1.02   0.308     .2578671    1.534581
1.flu_vac~ne |    .807488   .0449695    -3.84   0.000     .7239892    .9006168
             |
         ckd |
        CKD  |    1.27494   .0597516     5.18   0.000     1.163047    1.397599
      1.copd |   1.242386    .075965     3.55   0.000     1.102073    1.400564
1.other_re~y |   1.521944   .1097586     5.82   0.000     1.321333    1.753013
1.immunode~y |    1.55125   .3743962     1.82   0.069     .9665919    2.489547
    1.cancer |   1.018027   .0552196     0.33   0.742     .9153529    1.132218
1.ae_atten~r |   2.145969   .0996415    16.45   0.000     1.959298    2.350425
1.gp_consult |   .7463966   .0873672    -2.50   0.012     .5933825    .9388679
1.antiplat~t |   .8380174   .0755349    -1.96   0.050     .7023115    .9999454
1.care_ho~ce |   6.353973   .3946108    29.77   0.000     5.625769    7.176437
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table2_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .717328    .038484    -6.19   0.000      .645731    .7968635
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6541803   .0352047    -7.89   0.000     .5886945    .7269506
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7427037   .0415789    -5.31   0.000     .6655223    .8288359
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8137521   .0457761    -3.66   0.000     .7288017    .9086044
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_onsco
> viddeath.log
  log type:  text
 closed on:   1 Mar 2021, 22:11:55
-------------------------------------------------------------------------------
