-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_covid
> test.log
  log type:  text
 opened on:  31 Dec 2020, 03:33:00

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   250,485     25,507 |   275,992 
             |     90.76       9.24 |    100.00 
-------------+----------------------+----------
warfarin use |    85,194      6,901 |    92,095 
             |     92.51       7.49 |    100.00 
-------------+----------------------+----------
       Total |   335,679     32,408 |   368,087 
             |     91.20       8.80 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -413096.19
Iteration 1:   log likelihood = -412949.76
Iteration 2:   log likelihood =  -412949.3
Iteration 3:   log likelihood =  -412949.3
Refining estimates:
Iteration 0:   log likelihood =  -412949.3

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       32,408
Time at risk    =   72946000.5
                                                LR chi2(1)       =      293.77
Log likelihood  =    -412949.3                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7963832    .010806   -16.78   0.000      .775483    .8178467
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_univa
> r.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_univar.ster 
> saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -413096.19
Iteration 1:   log likelihood = -411598.01
Iteration 2:   log likelihood = -411493.14
Iteration 3:   log likelihood = -411492.66
Iteration 4:   log likelihood = -411492.66
Refining estimates:
Iteration 0:   log likelihood = -411492.66

Cox regression -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       32,408
Time at risk    =   72946000.5
                                                LR chi2(5)       =     3207.04
Log likelihood  =   -411492.66                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7777879   .0106019   -18.44   0.000     .7572837    .7988473
      1.male |   1.014711   .0115988     1.28   0.201     .9922309    1.037701
        age1 |   .9873758   .0020193    -6.21   0.000     .9834259    .9913415
        age2 |   1.044822   .0038707    11.84   0.000     1.037263    1.052436
        age3 |   .9202563   .0219133    -3.49   0.000     .8782939    .9642236
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar1.st
> er saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -167786.32
Iteration 1:   log likelihood = -163984.23
Iteration 2:   log likelihood = -163495.32
Iteration 3:   log likelihood = -163494.47
Iteration 4:   log likelihood = -163494.47
Refining estimates:
Iteration 0:   log likelihood = -163494.47

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       32,408
Time at risk    =   72946000.5
                                                LR chi2(27)      =     8583.71
Log likelihood  =   -163494.47                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .794062   .0111382   -16.44   0.000     .7725289    .8161953
      1.male |   1.008785   .0121359     0.73   0.467     .9852772    1.032854
        age1 |   .9870572   .0020733    -6.20   0.000     .9830019    .9911292
        age2 |   1.044206   .0039253    11.51   0.000     1.036541    1.051928
        age3 |   .8695554   .0209425    -5.80   0.000     .8294626    .9115862
             |
         imd |
          2  |   1.025729   .0203685     1.28   0.201     .9865742    1.066437
          3  |   1.051046     .02124     2.46   0.014      1.01023    1.093511
          4  |   1.081798   .0228471     3.72   0.000     1.037932    1.127517
5 most de..  |   1.183789   .0260266     7.67   0.000     1.133861    1.235915
             |
   obese4cat |
Obese I ..)  |   .9094869   .0136464    -6.32   0.000     .8831299    .9366305
Obese II..)  |   .9947063   .0213789    -0.25   0.805     .9536747    1.037503
Obese II..)  |   1.004788   .0292973     0.16   0.870     .9489768    1.063883
             |
smoke_nomiss |
     Former  |   1.110831   .0138705     8.42   0.000     1.083975    1.138352
    Current  |   1.196354   .0307829     6.97   0.000     1.137517    1.258235
             |
     diabcat |
Controlle..  |   1.124111   .0155505     8.46   0.000     1.094042    1.155006
Uncontrol..  |   1.324385   .0256366    14.51   0.000      1.27508    1.375597
Diabetes,..  |   1.020653   .1120098     0.19   0.852     .8231229    1.265587
             |
1.myocardi~t |   1.149973   .0193162     8.32   0.000      1.11273    1.188462
       1.pad |   1.327279   .0282753    13.29   0.000     1.273001    1.383871
1.hyperten~n |   1.016866   .0133274     1.28   0.202     .9910771    1.043325
1.heart_f~re |   1.269247   .0156339    19.36   0.000     1.238972    1.300262
1.stroke_tia |    1.16086   .0150698    11.49   0.000     1.131696    1.190775
       1.vte |   1.250202   .0239206    11.67   0.000     1.204187    1.297976
 1.oestrogen |   1.189391   .0926819     2.23   0.026     1.020929     1.38565
1.flu_vac~ne |   .9703694   .0142797    -2.04   0.041     .9427814    .9987647
1.antiplat~t |   1.213355   .0266328     8.81   0.000     1.162262    1.266693
1.care_ho~ce |    4.03235      .0879    63.96   0.000     3.863698    4.208364
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar2.st
> er saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -167786.32
Iteration 1:   log likelihood = -162691.62
Iteration 2:   log likelihood = -161885.53
Iteration 3:   log likelihood = -161884.29
Iteration 4:   log likelihood = -161884.29
Refining estimates:
Iteration 0:   log likelihood = -161884.29

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      368,082                  Number of obs    =     368,082
No. of failures =       32,408
Time at risk    =   72946000.5
                                                LR chi2(34)      =    11804.07
Log likelihood  =   -161884.29                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8506403   .0119845   -11.48   0.000     .8274725    .8744569
      1.male |   1.028101   .0123721     2.30   0.021     1.004136    1.052638
        age1 |   .9882897   .0020708    -5.62   0.000     .9842393    .9923568
        age2 |   1.032795   .0038835     8.58   0.000     1.025211    1.040434
        age3 |   .9302385   .0224325    -3.00   0.003     .8872945     .975261
             |
         imd |
          2  |   1.023203   .0203276     1.15   0.248      .984127     1.06383
          3  |   1.041077   .0210472     1.99   0.046     1.000632    1.083157
          4  |   1.062538   .0224653     2.87   0.004     1.019406    1.107494
5 most de..  |   1.143331   .0251932     6.08   0.000     1.095005    1.193791
             |
   obese4cat |
Obese I ..)  |    .918039   .0137899    -5.69   0.000     .8914053    .9454685
Obese II..)  |   .9982437   .0214783    -0.08   0.935     .9570223    1.041241
Obese II..)  |   1.002767   .0292689     0.09   0.925     .9470108    1.061805
             |
smoke_nomiss |
     Former  |   1.058901   .0134458     4.51   0.000     1.032873    1.085585
    Current  |   1.098344   .0288699     3.57   0.000     1.043193    1.156411
             |
     diabcat |
Controlle..  |   1.106316   .0153414     7.29   0.000     1.076652    1.136797
Uncontrol..  |   1.280995   .0249072    12.74   0.000     1.233096    1.330754
Diabetes,..  |   1.018041    .111662     0.16   0.871     .8211122    1.262198
             |
1.myocardi~t |   1.119758   .0188223     6.73   0.000     1.083468    1.157263
       1.pad |    1.27695   .0272546    11.45   0.000     1.224633    1.331501
1.hyperten~n |   1.015924   .0133538     1.20   0.229     .9900852    1.042437
1.heart_f~re |   1.195744   .0149672    14.28   0.000     1.166766    1.225442
1.stroke_tia |    1.12675   .0146499     9.18   0.000     1.098399    1.155832
       1.vte |   1.166772   .0224066     8.03   0.000     1.123672    1.211525
 1.oestrogen |   1.109693   .0866501     1.33   0.183     .9522194    1.293209
1.flu_vac~ne |   .9619856   .0142183    -2.62   0.009     .9345179    .9902605
             |
         ckd |
        CKD  |   1.086307   .0136148     6.61   0.000     1.059948    1.113322
      1.copd |   1.220506   .0204051    11.92   0.000     1.181161    1.261162
1.other_re~y |   1.262605   .0272921    10.79   0.000     1.210231    1.317246
1.immunode~y |   1.263129   .0795443     3.71   0.000     1.116462    1.429063
    1.cancer |    1.24376   .0172071    15.77   0.000     1.210487    1.277946
1.ae_atten~r |   1.799779   .0215871    49.00   0.000     1.757962     1.84259
1.gp_consult |   .8205202   .0314769    -5.16   0.000     .7610888    .8845923
1.antiplat~t |   1.128471    .024818     5.50   0.000     1.080862    1.178177
1.care_ho~ce |   3.814236   .0840683    60.74   0.000     3.652973    3.982618
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar3.st
> er saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table2_covidtest.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7963832    .010806   -16.78   0.000      .775483    .8178467
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7777879   .0106019   -18.44   0.000     .7572837    .7988473
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .794062   .0111382   -16.44   0.000     .7725289    .8161953
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8506403   .0119845   -11.48   0.000     .8274725    .8744569
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/05b_an_models_covid
> test.log
  log type:  text
 closed on:  31 Dec 2020, 03:34:51
-------------------------------------------------------------------------------
