-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:35:41

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,041 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   202,132      1,324 |   203,456 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    67,273        317 |    67,590 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   269,405      1,641 |   271,046 
             |     99.39       0.61 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20500.417
Iteration 1:   log likelihood = -20485.356
Iteration 2:   log likelihood = -20485.254
Iteration 3:   log likelihood = -20485.254
Refining estimates:
Iteration 0:   log likelihood = -20485.254

Cox regression -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,641
Time at risk    =     55641057
                                                LR chi2(1)       =       30.33
Log likelihood  =   -20485.254                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .716672   .0448127    -5.33   0.000     .6340094    .8101121
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_u
> nivar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_univar_e
> thn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20500.417
Iteration 1:   log likelihood = -20123.346
Iteration 2:   log likelihood = -19956.798
Iteration 3:   log likelihood = -19952.139
Iteration 4:   log likelihood =  -19952.13
Refining estimates:
Iteration 0:   log likelihood =  -19952.13

Cox regression -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,641
Time at risk    =     55641057
                                                LR chi2(5)       =     1096.57
Log likelihood  =    -19952.13                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6482151    .040662    -6.91   0.000     .5732235    .7330174
      1.male |   1.486655   .0760657     7.75   0.000     1.344801    1.643473
        age1 |   1.044459     .02124     2.14   0.032     1.003648     1.08693
        age2 |   1.082261   .0308766     2.77   0.006     1.023405    1.144503
        age3 |   .6747053   .0999635    -2.66   0.008     .5046627    .9020426
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8007.9356
Iteration 1:   log likelihood = -7295.2864
Iteration 2:   log likelihood = -7030.7734
Iteration 3:   log likelihood = -7028.2408
Iteration 4:   log likelihood =   -7028.15
Iteration 5:   log likelihood = -7028.1498
Refining estimates:
Iteration 0:   log likelihood = -7028.1498

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,641
Time at risk    =     55641057
                                                LR chi2(31)      =     1959.57
Log likelihood  =   -7028.1498                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7291447   .0478098    -4.82   0.000     .6412105     .829138
      1.male |   1.538081   .0847074     7.82   0.000     1.380704    1.713396
        age1 |   1.055252   .0221125     2.57   0.010      1.01279    1.099494
        age2 |   1.068954   .0313338     2.27   0.023     1.009271    1.132165
        age3 |   .6418233     .09748    -2.92   0.004     .4765793    .8643624
             |
         imd |
          2  |    .999543   .0976601    -0.00   0.996     .8253441    1.210509
          3  |   1.195269   .1154147     1.85   0.065     .9891767      1.4443
          4  |   1.195264   .1210918     1.76   0.078     .9800065    1.457803
5 most de..  |   1.382739   .1415149     3.17   0.002     1.131422    1.689878
             |
   obese4cat |
Obese I ..)  |     .99856   .0687241    -0.02   0.983      .872553    1.142764
Obese II..)  |    1.30798   .1288966     2.72   0.006     1.078247     1.58666
Obese II..)  |   1.219778   .1918819     1.26   0.207     .8961474    1.660284
             |
smoke_nomiss |
     Former  |   1.410264   .0833728     5.82   0.000     1.255968    1.583515
    Current  |   1.366245   .1806722     2.36   0.018     1.054304    1.770482
             |
     diabcat |
Controlle..  |   1.250348   .0746283     3.74   0.000     1.112311    1.405516
Uncontrol..  |   1.335648   .1172438     3.30   0.001     1.124535    1.586393
Diabetes,..  |   .7896335   .3613756    -0.52   0.606     .3220129    1.936323
             |
1.myocardi~t |   1.335183   .0899989     4.29   0.000     1.169944     1.52376
       1.pad |   1.621709   .1339196     5.85   0.000     1.379371    1.906621
1.hyperten~n |   1.018883   .0633151     0.30   0.763     .9020468    1.150851
1.heart_f~re |   1.421339   .0758526     6.59   0.000     1.280182    1.578061
1.stroke_tia |   1.243147   .0685782     3.95   0.000     1.115748    1.385093
       1.vte |   1.346401   .1077524     3.72   0.000      1.15094    1.575056
 1.oestrogen |   .3649964   .2608935    -1.41   0.159     .0899215    1.481541
1.flu_vac~ne |   .7397404   .0475314    -4.69   0.000      .652208    .8390205
1.antiplat~t |   .9200008   .0949081    -0.81   0.419      .751584    1.126157
1.care_ho~ce |    6.66208   .4805896    26.29   0.000     5.783701     7.67386
             |
   ethnicity |
      Mixed  |   1.193376   .5114654     0.41   0.680     .5151855    2.764338
Asian or ..  |   1.401011   .2676136     1.77   0.078      .963495    2.037199
      Black  |   1.207027   .3310967     0.69   0.493       .70506     2.06637
      Other  |   1.372461   .4382888     0.99   0.321     .7339611    2.566416
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8007.9356
Iteration 1:   log likelihood = -7296.7394
Iteration 2:   log likelihood = -7032.7313
Iteration 3:   log likelihood = -7030.2066
Iteration 4:   log likelihood = -7030.1162
Iteration 5:   log likelihood =  -7030.116
Refining estimates:
Iteration 0:   log likelihood =  -7030.116

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,641
Time at risk    =     55641057
                                                LR chi2(27)      =     1955.64
Log likelihood  =    -7030.116                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7271734   .0476574    -4.86   0.000     .6395169    .8268446
      1.male |   1.537203   .0846419     7.81   0.000     1.379946    1.712381
        age1 |   1.054512    .022092     2.53   0.011      1.01209    1.098713
        age2 |   1.069847    .031353     2.30   0.021     1.010127    1.133096
        age3 |   .6388938   .0970134    -2.95   0.003     .4744356    .8603598
             |
         imd |
          2  |   .9992522     .09763    -0.01   0.994     .8251067    1.210153
          3  |   1.195646   .1154368     1.85   0.064     .9895124    1.444722
          4  |   1.196509   .1211804     1.77   0.076      .981087    1.459231
5 most de..  |   1.386168   .1418124     3.19   0.001     1.134314    1.693941
             |
   obese4cat |
Obese I ..)  |   .9974667   .0686424    -0.04   0.971     .8716086    1.141498
Obese II..)  |   1.303549   .1284254     2.69   0.007      1.07465    1.581203
Obese II..)  |   1.211246    .190488     1.22   0.223     .8899529    1.648532
             |
smoke_nomiss |
     Former  |   1.397606    .082263     5.69   0.000     1.245326    1.568507
    Current  |   1.353455   .1788226     2.29   0.022     1.044673    1.753506
             |
     diabcat |
Controlle..  |   1.258751   .0749501     3.86   0.000     1.120099    1.414566
Uncontrol..  |   1.352199    .118241     3.45   0.001     1.139223    1.604992
Diabetes,..  |   .7936153   .3632033    -0.51   0.613     .3236324    1.946113
             |
1.myocardi~t |   1.341499   .0903256     4.36   0.000     1.175648    1.530746
       1.pad |   1.617709    .133541     5.83   0.000      1.37605    1.901807
1.hyperten~n |   1.019422   .0633298     0.31   0.757     .9025564    1.151419
1.heart_f~re |   1.422395   .0758822     6.60   0.000      1.28118    1.579175
1.stroke_tia |   1.243975   .0686252     3.96   0.000     1.116489    1.386019
       1.vte |   1.342846   .1074453     3.68   0.000     1.147939    1.570845
 1.oestrogen |   .3633644   .2597121    -1.42   0.157     .0895266    1.474798
1.flu_vac~ne |   .7405984   .0475702    -4.68   0.000     .6529926    .8399573
1.antiplat~t |   .9228374    .095193    -0.78   0.436     .7539137    1.129611
1.care_ho~ce |   6.643701   .4792152    26.25   0.000     5.767827     7.65258
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8007.9356
Iteration 1:   log likelihood = -7164.1525
Iteration 2:   log likelihood = -6876.1694
Iteration 3:   log likelihood = -6873.6065
Iteration 4:   log likelihood = -6873.5233
Iteration 5:   log likelihood = -6873.5232
Refining estimates:
Iteration 0:   log likelihood = -6873.5232

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,641
Time at risk    =     55641057
                                                LR chi2(38)      =     2268.82
Log likelihood  =   -6873.5232                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8069093     .05324    -3.25   0.001     .7090263    .9183054
      1.male |   1.569497   .0865215     8.18   0.000     1.408758    1.748576
        age1 |   1.056291   .0221155     2.62   0.009     1.013823    1.100538
        age2 |   1.050108   .0307717     1.67   0.095     .9914956    1.112185
        age3 |   .7147416   .1086752    -2.21   0.027     .5305488    .9628812
             |
         imd |
          2  |   1.000879   .0980862     0.01   0.993     .8259685    1.212828
          3  |   1.175919   .1138102     1.67   0.094     .9727352    1.421543
          4  |   1.149512   .1169801     1.37   0.171     .9416532    1.403253
5 most de..  |   1.303541   .1340145     2.58   0.010     1.065649    1.594539
             |
   obese4cat |
Obese I ..)  |   1.005478   .0695201     0.08   0.937     .8780506    1.151399
Obese II..)  |   1.306726   .1292177     2.71   0.007     1.076495    1.586197
Obese II..)  |    1.17691   .1860368     1.03   0.303     .8633598    1.604333
             |
smoke_nomiss |
     Former  |   1.309079   .0788683     4.47   0.000     1.163277    1.473155
    Current  |   1.200951   .1620949     1.36   0.175     .9217998    1.564637
             |
     diabcat |
Controlle..  |   1.218668   .0732246     3.29   0.001     1.083279    1.370978
Uncontrol..  |   1.224112   .1085596     2.28   0.023     1.028805    1.456497
Diabetes,..  |   .8233122   .3763721    -0.43   0.671     .3360802    2.016908
             |
1.myocardi~t |   1.271833   .0858251     3.56   0.000     1.114268    1.451678
       1.pad |   1.517058   .1258244     5.03   0.000     1.289448    1.784846
1.hyperten~n |   .9954074   .0622559    -0.07   0.941     .8805704    1.125221
1.heart_f~re |   1.264944   .0687335     4.33   0.000     1.137154    1.407094
1.stroke_tia |   1.188192   .0657543     3.12   0.002     1.066059    1.324317
       1.vte |   1.243582   .1000182     2.71   0.007      1.06222     1.45591
 1.oestrogen |   .3745446   .2680605    -1.37   0.170     .0921088    1.523021
1.flu_vac~ne |   .7368906   .0476798    -4.72   0.000     .6491227    .8365256
             |
         ckd |
        CKD  |    1.32053   .0726556     5.05   0.000     1.185537    1.470894
      1.copd |   1.321233   .0921606     3.99   0.000     1.152405    1.514794
1.other_re~y |   1.462708   .1220119     4.56   0.000     1.242095    1.722506
1.immunode~y |   1.763308   .4732981     2.11   0.035     1.041964    2.984031
    1.cancer |   .9799229   .0631406    -0.31   0.753      .863665     1.11183
1.ae_atten~r |   2.174017   .1184114    14.26   0.000     1.953893    2.418939
1.gp_consult |   .7282643   .0998297    -2.31   0.021     .5566821    .9527321
1.antiplat~t |   .8439812   .0873124    -1.64   0.101      .689086    1.033694
1.care_ho~ce |   6.137028   .4512879    24.67   0.000     5.313305    7.088452
             |
   ethnicity |
      Mixed  |   1.187374   .5077837     0.40   0.688     .5135339    2.745403
Asian or ..  |   1.385698   .2665124     1.70   0.090     .9505089    2.020137
      Black  |   1.160681   .3208802     0.54   0.590     .6751357    1.995422
      Other  |   1.305138   .4214832     0.82   0.410     .6930553     2.45779
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8007.9356
Iteration 1:   log likelihood = -7165.4551
Iteration 2:   log likelihood = -6877.8527
Iteration 3:   log likelihood = -6875.3054
Iteration 4:   log likelihood = -6875.2228
Iteration 5:   log likelihood = -6875.2226
Refining estimates:
Iteration 0:   log likelihood = -6875.2226

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,641
Time at risk    =     55641057
                                                LR chi2(34)      =     2265.43
Log likelihood  =   -6875.2226                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8049799   .0530875    -3.29   0.001     .7073742    .9160535
      1.male |   1.569259   .0864845     8.18   0.000     1.408587    1.748259
        age1 |   1.055694   .0221085     2.59   0.010     1.013239    1.099927
        age2 |   1.050714    .030797     1.69   0.091     .9920544    1.112843
        age3 |   .7125679   .1083611    -2.23   0.026     .5289115    .9599963
             |
         imd |
          2  |   1.000403   .0980382     0.00   0.997     .8255785    1.212248
          3  |   1.175956   .1137981     1.67   0.094     .9727915    1.421551
          4  |    1.15015   .1170085     1.38   0.169     .9422346    1.403945
5 most de..  |   1.305619   .1341867     2.59   0.009     1.067415    1.596981
             |
   obese4cat |
Obese I ..)  |     1.0044     .06944     0.06   0.949     .8771183    1.150152
Obese II..)  |   1.302256   .1287326     2.67   0.008     1.072883    1.580668
Obese II..)  |   1.169705   .1848398     0.99   0.321     .8581583    1.594356
             |
smoke_nomiss |
     Former  |   1.298257    .077912     4.35   0.000     1.154191    1.460305
    Current  |   1.190794   .1605992     1.29   0.195     .9141919    1.551086
             |
     diabcat |
Controlle..  |   1.225537   .0734876     3.39   0.001     1.089646    1.378375
Uncontrol..  |   1.239032   .1094112     2.43   0.015     1.042121    1.473149
Diabetes,..  |   .8258225   .3775385    -0.42   0.675     .3370899    2.023148
             |
1.myocardi~t |   1.277236   .0861064     3.63   0.000     1.119145    1.457659
       1.pad |   1.514169   .1255195     5.00   0.000     1.287101    1.781296
1.hyperten~n |   .9960276   .0622745    -0.06   0.949      .881154    1.125877
1.heart_f~re |   1.266237   .0687668     4.35   0.000     1.138381    1.408452
1.stroke_tia |   1.189241   .0658045     3.13   0.002     1.067014    1.325469
       1.vte |   1.240941   .0997815     2.68   0.007     1.060004    1.452762
 1.oestrogen |   .3730844   .2670014    -1.38   0.168     .0917564    1.516972
1.flu_vac~ne |   .7380235   .0477375    -4.70   0.000     .6501477    .8377768
             |
         ckd |
        CKD  |   1.321454    .072699     5.07   0.000     1.186379    1.471907
      1.copd |   1.320763   .0921239     3.99   0.000     1.152002    1.514247
1.other_re~y |   1.461967    .121939     4.55   0.000     1.241483    1.721607
1.immunode~y |   1.759206    .472229     2.10   0.035     1.039504    2.977195
    1.cancer |   .9772603   .0629389    -0.36   0.721     .8613705    1.108742
1.ae_atten~r |   2.176472   .1185337    14.28   0.000      1.95612    2.421646
1.gp_consult |   .7296558    .100013    -2.30   0.021     .5577568    .9545335
1.antiplat~t |   .8466617     .08758    -1.61   0.108     .6912901    1.036954
1.care_ho~ce |   6.121044   .4499496    24.65   0.000     5.299743    7.069622
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_m
> ultivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/onscoviddeath_multivar
> 3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table3_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    203,456    4.17e+07           0   4.17e+07   4.17e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,590    1.40e+07           0   1.40e+07   1.40e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .716672   .0448127    -5.33   0.000     .6340094    .8101121
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6482151    .040662    -6.91   0.000     .5732235    .7330174
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7291447   .0478098    -4.82   0.000     .6412105     .829138
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7271734   .0476574    -4.86   0.000     .6395169    .8268446
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8069093     .05324    -3.25   0.001     .7090263    .9183054
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8049799   .0530875    -3.29   0.001     .7073742    .9160535
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:38:09
-------------------------------------------------------------------------------
