-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 03:36:03

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,041 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
 warfarin vs |  outcome: SUS covid
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   201,997      1,459 |   203,456 
             |     99.28       0.72 |    100.00 
-------------+----------------------+----------
warfarin use |    67,218        372 |    67,590 
             |     99.45       0.55 |    100.00 
-------------+----------------------+----------
       Total |   269,215      1,831 |   271,046 
             |     99.32       0.68 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -22874.166
Iteration 1:   log likelihood = -22862.842
Iteration 2:   log likelihood = -22862.791
Iteration 3:   log likelihood = -22862.791
Refining estimates:
Iteration 0:   log likelihood = -22862.791

Cox regression -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,831
Time at risk    =   55492269.5
                                                LR chi2(1)       =       22.75
Log likelihood  =   -22862.791                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7634426   .0443426    -4.65   0.000      .681297    .8554927
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_univ
> ar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_univar_ethn
> .ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -22874.166
Iteration 1:   log likelihood = -22643.402
Iteration 2:   log likelihood = -22631.479
Iteration 3:   log likelihood = -22631.412
Iteration 4:   log likelihood = -22631.412
Refining estimates:
Iteration 0:   log likelihood = -22631.412

Cox regression -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,831
Time at risk    =   55492269.5
                                                LR chi2(5)       =      485.51
Log likelihood  =   -22631.412                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7051977   .0411204    -5.99   0.000     .6290381    .7905782
      1.male |   1.413299   .0690346     7.08   0.000     1.284268    1.555293
        age1 |   .9879561   .0102431    -1.17   0.243     .9680826    1.008238
        age2 |    1.11165   .0196179     6.00   0.000     1.073857    1.150773
        age3 |   .5778463   .0623818    -5.08   0.000     .4676493    .7140103
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_mult
> ivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_multivar1_e
> thn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -8917.681
Iteration 1:   log likelihood = -8836.5181
Iteration 2:   log likelihood = -8407.3088
Iteration 3:   log likelihood = -8397.3838
Iteration 4:   log likelihood = -8397.3198
Iteration 5:   log likelihood = -8397.3197
Refining estimates:
Iteration 0:   log likelihood = -8397.3197

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,831
Time at risk    =   55492269.5
                                                LR chi2(31)      =     1040.72
Log likelihood  =   -8397.3197                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7488238    .045277    -4.78   0.000      .665139    .8430373
      1.male |   1.403332   .0725634     6.55   0.000      1.26808    1.553011
        age1 |   .9949613   .0108629    -0.46   0.644     .9738966    1.016482
        age2 |   1.102936      .0202     5.35   0.000     1.064047    1.143246
        age3 |   .5729429   .0635858    -5.02   0.000     .4609398    .7121616
             |
         imd |
          2  |   1.059176   .0994666     0.61   0.540      .881114    1.273221
          3  |   1.297124   .1200449     2.81   0.005     1.081945    1.555098
          4  |   1.410278   .1333715     3.64   0.000     1.171671    1.697476
5 most de..  |   1.471739   .1411814     4.03   0.000     1.219485    1.776172
             |
   obese4cat |
Obese I ..)  |   .9988771   .0630062    -0.02   0.986     .8827156    1.130325
Obese II..)  |   1.409022   .1175961     4.11   0.000     1.196401    1.659428
Obese II..)  |   1.297683    .160277     2.11   0.035     1.018677    1.653106
             |
smoke_nomiss |
     Former  |   1.355854   .0754004     5.47   0.000     1.215841     1.51199
    Current  |   1.045224    .128965     0.36   0.720     .8206985    1.331174
             |
     diabcat |
Controlle..  |   1.203078   .0683473     3.25   0.001     1.076308    1.344779
Uncontrol..  |   1.653801   .1234464     6.74   0.000     1.428716    1.914345
Diabetes,..  |   .7946065    .402275    -0.45   0.650     .2945951    2.143279
             |
1.myocardi~t |   1.196103   .0788992     2.71   0.007     1.051043    1.361184
       1.pad |   1.583545   .1265244     5.75   0.000     1.354004       1.852
1.hyperten~n |   .9966185   .0576314    -0.06   0.953      .889829    1.116224
1.heart_f~re |   1.314261   .0667308     5.38   0.000     1.189768     1.45178
1.stroke_tia |   1.205791   .0644693     3.50   0.000     1.085829    1.339007
       1.vte |   1.404209   .1067562     4.47   0.000     1.209813     1.62984
 1.oestrogen |   .6431137   .3245297    -0.87   0.382     .2391951    1.729113
1.flu_vac~ne |   .8722644   .0538862    -2.21   0.027      .772793    .9845394
1.antiplat~t |   1.107891   .0996527     1.14   0.255     .9288233    1.321481
1.care_ho~ce |    3.74155    .312049    15.82   0.000     3.177316     4.40598
             |
   ethnicity |
      Mixed  |   .9631527   .4071496    -0.09   0.929     .4206009    2.205566
Asian or ..  |   1.507352   .2473861     2.50   0.012     1.092737    2.079283
      Black  |   1.805823   .3757392     2.84   0.005     1.201061    2.715098
      Other  |   1.404552   .3985919     1.20   0.231     .8053393    2.449609
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_mult
> ivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_multivar2_e
> thn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -8917.681
Iteration 1:   log likelihood =  -8841.425
Iteration 2:   log likelihood =  -8413.569
Iteration 3:   log likelihood = -8403.5606
Iteration 4:   log likelihood =  -8403.495
Iteration 5:   log likelihood =  -8403.495
Refining estimates:
Iteration 0:   log likelihood =  -8403.495

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,831
Time at risk    =   55492269.5
                                                LR chi2(27)      =     1028.37
Log likelihood  =    -8403.495                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7457636   .0450744    -4.85   0.000     .6624513    .8395534
      1.male |   1.401152   .0724195     6.53   0.000     1.266165     1.55053
        age1 |   .9935264   .0108443    -0.60   0.552     .9724977     1.01501
        age2 |   1.105137   .0202367     5.46   0.000     1.066177     1.14552
        age3 |   .5668973   .0629016    -5.12   0.000     .4560968    .7046147
             |
         imd |
          2  |   1.059723   .0995129     0.62   0.537     .8815774    1.273867
          3  |   1.298419   .1201295     2.82   0.005     1.083083    1.556567
          4  |   1.412609   .1335425     3.65   0.000     1.173688    1.700166
5 most de..  |   1.481007   .1419615     4.10   0.000     1.227342      1.7871
             |
   obese4cat |
Obese I ..)  |   .9989149   .0629902    -0.02   0.986     .8827808    1.130327
Obese II..)  |   1.403499   .1171049     4.06   0.000     1.191763    1.652854
Obese II..)  |   1.282153   .1582749     2.01   0.044     1.006616    1.633113
             |
smoke_nomiss |
     Former  |   1.336026   .0738705     5.24   0.000     1.198812    1.488946
    Current  |   1.025065   .1262628     0.20   0.841     .8052007    1.304964
             |
     diabcat |
Controlle..  |   1.217313   .0689432     3.47   0.001     1.089416    1.360224
Uncontrol..  |   1.680837   .1250455     6.98   0.000     1.452783    1.944691
Diabetes,..  |   .8019403   .4060159    -0.44   0.663     .2972936    2.163209
             |
1.myocardi~t |   1.201794   .0791342     2.79   0.005     1.056285    1.367347
       1.pad |   1.579913     .12614     5.73   0.000     1.351056    1.847536
1.hyperten~n |   1.000476   .0578156     0.01   0.993     .8933416    1.120459
1.heart_f~re |   1.316516   .0668138     5.42   0.000     1.191866    1.454203
1.stroke_tia |   1.208613   .0646209     3.54   0.000     1.088369    1.342142
       1.vte |   1.401796   .1065343     4.44   0.000     1.207799    1.626952
 1.oestrogen |   .6308434   .3183375    -0.91   0.361     .2346315     1.69612
1.flu_vac~ne |   .8720822   .0538443    -2.22   0.027     .7726847     .984266
1.antiplat~t |   1.113396   .1001274     1.19   0.232     .9334719       1.328
1.care_ho~ce |    3.71888   .3101483    15.75   0.000     3.158081    4.379262
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_mult
> ivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_multivar2_w
> ithoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -8917.681
Iteration 1:   log likelihood =  -8623.309
Iteration 2:   log likelihood = -8196.9911
Iteration 3:   log likelihood = -8187.8727
Iteration 4:   log likelihood = -8187.8251
Iteration 5:   log likelihood = -8187.8251
Refining estimates:
Iteration 0:   log likelihood = -8187.8251

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,831
Time at risk    =   55492269.5
                                                LR chi2(38)      =     1459.71
Log likelihood  =   -8187.8251                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8322683   .0506325    -3.02   0.003     .7387186    .9376649
      1.male |   1.445678    .074867     7.12   0.000     1.306143    1.600121
        age1 |   .9949669   .0108207    -0.46   0.643     .9739831    1.016403
        age2 |    1.08334    .019825     4.37   0.000     1.045173    1.122902
        age3 |   .6412876    .071336    -3.99   0.000     .5156633     .797516
             |
         imd |
          2  |   1.049659   .0987976     0.51   0.607     .8728309    1.262311
          3  |   1.266801    .117369     2.55   0.011      1.05644    1.519051
          4  |   1.341744    .127283     3.10   0.002     1.114093    1.615913
5 most de..  |   1.363143   .1312835     3.22   0.001     1.128659    1.646342
             |
   obese4cat |
Obese I ..)  |   1.005246   .0636425     0.08   0.934     .8879381    1.138053
Obese II..)  |   1.389428   .1163389     3.93   0.000     1.179135    1.637225
Obese II..)  |   1.251384   .1550056     1.81   0.070     .9816446    1.595242
             |
smoke_nomiss |
     Former  |   1.223797   .0696395     3.55   0.000     1.094642     1.36819
    Current  |   .8584202   .1081062    -1.21   0.225     .6706606    1.098745
             |
     diabcat |
Controlle..  |   1.162639   .0664205     2.64   0.008     1.039481    1.300389
Uncontrol..  |   1.526923   .1150936     5.62   0.000     1.317215    1.770017
Diabetes,..  |   .7903591   .4004008    -0.46   0.642     .2928199    2.133283
             |
1.myocardi~t |   1.135322   .0749323     1.92   0.054     .9975598    1.292109
       1.pad |   1.470538   .1179654     4.81   0.000      1.25659    1.720914
1.hyperten~n |   .9902784   .0575763    -0.17   0.867     .8836234    1.109807
1.heart_f~re |   1.161742   .0600638     2.90   0.004     1.049787    1.285636
1.stroke_tia |   1.150987   .0617538     2.62   0.009     1.036099    1.278615
       1.vte |    1.27239   .0973025     3.15   0.002     1.095285    1.478133
 1.oestrogen |   .6318347   .3193771    -0.91   0.364     .2346074     1.70163
1.flu_vac~ne |   .8660683   .0538813    -2.31   0.021     .7666475    .9783822
             |
         ckd |
        CKD  |   1.287681   .0671003     4.85   0.000      1.16266    1.426146
      1.copd |   1.536006   .0973457     6.77   0.000     1.356586    1.739156
1.other_re~y |   1.362847   .1076838     3.92   0.000     1.167321    1.591123
1.immunode~y |   1.043085   .3195504     0.14   0.890     .5722064    1.901456
    1.cancer |   1.067432   .0638611     1.09   0.275     .9493267    1.200232
1.ae_atten~r |   2.323453    .118686    16.50   0.000     2.102099    2.568117
1.gp_consult |   .8235003   .1324843    -1.21   0.227     .6007903    1.128768
1.antiplat~t |   1.008256   .0909609     0.09   0.927      .844848    1.203269
1.care_ho~ce |   3.425632   .2896588    14.56   0.000      2.90246    4.043106
             |
   ethnicity |
      Mixed  |   1.030888   .4351587     0.07   0.943      .450715    2.357876
Asian or ..  |   1.470791   .2445206     2.32   0.020     1.061788    2.037343
      Black  |   1.802024   .3754036     2.83   0.005     1.197941    2.710726
      Other  |   1.335156   .3810753     1.01   0.311     .7631067    2.336032
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_mult
> ivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_multivar3_e
> thn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -8917.681
Iteration 1:   log likelihood = -8627.8494
Iteration 2:   log likelihood = -8202.7048
Iteration 3:   log likelihood = -8193.5595
Iteration 4:   log likelihood = -8193.5108
Iteration 5:   log likelihood = -8193.5108
Refining estimates:
Iteration 0:   log likelihood = -8193.5108

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      271,042                  Number of obs    =     271,042
No. of failures =        1,831
Time at risk    =   55492269.5
                                                LR chi2(34)      =     1448.34
Log likelihood  =   -8193.5108                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8290925   .0504191    -3.08   0.002     .7359349    .9340424
      1.male |   1.445343   .0748192     7.12   0.000     1.305894    1.599684
        age1 |   .9936516   .0108024    -0.59   0.558     .9727033    1.015051
        age2 |   1.085258   .0198552     4.47   0.000     1.047032     1.12488
        age3 |   .6353199   .0706521    -4.08   0.000     .5108963    .7900457
             |
         imd |
          2  |   1.049825   .0988092     0.52   0.605     .8729751    1.262501
          3  |   1.268523   .1174869     2.57   0.010     1.057944    1.521017
          4  |   1.343061   .1273634     3.11   0.002     1.115259    1.617394
5 most de..  |   1.370465   .1319045     3.27   0.001     1.134858    1.654986
             |
   obese4cat |
Obese I ..)  |    1.00528   .0636282     0.08   0.934     .8879963    1.138055
Obese II..)  |   1.383936   .1158448     3.88   0.000     1.174532    1.630675
Obese II..)  |   1.238133   .1533022     1.73   0.084     .9713454    1.578195
             |
smoke_nomiss |
     Former  |   1.206331   .0682765     3.31   0.001     1.079667    1.347856
    Current  |    .842251    .105923    -1.37   0.172     .6582531    1.077681
             |
     diabcat |
Controlle..  |   1.175291   .0669566     2.84   0.005      1.05112    1.314131
Uncontrol..  |   1.550259   .1164805     5.84   0.000     1.337976    1.796223
Diabetes,..  |   .7972165   .4038304    -0.45   0.655     .2953927    2.151557
             |
1.myocardi~t |   1.139646   .0750885     1.98   0.047     1.001582    1.296742
       1.pad |    1.46706     .11759     4.78   0.000     1.253779    1.716622
1.hyperten~n |   .9941674   .0577705    -0.10   0.920     .8871492    1.114095
1.heart_f~re |   1.163702   .0601296     2.93   0.003     1.051621    1.287728
1.stroke_tia |   1.153897   .0618995     2.67   0.008     1.038736    1.281825
       1.vte |   1.270276   .0971054     3.13   0.002     1.093525    1.475597
 1.oestrogen |   .6213749   .3140909    -0.94   0.347     .2307229    1.673465
1.flu_vac~ne |    .865692   .0538309    -2.32   0.020     .7663614    .9778973
             |
         ckd |
        CKD  |   1.290117   .0672371     4.89   0.000     1.164842    1.428866
      1.copd |   1.530581   .0969597     6.72   0.000     1.351868     1.73292
1.other_re~y |   1.363316   .1076941     3.92   0.000     1.167768    1.591609
1.immunode~y |   1.038965   .3183527     0.12   0.901     .5698771    1.894176
    1.cancer |   1.064295   .0636322     1.04   0.297     .9466082    1.196613
1.ae_atten~r |   2.329318    .118948    16.56   0.000     2.107472    2.574518
1.gp_consult |   .8281467   .1332122    -1.17   0.241     .6042081    1.135084
1.antiplat~t |   1.013616   .0914125     0.15   0.881     .8493923    1.209591
1.care_ho~ce |   3.405609   .2879425    14.49   0.000     2.885533     4.01942
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_mult
> ivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/admitcovid_multivar3_w
> ithoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table3_admitcovid
> .txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    203,456    4.16e+07           0   4.16e+07   4.16e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,590    1.39e+07           0   1.39e+07   1.39e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7634426   .0443426    -4.65   0.000      .681297    .8554927
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7051977   .0411204    -5.99   0.000     .6290381    .7905782
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7488238    .045277    -4.78   0.000      .665139    .8430373
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7457636   .0450744    -4.85   0.000     .6624513    .8395534
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8322683   .0506325    -3.02   0.003     .7387186    .9376649
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8290925   .0504191    -3.08   0.002     .7359349    .9340424
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 03:38:25
-------------------------------------------------------------------------------
