-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_positivecovidtest.log
  log type:  text
 opened on:   1 Mar 2021, 22:20:20

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(95,698 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   202,429      2,919 |   205,348 
             |     98.58       1.42 |    100.00 
-------------+----------------------+----------
warfarin use |    67,532        688 |    68,220 
             |     98.99       1.01 |    100.00 
-------------+----------------------+----------
       Total |   269,961      3,607 |   273,568 
             |     98.68       1.32 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45075.964
Iteration 1:   log likelihood = -45039.636
Iteration 2:   log likelihood = -45039.365
Iteration 3:   log likelihood = -45039.365
Refining estimates:
Iteration 0:   log likelihood = -45039.365

Cox regression -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =        3,607
Time at risk    =   55851626.5
                                                LR chi2(1)       =       73.20
Log likelihood  =   -45039.365                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7046082   .0298614    -8.26   0.000     .6484458    .7656348
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_univar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_univ
> ar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45075.964
Iteration 1:   log likelihood = -44549.349
Iteration 2:   log likelihood = -44449.466
Iteration 3:   log likelihood = -44447.516
Iteration 4:   log likelihood = -44447.515
Refining estimates:
Iteration 0:   log likelihood = -44447.515

Cox regression -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =        3,607
Time at risk    =   55851626.5
                                                LR chi2(5)       =     1256.90
Log likelihood  =   -44447.515                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6630475   .0282114    -9.66   0.000      .609997    .7207118
      1.male |   1.176566   .0403344     4.74   0.000     1.100109    1.258336
        age1 |    .967455   .0063173    -5.07   0.000     .9551523    .9799163
        age2 |   1.137952   .0133852    10.99   0.000     1.112017    1.164491
        age3 |   .5732636   .0419411    -7.61   0.000     .4966824    .6616524
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17625.024
Iteration 1:   log likelihood = -16561.303
Iteration 2:   log likelihood = -16177.217
Iteration 3:   log likelihood = -16175.358
Iteration 4:   log likelihood = -16175.358
Refining estimates:
Iteration 0:   log likelihood = -16175.358

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =        3,607
Time at risk    =   55851626.5
                                                LR chi2(31)      =     2899.33
Log likelihood  =   -16175.358                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .746254   .0329964    -6.62   0.000     .6843053    .8138107
      1.male |   1.252434   .0459306     6.14   0.000     1.165571    1.345771
        age1 |   .9728701   .0066802    -4.01   0.000     .9598649    .9860516
        age2 |   1.132353   .0138032    10.20   0.000      1.10562    1.159733
        age3 |   .5242404   .0394344    -8.59   0.000     .4523779    .6075186
             |
         imd |
          2  |   1.117557   .0733266     1.69   0.090     .9826972    1.270925
          3  |    1.25463   .0822539     3.46   0.001     1.103343    1.426661
          4  |   1.310062   .0889785     3.98   0.000     1.146777    1.496597
5 most de..  |   1.470765   .1008468     5.63   0.000     1.285815    1.682318
             |
   obese4cat |
Obese I ..)  |   .9803821   .0448442    -0.43   0.665     .8963139    1.072335
Obese II..)  |   1.262224   .0796104     3.69   0.000      1.11545    1.428312
Obese II..)  |   1.298153   .1158195     2.92   0.003      1.08989    1.546211
             |
smoke_nomiss |
     Former  |   1.227428    .047137     5.34   0.000     1.138432     1.32338
    Current  |   1.003335   .0889695     0.04   0.970     .8432704    1.193783
             |
     diabcat |
Controlle..  |   1.213365     .04945     4.75   0.000     1.120215    1.314262
Uncontrol..  |   1.556312   .0863801     7.97   0.000     1.395894    1.735166
Diabetes,..  |   .8836298   .2719032    -0.40   0.688     .4834435    1.615084
             |
1.myocardi~t |   1.105118    .054363     2.03   0.042     1.003544    1.216973
       1.pad |   1.425122    .085967     5.87   0.000     1.266209    1.603979
1.hyperten~n |   1.013336   .0419247     0.32   0.749     .9344082     1.09893
1.heart_f~re |   1.229894   .0450672     5.65   0.000     1.144661    1.321473
1.stroke_tia |   1.213054   .0459626     5.10   0.000     1.126233    1.306569
       1.vte |   1.388917   .0746717     6.11   0.000      1.25001     1.54326
 1.oestrogen |   1.009296   .2750585     0.03   0.973     .5916223    1.721838
1.flu_vac~ne |   .8071099   .0349552    -4.95   0.000     .7414261    .8786127
1.antiplat~t |    1.04617   .0718292     0.66   0.511     .9144491    1.196865
1.care_ho~ce |   6.840918   .3417887    38.49   0.000     6.202779    7.544709
             |
   ethnicity |
      Mixed  |    1.05957   .3182712     0.19   0.847     .5880949    1.909025
Asian or ..  |   1.360538   .1723541     2.43   0.015     1.061401     1.74398
      Black  |   1.353931   .2427228     1.69   0.091     .9527949     1.92395
      Other  |   1.321127   .2848885     1.29   0.197     .8657472    2.016035
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17625.024
Iteration 1:   log likelihood = -16564.463
Iteration 2:   log likelihood = -16181.488
Iteration 3:   log likelihood = -16179.646
Iteration 4:   log likelihood = -16179.646
Refining estimates:
Iteration 0:   log likelihood = -16179.646

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =        3,607
Time at risk    =   55851626.5
                                                LR chi2(27)      =     2890.76
Log likelihood  =   -16179.646                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7447212   .0329211    -6.67   0.000     .6829132    .8121232
      1.male |   1.251444   .0458895     6.12   0.000     1.164659    1.344697
        age1 |   .9720909   .0066711    -4.12   0.000     .9591033    .9852544
        age2 |   1.133412   .0138137    10.28   0.000     1.106658    1.160812
        age3 |   .5217272   .0392421    -8.65   0.000     .4502148    .6045986
             |
         imd |
          2  |   1.117779   .0733334     1.70   0.090     .9829052     1.27116
          3  |   1.254993   .0822618     3.47   0.001      1.10369    1.427038
          4  |   1.311288   .0890416     3.99   0.000     1.147885    1.497952
5 most de..  |   1.474538   .1010662     5.67   0.000     1.289181    1.686546
             |
   obese4cat |
Obese I ..)  |   .9794981   .0447992    -0.45   0.651     .8955139    1.071359
Obese II..)  |   1.258488   .0793598     3.65   0.000     1.112174    1.424051
Obese II..)  |   1.288921   .1149416     2.85   0.004     1.082229    1.535089
             |
smoke_nomiss |
     Former  |   1.217613   .0465712     5.15   0.000     1.129673      1.3124
    Current  |   .9918757   .0878436    -0.09   0.927     .8338199    1.179892
             |
     diabcat |
Controlle..  |   1.221971   .0496793     4.93   0.000      1.12838    1.323325
Uncontrol..  |   1.571582    .087014     8.17   0.000     1.409966    1.751724
Diabetes,..  |   .8912933   .2742554    -0.37   0.708     .4876426     1.62907
             |
1.myocardi~t |   1.109554   .0545263     2.12   0.034     1.007669    1.221739
       1.pad |   1.423048   .0858356     5.85   0.000     1.264377    1.601631
1.hyperten~n |    1.01519   .0419891     0.36   0.715     .9361406    1.100915
1.heart_f~re |   1.230777    .045089     5.67   0.000     1.145502      1.3224
1.stroke_tia |   1.214734    .046023     5.13   0.000     1.127799    1.308372
       1.vte |   1.387199   .0745614     6.09   0.000     1.248495    1.541312
 1.oestrogen |   1.005133    .273909     0.02   0.985     .5891994    1.714686
1.flu_vac~ne |   .8067632   .0349274    -4.96   0.000     .7411308    .8782079
1.antiplat~t |      1.049   .0720241     0.70   0.486     .9169213    1.200103
1.care_ho~ce |    6.81083   .3401508    38.41   0.000     6.175737    7.511234
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17625.024
Iteration 1:   log likelihood = -16340.293
Iteration 2:   log likelihood = -15901.997
Iteration 3:   log likelihood = -15900.017
Iteration 4:   log likelihood = -15900.017
Refining estimates:
Iteration 0:   log likelihood = -15900.017

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =        3,607
Time at risk    =   55851626.5
                                                LR chi2(38)      =     3450.01
Log likelihood  =   -15900.017                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8170145   .0363067    -4.55   0.000     .7488655    .8913653
      1.male |    1.28116   .0470109     6.75   0.000     1.192256    1.376694
        age1 |   .9754226   .0066907    -3.63   0.000     .9623969    .9886247
        age2 |   1.115652   .0136264     8.96   0.000     1.089262    1.142682
        age3 |   .5698567   .0430265    -7.45   0.000     .4914694    .6607464
             |
         imd |
          2  |   1.107545   .0727748     1.55   0.120     .9737115    1.259773
          3  |   1.235028   .0810227     3.22   0.001     1.086012    1.404491
          4  |   1.269056    .086358     3.50   0.000     1.110599    1.450121
5 most de..  |   1.389811   .0955682     4.79   0.000     1.214574     1.59033
             |
   obese4cat |
Obese I ..)  |   .9873094   .0452901    -0.28   0.781     .9024159    1.080189
Obese II..)  |   1.266053   .0800264     3.73   0.000     1.118531    1.433032
Obese II..)  |   1.272701   .1137468     2.70   0.007     1.068196    1.516359
             |
smoke_nomiss |
     Former  |   1.157404   .0453007     3.73   0.000     1.071936    1.249686
    Current  |   .8929729   .0805693    -1.25   0.210     .7482347    1.065709
             |
     diabcat |
Controlle..  |   1.198294   .0490672     4.42   0.000     1.105882    1.298428
Uncontrol..  |   1.481144   .0828269     7.02   0.000     1.327386    1.652712
Diabetes,..  |    .866957   .2667936    -0.46   0.643     .4742992    1.584684
             |
1.myocardi~t |   1.063852   .0523533     1.26   0.208      .966034    1.171574
       1.pad |   1.358478   .0820754     5.07   0.000     1.206772    1.529254
1.hyperten~n |   1.008705   .0419428     0.21   0.835     .9297591    1.094354
1.heart_f~re |   1.130587   .0421401     3.29   0.001     1.050939    1.216272
1.stroke_tia |   1.160893   .0440635     3.93   0.000     1.077664    1.250549
       1.vte |   1.284757     .06942     4.64   0.000     1.155653    1.428284
 1.oestrogen |   .9768645   .2670889    -0.09   0.932     .5716148    1.669418
1.flu_vac~ne |    .812489   .0354092    -4.76   0.000     .7459696    .8849399
             |
         ckd |
        CKD  |   1.148004   .0428135     3.70   0.000     1.067084     1.23506
      1.copd |   1.278883   .0621732     5.06   0.000     1.162651    1.406735
1.other_re~y |   1.223326   .0745826     3.31   0.001     1.085542    1.378597
1.immunode~y |   1.109121   .2364131     0.49   0.627     .7303686    1.684285
    1.cancer |   1.049102   .0454775     1.11   0.269     .9636497    1.142133
1.ae_atten~r |   2.147958    .077976    21.06   0.000     2.000439    2.306357
1.gp_consult |   .7037529   .0667954    -3.70   0.000      .584292     .847638
1.antiplat~t |    .954145   .0656424    -0.68   0.495     .8337853    1.091879
1.care_ho~ce |   6.232232    .316829    35.99   0.000     5.641193    6.885196
             |
   ethnicity |
      Mixed  |    1.07086   .3215583     0.23   0.820     .5944751    1.928998
Asian or ..  |   1.339513   .1705064     2.30   0.022     1.043753    1.719081
      Black  |   1.359545   .2434776     1.72   0.086     .9570928    1.931226
      Other  |   1.266511   .2746439     1.09   0.276     .8279904    1.937281
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17625.024
Iteration 1:   log likelihood = -16343.115
Iteration 2:   log likelihood = -15905.875
Iteration 3:   log likelihood = -15903.917
Iteration 4:   log likelihood = -15903.917
Refining estimates:
Iteration 0:   log likelihood = -15903.917

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =        3,607
Time at risk    =   55851626.5
                                                LR chi2(34)      =     3442.21
Log likelihood  =   -15903.917                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8154567   .0362302    -4.59   0.000     .7474508      .88965
      1.male |    1.28072   .0469896     6.74   0.000     1.191855     1.37621
        age1 |   .9746857   .0066816    -3.74   0.000     .9616777    .9878698
        age2 |   1.116608   .0136356     9.03   0.000       1.0902    1.143655
        age3 |   .5673605   .0428335    -7.51   0.000     .4893242    .6578419
             |
         imd |
          2  |   1.107456   .0727593     1.55   0.120     .9736501     1.25965
          3  |   1.235249   .0810189     3.22   0.001     1.086238    1.404701
          4  |   1.269616   .0863789     3.51   0.000     1.111119    1.450722
5 most de..  |   1.392983   .0957485     4.82   0.000     1.217411    1.593875
             |
   obese4cat |
Obese I ..)  |   .9866434   .0452554    -0.29   0.769     .9018146    1.079452
Obese II..)  |    1.26218   .0797656     3.68   0.000     1.115137    1.428613
Obese II..)  |   1.264742   .1129816     2.63   0.009     1.061604     1.50675
             |
smoke_nomiss |
     Former  |   1.148407   .0447758     3.55   0.000     1.063917    1.239606
    Current  |    .883153   .0795967    -1.38   0.168     .7401487    1.053787
             |
     diabcat |
Controlle..  |    1.20607   .0492773     4.59   0.000     1.113255    1.306625
Uncontrol..  |   1.495049   .0833936     7.21   0.000     1.340219    1.667767
Diabetes,..  |   .8735952    .268823    -0.44   0.661     .4779453     1.59677
             |
1.myocardi~t |   1.067526   .0524832     1.33   0.184     .9694617    1.175511
       1.pad |   1.356861   .0819648     5.05   0.000     1.205358    1.527406
1.hyperten~n |   1.010457   .0420038     0.25   0.802     .9313957     1.09623
1.heart_f~re |   1.131263   .0421529     3.31   0.001      1.05159    1.216973
1.stroke_tia |   1.162507   .0441199     3.97   0.000     1.079172    1.252278
       1.vte |   1.283748   .0693448     4.62   0.000     1.154782    1.427117
 1.oestrogen |   .9730898   .2660442    -0.10   0.921     .5694206    1.662925
1.flu_vac~ne |   .8120643   .0353747    -4.78   0.000     .7456085    .8844432
             |
         ckd |
        CKD  |   1.149331   .0428599     3.73   0.000     1.068324    1.236481
      1.copd |   1.276938   .0620734     5.03   0.000     1.160893    1.404584
1.other_re~y |   1.223718   .0745961     3.31   0.001     1.085909    1.379016
1.immunode~y |   1.106333   .2358632     0.47   0.636     .7284759    1.680183
    1.cancer |   1.046362   .0453369     1.05   0.296     .9611722    1.139103
1.ae_atten~r |   2.150251   .0780515    21.09   0.000     2.002588    2.308802
1.gp_consult |   .7058167   .0670082    -3.67   0.000      .585978    .8501636
1.antiplat~t |   .9565494   .0658078    -0.65   0.518     .8358864    1.094631
1.care_ho~ce |   6.205684   .3153424    35.92   0.000     5.617405    6.855569
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidte
> st_multivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/positivecovidtest_mult
> ivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table3_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,348    4.18e+07           0   4.18e+07   4.18e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,220    1.40e+07           0   1.40e+07   1.40e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7046082   .0298614    -8.26   0.000     .6484458    .7656348
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6630475   .0282114    -9.66   0.000      .609997    .7207118
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .746254   .0329964    -6.62   0.000     .6843053    .8138107
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7447212   .0329211    -6.67   0.000     .6829132    .8121232
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8170145   .0363067    -4.55   0.000     .7488655    .8913653
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8154567   .0362302    -4.59   0.000     .7474508      .88965
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_positivecovidtest.log
  log type:  text
 closed on:   1 Mar 2021, 22:22:51
-------------------------------------------------------------------------------
