-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_covidtest.log
  log type:  text
 opened on:   1 Mar 2021, 22:19:28

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(95,698 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   162,577     42,771 |   205,348 
             |     79.17      20.83 |    100.00 
-------------+----------------------+----------
warfarin use |    56,853     11,367 |    68,220 
             |     83.34      16.66 |    100.00 
-------------+----------------------+----------
       Total |   219,430     54,138 |   273,568 
             |     80.21      19.79 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -670974.55
Iteration 1:   log likelihood = -670663.65
Iteration 2:   log likelihood = -670662.43
Iteration 3:   log likelihood = -670662.43
Refining estimates:
Iteration 0:   log likelihood = -670662.43

Cox regression -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =       54,138
Time at risk    =     52008213
                                                LR chi2(1)       =      624.23
Log likelihood  =   -670662.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7730981   .0081583   -24.39   0.000     .7572724    .7892545
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_univa
> r_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_univar_ethn.
> ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -670974.55
Iteration 1:   log likelihood =  -669094.2
Iteration 2:   log likelihood = -668977.34
Iteration 3:   log likelihood = -668976.92
Iteration 4:   log likelihood = -668976.92
Refining estimates:
Iteration 0:   log likelihood = -668976.92

Cox regression -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =       54,138
Time at risk    =     52008213
                                                LR chi2(5)       =     3995.26
Log likelihood  =   -668976.92                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7622791   .0080855   -25.59   0.000     .7465955    .7782922
      1.male |   1.007811   .0089212     0.88   0.379      .990477    1.025449
        age1 |   .9822243   .0013949   -12.63   0.000     .9794942     .984962
        age2 |   1.037068    .002789    13.53   0.000     1.031616    1.042548
        age3 |   .9914474   .0178088    -0.48   0.633     .9571502    1.026974
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar1_et
> hn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -262169.97
Iteration 1:   log likelihood = -256808.86
Iteration 2:   log likelihood =  -255745.4
Iteration 3:   log likelihood = -255733.62
Iteration 4:   log likelihood = -255733.61
Refining estimates:
Iteration 0:   log likelihood = -255733.61

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =       54,138
Time at risk    =     52008213
                                                LR chi2(31)      =    12872.71
Log likelihood  =   -255733.61                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8012425   .0087712   -20.24   0.000     .7842344    .8186194
      1.male |    .998198   .0093045    -0.19   0.847     .9801272    1.016602
        age1 |   .9819689   .0014406   -12.40   0.000     .9791493    .9847965
        age2 |   1.035464   .0028345    12.73   0.000     1.029923    1.041034
        age3 |   .9249807   .0168555    -4.28   0.000     .8925276     .958614
             |
         imd |
          2  |   1.026867   .0158565     1.72   0.086     .9962547    1.058421
          3  |   1.049927   .0166216     3.08   0.002     1.017849    1.083015
          4  |   1.082048   .0178142     4.79   0.000      1.04769    1.117533
5 most de..  |   1.104685   .0192157     5.72   0.000     1.067658    1.142997
             |
   obese4cat |
Obese I ..)  |   .9150032   .0105155    -7.73   0.000     .8946235     .935847
Obese II..)  |   .9664717   .0159684    -2.06   0.039     .9356756    .9982815
Obese II..)  |   .9841129   .0218488    -0.72   0.471     .9422083    1.027881
             |
smoke_nomiss |
     Former  |    1.10641   .0107554    10.40   0.000      1.08553    1.127693
    Current  |   1.209411    .023441     9.81   0.000     1.164329    1.256238
             |
     diabcat |
Controlle..  |   1.089137   .0117747     7.90   0.000     1.066301    1.112461
Uncontrol..  |   1.220243   .0187856    12.93   0.000     1.183973    1.257623
Diabetes,..  |   .9939398   .0768402    -0.08   0.937     .8541906    1.156553
             |
1.myocardi~t |    1.14543   .0151991    10.23   0.000     1.116025    1.175611
       1.pad |    1.23749   .0216364    12.19   0.000     1.195802    1.280631
1.hyperten~n |   1.024017   .0104003     2.34   0.019     1.003835    1.044606
1.heart_f~re |   1.217231   .0118065    20.27   0.000      1.19431    1.240593
1.stroke_tia |   1.164746   .0119095    14.91   0.000     1.141636    1.188324
       1.vte |   1.241988   .0186646    14.42   0.000     1.205939    1.279114
 1.oestrogen |   1.232102   .0689881     3.73   0.000     1.104043    1.375014
1.flu_vac~ne |   .9799821   .0112316    -1.76   0.078     .9582139    1.002245
1.antiplat~t |    1.18561   .0202569     9.96   0.000     1.146565    1.225985
1.care_ho~ce |   5.562639   .1002722    95.20   0.000      5.36954    5.762681
             |
   ethnicity |
      Mixed  |   .9751062   .0849319    -0.29   0.772     .8220764    1.156623
Asian or ..  |    .970864   .0380024    -0.76   0.450      .899166    1.048279
      Black  |   .9379957   .0556503    -1.08   0.281     .8350259    1.053663
      Other  |   .9555949   .0615241    -0.71   0.481     .8423078    1.084119
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar2_et
> hn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -262169.97
Iteration 1:   log likelihood = -256809.64
Iteration 2:   log likelihood = -255746.44
Iteration 3:   log likelihood = -255734.66
Iteration 4:   log likelihood = -255734.65
Refining estimates:
Iteration 0:   log likelihood = -255734.65

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =       54,138
Time at risk    =     52008213
                                                LR chi2(27)      =    12870.63
Log likelihood  =   -255734.65                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8013898   .0087717   -20.23   0.000     .7843807    .8187678
      1.male |    .998357   .0093053    -0.18   0.860     .9802845    1.016763
        age1 |   .9820554   .0014395   -12.35   0.000     .9792382    .9848808
        age2 |   1.035365   .0028332    12.70   0.000     1.029827    1.040933
        age3 |   .9254318   .0168597    -4.25   0.000     .8929704    .9590732
             |
         imd |
          2  |   1.026927   .0158571     1.72   0.085     .9963134    1.058481
          3  |   1.049901   .0166211     3.08   0.002     1.017824    1.082989
          4  |   1.081932   .0178117     4.78   0.000     1.047579    1.117412
5 most de..  |   1.104272    .019205     5.70   0.000     1.067265    1.142562
             |
   obese4cat |
Obese I ..)  |    .915143   .0105149    -7.72   0.000     .8947645    .9359857
Obese II..)  |   .9668091   .0159683    -2.04   0.041     .9360129    .9986185
Obese II..)  |   .9847043    .021851    -0.69   0.487     .9427951    1.028477
             |
smoke_nomiss |
     Former  |   1.107274   .0107364    10.51   0.000      1.08643    1.128518
    Current  |   1.210758   .0234321     9.88   0.000     1.165692    1.257566
             |
     diabcat |
Controlle..  |     1.0883   .0117486     7.84   0.000     1.065516    1.111573
Uncontrol..  |   1.219121    .018741    12.89   0.000     1.182937    1.256411
Diabetes,..  |   .9927093   .0767391    -0.09   0.925     .8531431    1.155107
             |
1.myocardi~t |   1.145222   .0151905    10.22   0.000     1.115833    1.175385
       1.pad |   1.237681    .021638    12.20   0.000      1.19599    1.280826
1.hyperten~n |   1.023707   .0103948     2.31   0.021     1.003535    1.044284
1.heart_f~re |   1.217118   .0118048    20.26   0.000     1.194199    1.240476
1.stroke_tia |   1.164539   .0119056    14.90   0.000     1.141436    1.188108
       1.vte |   1.242131   .0186652    14.43   0.000     1.206081    1.279258
 1.oestrogen |    1.23265   .0690165     3.74   0.000     1.104538    1.375622
1.flu_vac~ne |   .9801054   .0112317    -1.75   0.080     .9583371    1.002368
1.antiplat~t |   1.185309   .0202488     9.95   0.000      1.14628    1.225668
1.care_ho~ce |   5.564412   .1002883    95.23   0.000     5.371281    5.764486
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar2_wi
> thoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -262169.97
Iteration 1:   log likelihood = -255063.79
Iteration 2:   log likelihood = -253549.17
Iteration 3:   log likelihood = -253537.11
Iteration 4:   log likelihood =  -253537.1
Refining estimates:
Iteration 0:   log likelihood =  -253537.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =       54,138
Time at risk    =     52008213
                                                LR chi2(38)      =    17265.73
Log likelihood  =    -253537.1                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8559212   .0094161   -14.14   0.000     .8376635    .8745769
      1.male |   1.017804   .0094929     1.89   0.058     .9993669     1.03658
        age1 |   .9833257   .0014437   -11.45   0.000     .9805003    .9861593
        age2 |   1.025107   .0028153     9.03   0.000     1.019604     1.03064
        age3 |   .9844815   .0179995    -0.86   0.392     .9498278      1.0204
             |
         imd |
          2  |   1.024697   .0158361     1.58   0.114     .9941243     1.05621
          3  |   1.042451   .0165171     2.62   0.009     1.010576    1.075332
          4  |   1.065735   .0175694     3.86   0.000      1.03185    1.100733
5 most de..  |   1.072056   .0186978     3.99   0.000     1.036028    1.109337
             |
   obese4cat |
Obese I ..)  |   .9230462   .0106205    -6.96   0.000     .9024633    .9440986
Obese II..)  |    .971396   .0160691    -1.75   0.079     .9404062    1.003407
Obese II..)  |   .9790314   .0217551    -0.95   0.340     .9373074    1.022613
             |
smoke_nomiss |
     Former  |   1.059098   .0104665     5.81   0.000     1.038782    1.079812
    Current  |   1.115197   .0220906     5.50   0.000      1.07273    1.159345
             |
     diabcat |
Controlle..  |   1.073928   .0116372     6.58   0.000      1.05136    1.096981
Uncontrol..  |   1.188477   .0183752    11.17   0.000     1.153003    1.225043
Diabetes,..  |   .9909694   .0765802    -0.12   0.907     .8516891    1.153027
             |
1.myocardi~t |   1.117278   .0148411     8.35   0.000     1.088565    1.146748
       1.pad |    1.19513   .0209261    10.18   0.000     1.154811    1.236856
1.hyperten~n |   1.024038     .01043     2.33   0.020     1.003798    1.044686
1.heart_f~re |   1.156815   .0113926    14.79   0.000       1.1347    1.179361
1.stroke_tia |   1.132659   .0116033    12.16   0.000     1.110144    1.155631
       1.vte |   1.170011   .0176423    10.41   0.000     1.135938    1.205105
 1.oestrogen |   1.150568   .0645736     2.50   0.012     1.030719    1.284354
1.flu_vac~ne |   .9708509   .0111823    -2.57   0.010     .9491795     .993017
             |
         ckd |
        CKD  |   1.060575   .0105073     5.94   0.000      1.04018     1.08137
      1.copd |   1.224782   .0158716    15.65   0.000     1.194066    1.256288
1.other_re~y |   1.191877   .0204241    10.24   0.000     1.152511    1.232587
1.immunode~y |   1.133176   .0586821     2.41   0.016     1.023805     1.25423
    1.cancer |   1.224531   .0133595    18.57   0.000     1.198625    1.250997
1.ae_atten~r |   1.698633   .0155805    57.76   0.000     1.668369    1.729447
1.gp_consult |   .8751168   .0272444    -4.28   0.000     .8233152    .9301776
1.antiplat~t |   1.109008    .018993     6.04   0.000       1.0724    1.146865
1.care_ho~ce |   5.269692   .0960437    91.19   0.000     5.084772    5.461336
             |
   ethnicity |
      Mixed  |   .9803162   .0854564    -0.23   0.820     .8263518    1.162967
Asian or ..  |   .9656333    .037826    -0.89   0.372     .8942702    1.042691
      Black  |   .9424313   .0558593    -1.00   0.317     .8390692    1.058526
      Other  |   .9648143   .0621477    -0.56   0.578     .8503824    1.094645
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar3_et
> hn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -262169.97
Iteration 1:   log likelihood = -255064.55
Iteration 2:   log likelihood = -253550.14
Iteration 3:   log likelihood = -253538.07
Iteration 4:   log likelihood = -253538.07
Refining estimates:
Iteration 0:   log likelihood = -253538.07

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,564                  Number of obs    =     273,564
No. of failures =       54,138
Time at risk    =     52008213
                                                LR chi2(34)      =    17263.80
Log likelihood  =   -253538.07                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8560759   .0094168   -14.13   0.000     .8378169    .8747328
      1.male |   1.017933   .0094936     1.91   0.057      .999495    1.036711
        age1 |   .9834079   .0014425   -11.41   0.000     .9805848    .9862391
        age2 |   1.025019    .002814     9.00   0.000     1.019518    1.030549
        age3 |   .9849257   .0180032    -0.83   0.406     .9502646    1.020851
             |
         imd |
          2  |   1.024761   .0158366     1.58   0.113     .9941874    1.056275
          3  |   1.042434   .0165168     2.62   0.009      1.01056    1.075315
          4  |   1.065652   .0175675     3.86   0.000      1.03177    1.100645
5 most de..  |   1.071709   .0186883     3.97   0.000     1.035699     1.10897
             |
   obese4cat |
Obese I ..)  |   .9232072   .0106203    -6.95   0.000     .9026246     .944259
Obese II..)  |   .9717755   .0160698    -1.73   0.083     .9407842    1.003788
Obese II..)  |   .9796935   .0217588    -0.92   0.356     .9379619    1.023282
             |
smoke_nomiss |
     Former  |   1.059953   .0104502     5.91   0.000     1.039667    1.080634
    Current  |    1.11649   .0220854     5.57   0.000     1.074032    1.160626
             |
     diabcat |
Controlle..  |   1.073096   .0116119     6.52   0.000     1.050577    1.096098
Uncontrol..  |   1.187327   .0183308    11.12   0.000     1.151937    1.223804
Diabetes,..  |   .9897646   .0764823    -0.13   0.894     .8506617    1.151614
             |
1.myocardi~t |   1.117033   .0148325     8.34   0.000     1.088337    1.146486
       1.pad |   1.195314    .020928    10.19   0.000     1.154992    1.237044
1.hyperten~n |   1.023763   .0104252     2.31   0.021     1.003532    1.044401
1.heart_f~re |   1.156699    .011391    14.78   0.000     1.134587    1.179242
1.stroke_tia |   1.132455   .0115997    12.14   0.000     1.109947     1.15542
       1.vte |   1.170134   .0176431    10.42   0.000      1.13606     1.20523
 1.oestrogen |   1.151013   .0645963     2.51   0.012     1.031121    1.284845
1.flu_vac~ne |   .9709216   .0111816    -2.56   0.010     .9492515    .9930864
             |
         ckd |
        CKD  |   1.060397   .0105043     5.92   0.000     1.040007    1.081186
      1.copd |   1.225147   .0158736    15.67   0.000     1.194427    1.256657
1.other_re~y |   1.191846   .0204232    10.24   0.000     1.152482    1.232555
1.immunode~y |   1.133191   .0586809     2.41   0.016     1.023823    1.254243
    1.cancer |   1.224798   .0133598    18.59   0.000     1.198891    1.251264
1.ae_atten~r |   1.698434   .0155777    57.75   0.000     1.668175    1.729241
1.gp_consult |   .8750857   .0272436    -4.29   0.000     .8232857    .9301448
1.antiplat~t |   1.108721   .0189858     6.03   0.000     1.072127    1.146564
1.care_ho~ce |   5.271523     .09606    91.22   0.000     5.086572      5.4632
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multi
> var3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_4/covidtest_multivar3_wi
> thoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_4/table3_covidtest.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,348    3.88e+07           0   3.88e+07   3.88e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     68,220    1.32e+07           0   1.32e+07   1.32e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7730981   .0081583   -24.39   0.000     .7572724    .7892545
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7622791   .0080855   -25.59   0.000     .7465955    .7782922
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8012425   .0087712   -20.24   0.000     .7842344    .8186194
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8013898   .0087717   -20.23   0.000     .7843807    .8187678
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8559212   .0094161   -14.14   0.000     .8376635    .8745769
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8560759   .0094168   -14.13   0.000     .8378169    .8747328
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_4/06b_an_models_ethni
> city_covidtest.log
  log type:  text
 closed on:   1 Mar 2021, 22:22:23
-------------------------------------------------------------------------------
