-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/00_cr_create_analysis_dataset.log
  log type:  text
 opened on:  31 Dec 2020, 11:20:07

. 
. 
. *import the file=============================================================
> ==*/ 
. 
. import delimited `c(pwd)'/output/`inputfile'.csv, clear
(90 vars, 511,375 obs)

. 
. /* describe VARAIBLES========================================================
> ===*/
. des, f

Contains data
  obs:       511,375                          
 vars:            90                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
patient_id      long    %12.0g                
dereg_date      str10   %10s                  
af              byte    %8.0g                 
valvular_af     str7    %9s                   valvular_AF
antiphospholipid_syndrome
                str7    %9s                   
died_ons_covid_flag_any
                byte    %8.0g                 
died_ons_covid_flag_underlying
                byte    %8.0g                 
died_date_ons   str10   %10s                  
first_tested_for_covid
                str10   %10s                  
first_positive_test_date
                str10   %10s                  
covid_admission_date
                str10   %10s                  
covid_admission_primary_dx
                str5    %9s                   
lmwh_last_four_months
                byte    %8.0g                 
warfarin_last_four_months
                byte    %8.0g                 
doac_last_four_months
                byte    %8.0g                 
warfarin_march_first
                str10   %10s                  
doac_march_first
                str10   %10s                  
warfarin_march_last
                str10   %10s                  
doac_march_last str10   %10s                  
warfarin_apr_first
                str10   %10s                  
doac_apr_first  str10   %10s                  
warfarin_apr_last
                str10   %10s                  
doac_apr_last   str10   %10s                  
warfarin_may_first
                str10   %10s                  
doac_may_first  str10   %10s                  
warfarin_may_last
                str10   %10s                  
doac_may_last   str10   %10s                  
warfarin_jun_first
                str10   %10s                  
doac_jun_first  str10   %10s                  
warfarin_jun_last
                str10   %10s                  
doac_jun_last   str10   %10s                  
warfarin_jul_first
                str10   %10s                  
doac_jul_first  str10   %10s                  
warfarin_jul_last
                str10   %10s                  
doac_jul_last   str10   %10s                  
warfarin_aug_first
                str10   %10s                  
doac_aug_first  str10   %10s                  
warfarin_aug_last
                str10   %10s                  
doac_aug_last   str10   %10s                  
warfarin_sep_first
                str10   %10s                  
doac_sep_first  str10   %10s                  
warfarin_sep_last
                str10   %10s                  
doac_sep_last   str10   %10s                  
age             int     %8.0g                 
sex             str1    %9s                   
bmi             float   %9.0g                 
bmi_date_measured
                str7    %9s                   
stp             str9    %9s                   
msoa            str9    %9s                   
practice_id     long    %12.0g                
care_home_type  str2    %9s                   
imd             long    %12.0g                
ethnicity       byte    %8.0g                 
ethnicity_date  int     %8.0g                 
smoking_status  str1    %9s                   
smoking_status_date
                str7    %9s                   
hypertension    str7    %9s                   
heart_failure   str7    %9s                   
diabetes        str7    %9s                   
hba1c_mmol_per_mol
                float   %9.0g                 
hba1c_mmol_per_mol_date
                str7    %9s                   
hba1c_percentage
                float   %9.0g                 
hba1c_percentage_date
                str7    %9s                   
copd            str7    %9s                   
other_respiratory
                str7    %9s                   
cancer          str7    %9s                   
permanent_immunodeficiency
                str7    %9s                   
aplastic_anaemia
                str7    %9s                   
temporary_immunodeficiency
                str7    %9s                   
creatinine      float   %9.0g                 
creatinine_date str7    %9s                   
esrf            str7    %9s                   
stroke          str7    %9s                   
tia             str7    %9s                   
myocardial_infarct
                str7    %9s                   
pad             str7    %9s                   
vte             str7    %9s                   
flu_vaccine_tpp_table
                int     %8.0g                 
flu_vaccine_med str10   %10s                  
flu_vaccine_clinical
                str7    %9s                   
flu_vaccine     byte    %8.0g                 
ae_attendance_last_year
                byte    %8.0g                 
gp_consult_count
                int     %8.0g                 
has_consultation_history
                byte    %8.0g                 
oestrogen       str7    %9s                   
antiplatelet    str7    %9s                   
set_id          long    %12.0g                
randomise       float   %9.0g                 
case            byte    %8.0g                 
indexdate       str10   %10s                  
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates are given with month only, so adding day 15 to enable
>    them to be processed as dates                                             
>                                              */
. 
. foreach var of varlist  aplastic_anaemia                                ///
>                                                 bmi_date_measured            
>                    ///
>                                                 copd                         
>                    ///
>                                                 creatinine_date              
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 heart_failure                
>                    ///
>                                                 hypertension                 
>                    ///
>                                                 hba1c_percentage_date        
>            ///
>                                                 hba1c_mmol_per_mol_date      
>            ///
>                                                 esrf                         
>                            ///
>                         cancer                                          ///
>                                                 other_respiratory            
>                    ///
>                                                 permanent_immunodeficiency   
>    ///
>                                                 smoking_status_date          
>                    ///
>                                                 temporary_immunodeficiency   
>    ///
>                                                 af                           
>    ///
>                                                 valvular_af                  
>    ///
>                                                 stroke                       
>    ///
>                                                 tia                          
>    ///
>                                                 vte                          
>    ///
>                                                 myocardial_infarct           
>        ///
>                                                 pad                          
>    ///
>                                                 antiphospholipid_syndrome    
>    ///
>                                                 lmwh_last_four_months        
>    ///
>                                                 oestrogen                    
>    ///
>                                                 antiplatelet                 
>    ///
>                       {
  2.                 
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable aplastic_anaemia was str7 now str10
(511,375 real changes made)
(511,372 real changes made)
(511,372 missing values generated)
variable bmi_date_measured was str7 now str10
(511,375 real changes made)
(35,575 real changes made)
(35,575 missing values generated)
variable copd was str7 now str10
(511,375 real changes made)
(466,938 real changes made)
(466,938 missing values generated)
variable creatinine_date was str7 now str10
(511,375 real changes made)
(163,336 real changes made)
(163,336 missing values generated)
variable diabetes was str7 now str10
(511,375 real changes made)
(401,003 real changes made)
(401,003 missing values generated)
variable heart_failure was str7 now str10
(511,375 real changes made)
(495,854 real changes made)
(495,854 missing values generated)
variable hypertension was str7 now str10
(511,375 real changes made)
(261,656 real changes made)
(261,656 missing values generated)
variable hba1c_percentage_date was str7 now str10
(511,375 real changes made)
(314,715 real changes made)
(314,715 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(511,375 real changes made)
(96,068 real changes made)
(96,068 missing values generated)
variable esrf was str7 now str10
(511,375 real changes made)
(510,080 real changes made)
(510,080 missing values generated)
variable cancer was str7 now str10
(511,375 real changes made)
(440,961 real changes made)
(440,961 missing values generated)
variable other_respiratory was str7 now str10
(511,375 real changes made)
(494,709 real changes made)
(494,709 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(511,375 real changes made)
(508,122 real changes made)
(508,122 missing values generated)
variable smoking_status_date was str7 now str10
(511,375 real changes made)
(1,192 real changes made)
(1,192 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(511,375 real changes made)
(511,116 real changes made)
(511,116 missing values generated)
variable valvular_af was str7 now str10
(511,375 real changes made)
(508,496 real changes made)
(508,496 missing values generated)
variable stroke was str7 now str10
(511,375 real changes made)
(485,771 real changes made)
(485,771 missing values generated)
variable tia was str7 now str10
(511,375 real changes made)
(490,494 real changes made)
(490,494 missing values generated)
variable vte was str7 now str10
(511,375 real changes made)
(498,459 real changes made)
(498,459 missing values generated)
variable myocardial_infarct was str7 now str10
(511,375 real changes made)
(479,001 real changes made)
(479,001 missing values generated)
variable pad was str7 now str10
(511,375 real changes made)
(496,986 real changes made)
(496,986 missing values generated)
variable antiphospholipid_syndrome was str7 now str10
(511,375 real changes made)
(511,253 real changes made)
(511,253 missing values generated)
variable oestrogen was str7 now str10
(511,375 real changes made)
(507,061 real changes made)
(507,061 missing values generated)
variable antiplatelet was str7 now str10
(511,375 real changes made)
(405,871 real changes made)
(405,871 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. /* RENAME VARAIBLES==========================================================
> =*/
. *  An extra 'date' added to the end of some variable names, remove 
. 
. rename creatinine_date_date                     creatinine_measured_date

. rename smoking_status_date_date                 smoking_status_measured_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename hba1c_percentage_date_date               hb1ac_percentage_date 

. rename hba1c_mmol_per_mol_date_date             hba1c_mmol_per_mol_date

. 
. * Some names too long for loops below, shorten
. 
. rename permanent_immunodeficiency_date perm_immunodef_date

. rename temporary_immunodeficiency_date temp_immunodef_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  bmi_measured_date                                    
>    ///
>                                                 copd_date                    
>                    ///
>                                                 creatinine_measured_date     
>                    ///
>                                                 diabetes_date                
>                    ///
>                                                 heart_failure_date           
>                            ///
>                                                 hypertension_date            
>                    ///
>                                                 esrf_date                    
>                                    ///
>                         cancer_date                                     ///
>                                                 other_respiratory_date       
>                    ///
>                                                 smoking_status_measured_date 
>            ///
>                                                 stroke_date                  
>        ///
>                                                 af_date                      
>        ///
>                                                 valvular_af_date             
>                            ///
>                                                 tia_date                     
>        ///
>                                                 vte_date                     
>        ///
>                                                 myocardial_infarct_date      
>        ///
>                                                 pad_date                     
>        ///
>                                                 antiphospholipid_syndrome_dat
> e      ///
>                                                 oestrogen_date               
>        ///
>                                                 antiplatelet_date            
>        /// 
>                                                 {
  2.         
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(107,387 missing values generated)

. replace male = 0 if sex == "F"
(107,387 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(118,988 real changes made, 118,988 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(511,343 missing values generated)

. replace stp = sum(stp)
(511,374 real changes made)

. drop stp_old

. 
. * Care home residence
. gen care_home_residence = 0 if care_home_type == "U"
(3,036 missing values generated)

. replace care_home_residence = 1 if care_home_type != "" & care_home_type != "
> U"  
(3,036 real changes made)

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(511,375 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 409126 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age
. gen     agegroup=1 if age>=18 & age<40
(510,128 missing values generated)

. replace agegroup=2 if age>=40 & age<50
(7,490 real changes made)

. replace agegroup=3 if age>=50 & age<60
(46,059 real changes made)

. replace agegroup=4 if age>=60 & age<70
(155,830 real changes made)

. replace agegroup=5 if age>=70 & age<80
(223,943 real changes made)

. replace agegroup=6 if age>=80
(76,806 real changes made)

. replace agegroup=. if age==.
(0 real changes made)

. 
. label define agegroup   1 "18-<40" ///
>                                                 2 "40-<50" ///
>                                                 3 "50-<60" ///
>                                                 4 "60-<70" ///
>                                                 5 "70-<80" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age < .

. datacheck agegroup !=. , nolist

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(36,991 real changes made, 36,991 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(2,415 real changes made, 2,415 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(35,575 missing values generated)

. gen bmi_age = age - bmi_time
(35,575 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
([REDACTED] real changes made, [REDACTED] to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(3,834 real changes made, 3,834 to missing)

. replace bmi_measured_date = . if bmi == . 
(0 real changes made)

. 
. gen     bmicat = .
(511,375 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 5149 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 132425 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 198462 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 95560 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 29252 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 11118 changes made)

. replace bmicat = .u if bmi >= .
(39,409 real changes made, 39,409 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(506226 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(328,232 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(273,179 real changes made)

. replace smoke = 3  if smoking_status == "S"
(53,861 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,192 real changes made, 1,192 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(1192 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /* GP consultation rate */ 
. replace gp_consult_count = 0 if gp_consult_count <1 
(0 real changes made)

. 
. * those with no count assumed to have no visits 
. replace gp_consult_count = 0 if gp_consult_count == . 
(0 real changes made)

. gen gp_consult = (gp_consult_count >=1)

. 
. /* A&E attendance rate */
. rename ae_attendance_last_year ae_attendance_count

. replace ae_attendance_count = 0 if ae_attendance_count <1 
(0 real changes made)

. 
. * those with no count assumed to have no visits 
. replace ae_attendance_count = 0 if ae_attendance_count == . 
(0 real changes made)

. gen ae_attendance_last_year = (ae_attendance_count >=1)

. 
. /* Vaccines */ 
. replace flu_vaccine = 0 if flu_vaccine == . 
(0 real changes made)

. 
. /* Immunosuppression */
. 
. * Immunosuppressed:
. * permanent immunodeficiency ever, OR 
. * temporary immunodeficiency or aplastic anaemia last year
. * in python, index date not inclusive for defining temp_immunodef_date & apla
> stic_anaemia_date
. gen temp1  = (perm_immunodef_date               < .)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. gen temp3  = inrange(aplastic_anaemia_date, (date("$indexdate", "DMY") - 365)
> , date("$indexdate", "DMY"))

. 
. egen immunodef_any = rowmax(temp1 temp2 temp3)

. drop temp1 temp2 temp3

. order immunodef_any, after(temp_immunodef_date)

. 
. /* eGFR */
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(163,785 real changes made, 163,785 to missing)

. 
. * Remove creatinine dates if no measurements, and vice versa 
. replace creatinine = . if creatinine_measured_date == . 
(0 real changes made)

. replace creatinine_measured_date = . if creatinine == . 
(449 real changes made, 449 to missing)

. replace creatinine_measured = . if creatinine == . 
(163,785 real changes made, 163,785 to missing)

. 
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(163,785 missing values generated)

. 
. gen min = .
(511,375 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(65,563 real changes made)

. replace min = SCr_adj/0.9 if male==1
(282,027 real changes made)

. replace min = min^-0.329  if male==0
(65,563 real changes made)

. replace min = min^-0.411  if male==1
(282,027 real changes made)

. replace min = 1 if min<1
(242,056 real changes made)

. 
. gen max=.
(511,375 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(65,563 real changes made)

. replace max=SCr_adj/0.9 if male==1
(282,027 real changes made)

. replace max=max^-1.209
(347,590 real changes made)

. replace max=1 if max>1
(269,319 real changes made)

. 
. gen egfr=min*max*141
(163,785 missing values generated)

. replace egfr=egfr*(0.993^age)
(347,590 real changes made)

. replace egfr=egfr*1.018 if male==0
(65,563 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(163785 missing values generated)

. recode egfr_cat 0 = 5 15 = 4 30 = 3 45 = 2 60 = 0, generate(ckd_egfr)
(347590 differences between egfr_cat and ckd_egfr)

. 
. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. 
. * Add in end stage renal failure and create a single CKD variable 
. * Missing assumed to not have CKD 
. gen ckd = 0

. replace ckd = 1 if ckd_egfr != . & ckd_egfr >= 1
(64,900 real changes made)

. replace ckd = 1 if esrf == 1
(505 real changes made)

. 
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. label var ckd "CKD stage calc without eth"

. 
. * Create date (most recent measure prior to index)
. gen temp1_ckd_date = creatinine_measured_date if ckd_egfr >=1
(446,475 missing values generated)

. gen temp2_ckd_date = esrf_date if esrf == 1
(510,080 missing values generated)

. gen ckd_date = max(temp1_ckd_date,temp2_ckd_date) 
(445,970 missing values generated)

. format ckd_date %td

. 
. * End stage kidney failure (For exclusion)
. gen eskf_exclusion = 1 if egfr != . & egfr < 15
(510,526 missing values generated)

. replace eskf_exclusion = 1 if esrf == 1
(920 real changes made)

. replace eskf_exclusion = 0 if eskf_exclusion == .
(509,606 real changes made)

. 
. label define eskf_exclusion 0 "No End stage kidney failure" 1 "End stage kidn
> ey failure"

. label values eskf_exclusion eskf_exclusion

. 
. /* Hb1AC */
. 
. /* Diabetes severity */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(394,320 real changes made, 394,320 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(98,237 real changes made, 98,237 to missing)

. 
. /* Express HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_perc~e |    117,055    6.454538      3.5034         .1        315
hba1c_mmol~l |    413,138    43.04562    157.1651         .7      41000

. gen      hba1c_pct = hba1c_percentage 
(394,320 missing values generated)

. replace  hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<.
>  
(413,138 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(22 real changes made, 22 to missing)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(413,140 real changes made)

. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(171,187 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(42,694 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(11,157 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(11,451 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(10,102 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if diabetes==0
(110,372 missing values generated)

. replace diabcat = 2 if diabetes==1 & inlist(hba1ccat, 0, 1)
(76,616 real changes made)

. replace diabcat = 3 if diabetes==1 & inlist(hba1ccat, 2, 3, 4)
(32,493 real changes made)

. replace diabcat = 4 if diabetes==1 & !inlist(hba1ccat, 0, 1, 2, 3, 4)
(1,263 real changes made)

. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "Controlled diabetes"      
>    ///
>                                                 3 "Uncontrolled diabetes"    
>    ///
>                                                 4 "Diabetes, no hba1c measure
> "

. label values diabcat diabcat

. 
. * Delete unneeded variables
. drop hba1c_pct hba1c_percentage hba1c_mmol_per_mol

. 
. * Group stroke and transient ischaemic attack into one variable
. gen stroke_tia = 1 if stroke == 1 | tia == 1
(475,186 missing values generated)

. replace stroke_tia = 0 if stroke_tia == .
(475,186 real changes made)

. 
. /* Calculate CHA2DS2-VASc score */
. * Age component
. gen     chadsvas_age = 0 if age >= 18 & age < 65
(400,825 missing values generated)

. replace chadsvas_age = 1 if age >= 65 & age < 75
(268,830 real changes made)

. replace chadsvas_age = 2 if age >= 75
(131,995 real changes made)

. 
. * Sex component
. gen     chadsvas_sex = 1 if sex == "F"
(403,988 missing values generated)

. replace chadsvas_sex = 0 if sex == "M"
(403,988 real changes made)

. 
. * Heart failure history component
. gen     chadsvas_hf = 1 if heart_failure == 1
(495,854 missing values generated)

. replace chadsvas_hf = 0 if chadsvas_hf == .
(495,854 real changes made)

. 
. * hypertension component
. gen     chadsvas_ht = 1 if hypertension == 1
(261,656 missing values generated)

. replace chadsvas_ht = 0 if chadsvas_ht == .
(261,656 real changes made)

.                                                 
. * Stroke/TIA/thromboembolism history component
. gen     chadsvas_stroke= 2 if ///
>                 stroke == 1 | tia == 1 | vte == 1
(463,753 missing values generated)

.                 
. replace chadsvas_stroke = 0 if chadsvas_stroke == .
(463,753 real changes made)

. 
. * Vascular disease component (Mycardial infarction/Peripheral artery disease)
. gen     chadsvas_vascular = 1 if ///
>                 myocardial_infarct == 1 | pad == 1
(467,232 missing values generated)

.                 
. replace chadsvas_vascular = 0 if chadsvas_vascular == .
(467,232 real changes made)

. 
. * Diabetes component 
. gen     chadsvas_dm = 1 if ///
>                 diabcat !=. & diabcat > 1 
(401,003 missing values generated)

.                 
. replace chadsvas_dm = 0 if chadsvas_dm == .
(401,003 real changes made)

. 
. * Calculate the score
. gen CHA2DS2_VASc_score = chadsvas_age + chadsvas_sex + chadsvas_hf + chadsvas
> _ht ///
>                                                 + chadsvas_stroke + chadsvas_
> vascular + chadsvas_dm

. 
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var practice_id               "Practice ID"

. label var care_home_residence       "Care home residence"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Evidence of obesity 
> (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var CHA2DS2_VASc_score        "Calculated CHA2DS2_VASc_score"

. 
. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. 
. * Exposure variables (date)
. label var warfarin_last_four_months "latest date of warfarin Rx in past 4 mon
> ths"

. label var doac_last_four_months     "latest date of DOAC Rx in past 4 months"

. 
. * Exposure variables (Time-updated variable)
. label var warfarin_march_first      "earliest date of warfarin Rx in March 20
> 20"

. label var doac_march_first          "earliest date of DOAC Rx in March 2020"

. label var warfarin_apr_first        "earliest date of warfarin Rx in April 20
> 20"

. label var doac_apr_first            "earliest date of DOAC Rx in April 2020"

. label var warfarin_may_first        "earliest date of warfarin Rx in May 2020
> "

. label var doac_may_first            "earliest date of DOAC Rx in May 2020"

. label var warfarin_jun_first        "earliest date of warfarin Rx in June 202
> 0"

. label var doac_jun_first            "earliest date of DOAC Rx in June 2020"

. label var warfarin_jul_first        "earliest date of warfarin Rx in July 202
> 0"

. label var doac_jul_first            "earliest date of DOAC Rx in July 2020"

. label var warfarin_aug_first        "earliest date of warfarin Rx in Aug 2020
> "

. label var doac_aug_first            "earliest date of DOAC Rx in Aug 2020"

. label var warfarin_sep_first        "earliest date of warfarin Rx in Sep 2020
> "

. label var doac_sep_first            "earliest date of DOAC Rx in Sep 2020"

. 
. label var warfarin_march_last       "latest date of warfarin Rx in March 2020
> "

. label var doac_march_last           "latest date of DOAC Rx in March 2020"

. label var warfarin_apr_last         "latest date of warfarin Rx in April 2020
> "

. label var doac_apr_last             "latest date of DOAC Rx in April 2020"

. label var warfarin_may_last         "latest date of warfarin Rx in May 2020"

. label var doac_may_last             "latest date of DOAC Rx in May 2020"

. label var warfarin_jun_last         "latest date of warfarin Rx in June 2020"

. label var doac_jun_last             "latest date of DOAC Rx in June 2020"

. label var warfarin_jul_last         "latest date of warfarin Rx in July 2020"

. label var doac_jul_last             "latest date of DOAC Rx in July 2020"

. label var warfarin_aug_last         "latest date of warfarin Rx in Aug 2020"

. label var doac_aug_last             "latest date of DOAC Rx in Aug 2020"

. label var warfarin_sep_last         "latest date of warfarin Rx in Sep 2020"

. label var doac_sep_last             "latest date of DOAC Rx in Sep 2020"

. 
. * Comorbidities/medications of interest
. label var ckd                                                   "Chronic kidn
> ey disease" 

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var heart_failure                             "Heart Failure"

. label var other_respiratory                     "Other Respiratory Diseases"

. label var copd                                                  "COPD"

. label var diabetes                                              "Diabetes"

. label var cancer                                        "Cancer"

. label var immunodef_any                                 "Immunosuppressed (co
> mbination algorithm)"

. label var diabcat                                               "Diabetes Sev
> erity"

. label var stroke                        "Stroke"

. label var myocardial_infarct                    "Myocardial infarction"

. label var tia                           "Transient ischaemic attack"

. label var stroke_tia                                    "Stroke/Transient isc
> haemic attack"

. label var vte                           "Venous thromboembolism"

. label var pad                                           "Peripheral arterial 
> disease"

. label var oestrogen                                     "Recent Oestrogen"

. label var antiplatelet                      "Recent antiplatelet"

. label var flu_vaccine                                   "Flu vaccine"

. label var gp_consult                                    "GP consultation in l
> ast year (binary)"

. label var gp_consult_count                              "GP consultation coun
> t"

. label var ae_attendance_last_year       "A&E attendance rate in last year (bi
> nary)"

. label var ae_attendance_count           "A&E attendance count"

. label var ckd_date                                      "Chronic kidney disea
> se Date" 

. label var hypertension_date                         "Diagnosed hypertension D
> ate"

. label var heart_failure_date                    "Heart Failure Date"

. label var other_respiratory_date                "Other Respiratory Diseases D
> ate"

. label var copd_date                                     "COPD Date"

. label var diabetes_date                                 "Diabetes Date"

. label var cancer_date                           "Cancer Date"

. label var myocardial_infarct_date       "Myocardial infarction Date"

. label var stroke_date                           "Stroke Date"

. label var tia_date                                          "Transient ischae
> mic attack Date"

. label var vte_date                                      "Venous thromboemboli
> sm Date"

. label var pad_date                                              "Peripheral a
> rterial disease Date"

. 
. label var oestrogen_date                                "Recent Oestrogen Dat
> e"

. label var antiplatelet_date                             "Recent antiplatelet 
> Date"

. 
. *Inclusion/Exclusion criteria related variables
. label var af_date                                          "Atrial fibrillati
> on Date"                                                   

. label var valvular_af_date             "Valvular atrial fibrillation Date"

. label var antiphospholipid_syndrome_date "Antiphospholipid_syndrome Date"

. label var lmwh_last_four_months_date   "latest date of LMWH exposure in past 
> 4 months"

. label var eskf_exclusion                "End stage kidney failure/kidney tran
> splant/dialysis" 

. 
. *Outcome/right censoring related variables
. label var died_date_ons                 "ONS death date (any cause)"

. label var died_ons_covid_flag_any       "Binary indicator: ONS any covid"

. label var died_ons_covid_flag_underlying "Binary indicator: ONS underlying co
> vid (subset of any)"

. label var dereg_date                     "Deregistration date from GP"

. label var covid_admission_date           "Date of hospital admission due to C
> OVID"

. label var covid_admission_primary_dx     "Primary hospitalisation admission d
> ue to COVID"

. label var first_tested_for_covid         "Date of COVID-19 test"

. label var first_positive_test_date       "Date of positive COVID-19 test"

. 
. /* ==================================================================*/
. 
. save $tempdir/format_dataset, replace
(note: file /workspace/output/oac_match_tempdata/format_dataset.dta not found)
file /workspace/output/oac_match_tempdata/format_dataset.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/00_cr_create_analysis_dataset.log
  log type:  text
 closed on:  31 Dec 2020, 11:21:05
-------------------------------------------------------------------------------
