-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 11:26:50

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |
 indicating |   Failure/censoring
        the |     indicator for
   exposure |  outcome: SUS covid
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   509,962      1,413 |   511,375 
            |     99.72       0.28 |    100.00 
------------+----------------------+----------
current use |    51,583        165 |    51,748 
            |     99.68       0.32 |    100.00 
------------+----------------------+----------
      Total |   561,545      1,578 |   563,123 
            |     99.72       0.28 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3736.1497
Iteration 1:   log likelihood = -3735.1576
Iteration 2:   log likelihood = -3735.1552
Iteration 3:   log likelihood = -3735.1552
Refining estimates:
Iteration 0:   log likelihood = -3735.1552

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,578
Time at risk    =    117422425
                                                LR chi2(1)       =        1.99
Log likelihood  =   -3735.1552                  Prob > chi2      =      0.1584

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.125537   .0929377     1.43   0.152     .9573581     1.32326
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_univar.ster not fou
> nd)
file /workspace/output/oac_match_tempdata/admitcovid_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3736.1497
Iteration 1:   log likelihood = -3731.7532
Iteration 2:   log likelihood = -3731.7029
Iteration 3:   log likelihood = -3731.7029
Refining estimates:
Iteration 0:   log likelihood = -3731.7029

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,578
Time at risk    =    117422425
                                                LR chi2(4)       =        8.89
Log likelihood  =   -3731.7029                  Prob > chi2      =      0.0638

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.396611   .1808165     2.58   0.010     1.083607    1.800026
      1.male |          1  (omitted)
        age1 |   .8335637    .133898    -1.13   0.257     .6084258     1.14201
        age2 |   1.247345   .1296585     2.13   0.033     1.017434     1.52921
        age3 |   .7959884   .1652262    -1.10   0.272     .5299315    1.195622
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar1.ster not 
> found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3736.1497
Iteration 1:   log likelihood = -3584.1963
Iteration 2:   log likelihood = -3578.0406
Iteration 3:   log likelihood = -3578.0378
Refining estimates:
Iteration 0:   log likelihood = -3578.0378

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,578
Time at risk    =    117422425
                                                LR chi2(25)      =      316.22
Log likelihood  =   -3578.0378                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.309729    .173698     2.03   0.042     1.009936    1.698513
      1.male |          1  (omitted)
        age1 |   1.004279   .1636366     0.03   0.979     .7297265    1.382129
        age2 |   1.132244   .1198281     1.17   0.241     .9201427    1.393236
        age3 |    .697385   .1506599    -1.67   0.095     .4566493    1.065031
             |
         imd |
          2  |   1.186803   .1205398     1.69   0.092     .9725792    1.448213
          3  |   1.315387   .1359093     2.65   0.008     1.074249    1.610653
          4  |    1.46543   .1552421     3.61   0.000     1.190672    1.803592
5 most de..  |   1.655398    .178656     4.67   0.000     1.339794    2.045347
             |
   obese4cat |
Obese I ..)  |   1.134923   .0800647     1.79   0.073     .9883648    1.303214
Obese II..)  |   1.753337   .1774935     5.55   0.000     1.437794     2.13813
Obese II..)  |   1.670857   .2829399     3.03   0.002     1.198943    2.328521
             |
smoke_nomiss |
     Former  |   1.323235   .0836634     4.43   0.000     1.169011    1.497806
    Current  |   .8054511   .0942505    -1.85   0.064     .6403761    1.013079
             |
     diabcat |
Controlle..  |   1.455855   .1029706     5.31   0.000       1.2674    1.672332
Uncontrol..  |   1.905775   .1694559     7.25   0.000     1.600978      2.2686
Diabetes,..  |   .5956695   .4365312    -0.71   0.480     .1416478    2.504961
             |
1.myocardi~t |   1.217662    .117945     2.03   0.042     1.007112    1.472231
       1.pad |   1.266985   .1590857     1.88   0.059     .9905871    1.620505
1.hyperten~n |   .9701356   .0571983    -0.51   0.607      .864264    1.088976
1.heart_f~re |   1.367672   .1476321     2.90   0.004     1.106878    1.689912
1.stroke_tia |   1.633878   .1416318     5.66   0.000     1.378585    1.936447
       1.vte |   1.425837   .1975139     2.56   0.010     1.086819    1.870607
 1.oestrogen |   1.044226   .4791208     0.09   0.925     .4248535    2.566552
1.antiplat~t |   1.088403   .0806775     1.14   0.253     .9412276    1.258591
1.flu_vac~ne |   .8929771   .0586735    -1.72   0.085     .7850761    1.015708
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar2.ster not 
> found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3736.1497
Iteration 1:   log likelihood =  -3447.321
Iteration 2:   log likelihood = -3436.7252
Iteration 3:   log likelihood = -3436.7219
Iteration 4:   log likelihood = -3436.7219
Refining estimates:
Iteration 0:   log likelihood = -3436.7219

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,578
Time at risk    =    117422425
                                                LR chi2(32)      =      598.86
Log likelihood  =   -3436.7219                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.267833   .1706116     1.76   0.078      .973904     1.65047
      1.male |          1  (omitted)
        age1 |   .8997537   .1492255    -0.64   0.524     .6500557    1.245365
        age2 |   1.216788   .1318803     1.81   0.070      .983917    1.504775
        age3 |   .6481153   .1424913    -1.97   0.049     .4212224    .9972248
             |
         imd |
          2  |    1.15945   .1189475     1.44   0.149     .9482605    1.417674
          3  |   1.232738   .1292519     2.00   0.046     1.003743    1.513975
          4  |   1.367724   .1466205     2.92   0.003     1.108535    1.687515
5 most de..  |   1.492657   .1636165     3.65   0.000     1.204082    1.850392
             |
   obese4cat |
Obese I ..)  |   1.141293   .0815173     1.85   0.064     .9922016    1.312788
Obese II..)  |   1.778311   .1827309     5.60   0.000     1.453925     2.17507
Obese II..)  |   1.601626   .2740247     2.75   0.006     1.145322    2.239724
             |
smoke_nomiss |
     Former  |   1.223085   .0794071     3.10   0.002     1.076945    1.389056
    Current  |   .7102201   .0854046    -2.85   0.004     .5610936    .8989813
             |
     diabcat |
Controlle..  |   1.398368   .1005236     4.66   0.000     1.214596    1.609946
Uncontrol..  |   1.750355   .1590783     6.16   0.000     1.464759    2.091637
Diabetes,..  |   .5415866   .4040703    -0.82   0.411     .1254869    2.337425
             |
1.myocardi~t |   1.188229   .1161673     1.76   0.078     .9810302    1.439189
       1.pad |   1.153025   .1483777     1.11   0.269     .8959866    1.483803
1.hyperten~n |   .9645573   .0578596    -0.60   0.547     .8575671    1.084896
1.heart_f~re |    1.12912   .1249561     1.10   0.272     .9089508    1.402619
1.stroke_tia |   1.483043   .1307333     4.47   0.000     1.247724    1.762743
       1.vte |   1.281765   .1800738     1.77   0.077     .9732494    1.688079
 1.oestrogen |   .9556953    .432683    -0.10   0.920     .3935004    2.321099
1.antiplat~t |   1.034163   .0775161     0.45   0.654     .8928667    1.197819
1.flu_vac~ne |    .866511   .0577976    -2.15   0.032     .7603221    .9875305
             |
         ckd |
        CKD  |   1.398942   .0954156     4.92   0.000     1.223892    1.599029
      1.copd |   1.486114   .1204932     4.89   0.000     1.267761    1.742076
1.other_re~y |   1.516386   .1654014     3.82   0.000     1.224515    1.877826
1.immunode~y |   .7919449   .2529984    -0.73   0.465     .4234149    1.481234
    1.cancer |   1.264161   .0863158     3.43   0.001     1.105817    1.445179
1.ae_atten~r |   2.217243   .1323407    13.34   0.000     1.972457    2.492407
1.gp_consult |   .5719862   .3326961    -0.96   0.337     .1829295    1.788494
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar3.ster not 
> found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table2_admitcovid.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.125537   .0929377     1.43   0.152     .9573581     1.32326
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.396611   .1808165     2.58   0.010     1.083607    1.800026
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.309729    .173698     2.03   0.042     1.009936    1.698513
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.267833   .1706116     1.76   0.078      .973904     1.65047
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 11:29:05
-------------------------------------------------------------------------------
