-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 11:24:07

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |  outcome: ONS covid
   exposure |         death
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   510,350      1,025 |   511,375 
            |     99.80       0.20 |    100.00 
------------+----------------------+----------
current use |    51,618        130 |    51,748 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Total |   561,968      1,155 |   563,123 
            |     99.79       0.21 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2720.9552
Iteration 1:   log likelihood = -2719.0069
Iteration 2:   log likelihood = -2718.9941
Iteration 3:   log likelihood = -2718.9941
Refining estimates:
Iteration 0:   log likelihood = -2718.9941

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,155
Time at risk    =    117566414
                                                LR chi2(1)       =        3.92
Log likelihood  =   -2718.9941                  Prob > chi2      =      0.0477

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.208873   .1130233     2.03   0.042     1.006463     1.45199
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_univar.ster not 
> found)
file /workspace/output/oac_match_tempdata/onscoviddeath_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2720.9552
Iteration 1:   log likelihood = -2715.6243
Iteration 2:   log likelihood = -2715.4082
Iteration 3:   log likelihood =  -2715.408
Refining estimates:
Iteration 0:   log likelihood =  -2715.408

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,155
Time at risk    =    117566414
                                                LR chi2(4)       =       11.09
Log likelihood  =    -2715.408                  Prob > chi2      =      0.0255

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.719114   .2924478     3.18   0.001     1.231692    2.399425
      1.male |          1  (omitted)
        age1 |   .7047312   .1181819    -2.09   0.037     .5073163    .9789672
        age2 |   1.277372   .1306823     2.39   0.017     1.045285     1.56099
        age3 |   .8754585   .1679742    -0.69   0.488     .6010568    1.275133
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1.ster n
> ot found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2720.9552
Iteration 1:   log likelihood = -2587.5616
Iteration 2:   log likelihood =  -2581.049
Iteration 3:   log likelihood =  -2581.045
Refining estimates:
Iteration 0:   log likelihood =  -2581.045

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,155
Time at risk    =    117566414
                                                LR chi2(25)      =      279.82
Log likelihood  =    -2581.045                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.647031   .2833485     2.90   0.004     1.175613    2.307486
      1.male |          1  (omitted)
        age1 |   .8649572   .1470144    -0.85   0.393     .6198952    1.206899
        age2 |   1.164324   .1216775     1.46   0.145     .9486783    1.428988
        age3 |   .7314233   .1473179    -1.55   0.120     .4928628    1.085454
             |
         imd |
          2  |   1.185626   .1374713     1.47   0.142     .9446093    1.488137
          3  |   1.317796   .1531531     2.37   0.018     1.049355    1.654909
          4  |   1.474595   .1791546     3.20   0.001     1.162135    1.871064
5 most de..  |   2.070407   .2564736     5.87   0.000     1.624098    2.639363
             |
   obese4cat |
Obese I ..)  |   1.166352   .0982577     1.83   0.068     .9888292    1.375745
Obese II..)  |   1.576084   .2161914     3.32   0.001     1.204537    2.062237
Obese II..)  |   1.956588    .425453     3.09   0.002     1.277641    2.996334
             |
smoke_nomiss |
     Former  |   1.332229   .1006133     3.80   0.000     1.148931     1.54477
    Current  |   .9978247   .1427148    -0.02   0.988     .7538941    1.320682
             |
     diabcat |
Controlle..  |   1.441187   .1186387     4.44   0.000     1.226448    1.693524
Uncontrol..  |   2.084676   .2180391     7.02   0.000     1.698283     2.55898
Diabetes,..  |   1.272403   .7907207     0.39   0.698     .3764049    4.301247
             |
1.myocardi~t |   1.301968   .1414245     2.43   0.015     1.052301    1.610872
       1.pad |   1.385276   .1885105     2.39   0.017     1.060971    1.808711
1.hyperten~n |   1.051116   .0746842     0.70   0.483     .9144729    1.208177
1.heart_f~re |   1.551495   .1784893     3.82   0.000     1.238299    1.943908
1.stroke_tia |   1.709509   .1613545     5.68   0.000     1.420788      2.0569
       1.vte |   1.606839   .2421082     3.15   0.002     1.195966    2.158867
 1.oestrogen |   .9447003   .7213229    -0.07   0.941      .211525    4.219163
1.antiplat~t |    .925616    .078115    -0.92   0.360     .7845053    1.092109
1.flu_vac~ne |   1.062779   .0867212     0.75   0.456     .9057037    1.247096
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2.ster n
> ot found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2720.9552
Iteration 1:   log likelihood = -2435.9556
Iteration 2:   log likelihood =  -2424.199
Iteration 3:   log likelihood = -2424.1847
Iteration 4:   log likelihood = -2424.1847
Refining estimates:
Iteration 0:   log likelihood = -2424.1847

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        1,155
Time at risk    =    117566414
                                                LR chi2(32)      =      593.54
Log likelihood  =   -2424.1847                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.380714   .2452956     1.82   0.069     .9747213    1.955811
      1.male |          1  (omitted)
        age1 |   .8301396    .144442    -1.07   0.285     .5902615    1.167502
        age2 |   1.197714   .1291508     1.67   0.094     .9695429    1.479582
        age3 |   .6785196    .141198    -1.86   0.062      .451263    1.020223
             |
         imd |
          2  |   1.145256   .1352316     1.15   0.251      .908642    1.443485
          3  |   1.228549   .1457777     1.73   0.083     .9736213    1.550225
          4  |   1.354772   .1679571     2.45   0.014     1.062524    1.727402
5 most de..  |    1.84138   .2333557     4.82   0.000     1.436388     2.36056
             |
   obese4cat |
Obese I ..)  |   1.198011   .1034396     2.09   0.036       1.0115    1.418914
Obese II..)  |   1.637298   .2318285     3.48   0.000     1.240522    2.160982
Obese II..)  |    1.85557    .419552     2.73   0.006     1.191289    2.890264
             |
smoke_nomiss |
     Former  |   1.239032   .0967557     2.74   0.006     1.063193    1.443951
    Current  |   .9069046   .1337731    -0.66   0.508     .6792115    1.210928
             |
     diabcat |
Controlle..  |   1.360262    .115147     3.63   0.000     1.152306    1.605748
Uncontrol..  |   1.906044    .205757     5.98   0.000     1.542573    2.355157
Diabetes,..  |   1.167704   .7500219     0.24   0.809       .33159      4.1121
             |
1.myocardi~t |   1.268358   .1402235     2.15   0.032     1.021262     1.57524
       1.pad |   1.326527   .1862568     2.01   0.044     1.007394    1.746758
1.hyperten~n |   1.055986   .0768353     0.75   0.454     .9156368    1.217848
1.heart_f~re |   1.281086   .1525126     2.08   0.037     1.014479    1.617757
1.stroke_tia |   1.541737   .1490184     4.48   0.000     1.275664    1.863306
       1.vte |   1.374469   .2132939     2.05   0.040     1.014012    1.863059
 1.oestrogen |   .8527287   .6579386    -0.21   0.836     .1879536    3.868754
1.antiplat~t |   .8849991   .0759051    -1.42   0.154     .7480601    1.047006
1.flu_vac~ne |    1.05556   .0880545     0.65   0.517     .8963466    1.243054
             |
         ckd |
        CKD  |   1.339538    .100981     3.88   0.000     1.155546    1.552826
      1.copd |   1.231399   .1156611     2.22   0.027      1.02435    1.480299
1.other_re~y |   1.830525   .2183262     5.07   0.000     1.448949    2.312588
1.immunode~y |   1.685155   .5147427     1.71   0.088     .9260492    3.066517
    1.cancer |   1.245978   .0965015     2.84   0.005     1.070495    1.450228
1.ae_atten~r |   2.789348   .1903253    15.03   0.000     2.440185    3.188473
1.gp_consult |   .3291492   .1835295    -1.99   0.046     .1103503    .9817754
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3.ster n
> ot found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table2_onscoviddeath.txt not fou
> nd)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.208873   .1130233     2.03   0.042     1.006463     1.45199
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.719114   .2924478     3.18   0.001     1.231692    2.399425
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.647031   .2833485     2.90   0.004     1.175613    2.307486
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.380714   .2452956     1.82   0.069     .9747213    1.955811
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 11:26:20
-------------------------------------------------------------------------------
