-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:31:23

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the | outcome: first covid
   exposure |         test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   487,710     23,665 |   511,375 
            |     95.37       4.63 |    100.00 
------------+----------------------+----------
current use |    48,491      3,257 |    51,748 
            |     93.71       6.29 |    100.00 
------------+----------------------+----------
      Total |   536,201     26,922 |   563,123 
            |     95.22       4.78 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood =  -62832.81
Iteration 2:   log likelihood = -62830.434
Iteration 3:   log likelihood = -62830.433
Refining estimates:
Iteration 0:   log likelihood = -62830.433

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(1)       =      251.65
Log likelihood  =   -62830.433                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.363711   .0256645    16.48   0.000     1.314326    1.414952
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/covidtest_univar.ster not foun
> d)
file /workspace/output/oac_match_tempdata/covidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood = -62797.193
Iteration 2:   log likelihood = -62791.613
Iteration 3:   log likelihood =  -62791.61
Refining estimates:
Iteration 0:   log likelihood =  -62791.61

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(4)       =      329.29
Log likelihood  =    -62791.61                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.591208   .0434177    17.02   0.000     1.508346    1.678621
      1.male |          1  (omitted)
        age1 |   .9256249   .0400565    -1.79   0.074     .8503529     1.00756
        age2 |   1.103678   .0304316     3.58   0.000     1.045616    1.164964
        age3 |   1.076644       .064     1.24   0.214     .9582382    1.209681
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/covidtest_multivar1.ster not f
> ound)
file /workspace/output/oac_match_tempdata/covidtest_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood = -61983.749
Iteration 2:   log likelihood = -61960.064
Iteration 3:   log likelihood =  -61960.05
Refining estimates:
Iteration 0:   log likelihood =  -61960.05

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(25)      =     1992.41
Log likelihood  =    -61960.05                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.525201   .0428864    15.01   0.000      1.44342    1.611617
      1.male |          1  (omitted)
        age1 |   1.061328   .0465586     1.36   0.175     .9738876    1.156619
        age2 |   1.019761   .0287826     0.69   0.488     .9648804    1.077764
        age3 |   .9861083   .0605997    -0.23   0.820     .8742093     1.11233
             |
         imd |
          2  |    1.06004    .024292     2.54   0.011     1.013482    1.108737
          3  |   1.084528   .0254245     3.46   0.001     1.035824    1.135521
          4  |    1.10046   .0270719     3.89   0.000     1.048659     1.15482
5 most de..  |   1.261278   .0323848     9.04   0.000     1.199376    1.326375
             |
   obese4cat |
Obese I ..)  |   .9950422   .0170167    -0.29   0.771     .9622429    1.028959
Obese II..)  |   1.005962   .0281775     0.21   0.832     .9522233    1.062733
Obese II..)  |   1.070544   .0439344     1.66   0.097     .9878067    1.160212
             |
smoke_nomiss |
     Former  |   1.134511   .0167572     8.54   0.000     1.102139    1.167835
    Current  |   1.193386   .0279513     7.55   0.000     1.139841    1.249447
             |
     diabcat |
Controlle..  |    1.17389   .0215528     8.73   0.000     1.132399    1.216902
Uncontrol..  |   1.408005   .0344857    13.97   0.000     1.342011    1.477244
Diabetes,..  |   1.223106   .1603171     1.54   0.124     .9460065    1.581373
             |
1.myocardi~t |   1.105902   .0287762     3.87   0.000     1.050916    1.163765
       1.pad |   1.340534   .0439701     8.93   0.000     1.257066    1.429545
1.hyperten~n |   1.037462   .0145613     2.62   0.009     1.009312    1.066398
1.heart_f~re |   1.376008   .0391738    11.21   0.000     1.301332     1.45497
1.stroke_tia |   1.336086   .0317683    12.19   0.000     1.275249    1.399824
       1.vte |   1.480245   .0523025    11.10   0.000     1.381203    1.586389
 1.oestrogen |   1.085532    .081123     1.10   0.272     .9376294    1.256764
1.antiplat~t |   1.186695   .0227699     8.92   0.000     1.142896    1.232173
1.flu_vac~ne |   1.043037   .0165573     2.65   0.008     1.011085    1.075999
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/covidtest_multivar2.ster not f
> ound)
file /workspace/output/oac_match_tempdata/covidtest_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood = -60497.023
Iteration 2:   log likelihood = -60423.334
Iteration 3:   log likelihood = -60423.324
Refining estimates:
Iteration 0:   log likelihood = -60423.324

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(32)      =     5065.87
Log likelihood  =   -60423.324                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.388345   .0397649    11.46   0.000     1.312554    1.468512
      1.male |          1  (omitted)
        age1 |   1.032088   .0457268     0.71   0.476     .9462459    1.125717
        age2 |   1.021603   .0291565     0.75   0.454      .966026    1.080377
        age3 |   .9863983   .0612271    -0.22   0.825     .8734078    1.114006
             |
         imd |
          2  |   1.052265   .0242568     2.21   0.027      1.00578    1.100898
          3  |   1.069639   .0252567     2.85   0.004     1.021265    1.120305
          4  |   1.072691   .0265778     2.83   0.005     1.021844    1.126068
5 most de..  |   1.204233   .0312319     7.17   0.000     1.144549    1.267029
             |
   obese4cat |
Obese I ..)  |   1.000177   .0172375     0.01   0.992     .9669559    1.034538
Obese II..)  |   1.015172   .0286457     0.53   0.594     .9605519    1.072898
Obese II..)  |    1.07157   .0443382     1.67   0.095     .9880994    1.162092
             |
smoke_nomiss |
     Former  |   1.094738   .0164679     6.02   0.000     1.062933    1.127495
    Current  |   1.131364   .0272668     5.12   0.000     1.079165    1.186088
             |
     diabcat |
Controlle..  |   1.150359   .0213218     7.56   0.000     1.109319    1.192917
Uncontrol..  |   1.365825   .0338752    12.57   0.000     1.301018    1.433859
Diabetes,..  |   1.187222   .1567568     1.30   0.194     .9165208    1.537878
             |
1.myocardi~t |   1.073135    .028157     2.69   0.007     1.019344    1.129766
       1.pad |   1.283589   .0426906     7.51   0.000     1.202586    1.370049
1.hyperten~n |   1.024855    .014553     1.73   0.084     .9967249    1.053779
1.heart_f~re |   1.245733   .0360152     7.60   0.000     1.177107    1.318359
1.stroke_tia |   1.249236   .0299999     9.27   0.000     1.191799     1.30944
       1.vte |   1.338623   .0478941     8.15   0.000     1.247968    1.435864
 1.oestrogen |   1.047935   .0786582     0.62   0.533     .9045712    1.214019
1.antiplat~t |   1.138665   .0219465     6.74   0.000     1.096453    1.182502
1.flu_vac~ne |   1.010076   .0162033     0.62   0.532      .978812    1.042338
             |
         ckd |
        CKD  |   1.206115   .0218667    10.34   0.000      1.16401    1.249744
      1.copd |   1.173865    .025391     7.41   0.000      1.12514      1.2247
1.other_re~y |   1.439785   .0433564    12.10   0.000     1.357267    1.527319
1.immunode~y |   1.349637   .0873559     4.63   0.000     1.188838    1.532186
    1.cancer |   1.549258   .0257344    26.35   0.000     1.499631    1.600526
1.ae_atten~r |   1.930677   .0290965    43.65   0.000     1.874483    1.988556
1.gp_consult |   .8552364     .11443    -1.17   0.243     .6579548    1.111671
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/covidtest_multivar3.ster not f
> ound)
file /workspace/output/oac_match_tempdata/covidtest_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table2_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.363711   .0256645    16.48   0.000     1.314326    1.414952
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.591208   .0434177    17.02   0.000     1.508346    1.678621
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.525201   .0428864    15.01   0.000      1.44342    1.611617
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.388345   .0397649    11.46   0.000     1.312554    1.468512
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:33:58
-------------------------------------------------------------------------------
