-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_positivecovidtest.lo
> g
  log type:  text
 opened on:  31 Dec 2020, 11:33:25

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   508,557      2,818 |   511,375 
            |     99.45       0.55 |    100.00 
------------+----------------------+----------
current use |    51,419        329 |    51,748 
            |     99.36       0.64 |    100.00 
------------+----------------------+----------
      Total |   559,976      3,147 |   563,123 
            |     99.44       0.56 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7442.7915
Iteration 1:   log likelihood = -7440.7993
Iteration 2:   log likelihood = -7440.7944
Iteration 3:   log likelihood = -7440.7944
Refining estimates:
Iteration 0:   log likelihood = -7440.7944

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        3,147
Time at risk    =    117282194
                                                LR chi2(1)       =        3.99
Log likelihood  =   -7440.7944                  Prob > chi2      =      0.0457

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.126086   .0658839     2.03   0.042     1.004084    1.262911
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_univar.ster 
> not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7442.7915
Iteration 1:   log likelihood = -7437.1087
Iteration 2:   log likelihood = -7437.0797
Iteration 3:   log likelihood = -7437.0797
Refining estimates:
Iteration 0:   log likelihood = -7437.0797

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        3,147
Time at risk    =    117282194
                                                LR chi2(4)       =       11.42
Log likelihood  =   -7437.0797                  Prob > chi2      =      0.0222

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.273803    .107605     2.86   0.004     1.079436     1.50317
      1.male |          1  (omitted)
        age1 |   .9751379   .1107799    -0.22   0.825     .7804873    1.218334
        age2 |   1.104849   .0823676     1.34   0.181      .954652    1.278677
        age3 |   .9725712   .1490741    -0.18   0.856     .7201958    1.313385
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar1.st
> er not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar1.ster save
> d

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7442.7915
Iteration 1:   log likelihood =  -7234.117
Iteration 2:   log likelihood = -7228.9026
Iteration 3:   log likelihood = -7228.9003
Refining estimates:
Iteration 0:   log likelihood = -7228.9003

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        3,147
Time at risk    =    117282194
                                                LR chi2(25)      =      427.78
Log likelihood  =   -7228.9003                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.215718   .1055317     2.25   0.024     1.025518    1.441193
      1.male |          1  (omitted)
        age1 |   1.128749   .1305278     1.05   0.295     .8998392    1.415891
        age2 |   1.024597   .0783503     0.32   0.751     .8819875    1.190266
        age3 |   .8656071   .1384757    -0.90   0.367     .6326298    1.184383
             |
         imd |
          2  |   1.250549   .0900484     3.11   0.002     1.085946    1.440102
          3  |   1.302856   .0958342     3.60   0.000     1.127936    1.504902
          4  |   1.491585   .1119083     5.33   0.000     1.287613    1.727868
5 most de..  |   1.822239   .1394757     7.84   0.000     1.568389    2.117176
             |
   obese4cat |
Obese I ..)  |    1.06081   .0529869     1.18   0.237     .9618795    1.169916
Obese II..)  |   1.236112    .095654     2.74   0.006     1.062158    1.438554
Obese II..)  |   1.428829   .1628051     3.13   0.002     1.142857    1.786359
             |
smoke_nomiss |
     Former  |   1.128796   .0483445     2.83   0.005      1.03791     1.22764
    Current  |   .6028821   .0496526    -6.14   0.000     .5130131    .7084942
             |
     diabcat |
Controlle..  |   1.369153   .0704335     6.11   0.000     1.237837    1.514399
Uncontrol..  |   1.694357   .1114518     8.02   0.000      1.48941    1.927504
Diabetes,..  |   .7072252   .3332715    -0.74   0.462     .2808272    1.781051
             |
1.myocardi~t |   1.033263   .0777838     0.43   0.664      .891523    1.197537
       1.pad |   1.372517   .1316764     3.30   0.001     1.137248    1.656457
1.hyperten~n |   .9780077   .0407109    -0.53   0.593     .9013841    1.061145
1.heart_f~re |   1.165229   .0966543     1.84   0.065      .990388    1.370937
1.stroke_tia |    1.64121   .1047766     7.76   0.000      1.44818     1.85997
       1.vte |   1.596596   .1530348     4.88   0.000     1.323143    1.926563
 1.oestrogen |    1.02536   .2508025     0.10   0.918     .6348528    1.656075
1.antiplat~t |   1.088664   .0597785     1.55   0.122     .9775852    1.212365
1.flu_vac~ne |   .8973274   .0411966    -2.36   0.018     .8201099    .9818154
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar2.st
> er not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar2.ster save
> d

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7442.7915
Iteration 1:   log likelihood = -7017.6748
Iteration 2:   log likelihood = -7004.6204
Iteration 3:   log likelihood = -7004.6189
Refining estimates:
Iteration 0:   log likelihood = -7004.6189

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =        3,147
Time at risk    =    117282194
                                                LR chi2(32)      =      876.35
Log likelihood  =   -7004.6189                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.107053   .0974121     1.16   0.248     .9316851    1.315429
      1.male |          1  (omitted)
        age1 |   1.090045   .1270684     0.74   0.460     .8673983    1.369842
        age2 |   1.040624   .0804267     0.52   0.606     .8943493    1.210823
        age3 |   .8445441   .1364018    -1.05   0.296     .6153828    1.159043
             |
         imd |
          2  |   1.220679   .0884895     2.75   0.006     1.059001    1.407041
          3  |   1.254347   .0932942     3.05   0.002     1.084197      1.4512
          4  |   1.416424   .1074314     4.59   0.000     1.220765    1.643441
5 most de..  |   1.692644   .1313337     6.78   0.000     1.453852    1.970658
             |
   obese4cat |
Obese I ..)  |   1.066074   .0537121     1.27   0.204     .9658312    1.176721
Obese II..)  |    1.24045   .0969581     2.76   0.006     1.064256    1.445813
Obese II..)  |   1.347792   .1555709     2.59   0.010     1.074909    1.689951
             |
smoke_nomiss |
     Former  |   1.083064   .0474852     1.82   0.069     .9938815    1.180249
    Current  |   .5572347   .0469407    -6.94   0.000     .4724263    .6572675
             |
     diabcat |
Controlle..  |   1.328954   .0693228     5.45   0.000     1.199799    1.472013
Uncontrol..  |   1.598197   .1070134     7.00   0.000     1.401635    1.822325
Diabetes,..  |   .6262591    .297989    -0.98   0.325     .2464519    1.591388
             |
1.myocardi~t |   .9953155   .0755691    -0.06   0.951     .8576962    1.155016
       1.pad |   1.299641   .1272012     2.68   0.007     1.072785    1.574468
1.hyperten~n |   .9741638   .0411146    -0.62   0.535     .8968235    1.058174
1.heart_f~re |   1.010426   .0853151     0.12   0.902     .8563145    1.192272
1.stroke_tia |   1.503903   .0973829     6.30   0.000     1.324651    1.707411
       1.vte |    1.42738   .1387804     3.66   0.000     1.179722     1.72703
 1.oestrogen |   1.035222   .2532142     0.14   0.887     .6409589    1.672001
1.antiplat~t |   1.032784    .057181     0.58   0.560     .9265782    1.151164
1.flu_vac~ne |   .8848273   .0410192    -2.64   0.008     .8079753    .9689891
             |
         ckd |
        CKD  |   1.264732   .0648475     4.58   0.000     1.143811    1.398436
      1.copd |   1.195408   .0751783     2.84   0.005      1.05678    1.352221
1.other_re~y |   1.481457   .1246331     4.67   0.000     1.256257    1.747027
1.immunode~y |   1.158263   .2344511     0.73   0.468     .7789511    1.722281
    1.cancer |   1.164412   .0598357     2.96   0.003     1.052848    1.287797
1.ae_atten~r |    2.23871   .0942384    19.14   0.000      2.06142    2.431247
1.gp_consult |   1.081225   .5002435     0.17   0.866     .4366122    2.677541
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar3.st
> er not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar3.ster save
> d

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table2_positivecovidtest.txt not
>  found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.126086   .0658839     2.03   0.042     1.004084    1.262911
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.273803    .107605     2.86   0.004     1.079436     1.50317
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.215718   .1055317     2.25   0.024     1.025518    1.441193
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.107053   .0974121     1.16   0.248     .9316851    1.315429
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_positivecovidtest.lo
> g
  log type:  text
 closed on:  31 Dec 2020, 11:35:53
-------------------------------------------------------------------------------
