-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_admitcovid
> .log
  log type:  text
 opened on:  31 Dec 2020, 11:27:14

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(132,325 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |
 indicating |   Failure/censoring
        the |     indicator for
   exposure |  outcome: SUS covid
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   391,285      1,102 |   392,387 
            |     99.72       0.28 |    100.00 
------------+----------------------+----------
current use |    38,292        119 |    38,411 
            |     99.69       0.31 |    100.00 
------------+----------------------+----------
      Total |   429,577      1,221 |   430,798 
            |     99.72       0.28 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2627.7635
Iteration 1:   log likelihood = -2627.5263
Iteration 2:   log likelihood = -2627.5261
Refining estimates:
Iteration 0:   log likelihood = -2627.5261

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        1,221
Time at risk    =     89897894
                                                LR chi2(1)       =        0.47
Log likelihood  =   -2627.5261                  Prob > chi2      =      0.4908

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.071171   .1059807     0.69   0.487     .8823518    1.300397
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_univar_ethn.ster no
> t found)
file /workspace/output/oac_match_tempdata/admitcovid_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2627.7635
Iteration 1:   log likelihood = -2624.6936
Iteration 2:   log likelihood = -2624.6535
Iteration 3:   log likelihood = -2624.6535
Refining estimates:
Iteration 0:   log likelihood = -2624.6535

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        1,221
Time at risk    =     89897894
                                                LR chi2(4)       =        6.22
Log likelihood  =   -2624.6535                  Prob > chi2      =      0.1833

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.235811   .1970402     1.33   0.184     .9041377    1.689154
      1.male |          1  (omitted)
        age1 |   .8054306   .1543992    -1.13   0.259      .553165    1.172739
        age2 |   1.317342   .1689963     2.15   0.032     1.024475     1.69393
        age3 |   .5980853   .1537383    -2.00   0.046     .3613775    .9898402
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar1_ethn.ster
>  not found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2627.7635
Iteration 1:   log likelihood = -2486.0252
Iteration 2:   log likelihood = -2482.1257
Iteration 3:   log likelihood = -2482.1252
Refining estimates:
Iteration 0:   log likelihood = -2482.1252

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        1,221
Time at risk    =     89897894
                                                LR chi2(29)      =      291.28
Log likelihood  =   -2482.1252                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.219285   .1997932     1.21   0.226     .8843548    1.681063
      1.male |          1  (omitted)
        age1 |    .960249   .1870361    -0.21   0.835     .6555229     1.40663
        age2 |   1.225125   .1590995     1.56   0.118     .9498172    1.580232
        age3 |   .4910168   .1303966    -2.68   0.007     .2917746    .8263143
             |
         imd |
          2  |   1.232627   .1496782     1.72   0.085     .9715613    1.563844
          3  |   1.291098   .1598788     2.06   0.039     1.012869    1.645754
          4  |   1.438953   .1819621     2.88   0.004     1.123074    1.843678
5 most de..  |   1.676239   .2136974     4.05   0.000     1.305628     2.15205
             |
   obese4cat |
Obese I ..)  |   1.150942   .0938667     1.72   0.085      .980918    1.350438
Obese II..)  |   1.731609   .2077081     4.58   0.000     1.368824    2.190546
Obese II..)  |   1.751159   .3419215     2.87   0.004     1.194331    2.567595
             |
smoke_nomiss |
     Former  |   1.467885   .1099889     5.12   0.000     1.267393    1.700093
    Current  |   .8839453   .1222209    -0.89   0.372     .6741118    1.159095
             |
     diabcat |
Controlle..  |    1.46379   .1214767     4.59   0.000     1.244055    1.722337
Uncontrol..  |   1.870912   .1937493     6.05   0.000     1.527229    2.291937
Diabetes,..  |   .8880144   .6804641    -0.15   0.877      .197772    3.987266
             |
1.myocardi~t |   1.195503   .1341556     1.59   0.112     .9594699      1.4896
       1.pad |   1.147027   .1736116     0.91   0.365     .8525849    1.543156
1.hyperten~n |   1.024818   .0706366     0.36   0.722     .8953169     1.17305
1.heart_f~re |   1.347582   .1730884     2.32   0.020     1.047668    1.733351
1.stroke_tia |   1.726312   .1736272     5.43   0.000     1.417451    2.102474
       1.vte |   1.518416   .2401205     2.64   0.008     1.113737    2.070135
 1.oestrogen |   1.566591   .7925082     0.89   0.375     .5812315    4.222426
1.antiplat~t |   1.050774    .090685     0.57   0.566     .8872541     1.24443
1.flu_vac~ne |   .8985035   .0692877    -1.39   0.165     .7724666    1.045105
             |
   ethnicity |
      Mixed  |   1.177368   .5259349     0.37   0.715     .4905433    2.825838
Asian or ..  |   2.165507   .3395904     4.93   0.000     1.592487    2.944715
      Black  |   2.288331   .4715804     4.02   0.000     1.527928    3.427164
      Other  |   .8170892   .3091909    -0.53   0.593     .3891978    1.715413
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar2_ethn.ster
>  not found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2627.7635
Iteration 1:   log likelihood = -2502.0545
Iteration 2:   log likelihood = -2498.5806
Iteration 3:   log likelihood =   -2498.58
Refining estimates:
Iteration 0:   log likelihood =   -2498.58

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        1,221
Time at risk    =     89897894
                                                LR chi2(25)      =      258.37
Log likelihood  =     -2498.58                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.159386   .1888381     0.91   0.364     .8425315      1.5954
      1.male |          1  (omitted)
        age1 |   .9924915   .1921478    -0.04   0.969     .6790988     1.45051
        age2 |   1.205322   .1558362     1.44   0.149     .9355155    1.552941
        age3 |   .4897696   .1299241    -2.69   0.007      .291198    .8237496
             |
         imd |
          2  |    1.23468   .1498962     1.74   0.082     .9732276     1.56637
          3  |     1.2892   .1595368     2.05   0.040     1.011545    1.643067
          4  |   1.452466   .1834247     2.96   0.003     1.133997    1.860372
5 most de..  |   1.696325   .2161057     4.15   0.000     1.321506    2.177454
             |
   obese4cat |
Obese I ..)  |   1.119539   .0908319     1.39   0.164     .9549454    1.312502
Obese II..)  |   1.668662   .1989211     4.30   0.000     1.320981    2.107852
Obese II..)  |   1.671855   .3262666     2.63   0.008     1.140472    2.450828
             |
smoke_nomiss |
     Former  |   1.407027   .1043263     4.61   0.000     1.216714    1.627107
    Current  |   .8229828   .1131172    -1.42   0.156     .6286297    1.077424
             |
     diabcat |
Controlle..  |   1.522052   .1251227     5.11   0.000     1.295553     1.78815
Uncontrol..  |   2.003417   .2048518     6.80   0.000     1.639589     2.44798
Diabetes,..  |    .843197   .6449109    -0.22   0.824     .1883198    3.775393
             |
1.myocardi~t |   1.199371   .1342103     1.62   0.104     .9631711    1.493494
       1.pad |   1.143874   .1728185     0.89   0.374     .8507011    1.538081
1.hyperten~n |    1.03906   .0714089     0.56   0.577      .908118    1.188883
1.heart_f~re |    1.34749      .1728     2.33   0.020     1.048018    1.732536
1.stroke_tia |   1.741185   .1743366     5.54   0.000      1.43093    2.118711
       1.vte |   1.520006   .2398803     2.65   0.008      1.11561     2.07099
 1.oestrogen |   1.545962   .7800093     0.86   0.388     .5750801    4.155941
1.antiplat~t |   1.053818   .0905408     0.61   0.542     .8904979    1.247091
1.flu_vac~ne |   .8851485   .0677733    -1.59   0.111      .761802    1.028467
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar2_withoutet
> hn.ster not found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar2_withoutethn.ster
>  saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2627.7635
Iteration 1:   log likelihood = -2388.7737
Iteration 2:   log likelihood = -2383.0854
Iteration 3:   log likelihood = -2383.0838
Refining estimates:
Iteration 0:   log likelihood = -2383.0838

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        1,221
Time at risk    =     89897894
                                                LR chi2(36)      =      489.36
Log likelihood  =   -2383.0838                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.180956   .1964633     1.00   0.317     .8523696     1.63621
      1.male |          1  (omitted)
        age1 |   .8542465   .1689417    -0.80   0.426      .579754    1.258701
        age2 |   1.321936   .1744895     2.11   0.034     1.020601    1.712242
        age3 |   .4473486   .1204251    -2.99   0.003     .2639397    .7582063
             |
         imd |
          2  |    1.19543    .147044     1.45   0.147     .9393385     1.52134
          3  |   1.192819   .1502747     1.40   0.162     .9318323    1.526902
          4  |   1.319656   .1693925     2.16   0.031     1.026123    1.697156
5 most de..  |   1.520501   .1969281     3.24   0.001     1.179623    1.959884
             |
   obese4cat |
Obese I ..)  |   1.168249   .0969461     1.87   0.061     .9928852    1.374585
Obese II..)  |   1.768081   .2156256     4.67   0.000     1.392176    2.245484
Obese II..)  |    1.63689   .3239058     2.49   0.013     1.110669    2.412428
             |
smoke_nomiss |
     Former  |   1.365434   .1050853     4.05   0.000     1.174252    1.587743
    Current  |   .7738884   .1102586    -1.80   0.072     .5853352     1.02318
             |
     diabcat |
Controlle..  |   1.398034    .117723     3.98   0.000     1.185336    1.648899
Uncontrol..  |   1.684161   .1785132     4.92   0.000     1.368233    2.073037
Diabetes,..  |   .7900731   .6091774    -0.31   0.760     .1743241    3.580776
             |
1.myocardi~t |   1.167375   .1327884     1.36   0.174     .9340856    1.458929
       1.pad |      .9876   .1548578    -0.08   0.937     .7262914    1.342924
1.hyperten~n |   1.012658   .0712201     0.18   0.858     .8822625    1.162325
1.heart_f~re |   1.080457   .1428982     0.59   0.558     .8337387    1.400184
1.stroke_tia |   1.552292   .1591793     4.29   0.000      1.26966     1.89784
       1.vte |    1.34095   .2161819     1.82   0.069     .9776554    1.839245
 1.oestrogen |   1.311907   .6630042     0.54   0.591     .4872229     3.53247
1.antiplat~t |   .9993229   .0874056    -0.01   0.994     .8418906    1.186195
1.flu_vac~ne |    .865172   .0679331    -1.84   0.065     .7417649     1.00911
             |
         ckd |
        CKD  |   1.519944   .1212019     5.25   0.000     1.300026    1.777065
      1.copd |   1.532858   .1437105     4.56   0.000     1.275554    1.842064
1.other_re~y |   1.471664   .1870559     3.04   0.002      1.14714    1.887994
1.immunode~y |   .7369644   .2791565    -0.81   0.420     .3507663    1.548372
    1.cancer |   1.277548    .102288     3.06   0.002     1.092006    1.494616
1.ae_atten~r |   2.085942    .147026    10.43   0.000     1.816795    2.394961
1.gp_consult |   .8984407   .6946698    -0.14   0.890     .1973989    4.089161
             |
   ethnicity |
      Mixed  |   1.260601   .5682655     0.51   0.607     .5210326    3.049933
Asian or ..  |   2.157982   .3440886     4.82   0.000      1.57879    2.949655
      Black  |   2.304409   .4811019     4.00   0.000      1.53056    3.469515
      Other  |   .8083593   .3149173    -0.55   0.585     .3767011    1.734651
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar3_ethn.ster
>  not found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2627.7635
Iteration 1:   log likelihood = -2404.4675
Iteration 2:   log likelihood = -2399.1081
Iteration 3:   log likelihood = -2399.1069
Refining estimates:
Iteration 0:   log likelihood = -2399.1069

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        1,221
Time at risk    =     89897894
                                                LR chi2(32)      =      457.31
Log likelihood  =   -2399.1069                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.125266   .1862129     0.71   0.476     .8135711    1.556378
      1.male |          1  (omitted)
        age1 |   .8805568   .1735437    -0.65   0.519     .5984104    1.295733
        age2 |   1.303363   .1717542     2.01   0.044     1.006691    1.687465
        age3 |   .4449763   .1199898    -3.00   0.003     .2623051     .754861
             |
         imd |
          2  |   1.200973   .1477655     1.49   0.137     .9436323    1.528493
          3  |   1.196914   .1507147     1.43   0.153     .9351477    1.531954
          4  |   1.339885   .1717532     2.28   0.022     1.042213    1.722578
5 most de..  |   1.543566   .1998035     3.35   0.001     1.197687    1.989331
             |
   obese4cat |
Obese I ..)  |   1.137378   .0938715     1.56   0.119     .9675035     1.33708
Obese II..)  |   1.702603   .2062486     4.39   0.000     1.342768    2.158865
Obese II..)  |   1.569501   .3098749     2.28   0.022      1.06587    2.311101
             |
smoke_nomiss |
     Former  |    1.30466   .0993104     3.49   0.000     1.123839    1.514574
    Current  |   .7209438   .1020006    -2.31   0.021      .546351    .9513298
             |
     diabcat |
Controlle..  |   1.451153   .1211639     4.46   0.000      1.23209    1.709166
Uncontrol..  |   1.804492   .1886895     5.65   0.000     1.470103    2.214941
Diabetes,..  |   .7292977   .5624092    -0.41   0.682     .1608747    3.306146
             |
1.myocardi~t |   1.172174   .1328483     1.40   0.161     .9386878    1.463737
       1.pad |   .9925664   .1546079    -0.05   0.962     .7314279    1.346938
1.hyperten~n |   1.027746   .0720829     0.39   0.696     .8957464    1.179197
1.heart_f~re |   1.076778   .1421994     0.56   0.575     .8312206    1.394877
1.stroke_tia |   1.561193   .1594694     4.36   0.000     1.277939    1.907231
       1.vte |   1.344641   .2164543     1.84   0.066     .9808078     1.84344
 1.oestrogen |   1.320904   .6639305     0.55   0.580      .493207     3.53764
1.antiplat~t |   1.001897   .0872985     0.02   0.983     .8446079    1.188478
1.flu_vac~ne |   .8501421   .0662904    -2.08   0.037     .7296566    .9905228
             |
         ckd |
        CKD  |   1.528336   .1216207     5.33   0.000     1.307623    1.786303
      1.copd |   1.536089   .1436999     4.59   0.000     1.278755    1.845209
1.other_re~y |   1.451954   .1840675     2.94   0.003     1.132516    1.861494
1.immunode~y |   .7719416   .2914002    -0.69   0.493     .3683531    1.617724
    1.cancer |   1.274455    .101773     3.04   0.002      1.08981    1.490384
1.ae_atten~r |   2.087738   .1467214    10.47   0.000     1.819096    2.396054
1.gp_consult |   .9535617   .7332383    -0.06   0.951     .2112613    4.304053
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/admitcovid_multivar3_withoutet
> hn.ster not found)
file /workspace/output/oac_match_tempdata/admitcovid_multivar3_withoutethn.ster
>  saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table3_admitcovid.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    392,387    8.19e+07           0   8.19e+07   8.19e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,411     8008171           0    8008171    8008171

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.071171   .1059807     0.69   0.487     .8823518    1.300397
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.235811   .1970402     1.33   0.184     .9041377    1.689154
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.219285   .1997932     1.21   0.226     .8843548    1.681063
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.159386   .1888381     0.91   0.364     .8425315      1.5954
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.180956   .1964633     1.00   0.317     .8523696     1.63621
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.125266   .1862129     0.71   0.476     .8135711    1.556378
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_admitcovid
> .log
  log type:  text
 closed on:  31 Dec 2020, 11:30:26
-------------------------------------------------------------------------------
