-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/08c_an_model_checks_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:32:10

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure , strata(set_id)

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02415        15.72        1         0.0001
      ------------+---------------------------------------------------
      global test |                     15.72        1         0.0001
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
0

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot1.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot1.svg written in S
> VG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 , strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood = -62797.193
Iteration 2:   log likelihood = -62791.613
Iteration 3:   log likelihood =  -62791.61
Refining estimates:
Iteration 0:   log likelihood =  -62791.61

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(4)       =      329.29
Log likelihood  =    -62791.61                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.591208   .0434177    17.02   0.000     1.508346    1.678621
      1.male |          1  (omitted)
        age1 |   .9256249   .0400565    -1.79   0.074     .8503529     1.00756
        age2 |   1.103678   .0304316     3.58   0.000     1.045616    1.164964
        age3 |   1.076644       .064     1.24   0.214     .9582382    1.209681
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02507        17.15        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00904         2.19        1         0.1385
      age2        |      0.00670         1.19        1         0.2762
      age3        |      0.00115         0.03        1         0.8525
      ------------+---------------------------------------------------
      global test |                     19.86        4         0.0005
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot2.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot2.svg written in S
> VG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood = -61983.749
Iteration 2:   log likelihood = -61960.064
Iteration 3:   log likelihood =  -61960.05
Refining estimates:
Iteration 0:   log likelihood =  -61960.05

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(25)      =     1992.41
Log likelihood  =    -61960.05                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.525201   .0428864    15.01   0.000      1.44342    1.611617
      1.male |          1  (omitted)
        age1 |   1.061328   .0465586     1.36   0.175     .9738876    1.156619
        age2 |   1.019761   .0287826     0.69   0.488     .9648804    1.077764
        age3 |   .9861083   .0605997    -0.23   0.820     .8742093     1.11233
             |
         imd |
          2  |    1.06004    .024292     2.54   0.011     1.013482    1.108737
          3  |   1.084528   .0254245     3.46   0.001     1.035824    1.135521
          4  |    1.10046   .0270719     3.89   0.000     1.048659     1.15482
5 most de..  |   1.261278   .0323848     9.04   0.000     1.199376    1.326375
             |
   obese4cat |
Obese I ..)  |   .9950422   .0170167    -0.29   0.771     .9622429    1.028959
Obese II..)  |   1.005962   .0281775     0.21   0.832     .9522233    1.062733
Obese II..)  |   1.070544   .0439344     1.66   0.097     .9878067    1.160212
             |
smoke_nomiss |
     Former  |   1.134511   .0167572     8.54   0.000     1.102139    1.167835
    Current  |   1.193386   .0279513     7.55   0.000     1.139841    1.249447
             |
     diabcat |
Controlle..  |    1.17389   .0215528     8.73   0.000     1.132399    1.216902
Uncontrol..  |   1.408005   .0344857    13.97   0.000     1.342011    1.477244
Diabetes,..  |   1.223106   .1603171     1.54   0.124     .9460065    1.581373
             |
1.myocardi~t |   1.105902   .0287762     3.87   0.000     1.050916    1.163765
       1.pad |   1.340534   .0439701     8.93   0.000     1.257066    1.429545
1.hyperten~n |   1.037462   .0145613     2.62   0.009     1.009312    1.066398
1.heart_f~re |   1.376008   .0391738    11.21   0.000     1.301332     1.45497
1.stroke_tia |   1.336086   .0317683    12.19   0.000     1.275249    1.399824
       1.vte |   1.480245   .0523025    11.10   0.000     1.381203    1.586389
 1.oestrogen |   1.085532    .081123     1.10   0.272     .9376294    1.256764
1.antiplat~t |   1.186695   .0227699     8.92   0.000     1.142896    1.232173
1.flu_vac~ne |   1.043037   .0165573     2.65   0.008     1.011085    1.075999
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02467        16.62        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00880         2.09        1         0.1481
      age2        |      0.00571         0.89        1         0.3463
      age3        |      0.00322         0.28        1         0.5936
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01737         8.12        1         0.0044
      3.imd       |     -0.01401         5.25        1         0.0220
      4.imd       |     -0.01627         7.09        1         0.0078
      5.imd       |     -0.02141        12.41        1         0.0004
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00549         0.82        1         0.3653
      3.obese4cat |     -0.01916        10.00        1         0.0016
      4.obese4cat |     -0.01219         4.07        1         0.0437
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00230         0.14        1         0.7070
      3.smoke_no~s|     -0.00602         0.98        1         0.3211
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01904         9.82        1         0.0017
      3.diabcat   |     -0.01897         9.78        1         0.0018
      4.diabcat   |      0.01288         4.50        1         0.0340
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00924         2.36        1         0.1248
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00288         0.22        1         0.6370
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01747         8.28        1         0.0040
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00234         0.15        1         0.6977
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02470        16.83        1         0.0000
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00848         1.93        1         0.1648
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00782         1.68        1         0.1952
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.01702         8.19        1         0.0042
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.01461         5.85        1         0.0155
      ------------+---------------------------------------------------
      global test |                    108.48       25         0.0000
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot3.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot3.svg written in S
> VG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -62956.257
Iteration 1:   log likelihood = -60497.023
Iteration 2:   log likelihood = -60423.334
Iteration 3:   log likelihood = -60423.324
Refining estimates:
Iteration 0:   log likelihood = -60423.324

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,123                  Number of obs    =     563,123
No. of failures =       26,922
Time at risk    =    115439000
                                                LR chi2(32)      =     5065.87
Log likelihood  =   -60423.324                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.388345   .0397649    11.46   0.000     1.312554    1.468512
      1.male |          1  (omitted)
        age1 |   1.032088   .0457268     0.71   0.476     .9462459    1.125717
        age2 |   1.021603   .0291565     0.75   0.454      .966026    1.080377
        age3 |   .9863983   .0612271    -0.22   0.825     .8734078    1.114006
             |
         imd |
          2  |   1.052265   .0242568     2.21   0.027      1.00578    1.100898
          3  |   1.069639   .0252567     2.85   0.004     1.021265    1.120305
          4  |   1.072691   .0265778     2.83   0.005     1.021844    1.126068
5 most de..  |   1.204233   .0312319     7.17   0.000     1.144549    1.267029
             |
   obese4cat |
Obese I ..)  |   1.000177   .0172375     0.01   0.992     .9669559    1.034538
Obese II..)  |   1.015172   .0286457     0.53   0.594     .9605519    1.072898
Obese II..)  |    1.07157   .0443382     1.67   0.095     .9880994    1.162092
             |
smoke_nomiss |
     Former  |   1.094738   .0164679     6.02   0.000     1.062933    1.127495
    Current  |   1.131364   .0272668     5.12   0.000     1.079165    1.186088
             |
     diabcat |
Controlle..  |   1.150359   .0213218     7.56   0.000     1.109319    1.192917
Uncontrol..  |   1.365825   .0338752    12.57   0.000     1.301018    1.433859
Diabetes,..  |   1.187222   .1567568     1.30   0.194     .9165208    1.537878
             |
1.myocardi~t |   1.073135    .028157     2.69   0.007     1.019344    1.129766
       1.pad |   1.283589   .0426906     7.51   0.000     1.202586    1.370049
1.hyperten~n |   1.024855    .014553     1.73   0.084     .9967249    1.053779
1.heart_f~re |   1.245733   .0360152     7.60   0.000     1.177107    1.318359
1.stroke_tia |   1.249236   .0299999     9.27   0.000     1.191799     1.30944
       1.vte |   1.338623   .0478941     8.15   0.000     1.247968    1.435864
 1.oestrogen |   1.047935   .0786582     0.62   0.533     .9045712    1.214019
1.antiplat~t |   1.138665   .0219465     6.74   0.000     1.096453    1.182502
1.flu_vac~ne |   1.010076   .0162033     0.62   0.532      .978812    1.042338
             |
         ckd |
        CKD  |   1.206115   .0218667    10.34   0.000      1.16401    1.249744
      1.copd |   1.173865    .025391     7.41   0.000      1.12514      1.2247
1.other_re~y |   1.439785   .0433564    12.10   0.000     1.357267    1.527319
1.immunode~y |   1.349637   .0873559     4.63   0.000     1.188838    1.532186
    1.cancer |   1.549258   .0257344    26.35   0.000     1.499631    1.600526
1.ae_atten~r |   1.930677   .0290965    43.65   0.000     1.874483    1.988556
1.gp_consult |   .8552364     .11443    -1.17   0.243     .6579548    1.111671
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02928        23.63        1         0.0000
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00926         2.33        1         0.1273
      age2        |      0.00520         0.74        1         0.3893
      age3        |      0.00337         0.31        1         0.5759
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01597         6.85        1         0.0089
      3.imd       |     -0.01008         2.72        1         0.0989
      4.imd       |     -0.01191         3.78        1         0.0517
      5.imd       |     -0.01469         5.84        1         0.0157
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00650         1.15        1         0.2837
      3.obese4cat |     -0.01859         9.43        1         0.0021
      4.obese4cat |     -0.01163         3.70        1         0.0545
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00316         0.27        1         0.6050
      3.smoke_no~s|      0.00171         0.08        1         0.7791
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01613         7.03        1         0.0080
      3.diabcat   |     -0.01261         4.32        1         0.0376
      4.diabcat   |      0.01240         4.07        1         0.0437
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00740         1.50        1         0.2205
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00023         0.00        1         0.9698
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01834         9.09        1         0.0026
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00596         0.98        1         0.3231
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02020        11.29        1         0.0008
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00585         0.92        1         0.3381
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00916         2.30        1         0.1294
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02012        11.32        1         0.0008
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.01524         6.35        1         0.0117
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.01903         9.94        1         0.0016
      0b.copd     |            .            .        1             .
      1.copd      |     -0.02546        17.42        1         0.0000
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00407         0.45        1         0.5038
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.00278         0.21        1         0.6479
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.02377        15.52        1         0.0001
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.05902        93.67        1         0.0000
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.00425         0.48        1         0.4870
      ------------+---------------------------------------------------
      global test |                    244.56       32         0.0000
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot4.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot4.svg written in S
> VG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table5_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(132,325 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure , strata(set_id)

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.01681         5.82        1         0.0159
      ------------+---------------------------------------------------
      global test |                      5.82        1         0.0159
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
0

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot1_completeca
> se.svg not found)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot1_completecase.svg
>  written in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 , strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -43280.269
Iteration 1:   log likelihood =  -43161.59
Iteration 2:   log likelihood = -43158.064
Iteration 3:   log likelihood = -43158.062
Refining estimates:
Iteration 0:   log likelihood = -43158.062

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =       20,405
Time at risk    =     88388542
                                                LR chi2(4)       =      244.41
Log likelihood  =   -43158.062                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.593118   .0512264    14.48   0.000     1.495814    1.696751
      1.male |          1  (omitted)
        age1 |   .9292891   .0480659    -1.42   0.156     .8396994    1.028437
        age2 |   1.113513   .0379478     3.15   0.002     1.041566     1.19043
        age3 |   1.038611    .078815     0.50   0.618     .8950749    1.205164
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02129         9.51        1         0.0020
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00728         1.10        1         0.2949
      age2        |      0.01191         2.95        1         0.0859
      age3        |     -0.00568         0.66        1         0.4156
      ------------+---------------------------------------------------
      global test |                     10.00        4         0.0404
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot2_completeca
> se.svg not found)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot2_completecase.svg
>  written in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity , strata(set_i
> d)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -43280.269
Iteration 1:   log likelihood = -42477.676
Iteration 2:   log likelihood = -42462.364
Iteration 3:   log likelihood = -42462.359
Refining estimates:
Iteration 0:   log likelihood = -42462.359

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =       20,405
Time at risk    =     88388542
                                                LR chi2(29)      =     1635.82
Log likelihood  =   -42462.359                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.538522   .0511788    12.95   0.000     1.441414    1.642173
      1.male |          1  (omitted)
        age1 |   1.065292   .0558954     1.21   0.228     .9611838    1.180676
        age2 |   1.027668   .0358045     0.78   0.433      .959835    1.100295
        age3 |   .9587389   .0749396    -0.54   0.590     .8225577    1.117466
             |
         imd |
          2  |    1.04403   .0286205     1.57   0.116     .9894148    1.101659
          3  |   1.083158    .030388     2.85   0.004     1.025206    1.144385
          4  |   1.088486   .0317323     2.91   0.004     1.028036    1.152492
5 most de..  |   1.242216   .0374388     7.20   0.000     1.170963    1.317806
             |
   obese4cat |
Obese I ..)  |    1.01129   .0200575     0.57   0.571      .972732    1.051376
Obese II..)  |   1.035585   .0336026     1.08   0.281     .9717756    1.103584
Obese II..)  |   1.084186    .051461     1.70   0.089     .9878739    1.189888
             |
smoke_nomiss |
     Former  |   1.154769   .0201132     8.26   0.000     1.116014    1.194871
    Current  |    1.22721    .033495     7.50   0.000     1.163286    1.294647
             |
     diabcat |
Controlle..  |   1.147381   .0248277     6.35   0.000     1.099737    1.197089
Uncontrol..  |   1.394632   .0402272    11.53   0.000     1.317975    1.475747
Diabetes,..  |   1.190137   .1851531     1.12   0.263     .8773503    1.614436
             |
1.myocardi~t |   1.064061   .0329811     2.00   0.045     1.001344    1.130707
       1.pad |   1.354547   .0523145     7.86   0.000     1.255797    1.461062
1.hyperten~n |   1.031598    .017017     1.89   0.059     .9987789    1.065496
1.heart_f~re |   1.381456   .0465216     9.60   0.000      1.29322    1.475713
1.stroke_tia |   1.351364   .0380453    10.70   0.000     1.278816    1.428027
       1.vte |   1.435571   .0604168     8.59   0.000     1.321909    1.559007
 1.oestrogen |     1.0723   .0926879     0.81   0.419       .90519     1.27026
1.antiplat~t |    1.19702   .0271101     7.94   0.000     1.145048    1.251352
1.flu_vac~ne |   1.055546   .0197958     2.88   0.004     1.017452    1.095067
             |
   ethnicity |
      Mixed  |   1.609605   .1703223     4.50   0.000     1.308123    1.980571
Asian or ..  |   1.643623   .0766694    10.65   0.000     1.500018    1.800976
      Black  |   1.452319   .1043318     5.19   0.000     1.261576    1.671902
      Other  |   1.300112      .1059     3.22   0.001     1.108273    1.525159
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.01953         7.99        1         0.0047
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00772         1.24        1         0.2655
      age2        |      0.01164         2.87        1         0.0905
      age3        |     -0.00420         0.38        1         0.5397
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01604         5.23        1         0.0222
      3.imd       |     -0.01223         3.04        1         0.0811
      4.imd       |     -0.01552         4.89        1         0.0270
      5.imd       |     -0.01879         7.28        1         0.0070
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00599         0.74        1         0.3903
      3.obese4cat |     -0.01520         4.77        1         0.0290
      4.obese4cat |     -0.01035         2.22        1         0.1362
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01458         4.32        1         0.0376
      3.smoke_no~s|     -0.01082         2.40        1         0.1217
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02164         9.54        1         0.0020
      3.diabcat   |     -0.02640        14.38        1         0.0001
      4.diabcat   |      0.01061         2.37        1         0.1238
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01244         3.24        1         0.0720
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00325         0.22        1         0.6411
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01506         4.62        1         0.0316
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00300         0.19        1         0.6643
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02677        14.88        1         0.0001
      0b.vte      |            .            .        1             .
      1.vte       |      0.00217         0.09        1         0.7584
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00875         1.59        1         0.2076
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.01846         7.19        1         0.0073
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.01878         7.30        1         0.0069
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00391         0.32        1         0.5735
      3.ethnicity |      0.00036         0.00        1         0.9584
      4.ethnicity |     -0.01732         6.14        1         0.0132
      5.ethnicity |      0.00011         0.00        1         0.9876
      ------------+---------------------------------------------------
      global test |                     92.32       29         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot3_completeca
> se_ethn.svg not found)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot3_completecase_eth
> n.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -43280.269
Iteration 1:   log likelihood = -42547.111
Iteration 2:   log likelihood = -42532.212
Iteration 3:   log likelihood = -42532.206
Refining estimates:
Iteration 0:   log likelihood = -42532.206

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =       20,405
Time at risk    =     88388542
                                                LR chi2(25)      =     1496.13
Log likelihood  =   -42532.206                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.514055   .0502737    12.49   0.000     1.418659    1.615867
      1.male |          1  (omitted)
        age1 |   1.072596   .0562692     1.34   0.182     .9677914    1.188751
        age2 |   1.021154   .0355927     0.60   0.548     .9537228    1.093352
        age3 |   .9616604    .075243    -0.50   0.617      .824938    1.121043
             |
         imd |
          2  |   1.042629   .0285682     1.52   0.128     .9881128    1.100152
          3  |   1.082312   .0303534     2.82   0.005     1.024426    1.143468
          4  |    1.09103   .0317825     2.99   0.003     1.030482    1.155135
5 most de..  |   1.250421   .0376405     7.42   0.000     1.178781    1.326414
             |
   obese4cat |
Obese I ..)  |   1.001349   .0198354     0.07   0.946     .9632178    1.040991
Obese II..)  |   1.019304   .0330406     0.59   0.555     .9565602    1.086164
Obese II..)  |     1.0612   .0503226     1.25   0.210     .9670139    1.164559
             |
smoke_nomiss |
     Former  |   1.135394   .0196695     7.33   0.000      1.09749    1.174608
    Current  |   1.200101   .0326481     6.71   0.000     1.137788    1.265827
             |
     diabcat |
Controlle..  |   1.175791   .0252852     7.53   0.000     1.127263    1.226408
Uncontrol..  |   1.439734   .0412629    12.72   0.000      1.36109    1.522923
Diabetes,..  |   1.209577   .1879938     1.22   0.221     .8919465    1.640319
             |
1.myocardi~t |    1.06519   .0330086     2.04   0.042      1.00242    1.131891
       1.pad |   1.347402   .0520089     7.72   0.000     1.249227    1.453293
1.hyperten~n |   1.035294   .0170681     2.10   0.035     1.002376    1.069293
1.heart_f~re |   1.382458   .0465408     9.62   0.000     1.294184    1.476753
1.stroke_tia |    1.35316   .0380674    10.75   0.000     1.280569    1.429866
       1.vte |   1.428086   .0600685     8.47   0.000     1.315076    1.550807
 1.oestrogen |   1.062365   .0917981     0.70   0.484     .8968544    1.258419
1.antiplat~t |   1.200727   .0271801     8.08   0.000     1.148619    1.255198
1.flu_vac~ne |   1.054006    .019749     2.81   0.005     1.016001    1.093433
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02016         8.50        1         0.0035
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00824         1.41        1         0.2344
      age2        |      0.01180         2.94        1         0.0862
      age3        |     -0.00411         0.36        1         0.5488
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01624         5.36        1         0.0206
      3.imd       |     -0.01214         2.99        1         0.0836
      4.imd       |     -0.01579         5.06        1         0.0245
      5.imd       |     -0.01931         7.68        1         0.0056
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00506         0.53        1         0.4677
      3.obese4cat |     -0.01525         4.81        1         0.0284
      4.obese4cat |     -0.01004         2.09        1         0.1485
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01337         3.63        1         0.0566
      3.smoke_no~s|     -0.00948         1.84        1         0.1744
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02300        10.77        1         0.0010
      3.diabcat   |     -0.02798        16.09        1         0.0001
      4.diabcat   |      0.01052         2.32        1         0.1277
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01256         3.30        1         0.0694
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00349         0.25        1         0.6165
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01382         3.90        1         0.0484
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00293         0.18        1         0.6712
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02715        15.30        1         0.0001
      0b.vte      |            .            .        1             .
      1.vte       |      0.00191         0.07        1         0.7859
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00854         1.52        1         0.2176
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.01875         7.42        1         0.0065
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.01939         7.77        1         0.0053
      ------------+---------------------------------------------------
      global test |                     86.99       25         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot3_completeca
> se.svg not found)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot3_completecase.svg
>  written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(set_i
> d)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -43280.269
Iteration 1:   log likelihood = -41410.932
Iteration 2:   log likelihood = -41369.277
Iteration 3:   log likelihood = -41369.275
Refining estimates:
Iteration 0:   log likelihood = -41369.275

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =       20,405
Time at risk    =     88388542
                                                LR chi2(36)      =     3821.99
Log likelihood  =   -41369.275                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.403985   .0476103    10.01   0.000     1.313704    1.500471
      1.male |          1  (omitted)
        age1 |   1.036433   .0548938     0.68   0.499     .9342387    1.149805
        age2 |   1.030355   .0362761     0.85   0.396     .9616525    1.103965
        age3 |   .9546855   .0753677    -0.59   0.557     .8178283    1.114445
             |
         imd |
          2  |   1.035327   .0285862     1.26   0.209     .9807884    1.092899
          3  |   1.069434   .0302441     2.37   0.018      1.01177    1.130385
          4  |   1.059822   .0311644     1.98   0.048     1.000468    1.122698
5 most de..  |   1.182933   .0360445     5.51   0.000     1.114355    1.255731
             |
   obese4cat |
Obese I ..)  |   1.017682    .020386     0.87   0.382     .9785007    1.058433
Obese II..)  |   1.047183   .0342905     1.41   0.159      .982086    1.116595
Obese II..)  |   1.082768   .0518639     1.66   0.097     .9857428    1.189344
             |
smoke_nomiss |
     Former  |   1.114172   .0198012     6.08   0.000      1.07603    1.153665
    Current  |   1.158624   .0326049     5.23   0.000      1.09645    1.224324
             |
     diabcat |
Controlle..  |   1.121069   .0245226     5.22   0.000     1.074022    1.170178
Uncontrol..  |   1.352007   .0395553    10.31   0.000     1.276661      1.4318
Diabetes,..  |    1.13725   .1779952     0.82   0.411     .8368188    1.545542
             |
1.myocardi~t |   1.027913   .0322197     0.88   0.380     .9666645    1.093043
       1.pad |   1.281223   .0503177     6.31   0.000     1.186302    1.383739
1.hyperten~n |   1.017719   .0170134     1.05   0.293     .9849137    1.051617
1.heart_f~re |   1.250921   .0428442     6.54   0.000     1.169705    1.337777
1.stroke_tia |   1.268377   .0361501     8.34   0.000     1.199466    1.341246
       1.vte |   1.291073   .0550936     5.99   0.000     1.187484    1.403699
 1.oestrogen |   1.044607    .090838     0.50   0.616     .8809132    1.238718
1.antiplat~t |   1.145438   .0261341     5.95   0.000     1.095345    1.197823
1.flu_vac~ne |    1.02205   .0193978     1.15   0.250     .9847292    1.060785
             |
         ckd |
        CKD  |    1.21257   .0263709     8.86   0.000      1.16197    1.265374
      1.copd |   1.182062   .0298379     6.63   0.000     1.125004    1.242014
1.other_re~y |   1.450544   .0509341    10.59   0.000     1.354073    1.553888
1.immunode~y |   1.252493   .0971041     2.90   0.004     1.075927    1.458035
    1.cancer |   1.525503   .0301318    21.38   0.000     1.467574    1.585718
1.ae_atten~r |    1.92366   .0341627    36.84   0.000     1.857854    1.991796
1.gp_consult |    .984164   .1648484    -0.10   0.924     .7087456     1.36661
             |
   ethnicity |
      Mixed  |    1.64496   .1759836     4.65   0.000       1.3338    2.028709
Asian or ..  |   1.667584   .0786461    10.84   0.000      1.52035    1.829076
      Black  |   1.403056   .1019428     4.66   0.000     1.216826    1.617787
      Other  |   1.344298   .1106344     3.60   0.000     1.144043    1.579605
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02299        11.12        1         0.0009
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00803         1.35        1         0.2459
      age2        |      0.01126         2.69        1         0.1012
      age3        |     -0.00451         0.44        1         0.5090
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01354         3.71        1         0.0541
      3.imd       |     -0.00745         1.13        1         0.2888
      4.imd       |     -0.01063         2.29        1         0.1305
      5.imd       |     -0.01177         2.85        1         0.0917
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00733         1.11        1         0.2926
      3.obese4cat |     -0.01442         4.30        1         0.0381
      4.obese4cat |     -0.00982         1.99        1         0.1580
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00929         1.75        1         0.1854
      3.smoke_no~s|     -0.00229         0.11        1         0.7443
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01941         7.66        1         0.0056
      3.diabcat   |     -0.02182         9.83        1         0.0017
      4.diabcat   |      0.01055         2.28        1         0.1313
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.00999         2.07        1         0.1500
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00166         0.06        1         0.8117
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01546         4.86        1         0.0275
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.01075         2.41        1         0.1206
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02155         9.68        1         0.0019
      0b.vte      |            .            .        1             .
      1.vte       |      0.00436         0.38        1         0.5362
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.01082         2.41        1         0.1203
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02105         9.26        1         0.0023
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.01982         8.09        1         0.0044
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.01352         3.83        1         0.0504
      0b.copd     |            .            .        1             .
      1.copd      |     -0.02478        12.46        1         0.0004
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.01093         2.44        1         0.1182
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.00519         0.54        1         0.4609
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.02518        13.15        1         0.0003
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.04708        45.22        1         0.0000
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.00104         0.02        1         0.8837
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00445         0.42        1         0.5170
      3.ethnicity |      0.00077         0.01        1         0.9115
      4.ethnicity |     -0.01717         6.08        1         0.0137
      5.ethnicity |      0.00007         0.00        1         0.9915
      ------------+---------------------------------------------------
      global test |                    168.49       36         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot4_completeca
> se_ethn.svg not found)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot4_completecase_eth
> n.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -43280.269
Iteration 1:   log likelihood = -41482.806
Iteration 2:   log likelihood = -41440.506
Iteration 3:   log likelihood = -41440.503
Refining estimates:
Iteration 0:   log likelihood = -41440.503

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =       20,405
Time at risk    =     88388542
                                                LR chi2(32)      =     3679.53
Log likelihood  =   -41440.503                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.381239   .0467504     9.54   0.000     1.292583    1.475976
      1.male |          1  (omitted)
        age1 |   1.043538   .0552774     0.80   0.421     .9406311    1.157704
        age2 |   1.023642   .0360582     0.66   0.507     .9553541    1.096812
        age3 |   .9576662   .0756826    -0.55   0.584     .8202482    1.118106
             |
         imd |
          2  |   1.034366   .0285464     1.22   0.221     .9799027    1.091857
          3  |   1.069179   .0302262     2.37   0.018     1.011549    1.130094
          4  |   1.062663   .0312244     2.07   0.039     1.003193    1.125658
5 most de..  |    1.19159    .036264     5.76   0.000     1.122592    1.264829
             |
   obese4cat |
Obese I ..)  |   1.007454   .0201553     0.37   0.710     .9687152    1.047743
Obese II..)  |   1.030345   .0337026     0.91   0.361     .9663623    1.098565
Obese II..)  |   1.058707   .0506601     1.19   0.233     .9639292    1.162804
             |
smoke_nomiss |
     Former  |    1.09539   .0193644     5.15   0.000     1.058086    1.134008
    Current  |   1.133912   .0318103     4.48   0.000     1.073248    1.198005
             |
     diabcat |
Controlle..  |   1.149008   .0249823     6.39   0.000     1.101072    1.199031
Uncontrol..  |   1.396277   .0405873    11.48   0.000     1.318951    1.478136
Diabetes,..  |   1.154144   .1805269     0.92   0.359      .849412    1.568201
             |
1.myocardi~t |   1.029357   .0322487     0.92   0.356      .968052    1.094544
       1.pad |    1.27524   .0500467     6.20   0.000     1.180828    1.377201
1.hyperten~n |   1.021027   .0170592     1.25   0.213     .9881329    1.055016
1.heart_f~re |   1.250961   .0428329     6.54   0.000     1.169765    1.337793
1.stroke_tia |   1.268598   .0361273     8.35   0.000     1.199729    1.341419
       1.vte |   1.284801   .0547905     5.88   0.000     1.181779    1.396804
 1.oestrogen |   1.036268   .0900744     0.41   0.682     .8739451    1.228741
1.antiplat~t |   1.149703    .026214     6.12   0.000     1.099456    1.202247
1.flu_vac~ne |   1.021069   .0193609     1.10   0.272     .9838188    1.059729
             |
         ckd |
        CKD  |   1.215065    .026409     8.96   0.000     1.164391    1.267944
      1.copd |   1.175088   .0296434     6.40   0.000     1.118401    1.234648
1.other_re~y |   1.449879   .0508773    10.59   0.000     1.353513    1.553106
1.immunode~y |   1.265276   .0979481     3.04   0.002     1.087155     1.47258
    1.cancer |   1.517294   .0299303    21.14   0.000     1.459751    1.577105
1.ae_atten~r |   1.927396   .0342002    36.98   0.000     1.861517    1.995606
1.gp_consult |   .9873757   .1653226    -0.08   0.940     .7111486    1.370896
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.02342        11.53        1         0.0007
      0b.male     |            .            .        1             .
      1.male      |            .            .        1             .
      age1        |     -0.00847         1.50        1         0.2213
      age2        |      0.01132         2.72        1         0.0991
      age3        |     -0.00442         0.42        1         0.5172
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01376         3.83        1         0.0504
      3.imd       |     -0.00736         1.10        1         0.2946
      4.imd       |     -0.01090         2.40        1         0.1214
      5.imd       |     -0.01223         3.07        1         0.0796
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00632         0.82        1         0.3643
      3.obese4cat |     -0.01445         4.33        1         0.0375
      4.obese4cat |     -0.00961         1.91        1         0.1670
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00804         1.31        1         0.2516
      3.smoke_no~s|     -0.00096         0.02        1         0.8912
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02068         8.69        1         0.0032
      3.diabcat   |     -0.02342        11.27        1         0.0008
      4.diabcat   |      0.01040         2.21        1         0.1373
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01029         2.20        1         0.1383
      0b.pad      |            .            .        1             .
      1.pad       |     -0.00177         0.06        1         0.7991
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.01435         4.19        1         0.0406
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.01082         2.44        1         0.1183
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02182         9.91        1         0.0016
      0b.vte      |            .            .        1             .
      1.vte       |      0.00410         0.34        1         0.5613
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.01067         2.36        1         0.1245
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02124         9.42        1         0.0022
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|      0.02045         8.60        1         0.0034
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.01363         3.89        1         0.0487
      0b.copd     |            .            .        1             .
      1.copd      |     -0.02434        12.02        1         0.0005
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.01060         2.30        1         0.1296
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.00627         0.79        1         0.3738
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.02528        13.25        1         0.0003
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.04737        45.82        1         0.0000
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.00082         0.01        1         0.9077
      ------------+---------------------------------------------------
      global test |                    162.89       32         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_match_tabfig/covidtest_schoenplot4_completeca
> se.svg not found)
(file /workspace/output/oac_match_tabfig/covidtest_schoenplot4_completecase.svg
>  written in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table6_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/08c_an_model_checks_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:56:03
-------------------------------------------------------------------------------
