-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 13:11:53

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -120421.06                     Number of obs     =    563,123

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   1.426055   .0290794    17.40   0.000     1.370184    1.484204
    _Imale_1 |   .9853302    .016965    -0.86   0.391     .9526341    1.019148
     _Iimd_2 |    1.05351   .0211396     2.60   0.009     1.012882    1.095769
     _Iimd_3 |   1.071037   .0214817     3.42   0.001      1.02975    1.113978
     _Iimd_4 |   1.127975     .02244     6.05   0.000      1.08484    1.172825
     _Iimd_5 |   1.257505   .0248094    11.61   0.000     1.209807    1.307083
_Iobese4ca~2 |   .9944337   .0160404    -0.35   0.729      .963487    1.026374
_Iobese4ca~3 |   .9849931    .025909    -0.57   0.565     .9354992    1.037106
_Iobese4ca~4 |   1.041718   .0398744     1.07   0.286     .9664257    1.122877
_Ismoke_no~2 |   1.084048   .0152235     5.75   0.000     1.054618      1.1143
_Ismoke_no~3 |   1.131146   .0254109     5.49   0.000     1.082423    1.182064
 _Idiabcat_2 |   1.168153   .0198075     9.17   0.000     1.129969    1.207627
 _Idiabcat_3 |    1.35576   .0307966    13.40   0.000     1.296723    1.417484
 _Idiabcat_4 |   1.071701    .130218     0.57   0.569     .8445936    1.359877
_Imyocardi~1 |   1.105146   .0267332     4.13   0.000     1.053973    1.158804
     _Ipad_1 |   1.311121    .039553     8.98   0.000     1.235846    1.390981
_Ihyperten~1 |   1.012644   .0132741     0.96   0.338     .9869588    1.038998
_Iheart_fa~1 |    1.23447   .0321059     8.10   0.000      1.17312    1.299028
_Istroke_t~1 |   1.259471   .0277938    10.45   0.000     1.206157    1.315141
     _Ivte_1 |   1.310252   .0428393     8.26   0.000     1.228922    1.396964
_Ioestroge~1 |   1.079053   .0754481     1.09   0.277     .9408624     1.23754
_Iantiplat~1 |   1.122139   .0201794     6.41   0.000     1.083277    1.162395
_Iflu_vacc~1 |   1.016173   .0150864     1.08   0.280     .9870302    1.046176
     _Ickd_1 |   1.247406   .0208437    13.23   0.000     1.207214    1.288935
    _Icopd_1 |   1.192249   .0237818     8.82   0.000     1.146537    1.239784
_Iother_re~1 |   1.416277   .0386414    12.76   0.000     1.342531    1.494074
_Iimmunode~1 |     1.3402   .0784715     5.00   0.000     1.194896    1.503174
  _Icancer_1 |   1.518097   .0232671    27.24   0.000     1.473172    1.564391
_Iae_atten~1 |   1.764673   .0240718    41.64   0.000     1.718118    1.812489
_Igp_consu~1 |   .8118476   .0943079    -1.79   0.073     .6465394    1.019422
        age1 |   .9856645    .001876    -7.59   0.000     .9819945    .9893482
        age2 |   1.024875   .0050515     4.99   0.000     1.015022    1.034824
        age3 |   1.052607   .0312694     1.73   0.084     .9930698    1.115713
       _rcs1 |   1.693217    .008929    99.87   0.000     1.675807    1.710809
       _rcs2 |   1.133103   .0059432    23.82   0.000     1.121514    1.144811
       _rcs3 |   .9980012   .0009015    -2.21   0.027     .9962359    .9997697
       _cons |   .0695185   .0113669   -16.31   0.000      .050457     .095781
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,123    204.9978     27.3321         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,911 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .04693688   .04635807   .04752293 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +----------------------------------+
  |      _at2   _at2_lci    _at2_uci |
  |----------------------------------|
  | .06601753   .0637105   .06840809 |
  +----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    .01908064          .01663658           .0215247 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_covidtest.gph not found)
(file adj_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_covidtest.svg not fou
> nd)
(file /workspace/output/oac_match_tabfig/adj_curves_covidtest.svg written in SV
> G format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_covidtest.gph not found)
(file diff_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_covidtest.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/diff_curves_covidtest.svg written in S
> VG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 13:35:52
-------------------------------------------------------------------------------
