-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_positivecovidte
> st.log
  log type:  text
 opened on:  31 Dec 2020, 13:12:17

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -21307.232                     Number of obs     =    563,123

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   1.250488    .080125     3.49   0.000     1.102907    1.417817
    _Imale_1 |   1.132016   .0617898     2.27   0.023     1.017163    1.259837
     _Iimd_2 |    1.15663   .0735851     2.29   0.022     1.021035    1.310232
     _Iimd_3 |   1.195037   .0757166     2.81   0.005      1.05548    1.353046
     _Iimd_4 |   1.399157   .0859056     5.47   0.000     1.240522    1.578078
     _Iimd_5 |   2.044919   .1191384    12.28   0.000      1.82425     2.29228
_Iobese4ca~2 |   1.050305    .049424     1.04   0.297     .9577686    1.151782
_Iobese4ca~3 |    1.21365   .0869627     2.70   0.007     1.054634    1.396643
_Iobese4ca~4 |   1.234728   .1294018     2.01   0.044     1.005457    1.516278
_Ismoke_no~2 |   1.047448   .0423619     1.15   0.252      .967626    1.133856
_Ismoke_no~3 |   .5560389   .0444023    -7.35   0.000     .4754805    .6502459
 _Idiabcat_2 |    1.41235   .0665026     7.33   0.000     1.287841    1.548897
 _Idiabcat_3 |   1.734443   .1052602     9.07   0.000     1.539934     1.95352
 _Idiabcat_4 |   .6766141   .3029945    -0.87   0.383     .2812967    1.627487
_Imyocardi~1 |    1.02308   .0715368     0.33   0.744     .8920537    1.173351
     _Ipad_1 |   1.199752   .1059286     2.06   0.039     1.009107    1.426415
_Ihyperten~1 |   .9681308   .0374831    -0.84   0.403     .8973835    1.044456
_Iheart_fa~1 |   1.050959   .0804222     0.65   0.516     .9045852    1.221018
_Istroke_t~1 |   1.511477   .0889461     7.02   0.000     1.346824     1.69626
     _Ivte_1 |   1.444243   .1265492     4.20   0.000     1.216341    1.714847
_Ioestroge~1 |   1.014883   .2312755     0.06   0.948     .6492929    1.586321
_Iantiplat~1 |     1.0271   .0527585     0.52   0.603     .9287305    1.135889
_Iflu_vacc~1 |   .8382247   .0356157    -4.15   0.000     .7712469    .9110192
     _Ickd_1 |   1.245086   .0585509     4.66   0.000     1.135458    1.365299
    _Icopd_1 |   1.237719   .0713728     3.70   0.000     1.105446    1.385818
_Iother_re~1 |      1.488   .1121839     5.27   0.000     1.283597    1.724952
_Iimmunode~1 |   1.185407   .2183948     0.92   0.356     .8261245    1.700942
  _Icancer_1 |   1.165781   .0553708     3.23   0.001     1.062154    1.279517
_Iae_atten~1 |   2.173735   .0830092    20.33   0.000     2.016979    2.342673
_Igp_consu~1 |   1.171618   .4831054     0.38   0.701     .5221573     2.62888
        age1 |   .9621628   .0046811    -7.93   0.000     .9530316    .9713816
        age2 |   1.074851   .0144426     5.37   0.000     1.046914    1.103534
        age3 |   .9911563   .0806863    -0.11   0.913      .844985    1.162613
       _rcs1 |   1.556409   .0266751    25.81   0.000     1.504995    1.609579
       _rcs2 |   1.345449   .0255661    15.62   0.000     1.296262    1.396502
       _rcs3 |   .9845338   .0044287    -3.47   0.001     .9758919    .9932522
       _rcs4 |     .99292    .000704   -10.02   0.000     .9915411    .9943009
       _cons |   .0185297   .0093285    -7.92   0.000     .0069079    .0497043
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,123     208.271    20.10171         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,911 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +----------------------------------+
  |      _at1    _at1_lci   _at1_uci |
  |----------------------------------|
  | .00555881   .00535703   .0057682 |
  +----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00694101   .00617281   .00780481 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    .00138219          .00053296          .00223143 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_positivecovidtest.gph not found)
(file adj_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_positivecovidtest.svg
>  not found)
(file /workspace/output/oac_match_tabfig/adj_curves_positivecovidtest.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_positivecovidtest.gph not found)
(file diff_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_positivecovidtest.sv
> g not found)
(file /workspace/output/oac_match_tabfig/diff_curves_positivecovidtest.svg writ
> ten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_positivecovidte
> st.log
  log type:  text
 closed on:  31 Dec 2020, 13:36:48
-------------------------------------------------------------------------------
