-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_onscoviddeath.l
> og
  log type:  text
 opened on:  31 Dec 2020, 16:19:16

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -8837.2862                     Number of obs     =    563,123

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   1.332346   .1601426     2.39   0.017     1.052703    1.686273
    _Imale_1 |   1.876769   .2630146     4.49   0.000     1.426007    2.470018
     _Iimd_2 |   1.061811   .1095114     0.58   0.561      .867476    1.299682
     _Iimd_3 |   1.187469   .1197237     1.70   0.088     .9745446    1.446913
     _Iimd_4 |   1.287688   .1284034     2.54   0.011     1.059088     1.56563
     _Iimd_5 |   1.975967   .1860885     7.23   0.000     1.642922    2.376525
_Iobese4ca~2 |   1.160682   .0909964     1.90   0.057     .9953593    1.353464
_Iobese4ca~3 |    1.51063   .1854712     3.36   0.001     1.187544    1.921615
_Iobese4ca~4 |   1.643668   .3199335     2.55   0.011     1.122357    2.407117
_Ismoke_no~2 |   1.212945   .0868425     2.70   0.007      1.05414    1.395674
_Ismoke_no~3 |   .9158086   .1249239    -0.64   0.519     .7009609    1.196508
 _Idiabcat_2 |   1.468816   .1102033     5.12   0.000     1.267952      1.7015
 _Idiabcat_3 |   2.021533    .191059     7.45   0.000     1.679702     2.43293
 _Idiabcat_4 |   1.137017   .6580814     0.22   0.824     .3656869    3.535285
_Imyocardi~1 |   1.183027   .1166843     1.70   0.088     .9750768    1.435325
     _Ipad_1 |   1.268847   .1561142     1.94   0.053     .9969662    1.614871
_Ihyperten~1 |   1.052619    .069558     0.78   0.438     .9247469    1.198172
_Iheart_fa~1 |   1.341784   .1385399     2.85   0.004     1.095963    1.642744
_Istroke_t~1 |   1.636709    .140513     5.74   0.000     1.383232    1.936636
     _Ivte_1 |   1.346055   .1844148     2.17   0.030      1.02907    1.760681
_Ioestroge~1 |   .7236949   .5151846    -0.45   0.650     .1793087    2.920852
_Iantiplat~1 |   .8765805   .0686354    -1.68   0.093     .7518714    1.021975
_Iflu_vacc~1 |   .9729099   .0742736    -0.36   0.719     .8377038    1.129938
     _Ickd_1 |   1.326448   .0897519     4.18   0.000     1.161703    1.514556
    _Icopd_1 |   1.297174   .1098967     3.07   0.002     1.098713    1.531483
_Iother_re~1 |   1.741782   .1802595     5.36   0.000     1.422007    2.133466
_Iimmunode~1 |   1.929389   .4876538     2.60   0.009      1.17565    3.166367
  _Icancer_1 |   1.246649   .0876984     3.13   0.002     1.086086    1.430948
_Iae_atten~1 |   2.694866   .1648176    16.21   0.000      2.39044    3.038061
_Igp_consu~1 |   .5361546   .2451582    -1.36   0.173     .2188143    1.313725
        age1 |   1.046707   .0176651     2.70   0.007      1.01265    1.081909
        age2 |   1.066141   .0317498     2.15   0.032     1.005694    1.130221
        age3 |   .8390223   .1245261    -1.18   0.237     .6272488    1.122295
       _rcs1 |   1.170598   .0053772    34.29   0.000     1.160106    1.181184
       _cons |   .0000131   .0000151    -9.72   0.000     1.36e-06    .0001264
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,123    208.7757    18.01947         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,911 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00205343   .00192958   .00218523 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00273046   .00219676   .00339381 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    .00067703          .00005387          .00130018 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_onscoviddeath.gph not found)
(file adj_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_onscoviddeath.svg not
>  found)
(file /workspace/output/oac_match_tabfig/adj_curves_onscoviddeath.svg written i
> n SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_onscoviddeath.gph not found)
(file diff_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_onscoviddeath.svg no
> t found)
(file /workspace/output/oac_match_tabfig/diff_curves_onscoviddeath.svg written 
> in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_onscoviddeath.l
> og
  log type:  text
 closed on:  31 Dec 2020, 16:34:51
-------------------------------------------------------------------------------
