-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 15:33:20

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -11586.102                     Number of obs     =    563,123

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   1.189086   .1114997     1.85   0.065     .9894568    1.428992
    _Imale_1 |    1.87002   .1806233     6.48   0.000     1.547496    2.259763
     _Iimd_2 |   1.128315   .1010649     1.35   0.178     .9466441    1.344849
     _Iimd_3 |    1.21794   .1074114     2.24   0.025     1.024608    1.447752
     _Iimd_4 |   1.342578    .116265     3.40   0.001     1.132992    1.590934
     _Iimd_5 |   1.925746   .1584729     7.96   0.000     1.638899    2.262798
_Iobese4ca~2 |   1.102836   .0730364     1.48   0.139     .9685881     1.25569
_Iobese4ca~3 |   1.698535   .1555411     5.79   0.000     1.419472     2.03246
_Iobese4ca~4 |   1.392281   .2139499     2.15   0.031     1.030206    1.881611
_Ismoke_no~2 |   1.179493   .0707601     2.75   0.006     1.048649    1.326663
_Ismoke_no~3 |   .7090257   .0799922    -3.05   0.002     .5683679    .8844932
 _Idiabcat_2 |   1.545783   .0992061     6.79   0.000     1.363075    1.752982
 _Idiabcat_3 |    1.99583   .1613336     8.55   0.000     1.703399    2.338464
 _Idiabcat_4 |   .5700572   .4035561    -0.79   0.427     .1423423    2.282984
_Imyocardi~1 |   1.146234   .1022602     1.53   0.126     .9623523    1.365251
     _Ipad_1 |   1.175277    .134379     1.41   0.158     .9393241      1.4705
_Ihyperten~1 |   .9480108   .0520299    -0.97   0.331     .8513273    1.055674
_Iheart_fa~1 |   1.154958   .1136093     1.46   0.143      .952437    1.400541
_Istroke_t~1 |   1.498231   .1188883     5.09   0.000      1.28243    1.750345
     _Ivte_1 |   1.277965   .1617965     1.94   0.053     .9971318    1.637891
_Ioestroge~1 |   1.077009   .4460016     0.18   0.858     .4783292    2.424999
_Iantiplat~1 |   1.035724   .0716274     0.51   0.612     .9044357    1.186071
_Iflu_vacc~1 |   .8704703   .0534858    -2.26   0.024     .7717065     .981874
     _Ickd_1 |   1.390416   .0861691     5.32   0.000     1.231382     1.56999
    _Icopd_1 |   1.437187   .1060599     4.91   0.000     1.243647    1.660846
_Iother_re~1 |   1.551138   .1506882     4.52   0.000     1.282209    1.876472
_Iimmunode~1 |   .9224604   .2681059    -0.28   0.781     .5218583    1.630583
  _Icancer_1 |   1.319375   .0826512     4.42   0.000     1.166932    1.491733
_Iae_atten~1 |   2.183253   .1170536    14.56   0.000     1.965474    2.425161
_Igp_consu~1 |   .8063104   .4085495    -0.42   0.671     .2986805    2.176695
        age1 |   1.000062   .0097951     0.01   0.995     .9810476    1.019446
        age2 |   1.066513    .023436     2.93   0.003     1.021554     1.11345
        age3 |   .8210999   .1011423    -1.60   0.110     .6449793    1.045313
       _rcs1 |    1.34946   .0105675    38.27   0.000     1.328906    1.370331
       _rcs2 |   1.211817   .0067261    34.61   0.000     1.198706    1.225072
       _cons |   .0005082   .0003991    -9.66   0.000     .0001091    .0023685
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,123      208.52    19.18854         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,911 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +----------------------------------+
  |      _at1    _at1_lci   _at1_uci |
  |----------------------------------|
  | .00279731   .00265414   .0029482 |
  +----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00332391   .00279955   .00394648 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |     .0005266         -.00007243          .00112563 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_admitcovid.gph not found)
(file adj_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_admitcovid.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/adj_curves_admitcovid.svg written in S
> VG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_admitcovid.gph not found)
(file diff_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_admitcovid.svg not f
> ound)
(file /workspace/output/oac_match_tabfig/diff_curves_admitcovid.svg written in 
> SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 15:49:27
-------------------------------------------------------------------------------
