-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:17:48

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   256,944      3,592 |   260,536 
             |     98.62       1.38 |    100.00 
-------------+----------------------+----------
warfarin use |    87,149        850 |    87,999 
             |     99.03       0.97 |    100.00 
-------------+----------------------+----------
       Total |   344,093      4,442 |   348,535 
             |     98.73       1.27 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -56583.863
Iteration 1:   log likelihood = -56535.549
Iteration 2:   log likelihood =  -56535.17
Iteration 3:   log likelihood =  -56535.17
Refining estimates:
Iteration 0:   log likelihood =  -56535.17

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        4,442
Time at risk    =   71089826.5
                                                LR chi2(1)       =       97.39
Log likelihood  =    -56535.17                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6955613   .0265306    -9.52   0.000     .6454584    .7495534
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_univ
> ar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -56583.863
Iteration 1:   log likelihood = -55954.179
Iteration 2:   log likelihood = -55828.208
Iteration 3:   log likelihood = -55825.911
Iteration 4:   log likelihood =  -55825.91
Refining estimates:
Iteration 0:   log likelihood =  -55825.91

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        4,442
Time at risk    =   71089826.5
                                                LR chi2(5)       =     1515.91
Log likelihood  =    -55825.91                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6608689   .0253053   -10.82   0.000     .6130868    .7123751
      1.male |   1.161225   .0357852     4.85   0.000     1.093164    1.233524
        age1 |   .9691681   .0057964    -5.24   0.000     .9578737    .9805956
        age2 |    1.12639    .012062    11.11   0.000     1.102995     1.15028
        age3 |   .6204134   .0409736    -7.23   0.000     .5450869    .7061494
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -22705.078
Iteration 1:   log likelihood = -21471.558
Iteration 2:   log likelihood = -20935.449
Iteration 3:   log likelihood = -20932.392
Iteration 4:   log likelihood = -20932.391
Refining estimates:
Iteration 0:   log likelihood = -20932.391

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        4,442
Time at risk    =   71089826.5
                                                LR chi2(26)      =     3545.37
Log likelihood  =   -20932.391                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7362777   .0291642    -7.73   0.000     .6812794    .7957158
      1.male |   1.242085   .0407461     6.61   0.000     1.164738    1.324569
        age1 |    .973688   .0060719    -4.28   0.000     .9618598    .9856618
        age2 |   1.123486   .0123837    10.56   0.000     1.099475    1.148022
        age3 |   .5579996   .0376514    -8.65   0.000     .4888757    .6368972
             |
         imd |
          2  |   1.093657   .0621857     1.57   0.115     .9783213     1.22259
          3  |   1.209176   .0692528     3.32   0.001     1.080784     1.35282
          4  |   1.282026   .0764987     4.16   0.000     1.140527    1.441081
5 most de..  |   1.466482   .0887917     6.32   0.000     1.302383    1.651257
             |
   obese4cat |
Obese I ..)  |   .9978673    .041175    -0.05   0.959      .920343    1.081922
Obese II..)  |   1.211462   .0706717     3.29   0.001     1.080574    1.358206
Obese II..)  |   1.365975   .1072631     3.97   0.000     1.171122    1.593248
             |
smoke_nomiss |
     Former  |   1.175483   .0398672     4.77   0.000     1.099885    1.256276
    Current  |   1.021141   .0814195     0.26   0.793      .873406    1.193865
             |
     diabcat |
Controlle..  |   1.181703   .0435878     4.53   0.000     1.099288    1.270298
Uncontrol..  |   1.502392   .0769396     7.95   0.000     1.358914    1.661018
Diabetes,..  |   .8981928   .2442777    -0.39   0.693     .5270743     1.53062
             |
1.myocardi~t |   1.133787   .0524872     2.71   0.007     1.035443    1.241471
       1.pad |   1.330408   .0762311     4.98   0.000     1.189082    1.488531
1.hyperten~n |   1.041968   .0382586     1.12   0.263     .9696167    1.119717
1.heart_f~re |   1.284025   .0422184     7.60   0.000     1.203888    1.369496
1.stroke_tia |   1.165721   .0401131     4.46   0.000     1.089693    1.247053
       1.vte |   1.402147   .0675806     7.01   0.000     1.275755    1.541061
 1.oestrogen |   1.080621   .2461541     0.34   0.734     .6914788    1.688761
1.flu_vac~ne |   .8322793   .0321445    -4.75   0.000     .7716027    .8977273
1.care_ho~ce |   6.912476   .3066443    43.58   0.000     6.336851     7.54039
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -22705.078
Iteration 1:   log likelihood = -21200.223
Iteration 2:   log likelihood = -20601.956
Iteration 3:   log likelihood = -20598.662
Iteration 4:   log likelihood = -20598.661
Refining estimates:
Iteration 0:   log likelihood = -20598.661

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        4,442
Time at risk    =   71089826.5
                                                LR chi2(33)      =     4212.83
Log likelihood  =   -20598.661                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8019859   .0319027    -5.55   0.000     .7418331    .8670162
      1.male |   1.266809   .0415662     7.21   0.000     1.187905    1.350954
        age1 |   .9766223   .0060726    -3.80   0.000     .9647925    .9885972
        age2 |   1.106787   .0122094     9.20   0.000     1.083114    1.130978
        age3 |   .6058936   .0409852    -7.41   0.000     .5306613    .6917916
             |
         imd |
          2  |   1.085418   .0618064     1.44   0.150     .9707946    1.213574
          3  |   1.188599   .0681063     3.02   0.003     1.062336     1.32987
          4  |   1.242717   .0743107     3.63   0.000     1.105282    1.397242
5 most de..  |   1.394202   .0846071     5.48   0.000     1.237857    1.570294
             |
   obese4cat |
Obese I ..)  |   1.006098   .0416165     0.15   0.883     .9277499    1.091062
Obese II..)  |   1.217514   .0711751     3.37   0.001     1.085708     1.36532
Obese II..)  |    1.34803   .1059621     3.80   0.000     1.155555    1.572564
             |
smoke_nomiss |
     Former  |   1.112608   .0384467     3.09   0.002     1.039749    1.190573
    Current  |   .9196437   .0745787    -1.03   0.302     .7844969    1.078073
             |
     diabcat |
Controlle..  |   1.165383   .0431445     4.13   0.000     1.083816    1.253088
Uncontrol..  |   1.428632   .0736396     6.92   0.000     1.291352    1.580506
Diabetes,..  |    .885442   .2409002    -0.45   0.655     .5194881    1.509192
             |
1.myocardi~t |   1.087091    .050405     1.80   0.072     .9926555    1.190511
       1.pad |   1.268435   .0727675     4.14   0.000     1.133539    1.419384
1.hyperten~n |   1.035485   .0381765     0.95   0.344     .9633003     1.11308
1.heart_f~re |   1.176183   .0393598     4.85   0.000     1.101514    1.255912
1.stroke_tia |   1.117175   .0385007     3.22   0.001     1.044207    1.195242
       1.vte |   1.304308   .0631191     5.49   0.000     1.186283    1.434076
 1.oestrogen |   1.065105   .2436572     0.28   0.783       .68025    1.667694
1.flu_vac~ne |   .8381384   .0325445    -4.55   0.000     .7767191    .9044144
             |
         ckd |
        CKD  |   1.141625   .0381681     3.96   0.000     1.069215    1.218939
      1.copd |   1.244757    .055761     4.89   0.000     1.140128    1.358988
1.other_re~y |   1.309305    .072031     4.90   0.000     1.175472    1.458376
1.immunode~y |   1.165449   .2241689     0.80   0.426     .7994084    1.699097
    1.cancer |   1.023048   .0398483     0.59   0.559     .9478539    1.104208
1.ae_atten~r |   2.109841    .068269    23.07   0.000     1.980191     2.24798
1.gp_consult |   .6769995   .0561472    -4.70   0.000     .5754315    .7964951
1.care_ho~ce |    6.30772   .2842274    40.87   0.000     5.774536    6.890136
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table2_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6955613   .0265306    -9.52   0.000     .6454584    .7495534
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6608689   .0253053   -10.82   0.000     .6130868    .7123751
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7362777   .0291642    -7.73   0.000     .6812794    .7957158
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8019859   .0319027    -5.55   0.000     .7418331    .8670162
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_posit
> ivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:19:36
-------------------------------------------------------------------------------
