-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_admit
> covid.log
  log type:  text
 opened on:  31 Dec 2020, 03:11:53

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
 warfarin vs |  outcome: SUS covid
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   258,790      1,746 |   260,536 
             |     99.33       0.67 |    100.00 
-------------+----------------------+----------
warfarin use |    87,532        467 |    87,999 
             |     99.47       0.53 |    100.00 
-------------+----------------------+----------
       Total |   346,322      2,213 |   348,535 
             |     99.37       0.63 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28202.062
Iteration 1:   log likelihood = -28191.113
Iteration 2:   log likelihood = -28191.075
Iteration 3:   log likelihood = -28191.075
Refining estimates:
Iteration 0:   log likelihood = -28191.075

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,213
Time at risk    =     71292706
                                                LR chi2(1)       =       21.97
Log likelihood  =   -28191.075                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7875823   .0410305    -4.58   0.000     .7111335    .8722495
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_univ
> ar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_univar.ster
>  saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28202.062
Iteration 1:   log likelihood =  -27932.05
Iteration 2:   log likelihood = -27919.134
Iteration 3:   log likelihood = -27919.079
Iteration 4:   log likelihood = -27919.079
Refining estimates:
Iteration 0:   log likelihood = -27919.079

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,213
Time at risk    =     71292706
                                                LR chi2(5)       =      565.97
Log likelihood  =   -27919.079                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7309724    .038229    -5.99   0.000     .6597572    .8098747
      1.male |    1.42484   .0630854     8.00   0.000     1.306408    1.554009
        age1 |   .9926147   .0098038    -0.75   0.453     .9735843    1.012017
        age2 |   1.102071   .0182216     5.88   0.000      1.06693    1.138369
        age3 |   .6042294     .06024    -5.05   0.000     .4969806    .7346225
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_mult
> ivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_multivar1.s
> ter saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11257.457
Iteration 1:   log likelihood = -11229.167
Iteration 2:   log likelihood = -10662.956
Iteration 3:   log likelihood = -10650.062
Iteration 4:   log likelihood = -10649.969
Iteration 5:   log likelihood = -10649.969
Refining estimates:
Iteration 0:   log likelihood = -10649.969

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,213
Time at risk    =     71292706
                                                LR chi2(26)      =     1214.97
Log likelihood  =   -10649.969                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7570076   .0408733    -5.16   0.000     .6809906    .8415101
      1.male |   1.416253   .0661484     7.45   0.000     1.292362    1.552021
        age1 |   .9982197   .0102925    -0.17   0.863     .9782491    1.018598
        age2 |   1.097531   .0187088     5.46   0.000     1.061469    1.134819
        age3 |   .5840776   .0595483    -5.27   0.000     .4782867    .7132681
             |
         imd |
          2  |   1.042882   .0853159     0.51   0.608     .8883825     1.22425
          3  |    1.25066   .1018359     2.75   0.006     1.066177    1.467063
          4  |   1.277394   .1074105     2.91   0.004     1.083305    1.506256
5 most de..  |   1.398016   .1194421     3.92   0.000     1.182465     1.65286
             |
   obese4cat |
Obese I ..)  |   .9950347   .0572944    -0.09   0.931     .8888444    1.113912
Obese II..)  |   1.288006   .1016483     3.21   0.001     1.103423    1.503467
Obese II..)  |   1.351346   .1475955     2.76   0.006     1.090932    1.673924
             |
smoke_nomiss |
     Former  |   1.347132   .0670358     5.99   0.000     1.221948    1.485141
    Current  |   1.137265   .1260436     1.16   0.246     .9152134     1.41319
             |
     diabcat |
Controlle..  |   1.174508   .0610345     3.10   0.002     1.060772    1.300437
Uncontrol..  |   1.687322   .1159272     7.61   0.000     1.474743    1.930544
Diabetes,..  |   .7379396   .3340753    -0.67   0.502     .3038577    1.792138
             |
1.myocardi~t |   1.295067   .0797082     4.20   0.000     1.147896    1.461105
       1.pad |   1.437469   .1111408     4.69   0.000     1.235339    1.672673
1.hyperten~n |   1.027546   .0532933     0.52   0.600     .9282265    1.137492
1.heart_f~re |   1.355326   .0624057     6.60   0.000      1.23837    1.483328
1.stroke_tia |   1.115125   .0551994     2.20   0.028     1.012019    1.228736
       1.vte |   1.453843   .0990066     5.50   0.000     1.272187    1.661439
 1.oestrogen |   1.025684   .3672459     0.07   0.944     .5084413    2.069122
1.flu_vac~ne |   .9068778   .0507931    -1.75   0.081     .8125947      1.0121
1.care_ho~ce |   3.767383   .2812976    17.76   0.000     3.254494    4.361101
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_mult
> ivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_multivar2.s
> ter saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11257.457
Iteration 1:   log likelihood =  -10997.77
Iteration 2:   log likelihood = -10423.211
Iteration 3:   log likelihood =  -10411.87
Iteration 4:   log likelihood = -10411.805
Iteration 5:   log likelihood = -10411.805
Refining estimates:
Iteration 0:   log likelihood = -10411.805

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,213
Time at risk    =     71292706
                                                LR chi2(33)      =     1691.30
Log likelihood  =   -10411.805                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .833809   .0452392    -3.35   0.001     .7496935    .9273621
      1.male |   1.459057   .0682278     8.08   0.000     1.331278      1.5991
        age1 |    .998646   .0102317    -0.13   0.895     .9787922    1.018902
        age2 |   1.078848   .0183416     4.46   0.000     1.043492    1.115403
        age3 |   .6469785   .0659867    -4.27   0.000     .5297537     .790143
             |
         imd |
          2  |   1.025397   .0840267     0.31   0.760     .8732522    1.204049
          3  |    1.22472   .0997476     2.49   0.013     1.044024     1.43669
          4  |   1.217233   .1026369     2.33   0.020     1.031812    1.435975
5 most de..  |   1.302004   .1115495     3.08   0.002     1.100742    1.540066
             |
   obese4cat |
Obese I ..)  |   .9995511   .0577128    -0.01   0.994     .8926017    1.119315
Obese II..)  |   1.277989   .1011005     3.10   0.002     1.094433     1.49233
Obese II..)  |   1.310963   .1434551     2.47   0.013     1.057903    1.624557
             |
smoke_nomiss |
     Former  |   1.225667   .0623289     4.00   0.000     1.109395    1.354125
    Current  |   .9483515   .1071827    -0.47   0.639     .7599176    1.183511
             |
     diabcat |
Controlle..  |   1.136973   .0593409     2.46   0.014     1.026418    1.259435
Uncontrol..  |   1.564458   .1083624     6.46   0.000     1.365858    1.791936
Diabetes,..  |   .7120324   .3226925    -0.75   0.454     .2929112    1.730867
             |
1.myocardi~t |   1.222471     .07544     3.26   0.001     1.083203    1.379644
       1.pad |   1.340913    .104023     3.78   0.000     1.151775    1.561111
1.hyperten~n |   1.018641   .0530755     0.35   0.723     .9197507    1.128165
1.heart_f~re |   1.194972   .0560331     3.80   0.000     1.090044        1.31
1.stroke_tia |   1.060193   .0526168     1.18   0.239     .9619233    1.168503
       1.vte |    1.32705   .0908006     4.14   0.000     1.160502    1.517501
 1.oestrogen |   1.040141   .3735357     0.11   0.913     .5145272    2.102693
1.flu_vac~ne |   .9012558   .0507583    -1.85   0.065     .8070656    1.006439
             |
         ckd |
        CKD  |   1.292676   .0609783     5.44   0.000      1.17852    1.417891
      1.copd |   1.505829   .0877737     7.02   0.000     1.343259    1.688074
1.other_re~y |   1.401155   .1016288     4.65   0.000     1.215477    1.615198
1.immunode~y |   1.009844   .2834887     0.03   0.972     .5825058    1.750685
    1.cancer |   1.010823   .0553117     0.20   0.844     .9080247    1.125258
1.ae_atten~r |   2.233791   .1022915    17.55   0.000     2.042037    2.443551
1.gp_consult |   .7497939   .1032123    -2.09   0.036     .5724934    .9820042
1.care_ho~ce |   3.468842   .2620565    16.46   0.000     2.991436    4.022437
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_mult
> ivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/admitcovid_multivar3.s
> ter saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table2_admitcovid
> .txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7875823   .0410305    -4.58   0.000     .7111335    .8722495
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7309724    .038229    -5.99   0.000     .6597572    .8098747
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7570076   .0408733    -5.16   0.000     .6809906    .8415101
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .833809   .0452392    -3.35   0.001     .7496935    .9273621
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_admit
> covid.log
  log type:  text
 closed on:  31 Dec 2020, 03:13:44
-------------------------------------------------------------------------------
