-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_onsco
> viddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:11:14

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   258,836      1,700 |   260,536 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    87,591        408 |    87,999 
             |     99.54       0.46 |    100.00 
-------------+----------------------+----------
       Total |   346,427      2,108 |   348,535 
             |     99.40       0.60 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -26863.023
Iteration 1:   log likelihood = -26841.882
Iteration 2:   log likelihood = -26841.729
Iteration 3:   log likelihood = -26841.729
Refining estimates:
Iteration 0:   log likelihood = -26841.729

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,108
Time at risk    =     71466189
                                                LR chi2(1)       =       42.59
Log likelihood  =   -26841.729                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7063792   .0389421    -6.31   0.000     .6340331    .7869804
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_u
> nivar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_univar.s
> ter saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -26863.023
Iteration 1:   log likelihood = -26347.353
Iteration 2:   log likelihood = -26172.619
Iteration 3:   log likelihood = -26168.603
Iteration 4:   log likelihood = -26168.599
Refining estimates:
Iteration 0:   log likelihood = -26168.599

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,108
Time at risk    =     71466189
                                                LR chi2(5)       =     1388.85
Log likelihood  =   -26168.599                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6423966   .0355249    -8.00   0.000     .5764097    .7159375
      1.male |   1.508988   .0679297     9.14   0.000     1.381553    1.648178
        age1 |   1.050612   .0200497     2.59   0.010     1.012041    1.090652
        age2 |   1.077843   .0284511     2.84   0.005     1.023498    1.135074
        age3 |   .6716794   .0908329    -2.94   0.003     .5152902    .8755322
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_m
> ultivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_multivar
> 1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10799.421
Iteration 1:   log likelihood = -9939.9309
Iteration 2:   log likelihood = -9546.3511
Iteration 3:   log likelihood = -9543.2832
Iteration 4:   log likelihood = -9543.1764
Iteration 5:   log likelihood = -9543.1761
Refining estimates:
Iteration 0:   log likelihood = -9543.1761

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,108
Time at risk    =     71466189
                                                LR chi2(26)      =     2512.49
Log likelihood  =   -9543.1761                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7307016   .0420066    -5.46   0.000     .6528392    .8178506
      1.male |   1.556554   .0750632     9.18   0.000     1.416171    1.710852
        age1 |   1.057712   .0204994     2.90   0.004     1.018287    1.098663
        age2 |    1.06977   .0286695     2.52   0.012      1.01503    1.127463
        age3 |   .6233051   .0855557    -3.44   0.001     .4762814    .8157138
             |
         imd |
          2  |   .9899882   .0809422    -0.12   0.902      .843403     1.16205
          3  |   1.192645    .097553     2.15   0.031     1.015984    1.400025
          4  |   1.091422   .0952003     1.00   0.316     .9199107     1.29491
5 most de..  |   1.327805   .1177035     3.20   0.001     1.116039    1.579753
             |
   obese4cat |
Obese I ..)  |    .989652   .0603948    -0.17   0.865     .8780855    1.115394
Obese II..)  |   1.175962   .1071989     1.78   0.075     .9835561    1.406007
Obese II..)  |   1.423631   .1838152     2.74   0.006     1.105332     1.83359
             |
smoke_nomiss |
     Former  |   1.341717   .0683192     5.77   0.000     1.214279     1.48253
    Current  |   1.381536   .1625759     2.75   0.006      1.09697    1.739921
             |
     diabcat |
Controlle..  |   1.218345   .0647201     3.72   0.000     1.097877    1.352033
Uncontrol..  |    1.43812   .1104465     4.73   0.000     1.237153    1.671732
Diabetes,..  |   .4935238   .2497546    -1.40   0.163     .1830399    1.330671
             |
1.myocardi~t |   1.400435   .0851089     5.54   0.000     1.243176    1.577586
       1.pad |   1.384366    .108494     4.15   0.000     1.187248    1.614211
1.hyperten~n |   1.045165   .0563634     0.82   0.413     .9403322    1.161684
1.heart_f~re |    1.46664   .0687542     8.17   0.000      1.33789     1.60778
1.stroke_tia |   1.190072   .0583339     3.55   0.000      1.08106    1.310077
       1.vte |   1.410765   .0979648     4.96   0.000      1.23125    1.616452
 1.oestrogen |   .6650973   .3020736    -0.90   0.369      .273078    1.619883
1.flu_vac~ne |   .8193046   .0469464    -3.48   0.001       .73227    .9166838
1.care_ho~ce |   6.796643   .4230858    30.79   0.000     6.015999    7.678583
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_m
> ultivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_multivar
> 2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -10799.421
Iteration 1:   log likelihood = -9779.6333
Iteration 2:   log likelihood = -9358.9967
Iteration 3:   log likelihood = -9355.8092
Iteration 4:   log likelihood = -9355.7104
Iteration 5:   log likelihood = -9355.7102
Refining estimates:
Iteration 0:   log likelihood = -9355.7102

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =        2,108
Time at risk    =     71466189
                                                LR chi2(33)      =     2887.42
Log likelihood  =   -9355.7102                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7991734   .0461481    -3.88   0.000     .7136554    .8949391
      1.male |   1.582224   .0763303     9.51   0.000     1.439474     1.73913
        age1 |   1.059861   .0205318     3.00   0.003     1.020374    1.100877
        age2 |   1.050186   .0281569     1.83   0.068     .9964239    1.106848
        age3 |   .6934653   .0953647    -2.66   0.008     .5296248    .9079903
             |
         imd |
          2  |   .9906346   .0811524    -0.11   0.909      .843691    1.163171
          3  |   1.171619   .0959566     1.93   0.053     .9978663    1.375627
          4  |   1.052521   .0920991     0.58   0.559     .8866405    1.249435
5 most de..  |    1.26342    .112367     2.63   0.009     1.061312    1.504017
             |
   obese4cat |
Obese I ..)  |   .9935297   .0608294    -0.11   0.916     .8811818    1.120202
Obese II..)  |   1.166737   .1066289     1.69   0.092     .9753965    1.395613
Obese II..)  |   1.383046    .178959     2.51   0.012     1.073237    1.782288
             |
smoke_nomiss |
     Former  |   1.261952   .0653443     4.49   0.000     1.140164    1.396749
    Current  |   1.244012   .1491297     1.82   0.069     .9835218    1.573493
             |
     diabcat |
Controlle..  |   1.189663    .063485     3.25   0.001     1.071521    1.320831
Uncontrol..  |   1.329539   .1029626     3.68   0.000     1.142305    1.547463
Diabetes,..  |   .4979243   .2520486    -1.38   0.168     .1846232     1.34289
             |
1.myocardi~t |    1.33339   .0811971     4.72   0.000     1.183376     1.50242
       1.pad |   1.304629    .102612     3.38   0.001     1.118248    1.522075
1.hyperten~n |   1.022098   .0554095     0.40   0.687     .9190676    1.136678
1.heart_f~re |   1.312956    .062608     5.71   0.000     1.195806    1.441582
1.stroke_tia |   1.139478   .0559459     2.66   0.008     1.034937     1.25458
       1.vte |   1.311773   .0913096     3.90   0.000      1.14448    1.503519
 1.oestrogen |   .6676198   .3042523    -0.89   0.375     .2732837    1.630965
1.flu_vac~ne |   .8222525   .0473484    -3.40   0.001     .7344966    .9204933
             |
         ckd |
        CKD  |    1.29856   .0624456     5.43   0.000      1.18176    1.426905
      1.copd |   1.226971   .0779297     3.22   0.001     1.083355    1.389624
1.other_re~y |   1.487017   .1116038     5.29   0.000     1.283605    1.722663
1.immunode~y |   1.610271   .3906027     1.96   0.050     1.000975    2.590446
    1.cancer |   1.000148   .0557966     0.00   0.998     .8965556     1.11571
1.ae_atten~r |     2.1528   .1022779    16.14   0.000     1.961389     2.36289
1.gp_consult |   .7017102   .0826928    -3.01   0.003      .556991    .8840307
1.care_ho~ce |   6.275702   .3974137    29.00   0.000     5.543184     7.10502
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_m
> ultivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onscoviddeath_multivar
> 3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table2_onscovidde
> ath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7063792   .0389421    -6.31   0.000     .6340331    .7869804
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6423966   .0355249    -8.00   0.000     .5764097    .7159375
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7307016   .0420066    -5.46   0.000     .6528392    .8178506
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7991734   .0461481    -3.88   0.000     .7136554    .8949391
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_onsco
> viddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:13:09
-------------------------------------------------------------------------------
