-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/06b_an_models_ethni
> city_onsnoncoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 03:15:41

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(91,960 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   184,897      7,134 |   192,031 
             |     96.28       3.72 |    100.00 
-------------+----------------------+----------
warfarin use |    62,595      1,949 |    64,544 
             |     96.98       3.02 |    100.00 
-------------+----------------------+----------
       Total |   247,492      9,083 |   256,575 
             |     96.46       3.54 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -112895.39
Iteration 1:   log likelihood = -112858.76
Iteration 2:   log likelihood = -112858.65
Iteration 3:   log likelihood = -112858.65
Refining estimates:
Iteration 0:   log likelihood = -112858.65

Cox regression -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        9,083
Time at risk    =     52674756
                                                LR chi2(1)       =       73.47
Log likelihood  =   -112858.65                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .806746   .0206196    -8.40   0.000      .767328     .848189
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_univar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_univa
> r_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -112895.39
Iteration 1:   log likelihood = -111438.55
Iteration 2:   log likelihood = -109994.62
Iteration 3:   log likelihood = -109946.66
Iteration 4:   log likelihood = -109946.48
Iteration 5:   log likelihood = -109946.48
Refining estimates:
Iteration 0:   log likelihood = -109946.48

Cox regression -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        9,083
Time at risk    =     52674756
                                                LR chi2(5)       =     5897.81
Log likelihood  =   -109946.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7471631   .0191685   -11.36   0.000     .7105224    .7856933
      1.male |   1.222659   .0262597     9.36   0.000     1.172259    1.275226
        age1 |    1.03221   .0079173     4.13   0.000     1.016808    1.047844
        age2 |   1.072168   .0119252     6.27   0.000     1.049048    1.095798
        age3 |   .7897267   .0466413    -4.00   0.000     .7034039    .8866431
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44697.773
Iteration 1:   log likelihood = -41236.321
Iteration 2:   log likelihood = -40508.626
Iteration 3:   log likelihood = -40492.353
Iteration 4:   log likelihood = -40491.935
Iteration 5:   log likelihood = -40491.934
Refining estimates:
Iteration 0:   log likelihood = -40491.934

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        9,083
Time at risk    =     52674756
                                                LR chi2(30)      =     8411.68
Log likelihood  =   -40491.934                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7821234   .0208179    -9.23   0.000     .7423671    .8240089
      1.male |   1.205572   .0275599     8.18   0.000     1.152747    1.260816
        age1 |    1.04371   .0082603     5.41   0.000     1.027645    1.060026
        age2 |    1.05514   .0120647     4.69   0.000     1.031756    1.079053
        age3 |   .7989829   .0484402    -3.70   0.000     .7094656    .8997951
             |
         imd |
          2  |   1.057808   .0413741     1.44   0.151     .9797469    1.142089
          3  |   1.080452   .0425982     1.96   0.050     1.000105    1.167253
          4  |   1.124031   .0464165     2.83   0.005      1.03664    1.218788
5 most de..  |   1.340372   .0572782     6.86   0.000     1.232681     1.45747
             |
   obese4cat |
Obese I ..)  |   .7506514   .0235152    -9.16   0.000     .7059487    .7981847
Obese II..)  |   .8911298   .0415401    -2.47   0.013     .8133212    .9763821
Obese II..)  |   1.203786   .0740982     3.01   0.003     1.066975    1.358139
             |
smoke_nomiss |
     Former  |   1.229118   .0299894     8.46   0.000     1.171723    1.289324
    Current  |   2.024007   .0963013    14.82   0.000     1.843794    2.221835
             |
     diabcat |
Controlle..  |   1.215049   .0312156     7.58   0.000     1.155383    1.277797
Uncontrol..  |   1.460911   .0540518    10.25   0.000     1.358722    1.570787
Diabetes,..  |    1.34573   .2283468     1.75   0.080     .9649927    1.876687
             |
1.myocardi~t |   1.193673   .0364614     5.80   0.000     1.124307    1.267319
       1.pad |    1.44517   .0539251     9.87   0.000     1.343251    1.554822
1.hyperten~n |   1.118685   .0296877     4.23   0.000     1.061985    1.178411
1.heart_f~re |   1.702872   .0379743    23.87   0.000     1.630047    1.778951
1.stroke_tia |   1.235442   .0291664     8.96   0.000     1.179579     1.29395
       1.vte |   1.298568   .0448317     7.57   0.000     1.213606    1.389477
 1.oestrogen |    1.18381   .1935889     1.03   0.302     .8591813    1.631095
1.flu_vac~ne |   .7613017   .0208204    -9.97   0.000     .7215688    .8032225
1.care_ho~ce |   3.097545   .1097767    31.90   0.000      2.88969    3.320352
             |
   ethnicity |
      Mixed  |    .882906   .2204764    -0.50   0.618     .5411968    1.440369
Asian or ..  |   .9500323   .1034609    -0.47   0.638     .7674328    1.176079
      Black  |   .8947731   .1422497    -0.70   0.484     .6552246      1.2219
      Other  |   .7984159   .1618333    -1.11   0.267     .5366567    1.187851
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44697.773
Iteration 1:   log likelihood = -41236.863
Iteration 2:   log likelihood = -40509.658
Iteration 3:   log likelihood = -40493.409
Iteration 4:   log likelihood = -40492.991
Iteration 5:   log likelihood =  -40492.99
Refining estimates:
Iteration 0:   log likelihood =  -40492.99

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        9,083
Time at risk    =     52674756
                                                LR chi2(26)      =     8409.57
Log likelihood  =    -40492.99                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7824291   .0208213    -9.22   0.000     .7426662     .824321
      1.male |   1.205274   .0275508     8.17   0.000     1.152467    1.260501
        age1 |   1.043929   .0082611     5.43   0.000     1.027862    1.060247
        age2 |   1.054884   .0120602     4.67   0.000     1.031509    1.078788
        age3 |   .7999468   .0484903    -3.68   0.000      .710336    .9008622
             |
         imd |
          2  |   1.057917   .0413772     1.44   0.150       .97985    1.142204
          3  |   1.080604   .0426025     1.97   0.049     1.000249    1.167414
          4  |   1.123958   .0464096     2.83   0.005      1.03658    1.218701
5 most de..  |   1.339518   .0572263     6.84   0.000     1.231924    1.456509
             |
   obese4cat |
Obese I ..)  |   .7507106   .0235151    -9.15   0.000     .7060082    .7982435
Obese II..)  |   .8914726   .0415508    -2.46   0.014     .8136437    .9767463
Obese II..)  |   1.204623   .0741309     3.03   0.002     1.067749    1.359042
             |
smoke_nomiss |
     Former  |   1.230715   .0299602     8.53   0.000     1.173373    1.290859
    Current  |   2.027667   .0963746    14.87   0.000     1.847308    2.225636
             |
     diabcat |
Controlle..  |   1.213768   .0311588     7.55   0.000     1.154209      1.2764
Uncontrol..  |   1.458698    .053905    10.22   0.000     1.356781     1.56827
Diabetes,..  |   1.344797   .2281703     1.75   0.081     .9643488    1.875336
             |
1.myocardi~t |     1.1933   .0364352     5.79   0.000     1.123983    1.266892
       1.pad |   1.445622    .053934     9.88   0.000     1.343686    1.555292
1.hyperten~n |   1.118193   .0296714     4.21   0.000     1.061524    1.177886
1.heart_f~re |   1.702834   .0379697    23.87   0.000     1.630017    1.778903
1.stroke_tia |   1.235218   .0291593     8.95   0.000     1.179368    1.293711
       1.vte |   1.299111   .0448464     7.58   0.000     1.214121     1.39005
 1.oestrogen |   1.184211   .1936514     1.03   0.301     .8594765    1.631639
1.flu_vac~ne |   .7616289   .0208278    -9.96   0.000     .7218818    .8035644
1.care_ho~ce |   3.099366   .1098038    31.93   0.000     2.891457    3.322226
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44697.773
Iteration 1:   log likelihood = -44065.248
Iteration 2:   log likelihood = -39666.753
Iteration 3:   log likelihood = -39563.176
Iteration 4:   log likelihood = -39563.055
Iteration 5:   log likelihood = -39563.055
Refining estimates:
Iteration 0:   log likelihood = -39563.055

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        9,083
Time at risk    =     52674756
                                                LR chi2(37)      =    10269.44
Log likelihood  =   -39563.055                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8702765   .0233245    -5.18   0.000     .8257411    .9172137
      1.male |   1.197934   .0274001     7.90   0.000     1.145417    1.252859
        age1 |   1.040934   .0081868     5.10   0.000     1.025011    1.057104
        age2 |   1.041348   .0118638     3.56   0.000     1.018352    1.064862
        age3 |   .8812341   .0533833    -2.09   0.037     .7825775    .9923281
             |
         imd |
          2  |   1.055464   .0413993     1.38   0.169     .9773632    1.139805
          3  |   1.068196   .0421979     1.67   0.095     .9886106    1.154189
          4  |   1.101413   .0455951     2.33   0.020     1.015578    1.194504
5 most de..  |   1.280354   .0549867     5.75   0.000     1.176994    1.392792
             |
   obese4cat |
Obese I ..)  |   .7642457   .0240018    -8.56   0.000     .7186216    .8127664
Obese II..)  |   .8953452    .041825    -2.37   0.018     .8170104    .9811907
Obese II..)  |   1.184788   .0730905     2.75   0.006     1.049855    1.337063
             |
smoke_nomiss |
     Former  |   1.136738   .0282718     5.15   0.000     1.082655    1.193522
    Current  |   1.769128   .0864193    11.68   0.000     1.607605     1.94688
             |
     diabcat |
Controlle..  |   1.184087    .030555     6.55   0.000      1.12569    1.245514
Uncontrol..  |     1.3922   .0518084     8.89   0.000     1.294272    1.497537
Diabetes,..  |   1.313846   .2231069     1.61   0.108     .9418901    1.832689
             |
1.myocardi~t |   1.153064   .0353092     4.65   0.000     1.085895    1.224388
       1.pad |    1.37012   .0513106     8.41   0.000     1.273156     1.47447
1.hyperten~n |   1.119303   .0298122     4.23   0.000     1.062371    1.179286
1.heart_f~re |   1.560606   .0354676    19.58   0.000     1.492616    1.631693
1.stroke_tia |   1.185466   .0280865     7.18   0.000     1.131676    1.241812
       1.vte |    1.17376   .0407547     4.61   0.000     1.096539    1.256418
 1.oestrogen |   .9635896   .1581825    -0.23   0.821     .6984884    1.329306
1.flu_vac~ne |   .7513243   .0206796   -10.39   0.000     .7118668    .7929688
             |
         ckd |
        CKD  |   1.120165   .0260639     4.88   0.000     1.070228    1.172432
      1.copd |   1.337917   .0401249     9.71   0.000      1.26154    1.418917
1.other_re~y |   1.428628   .0522931     9.75   0.000     1.329726    1.534887
1.immunode~y |   1.386497   .1610189     2.81   0.005     1.104246    1.740892
    1.cancer |   1.627005   .0390992    20.25   0.000     1.552148    1.705471
1.ae_atten~r |   2.071429   .0472116    31.95   0.000     1.980932     2.16606
1.gp_consult |   .7898622   .0509645    -3.66   0.000     .6960318    .8963417
1.care_ho~ce |   2.915578   .1048172    29.76   0.000     2.717211    3.128427
             |
   ethnicity |
      Mixed  |   .9062757   .2265399    -0.39   0.694     .5552482    1.479222
Asian or ..  |   .9774096   .1069827    -0.21   0.835     .7886931    1.211282
      Black  |   .9147604   .1455972    -0.56   0.576      .669617     1.24965
      Other  |   .8270039   .1684491    -0.93   0.351     .5547914    1.232779
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -44697.773
Iteration 1:   log likelihood =  -44065.78
Iteration 2:   log likelihood = -39667.493
Iteration 3:   log likelihood = -39563.856
Iteration 4:   log likelihood = -39563.734
Iteration 5:   log likelihood = -39563.734
Refining estimates:
Iteration 0:   log likelihood = -39563.734

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        9,083
Time at risk    =     52674756
                                                LR chi2(33)      =    10268.08
Log likelihood  =   -39563.734                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8704634   .0233245    -5.18   0.000      .825928    .9174003
      1.male |    1.19763   .0273891     7.89   0.000     1.145134    1.252533
        age1 |   1.041092   .0081863     5.12   0.000      1.02517    1.057261
        age2 |   1.041161   .0118594     3.54   0.000     1.018175    1.064667
        age3 |   .8820093   .0534193    -2.07   0.038     .7832848    .9931769
             |
         imd |
          2  |   1.055535   .0414013     1.38   0.168     .9774306    1.139881
          3  |   1.068241   .0421981     1.67   0.095     .9886549    1.154234
          4  |   1.101316   .0455879     2.33   0.020     1.015494    1.194391
5 most de..  |   1.279619   .0549418     5.74   0.000     1.176342    1.391964
             |
   obese4cat |
Obese I ..)  |   .7642212   .0239997    -8.56   0.000     .7186011    .8127375
Obese II..)  |   .8954781   .0418275    -2.36   0.018     .8171384    .9813282
Obese II..)  |   1.185086   .0730947     2.75   0.006     1.050144    1.337368
             |
smoke_nomiss |
     Former  |   1.137603   .0282338     5.19   0.000      1.08359    1.194308
    Current  |   1.770858    .086415    11.71   0.000     1.609335    1.948592
             |
     diabcat |
Controlle..  |   1.183308   .0305115     6.53   0.000     1.124992    1.244646
Uncontrol..  |   1.390997   .0517042     8.88   0.000     1.293262    1.496118
Diabetes,..  |   1.313856   .2230943     1.61   0.108     .9419173    1.832664
             |
1.myocardi~t |   1.152916   .0352934     4.65   0.000     1.085776    1.224207
       1.pad |   1.370259   .0513106     8.41   0.000     1.273294    1.474608
1.hyperten~n |   1.119048   .0298021     4.22   0.000     1.062136    1.179011
1.heart_f~re |   1.560737   .0354671    19.59   0.000     1.492748    1.631823
1.stroke_tia |   1.185369   .0280826     7.18   0.000     1.131587    1.241708
       1.vte |   1.174074   .0407639     4.62   0.000     1.096836    1.256751
 1.oestrogen |   .9638994   .1582284    -0.22   0.823     .6987199     1.32972
1.flu_vac~ne |   .7516374   .0206855   -10.37   0.000     .7121685    .7932936
             |
         ckd |
        CKD  |   1.119891   .0260538     4.87   0.000     1.069973    1.172137
      1.copd |   1.338395   .0401353     9.72   0.000     1.261998    1.419416
1.other_re~y |   1.428758   .0522952     9.75   0.000     1.329851     1.53502
1.immunode~y |   1.386843   .1610298     2.82   0.005     1.104567    1.741255
    1.cancer |   1.627367   .0390965    20.27   0.000     1.552515    1.705827
1.ae_atten~r |   2.071233    .047205    31.95   0.000     1.980749    2.165851
1.gp_consult |   .7893917   .0509328    -3.67   0.000     .6956195    .8958048
1.care_ho~ce |   2.916541   .1048166    29.78   0.000     2.718172    3.129385
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table3_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    192,031    3.93e+07           0   3.93e+07   3.93e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     64,544    1.33e+07           0   1.33e+07   1.33e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .806746   .0206196    -8.40   0.000      .767328     .848189
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7471631   .0191685   -11.36   0.000     .7105224    .7856933
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7821234   .0208179    -9.23   0.000     .7423671    .8240089
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7824291   .0208213    -9.22   0.000     .7426662     .824321
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8702765   .0233245    -5.18   0.000     .8257411    .9172137
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8704634   .0233245    -5.18   0.000      .825928    .9174003
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/06b_an_models_ethni
> city_onsnoncoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:18:15
-------------------------------------------------------------------------------
