-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_onsnoncoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 02:58:15

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   268,356     11,100 |   279,456 
             |     96.03       3.97 |    100.00 
-------------+----------------------+----------
warfarin use |    89,124      2,971 |    92,095 
             |     96.77       3.23 |    100.00 
-------------+----------------------+----------
       Total |   357,480     14,071 |   371,551 
             |     96.21       3.79 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -180082.83
Iteration 1:   log likelihood = -180026.36
Iteration 2:   log likelihood = -180026.19
Iteration 3:   log likelihood = -180026.19
Refining estimates:
Iteration 0:   log likelihood = -180026.19

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       14,071
Time at risk    =   76162013.5
                                                LR chi2(1)       =      113.27
Log likelihood  =   -180026.19                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8061932   .0166529   -10.43   0.000     .7742061     .839502
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_univar.ster no
> t found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -180082.83
Iteration 1:   log likelihood = -177769.75
Iteration 2:   log likelihood = -175732.76
Iteration 3:   log likelihood = -175669.82
Iteration 4:   log likelihood = -175669.64
Refining estimates:
Iteration 0:   log likelihood = -175669.64

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       14,071
Time at risk    =   76162013.5
                                                LR chi2(5)       =     8826.38
Log likelihood  =   -175669.64                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7545733   .0156413   -13.59   0.000     .7245314     .785861
      1.male |   1.208153   .0208834    10.94   0.000     1.167908    1.249785
        age1 |   1.036287   .0065857     5.61   0.000     1.023459    1.049275
        age2 |   1.061886   .0097102     6.57   0.000     1.043024     1.08109
        age3 |   .8338115   .0401666    -3.77   0.000     .7586886    .9163727
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar1.ster
>  not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -74091.979
Iteration 1:   log likelihood = -68907.216
Iteration 2:   log likelihood = -67769.912
Iteration 3:   log likelihood = -67746.061
Iteration 4:   log likelihood = -67745.431
Iteration 5:   log likelihood =  -67745.43
Refining estimates:
Iteration 0:   log likelihood =  -67745.43

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       14,071
Time at risk    =   76162013.5
                                                LR chi2(27)      =    12693.10
Log likelihood  =    -67745.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7895644   .0169175   -11.03   0.000     .7570934    .8234281
      1.male |   1.191795   .0218998     9.55   0.000     1.149636      1.2355
        age1 |   1.045859    .006808     6.89   0.000       1.0326    1.059288
        age2 |   1.049984   .0098049     5.22   0.000     1.030941    1.069378
        age3 |    .823772   .0404891    -3.94   0.000     .7481173    .9070774
             |
         imd |
          2  |    1.00915   .0309474     0.30   0.766     .9502813    1.071666
          3  |    1.07184   .0330392     2.25   0.024     1.009002    1.138592
          4  |   1.136721   .0367092     3.97   0.000     1.067002    1.210996
5 most de..  |    1.31391   .0445899     8.04   0.000     1.229359    1.404277
             |
   obese4cat |
Obese I ..)  |   .7672557   .0192839   -10.54   0.000     .7303757    .8059979
Obese II..)  |    .896313   .0337044    -2.91   0.004     .8326293    .9648676
Obese II..)  |   1.165875   .0590306     3.03   0.002     1.055733    1.287509
             |
smoke_nomiss |
     Former  |   1.223788   .0237722    10.40   0.000     1.178071    1.271279
    Current  |   1.987199   .0757074    18.03   0.000     1.844219    2.141263
             |
     diabcat |
Controlle..  |   1.188707   .0246632     8.33   0.000     1.141338    1.238042
Uncontrol..  |   1.431303   .0424485    12.09   0.000     1.350478    1.516967
Diabetes,..  |   1.150063   .1604316     1.00   0.316     .8749449     1.51169
             |
1.myocardi~t |   1.156159   .0278827     6.02   0.000     1.102781     1.21212
       1.pad |    1.44645   .0422296    12.64   0.000     1.366005    1.531632
1.hyperten~n |   1.104005   .0230519     4.74   0.000     1.059736    1.150123
1.heart_f~re |   1.672688   .0298785    28.80   0.000      1.61514    1.732286
1.stroke_tia |      1.209   .0228404    10.05   0.000     1.165053    1.254606
       1.vte |   1.279144   .0356402     8.84   0.000     1.211164    1.350941
 1.oestrogen |   1.303624   .1596017     2.17   0.030     1.025512     1.65716
1.antiplat~t |    1.09248   .0372348     2.60   0.009     1.021885    1.167951
1.flu_vac~ne |   .7720593   .0167016   -11.96   0.000      .740009    .8054977
1.care_ho~ce |   3.189699    .090426    40.92   0.000     3.017301    3.371947
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2.ster
>  not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -74091.979
Iteration 1:   log likelihood = -67683.109
Iteration 2:   log likelihood = -66324.569
Iteration 3:   log likelihood = -66301.456
Iteration 4:   log likelihood = -66300.915
Iteration 5:   log likelihood = -66300.914
Refining estimates:
Iteration 0:   log likelihood = -66300.914

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       14,071
Time at risk    =   76162013.5
                                                LR chi2(34)      =    15582.13
Log likelihood  =   -66300.914                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8762835   .0188951    -6.12   0.000     .8400214     .914111
      1.male |   1.184448   .0217582     9.21   0.000     1.142562    1.227871
        age1 |   1.043607   .0067562     6.59   0.000     1.030449    1.056933
        age2 |   1.036031   .0096429     3.80   0.000     1.017303    1.055105
        age3 |    .906558   .0445165    -2.00   0.046     .8233745    .9981453
             |
         imd |
          2  |   1.006527   .0309253     0.21   0.832     .9477031    1.069001
          3  |   1.056028   .0325967     1.77   0.077     .9940333    1.121888
          4  |   1.108219   .0358458     3.18   0.001     1.040143     1.18075
5 most de..  |   1.254479    .042755     6.65   0.000     1.173418    1.341139
             |
   obese4cat |
Obese I ..)  |   .7792578    .019626    -9.90   0.000     .7417256    .8186893
Obese II..)  |   .9013544   .0339456    -2.76   0.006     .8372184    .9704036
Obese II..)  |   1.154541   .0585574     2.83   0.005     1.045291     1.27521
             |
smoke_nomiss |
     Former  |   1.135602   .0224688     6.43   0.000     1.092407    1.180505
    Current  |   1.752369   .0684692    14.36   0.000     1.623181    1.891838
             |
     diabcat |
Controlle..  |   1.156955   .0240881     7.00   0.000     1.110693    1.205143
Uncontrol..  |   1.363484   .0406464    10.40   0.000     1.286101    1.445523
Diabetes,..  |   1.135991   .1585099     0.91   0.361     .8641776    1.493299
             |
1.myocardi~t |   1.117588   .0269794     4.61   0.000     1.065941    1.171738
       1.pad |   1.371437   .0401548    10.79   0.000      1.29495    1.452441
1.hyperten~n |    1.10278    .023098     4.67   0.000     1.058426    1.148993
1.heart_f~re |   1.536068   .0279238    23.61   0.000     1.482302    1.591784
1.stroke_tia |   1.160813   .0219913     7.87   0.000     1.118501    1.204725
       1.vte |   1.154416   .0323167     5.13   0.000     1.092783    1.219526
 1.oestrogen |   1.052229   .1293783     0.41   0.679     .8268931     1.33897
1.antiplat~t |   1.007447   .0344148     0.22   0.828     .9422038    1.077208
1.flu_vac~ne |   .7619547   .0165733   -12.50   0.000     .7301543    .7951401
             |
         ckd |
        CKD  |   1.122405   .0208506     6.22   0.000     1.082274    1.164024
      1.copd |   1.327647   .0321717    11.70   0.000     1.266066    1.392224
1.other_re~y |   1.432061   .0421639    12.20   0.000      1.35176    1.517131
1.immunode~y |   1.607403   .1438787     5.30   0.000     1.348757    1.915648
    1.cancer |    1.60267   .0308302    24.52   0.000     1.543369    1.664249
1.ae_atten~r |   2.083512   .0381512    40.09   0.000     2.010063    2.159645
1.gp_consult |    .767602   .0392051    -5.18   0.000     .6944823    .8484202
1.care_ho~ce |   3.000871   .0861529    38.28   0.000     2.836677    3.174569
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3.ster
>  not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table2_onsnoncoviddeath.txt not f
> ound)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8061932   .0166529   -10.43   0.000     .7742061     .839502
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7545733   .0156413   -13.59   0.000     .7245314     .785861
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7895644   .0169175   -11.03   0.000     .7570934    .8234281
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8762835   .0188951    -6.12   0.000     .8400214     .914111
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_onsnoncoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 03:00:26
-------------------------------------------------------------------------------
