-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 02:59:33

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   253,542     25,914 |   279,456 
             |     90.73       9.27 |    100.00 
-------------+----------------------+----------
warfarin use |    85,194      6,901 |    92,095 
             |     92.51       7.49 |    100.00 
-------------+----------------------+----------
       Total |   338,736     32,815 |   371,551 
             |     91.17       8.83 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -418579.63
Iteration 1:   log likelihood = -418427.53
Iteration 2:   log likelihood = -418427.03
Iteration 3:   log likelihood = -418427.03
Refining estimates:
Iteration 0:   log likelihood = -418427.03

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(1)       =      305.19
Log likelihood  =   -418427.03                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7933126   .0107463   -17.09   0.000     .7725274    .8146571
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_univar.ster not found
> )
file /workspace/output/warfarin_tempdata/covidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -418579.63
Iteration 1:   log likelihood = -417056.27
Iteration 2:   log likelihood = -416950.91
Iteration 3:   log likelihood = -416950.43
Iteration 4:   log likelihood = -416950.43
Refining estimates:
Iteration 0:   log likelihood = -416950.43

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(5)       =     3258.38
Log likelihood  =   -416950.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7753066   .0105488   -18.70   0.000     .7549046    .7962599
      1.male |   1.014252   .0115197     1.25   0.213     .9919234    1.037083
        age1 |   .9874289   .0020131    -6.21   0.000     .9834911    .9913825
        age2 |   1.044968   .0038546    11.92   0.000      1.03744     1.05255
        age3 |   .9186611   .0217632    -3.58   0.000      .876981     .962322
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar1.ster not fo
> und)
file /workspace/output/warfarin_tempdata/covidtest_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -170200.5
Iteration 1:   log likelihood = -166348.85
Iteration 2:   log likelihood = -165852.72
Iteration 3:   log likelihood = -165851.86
Iteration 4:   log likelihood = -165851.86
Refining estimates:
Iteration 0:   log likelihood = -165851.86

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(27)      =     8697.29
Log likelihood  =   -165851.86                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .791474   .0110756   -16.71   0.000     .7700612    .8134822
      1.male |   1.008314   .0120537     0.69   0.489     .9849634    1.032218
        age1 |   .9869987   .0020665    -6.25   0.000     .9829569    .9910572
        age2 |   1.044352   .0039087    11.59   0.000     1.036719    1.052041
        age3 |   .8684832   .0208087    -5.89   0.000     .8286418    .9102402
             |
         imd |
          2  |   1.023435   .0201735     1.18   0.240       .98465    1.063748
          3  |   1.045709   .0209903     2.23   0.026     1.005367    1.087669
          4  |   1.077725   .0226106     3.57   0.000     1.034308    1.122965
5 most de..  |   1.179541   .0257579     7.56   0.000     1.130122    1.231122
             |
   obese4cat |
Obese I ..)  |   .9105797     .01357    -6.29   0.000     .8843677    .9375687
Obese II..)  |   .9929419   .0212273    -0.33   0.740     .9521967    1.035431
Obese II..)  |   1.003647   .0290936     0.13   0.900     .9482146    1.062321
             |
smoke_nomiss |
     Former  |   1.107897   .0137421     8.26   0.000     1.081288    1.135161
    Current  |   1.188085   .0304714     6.72   0.000     1.129838    1.249334
             |
     diabcat |
Controlle..  |   1.125274   .0154564     8.59   0.000     1.095385     1.15598
Uncontrol..  |   1.320761   .0254155    14.46   0.000     1.271875    1.371525
Diabetes,..  |   1.016458   .1109241     0.15   0.881     .8207284    1.258866
             |
1.myocardi~t |   1.151474   .0192108     8.45   0.000      1.11443    1.189748
       1.pad |   1.327182   .0280582    13.39   0.000     1.273313    1.383331
1.hyperten~n |   1.020068   .0132992     1.52   0.128     .9943322     1.04647
1.heart_f~re |   1.270075   .0155381    19.54   0.000     1.239983    1.300897
1.stroke_tia |   1.162855   .0149901    11.70   0.000     1.133843    1.192609
       1.vte |   1.251139   .0237667    11.79   0.000     1.205414    1.298599
 1.oestrogen |    1.19566   .0923526     2.31   0.021     1.027687    1.391087
1.antiplat~t |   1.213723   .0264603     8.88   0.000     1.162954    1.266708
1.flu_vac~ne |   .9695667   .0141842    -2.11   0.035     .9421609    .9977696
1.care_ho~ce |     4.0266   .0872195    64.31   0.000     3.859231    4.201228
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar2.ster not fo
> und)
file /workspace/output/warfarin_tempdata/covidtest_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -170200.5
Iteration 1:   log likelihood = -165049.35
Iteration 2:   log likelihood = -164232.54
Iteration 3:   log likelihood =  -164231.3
Iteration 4:   log likelihood =  -164231.3
Refining estimates:
Iteration 0:   log likelihood =  -164231.3

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =       32,815
Time at risk    =   73603739.5
                                                LR chi2(34)      =    11938.40
Log likelihood  =    -164231.3                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8485411   .0119271   -11.68   0.000     .8254835    .8722429
      1.male |   1.027522   .0122862     2.27   0.023     1.003722    1.051887
        age1 |   .9882108   .0020639    -5.68   0.000     .9841739    .9922642
        age2 |   1.032901   .0038669     8.65   0.000      1.02535    1.040508
        age3 |   .9291243   .0222901    -3.06   0.002     .8864476    .9738555
             |
         imd |
          2  |   1.020874   .0201309     1.05   0.295     .9821713    1.061103
          3  |   1.035592   .0207955     1.74   0.082     .9956255    1.077163
          4  |   1.058226   .0222256     2.69   0.007     1.015549    1.102696
5 most de..  |   1.139127    .024929     5.95   0.000       1.0913     1.18905
             |
   obese4cat |
Obese I ..)  |   .9188542   .0137084    -5.67   0.000     .8923752    .9461189
Obese II..)  |   .9962068   .0213212    -0.18   0.859     .9552823    1.038885
Obese II..)  |   1.001795   .0290686     0.06   0.951     .9464119     1.06042
             |
smoke_nomiss |
     Former  |   1.056647   .0133288     4.37   0.000     1.030843    1.083097
    Current  |   1.091695   .0286013     3.35   0.001     1.037052    1.149217
             |
     diabcat |
Controlle..  |   1.107374   .0152466     7.41   0.000     1.077891    1.137664
Uncontrol..  |   1.277603   .0246921    12.68   0.000     1.230112    1.326926
Diabetes,..  |   1.015121   .1107043     0.14   0.891     .8197662    1.257031
             |
1.myocardi~t |   1.121093   .0187166     6.85   0.000     1.085003    1.158384
       1.pad |   1.277026   .0270466    11.55   0.000     1.225101    1.331152
1.hyperten~n |   1.019163   .0133254     1.45   0.147     .9933775    1.045618
1.heart_f~re |   1.195812   .0148678    14.38   0.000     1.167024     1.22531
1.stroke_tia |     1.1288   .0145726     9.38   0.000     1.100596    1.157726
       1.vte |   1.167655   .0222623     8.13   0.000     1.124827    1.212114
 1.oestrogen |   1.115758   .0863614     1.42   0.157     .9587069    1.298537
1.antiplat~t |   1.128578   .0246513     5.54   0.000     1.081282    1.177943
1.flu_vac~ne |   .9612219   .0141231    -2.69   0.007     .9339358    .9893051
             |
         ckd |
        CKD  |   1.088838   .0135524     6.84   0.000     1.062597    1.115727
      1.copd |   1.217676   .0202423    11.85   0.000     1.178641    1.258004
1.other_re~y |   1.259699    .027079    10.74   0.000     1.207727    1.313906
1.immunode~y |   1.260025   .0790297     3.69   0.000     1.114272    1.424843
    1.cancer |   1.242053   .0170776    15.77   0.000     1.209028    1.275979
1.ae_atten~r |   1.798132   .0214381    49.21   0.000     1.756601    1.840645
1.gp_consult |   .8225537   .0314523    -5.11   0.000     .7631616    .8865679
1.care_ho~ce |   3.815076    .083534    61.15   0.000     3.654816    3.982363
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar3.ster not fo
> und)
file /workspace/output/warfarin_tempdata/covidtest_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table2_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7933126   .0107463   -17.09   0.000     .7725274    .8146571
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7753066   .0105488   -18.70   0.000     .7549046    .7962599
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .791474   .0110756   -16.71   0.000     .7700612    .8134822
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8485411   .0119271   -11.68   0.000     .8254835    .8722429
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:01:50
-------------------------------------------------------------------------------
