-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 02:54:14

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
 warfarin vs |  outcome: SUS covid
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   277,531      1,925 |   279,456 
             |     99.31       0.69 |    100.00 
-------------+----------------------+----------
warfarin use |    91,605        490 |    92,095 
             |     99.47       0.53 |    100.00 
-------------+----------------------+----------
       Total |   369,136      2,415 |   371,551 
             |     99.35       0.65 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -30930.014
Iteration 1:   log likelihood = -30915.792
Iteration 2:   log likelihood = -30915.731
Iteration 3:   log likelihood = -30915.731
Refining estimates:
Iteration 0:   log likelihood = -30915.731

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,415
Time at risk    =   75970858.5
                                                LR chi2(1)       =       28.57
Log likelihood  =   -30915.731                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7682457   .0388728    -5.21   0.000     .6957126     .848341
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/admitcovid_univar.ster not foun
> d)
file /workspace/output/warfarin_tempdata/admitcovid_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -30930.014
Iteration 1:   log likelihood = -30646.804
Iteration 2:   log likelihood = -30634.008
Iteration 3:   log likelihood = -30633.953
Iteration 4:   log likelihood = -30633.953
Refining estimates:
Iteration 0:   log likelihood = -30633.953

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,415
Time at risk    =   75970858.5
                                                LR chi2(5)       =      592.12
Log likelihood  =   -30633.953                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7156022    .036342    -6.59   0.000     .6478035    .7904967
      1.male |   1.415569   .0602406     8.17   0.000      1.30229    1.538702
        age1 |   .9895707   .0091033    -1.14   0.254     .9718885    1.007575
        age2 |   1.103622   .0171656     6.34   0.000     1.070486    1.137784
        age3 |   .6034148   .0570394    -5.34   0.000     .5013648    .7262365
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/admitcovid_multivar1.ster not f
> ound)
file /workspace/output/warfarin_tempdata/admitcovid_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12416.366
Iteration 1:   log likelihood = -11853.519
Iteration 2:   log likelihood = -11741.115
Iteration 3:   log likelihood = -11740.699
Iteration 4:   log likelihood = -11740.699
Refining estimates:
Iteration 0:   log likelihood = -11740.699

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,415
Time at risk    =   75970858.5
                                                LR chi2(27)      =     1351.33
Log likelihood  =   -11740.699                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7505287   .0393331    -5.48   0.000     .6772643    .8317187
      1.male |   1.402495   .0630812     7.52   0.000     1.284151    1.531745
        age1 |   .9948316   .0095682    -0.54   0.590      .976254    1.013763
        age2 |   1.100359   .0176638     5.96   0.000     1.066278     1.13553
        age3 |   .5809313   .0561823    -5.62   0.000      .480623    .7021745
             |
         imd |
          2  |   1.028577   .0813557     0.36   0.722     .8808676    1.201055
          3  |   1.236189    .097065     2.70   0.007     1.059861    1.441852
          4  |   1.334654   .1072901     3.59   0.000     1.140099    1.562411
5 most de..  |   1.424663   .1167767     4.32   0.000     1.213224    1.672952
             |
   obese4cat |
Obese I ..)  |    .987837   .0543981    -0.22   0.824     .8867709    1.100422
Obese II..)  |   1.322884   .0979321     3.78   0.000     1.144215    1.529451
Obese II..)  |   1.310622   .1381193     2.57   0.010     1.066041    1.611317
             |
smoke_nomiss |
     Former  |   1.357892   .0651206     6.38   0.000     1.236073    1.491717
    Current  |   1.132877   .1180216     1.20   0.231     .9236466    1.389504
             |
     diabcat |
Controlle..  |   1.226544    .060743     4.12   0.000     1.113085    1.351568
Uncontrol..  |   1.759353   .1132902     8.77   0.000     1.550749    1.996018
Diabetes,..  |   .6691695   .3025316    -0.89   0.374     .2758722    1.623171
             |
1.myocardi~t |   1.219811   .0701241     3.46   0.001     1.089831    1.365294
       1.pad |   1.431147   .1019118     5.03   0.000     1.244716    1.645501
1.hyperten~n |    1.00971   .0501126     0.19   0.846      .916117    1.112864
1.heart_f~re |   1.348189   .0592697     6.80   0.000     1.236887    1.469507
1.stroke_tia |   1.141646   .0536288     2.82   0.005     1.041229    1.251747
       1.vte |   1.455417   .0948865     5.76   0.000     1.280834    1.653795
 1.oestrogen |   .9681584   .3460933    -0.09   0.928     .4804657    1.950879
1.antiplat~t |   1.130534   .0884161     1.57   0.117     .9698693    1.317813
1.flu_vac~ne |   .8959911   .0478972    -2.05   0.040     .8068649    .9949623
1.care_ho~ce |   3.893742   .2782697    19.02   0.000     3.384818    4.479185
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/admitcovid_multivar2.ster not f
> ound)
file /workspace/output/warfarin_tempdata/admitcovid_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -12416.366
Iteration 1:   log likelihood = -12180.418
Iteration 2:   log likelihood = -11491.412
Iteration 3:   log likelihood = -11478.874
Iteration 4:   log likelihood = -11478.806
Iteration 5:   log likelihood = -11478.806
Refining estimates:
Iteration 0:   log likelihood = -11478.806

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,415
Time at risk    =   75970858.5
                                                LR chi2(34)      =     1875.12
Log likelihood  =   -11478.806                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8295111   .0437038    -3.55   0.000     .7481275    .9197478
      1.male |   1.442248     .06492     8.14   0.000     1.320458     1.57527
        age1 |   .9948297   .0094934    -0.54   0.587     .9763959    1.013611
        age2 |   1.082666   .0173143     4.97   0.000     1.049257    1.117139
        age3 |   .6418347   .0620422    -4.59   0.000     .5310589    .7757176
             |
         imd |
          2  |   1.012364   .0802029     0.16   0.877     .8667654     1.18242
          3  |   1.211503    .095183     2.44   0.015     1.038601    1.413188
          4  |    1.26993   .1023864     2.96   0.003     1.084308    1.487328
5 most de..  |   1.322309   .1087225     3.40   0.001     1.125501    1.553533
             |
   obese4cat |
Obese I ..)  |   .9928595   .0548464    -0.13   0.897     .8909775    1.106392
Obese II..)  |   1.313277   .0974977     3.67   0.000     1.135437    1.518971
Obese II..)  |   1.277368   .1349636     2.32   0.021     1.038437    1.571274
             |
smoke_nomiss |
     Former  |   1.233093   .0604456     4.27   0.000     1.120135    1.357442
    Current  |   .9405996   .1000142    -0.58   0.565     .7636535    1.158546
             |
     diabcat |
Controlle..  |    1.18794   .0591036     3.46   0.001     1.077568    1.309618
Uncontrol..  |   1.640313   .1065398     7.62   0.000     1.444244    1.863001
Diabetes,..  |   .6505615   .2943356    -0.95   0.342     .2680258    1.579066
             |
1.myocardi~t |   1.158338   .0665957     2.56   0.011     1.034898    1.296501
       1.pad |   1.334745   .0953641     4.04   0.000     1.160331    1.535375
1.hyperten~n |   1.003414   .0500305     0.07   0.946     .9099947    1.106423
1.heart_f~re |   1.195076   .0534817     3.98   0.000      1.09472    1.304633
1.stroke_tia |   1.087053   .0512008     1.77   0.076     .9911939    1.192183
       1.vte |    1.32437   .0867567     4.29   0.000     1.164793    1.505809
 1.oestrogen |   .9479246   .3398091    -0.15   0.881     .4695023    1.913859
1.antiplat~t |   1.029573   .0806765     0.37   0.710     .8829941    1.200485
1.flu_vac~ne |   .8906006   .0478811    -2.16   0.031     .8015306    .9895685
             |
         ckd |
        CKD  |   1.253243   .0566397     4.99   0.000     1.147006     1.36932
      1.copd |   1.504095   .0834536     7.36   0.000     1.349108    1.676886
1.other_re~y |   1.424448   .0977007     5.16   0.000     1.245271    1.629405
1.immunode~y |   .9864807   .2666859    -0.05   0.960     .5807299    1.675726
    1.cancer |    1.04108   .0543271     0.77   0.440     .9398655    1.153195
1.ae_atten~r |   2.253112   .0995363    18.39   0.000     2.066232    2.456895
1.gp_consult |   .7611143   .1013995    -2.05   0.040     .5862036    .9882147
1.care_ho~ce |   3.564593   .2578609    17.57   0.000     3.093388    4.107574
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/admitcovid_multivar3.ster not f
> ound)
file /workspace/output/warfarin_tempdata/admitcovid_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table2_admitcovid.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7682457   .0388728    -5.21   0.000     .6957126     .848341
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7156022    .036342    -6.59   0.000     .6478035    .7904967
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7505287   .0393331    -5.48   0.000     .6772643    .8317187
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8295111   .0437038    -3.55   0.000     .7481275    .9197478
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/05b_an_models_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 02:56:06
-------------------------------------------------------------------------------
