-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_positivecov
> idtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:01:45

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   203,030      2,945 |   205,975 
             |     98.57       1.43 |    100.00 
-------------+----------------------+----------
warfarin use |    66,905        685 |    67,590 
             |     98.99       1.01 |    100.00 
-------------+----------------------+----------
       Total |   269,935      3,630 |   273,565 
             |     98.67       1.33 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45362.245
Iteration 1:   log likelihood = -45325.716
Iteration 2:   log likelihood = -45325.438
Iteration 3:   log likelihood = -45325.438
Refining estimates:
Iteration 0:   log likelihood = -45325.438

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(1)       =       73.62
Log likelihood  =   -45325.438                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7037704   .0298536    -8.28   0.000     .6476248    .7647836
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_univar_ethn.s
> ter not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_univar_ethn.ster sav
> ed

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45362.245
Iteration 1:   log likelihood = -44832.005
Iteration 2:   log likelihood = -44731.679
Iteration 3:   log likelihood = -44729.722
Iteration 4:   log likelihood = -44729.721
Refining estimates:
Iteration 0:   log likelihood = -44729.721

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(5)       =     1265.05
Log likelihood  =   -44729.721                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .662653    .028218    -9.66   0.000     .6095919    .7203327
      1.male |   1.187057   .0405806     5.02   0.000     1.110126    1.269318
        age1 |   .9673552   .0063078    -5.09   0.000     .9550708    .9797977
        age2 |   1.137931   .0133574    11.01   0.000      1.11205    1.164414
        age3 |   .5740762   .0418937    -7.61   0.000      .497568    .6623488
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar1_eth
> n.ster not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar1_ethn.ster 
> saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17736.657
Iteration 1:   log likelihood = -16665.676
Iteration 2:   log likelihood = -16284.436
Iteration 3:   log likelihood = -16282.651
Iteration 4:   log likelihood = -16282.651
Refining estimates:
Iteration 0:   log likelihood = -16282.651

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(31)      =     2908.01
Log likelihood  =   -16282.651                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7448526    .032936    -6.66   0.000     .6830174    .8122859
      1.male |   1.267113   .0463469     6.47   0.000     1.179454    1.361286
        age1 |   .9727989   .0066633    -4.03   0.000     .9598264    .9859467
        age2 |   1.132289   .0137619    10.22   0.000     1.105635    1.159586
        age3 |    .525326   .0393945    -8.58   0.000     .4535205    .6085005
             |
         imd |
          2  |   1.115027   .0730652     1.66   0.097     .9806365    1.267835
          3  |   1.241573   .0808283     3.32   0.001     1.092843    1.410544
          4  |   1.299295   .0879385     3.87   0.000     1.137881    1.483605
5 most de..  |   1.448291   .0989596     5.42   0.000      1.26676    1.655835
             |
   obese4cat |
Obese I ..)  |   .9974373   .0452092    -0.06   0.955     .9126507    1.090101
Obese II..)  |   1.262006   .0793047     3.70   0.000     1.115762    1.427417
Obese II..)  |   1.304003   .1159231     2.99   0.003      1.09549    1.552203
             |
smoke_nomiss |
     Former  |   1.214818   .0464342     5.09   0.000     1.127134    1.309323
    Current  |   .9923843   .0881321    -0.09   0.931     .8338462    1.181065
             |
     diabcat |
Controlle..  |   1.214899   .0493138     4.80   0.000     1.121991    1.315501
Uncontrol..  |     1.5466   .0855567     7.88   0.000     1.387682    1.723716
Diabetes,..  |   .9237887    .284163    -0.26   0.797     .5055194    1.688136
             |
1.myocardi~t |   1.111101      .0544     2.15   0.031     1.009435    1.223007
       1.pad |   1.424622   .0856273     5.89   0.000     1.266304    1.602734
1.hyperten~n |    1.01993   .0421485     0.48   0.633     .9405771    1.105977
1.heart_f~re |   1.236246   .0450841     5.82   0.000     1.150967    1.327843
1.stroke_tia |   1.204887   .0455471     4.93   0.000     1.118843    1.297548
       1.vte |   1.368103   .0735891     5.83   0.000     1.231213    1.520212
 1.oestrogen |   1.018234   .2775048     0.07   0.947     .5968499    1.737122
1.antiplat~t |    1.02577   .0707499     0.37   0.712     .8960666    1.174247
1.flu_vac~ne |     .81072    .035079    -4.85   0.000      .744801    .8824732
1.care_ho~ce |   6.851954    .341373    38.63   0.000     6.214504     7.55479
             |
   ethnicity |
      Mixed  |   1.060723    .318593     0.20   0.844     .5887616    1.911015
Asian or ..  |   1.388413   .1735586     2.63   0.009     1.086712    1.773876
      Black  |   1.379665   .2472404     1.80   0.073     .9710371    1.960251
      Other  |   1.325754   .2856822     1.31   0.191     .8690415    2.022486
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar2_eth
> n.ster not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar2_ethn.ster 
> saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17736.657
Iteration 1:   log likelihood = -16669.138
Iteration 2:   log likelihood = -16289.278
Iteration 3:   log likelihood = -16287.515
Iteration 4:   log likelihood = -16287.515
Refining estimates:
Iteration 0:   log likelihood = -16287.515

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(27)      =     2898.28
Log likelihood  =   -16287.515                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7431463    .032853    -6.72   0.000     .6814664    .8104089
      1.male |   1.265709   .0462882     6.44   0.000     1.178161    1.359763
        age1 |   .9719931   .0066549    -4.15   0.000      .959037    .9851243
        age2 |    1.13335   .0137744    10.30   0.000     1.106672    1.160672
        age3 |   .5228242   .0392085    -8.65   0.000     .4513578    .6056064
             |
         imd |
          2  |   1.115011   .0730574     1.66   0.097     .9806343    1.267802
          3  |   1.242047   .0808411     3.33   0.001     1.093291    1.411042
          4  |   1.300313   .0879912     3.88   0.000     1.138801    1.484732
5 most de..  |   1.452118   .0991816     5.46   0.000     1.270175    1.660122
             |
   obese4cat |
Obese I ..)  |   .9964919   .0451623    -0.08   0.938     .9117929    1.089059
Obese II..)  |   1.258244   .0790573     3.66   0.000     1.112455    1.423138
Obese II..)  |    1.29389   .1149705     2.90   0.004     1.087082     1.54004
             |
smoke_nomiss |
     Former  |   1.204297   .0458417     4.88   0.000     1.117718    1.297581
    Current  |   .9801953   .0869442    -0.23   0.822     .8237783    1.166312
             |
     diabcat |
Controlle..  |   1.223759   .0495577     4.99   0.000     1.130382    1.324849
Uncontrol..  |   1.562825   .0862407     8.09   0.000     1.402616    1.741333
Diabetes,..  |    .932765   .2869217    -0.23   0.821     .5104342     1.70453
             |
1.myocardi~t |   1.115971   .0545825     2.24   0.025     1.013959    1.228247
       1.pad |   1.422465   .0854916     5.86   0.000     1.264397    1.600294
1.hyperten~n |   1.021923   .0422186     0.52   0.600     .9424378    1.108113
1.heart_f~re |   1.237141   .0451075     5.84   0.000     1.151817    1.328786
1.stroke_tia |   1.206809   .0456168     4.97   0.000     1.120633    1.299612
       1.vte |   1.366304   .0734748     5.80   0.000     1.229625    1.518175
 1.oestrogen |   1.013403   .2761715     0.05   0.961     .5940376    1.728824
1.antiplat~t |   1.029074   .0709753     0.42   0.678     .8989575    1.178024
1.flu_vac~ne |   .8104028   .0350517    -4.86   0.000      .744534    .8820989
1.care_ho~ce |   6.817396   .3395175    38.54   0.000       6.1834    7.516398
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar2_wit
> houtethn.ster not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar2_withouteth
> n.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17736.657
Iteration 1:   log likelihood = -16445.092
Iteration 2:   log likelihood = -16009.888
Iteration 3:   log likelihood = -16007.989
Iteration 4:   log likelihood = -16007.989
Refining estimates:
Iteration 0:   log likelihood = -16007.989

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(38)      =     3457.34
Log likelihood  =   -16007.989                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8170239   .0363113    -4.55   0.000     .7488666    .8913844
      1.male |   1.293392   .0473286     7.03   0.000     1.203878    1.389561
        age1 |   .9752034   .0066679    -3.67   0.000     .9622217    .9883602
        age2 |   1.115747   .0135806     9.00   0.000     1.089444    1.142684
        age3 |   .5708553   .0429505    -7.45   0.000     .4925866    .6615605
             |
         imd |
          2  |   1.104246   .0724614     1.51   0.131     .9709777    1.255805
          3  |   1.220447   .0795101     3.06   0.002     1.074149     1.38667
          4  |   1.256854   .0852306     3.37   0.001      1.10043    1.435513
5 most de..  |   1.368363   .0937432     4.58   0.000      1.19643    1.565002
             |
   obese4cat |
Obese I ..)  |   1.005623   .0457127     0.12   0.902     .9199029    1.099331
Obese II..)  |   1.263469   .0795971     3.71   0.000     1.116709    1.429517
Obese II..)  |   1.276737   .1136864     2.74   0.006     1.072276    1.520184
             |
smoke_nomiss |
     Former  |   1.148017   .0447166     3.54   0.000     1.063636    1.239092
    Current  |   .8870831   .0801283    -1.33   0.185     .7431511    1.058892
             |
     diabcat |
Controlle..  |   1.199349   .0489057     4.46   0.000     1.107226    1.299137
Uncontrol..  |   1.476103    .082253     6.99   0.000     1.323382    1.646449
Diabetes,..  |   .9199165     .28289    -0.27   0.786     .5034884    1.680766
             |
1.myocardi~t |   1.071647   .0524791     1.41   0.158     .9735722    1.179602
       1.pad |   1.359616    .081831     5.10   0.000     1.208329    1.529845
1.hyperten~n |   1.015366   .0421704     0.37   0.713     .9359884    1.101476
1.heart_f~re |   1.135573    .042131     3.43   0.001     1.055929    1.221225
1.stroke_tia |   1.152664   .0436437     3.75   0.000     1.070221    1.241458
       1.vte |   1.263949   .0683445     4.33   0.000      1.13685    1.405257
 1.oestrogen |   .9784237   .2675681    -0.08   0.936     .5724665     1.67226
1.antiplat~t |   .9367196   .0647316    -0.95   0.344     .8180648    1.072584
1.flu_vac~ne |     .81732   .0355859    -4.63   0.000      .750466    .8901296
             |
         ckd |
        CKD  |   1.144567   .0425261     3.63   0.000      1.06418    1.231027
      1.copd |   1.267911   .0615872     4.89   0.000      1.15277    1.394552
1.other_re~y |   1.230039   .0747162     3.41   0.001     1.091979    1.385553
1.immunode~y |   1.099016   .2341769     0.44   0.658     .7238212    1.668695
    1.cancer |   1.054246   .0454984     1.22   0.221      .968738    1.147301
1.ae_atten~r |   2.142007    .077555    21.04   0.000      1.99527    2.299535
1.gp_consult |    .683603   .0646726    -4.02   0.000      .567905     .822872
1.care_ho~ce |   6.223945   .3155766    36.06   0.000     5.635167    6.874241
             |
   ethnicity |
      Mixed  |   1.075261   .3227162     0.24   0.809     .5970964    1.936349
Asian or ..  |   1.364265   .1713812     2.47   0.013     1.066521    1.745131
      Black  |   1.366108    .244539     1.74   0.081     .9618705    1.940232
      Other  |   1.273782   .2758299     1.12   0.264     .8332447    1.947232
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar3_eth
> n.ster not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar3_ethn.ster 
> saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17736.657
Iteration 1:   log likelihood = -16448.119
Iteration 2:   log likelihood = -16014.183
Iteration 3:   log likelihood = -16012.311
Iteration 4:   log likelihood = -16012.311
Refining estimates:
Iteration 0:   log likelihood = -16012.311

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(34)      =     3448.69
Log likelihood  =   -16012.311                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8153418   .0362291    -4.59   0.000     .7473382    .8895334
      1.male |   1.292672   .0472958     7.02   0.000      1.20322    1.388775
        age1 |   .9744481   .0066599    -3.79   0.000      .961482     .987589
        age2 |    1.11669    .013592     9.07   0.000     1.090365     1.14365
        age3 |   .5683998   .0427676    -7.51   0.000     .4904647    .6587188
             |
         imd |
          2  |   1.103825   .0724248     1.51   0.132      .970623    1.255306
          3  |   1.220715   .0795078     3.06   0.002     1.074419    1.386931
          4  |   1.257195   .0852392     3.38   0.001     1.100754     1.43587
5 most de..  |    1.37129   .0939071     4.61   0.000     1.199053    1.568268
             |
   obese4cat |
Obese I ..)  |   1.004875   .0456744     0.11   0.915     .9192263    1.098504
Obese II..)  |   1.259593   .0793424     3.66   0.000     1.113301    1.425108
Obese II..)  |   1.267786   .1128349     2.67   0.008     1.064848    1.509399
             |
smoke_nomiss |
     Former  |   1.138506   .0441731     3.34   0.001     1.055139    1.228461
    Current  |   .8766726   .0791032    -1.46   0.145     .7345689    1.046267
             |
     diabcat |
Controlle..  |   1.207282   .0491252     4.63   0.000     1.114738    1.307509
Uncontrol..  |   1.490792   .0828601     7.18   0.000     1.336922     1.66237
Diabetes,..  |   .9280991   .2853778    -0.24   0.808     .5079975    1.695615
             |
1.myocardi~t |   1.075625   .0526232     1.49   0.136     .9772757    1.183871
       1.pad |   1.357991   .0817207     5.09   0.000     1.206906    1.527989
1.hyperten~n |   1.017203   .0422351     0.41   0.681     .9377025    1.103444
1.heart_f~re |   1.136271   .0421453     3.44   0.001     1.056599    1.221951
1.stroke_tia |   1.154426   .0437061     3.79   0.000     1.071865    1.243347
       1.vte |   1.262789   .0682622     4.32   0.000     1.135841    1.403925
 1.oestrogen |   .9741482   .2663851    -0.10   0.924     .5699808    1.664907
1.antiplat~t |   .9394417   .0649182    -0.90   0.366     .8204447    1.075698
1.flu_vac~ne |    .816978   .0355545    -4.64   0.000     .7501817    .8897218
             |
         ckd |
        CKD  |   1.145988   .0425771     3.67   0.000     1.065505    1.232551
      1.copd |   1.265869   .0614829     4.85   0.000     1.150923    1.392295
1.other_re~y |   1.230376   .0747262     3.41   0.001     1.092297     1.38591
1.immunode~y |    1.09627   .2336349     0.43   0.666     .7219564    1.664654
    1.cancer |   1.051301   .0453491     1.16   0.246     .9660725    1.144049
1.ae_atten~r |    2.14494   .0776522    21.08   0.000     1.998018    2.302665
1.gp_consult |   .6854986   .0648713    -3.99   0.000      .569448    .8251996
1.care_ho~ce |    6.19406   .3139243    35.98   0.000     5.608351    6.840937
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/positivecovidtest_multivar3_wit
> houtethn.ster not found)
file /workspace/output/warfarin_tempdata/positivecovidtest_multivar3_withouteth
> n.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table3_positivecovidtest.txt not 
> found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,975    4.19e+07           0   4.19e+07   4.19e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,590    1.39e+07           0   1.39e+07   1.39e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7037704   .0298536    -8.28   0.000     .6476248    .7647836
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .662653    .028218    -9.66   0.000     .6095919    .7203327
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7448526    .032936    -6.66   0.000     .6830174    .8122859
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7431463    .032853    -6.72   0.000     .6814664    .8104089
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8170239   .0363113    -4.55   0.000     .7488666    .8913844
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8153418   .0362291    -4.59   0.000     .7473382    .8895334
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_positivecov
> idtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:04:38
-------------------------------------------------------------------------------
