-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_covidtest.l
> og
  log type:  text
 opened on:  31 Dec 2020, 02:59:49

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   186,735     19,240 |   205,975 
             |     90.66       9.34 |    100.00 
-------------+----------------------+----------
warfarin use |    62,512      5,078 |    67,590 
             |     92.49       7.51 |    100.00 
-------------+----------------------+----------
       Total |   249,247     24,318 |   273,565 
             |     91.11       8.89 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302768.67
Iteration 1:   log likelihood = -302651.99
Iteration 2:   log likelihood = -302651.59
Iteration 3:   log likelihood = -302651.59
Refining estimates:
Iteration 0:   log likelihood = -302651.59

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(1)       =      234.15
Log likelihood  =   -302651.59                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7897195   .0124592   -14.96   0.000     .7656736    .8145206
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_univar_ethn.ster not 
> found)
file /workspace/output/warfarin_tempdata/covidtest_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -302768.67
Iteration 1:   log likelihood = -301658.57
Iteration 2:   log likelihood = -301582.47
Iteration 3:   log likelihood = -301582.11
Iteration 4:   log likelihood = -301582.11
Refining estimates:
Iteration 0:   log likelihood = -301582.11

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(5)       =     2373.10
Log likelihood  =   -301582.11                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7702259   .0122085   -16.47   0.000     .7466655    .7945297
      1.male |   1.008142   .0132918     0.62   0.539     .9824238    1.034533
        age1 |   .9866547   .0022747    -5.83   0.000     .9822065    .9911231
        age2 |   1.047051   .0044125    10.91   0.000     1.038438    1.055735
        age3 |   .9050856   .0247659    -3.64   0.000      .857824    .9549511
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar1_ethn.ster n
> ot found)
file /workspace/output/warfarin_tempdata/covidtest_multivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -118898.9
Iteration 1:   log likelihood = -116069.95
Iteration 2:   log likelihood = -115723.71
Iteration 3:   log likelihood = -115723.21
Iteration 4:   log likelihood = -115723.21
Refining estimates:
Iteration 0:   log likelihood = -115723.21

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(31)      =     6351.39
Log likelihood  =   -115723.21                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7911007   .0129221   -14.35   0.000      .766175    .8168373
      1.male |   1.007604   .0140086     0.54   0.586     .9805186    1.035438
        age1 |   .9869504   .0023511    -5.51   0.000     .9823531    .9915693
        age2 |   1.045659   .0044918    10.39   0.000     1.036892    1.054499
        age3 |    .855691   .0237763    -5.61   0.000     .8103366    .9035839
             |
         imd |
          2  |   1.037674   .0243583     1.58   0.115     .9910144    1.086531
          3  |   1.049678   .0251189     2.03   0.043     1.001582    1.100083
          4  |   1.079457   .0267866     3.08   0.002     1.028212    1.133255
5 most de..  |   1.178792   .0301944     6.42   0.000     1.121073    1.239483
             |
   obese4cat |
Obese I ..)  |   .9074446   .0156644    -5.63   0.000     .8772565    .9386716
Obese II..)  |   1.019969   .0249817     0.81   0.420     .9721622    1.070126
Obese II..)  |   1.019937   .0340102     0.59   0.554       .95541    1.088823
             |
smoke_nomiss |
     Former  |   1.100738   .0160019     6.60   0.000     1.069818    1.132552
    Current  |   1.205438   .0355364     6.34   0.000     1.137762     1.27714
             |
     diabcat |
Controlle..  |   1.123821   .0179415     7.31   0.000     1.089201    1.159542
Uncontrol..  |   1.314624   .0291596    12.33   0.000     1.258696    1.373036
Diabetes,..  |   1.084383   .1372144     0.64   0.522      .846203    1.389604
             |
1.myocardi~t |   1.145141   .0221599     7.00   0.000     1.102522    1.189407
       1.pad |   1.339109   .0328487    11.90   0.000      1.27625    1.405064
1.hyperten~n |   1.016643   .0155625     1.08   0.281     .9865936    1.047607
1.heart_f~re |   1.265852   .0180345    16.55   0.000     1.230994    1.301697
1.stroke_tia |   1.175827   .0176344    10.80   0.000     1.141767    1.210903
       1.vte |   1.239513   .0274844     9.68   0.000     1.186799    1.294569
 1.oestrogen |   1.212531   .1068255     2.19   0.029     1.020236    1.441068
1.antiplat~t |   1.183739   .0301168     6.63   0.000     1.126158    1.244263
1.flu_vac~ne |   .9562266    .016451    -2.60   0.009     .9245208    .9890197
1.care_ho~ce |     4.0304   .1024259    54.85   0.000     3.834567    4.236235
             |
   ethnicity |
      Mixed  |   1.036048   .1378667     0.27   0.790      .798198    1.344773
Asian or ..  |   1.309232    .073424     4.80   0.000     1.172951    1.461347
      Black  |   1.238384   .1036142     2.56   0.011     1.051081    1.459064
      Other  |   1.089554    .097673     0.96   0.339      .913993    1.298837
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar2_ethn.ster n
> ot found)
file /workspace/output/warfarin_tempdata/covidtest_multivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -118898.9
Iteration 1:   log likelihood = -116080.43
Iteration 2:   log likelihood = -115737.02
Iteration 3:   log likelihood = -115736.52
Iteration 4:   log likelihood = -115736.52
Refining estimates:
Iteration 0:   log likelihood = -115736.52

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(27)      =     6324.76
Log likelihood  =   -115736.52                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7900844   .0129036   -14.43   0.000     .7651944    .8157841
      1.male |   1.006926   .0139978     0.50   0.620     .9798613    1.034739
        age1 |   .9866031   .0023493    -5.66   0.000     .9820093    .9912183
        age2 |   1.045998   .0044931    10.47   0.000     1.037229    1.054841
        age3 |   .8542451   .0237377    -5.67   0.000     .8089643    .9020605
             |
         imd |
          2  |   1.037628   .0243571     1.57   0.116     .9909702    1.086482
          3  |    1.05001   .0251261     2.04   0.041     1.001901    1.100429
          4  |   1.080045   .0267998     3.10   0.002     1.028775     1.13387
5 most de..  |   1.181178    .030244     6.50   0.000     1.123363    1.241967
             |
   obese4cat |
Obese I ..)  |    .905991   .0156357    -5.72   0.000      .875858    .9371607
Obese II..)  |   1.017412   .0249129     0.70   0.481      .969737    1.067431
Obese II..)  |   1.015075   .0338342     0.45   0.654     .9508809    1.083603
             |
smoke_nomiss |
     Former  |   1.095156   .0158751     6.27   0.000     1.064479    1.126717
    Current  |   1.196284   .0352214     6.09   0.000     1.129206    1.267348
             |
     diabcat |
Controlle..  |    1.12849   .0179854     7.58   0.000     1.093784    1.164297
Uncontrol..  |   1.322577   .0292865    12.63   0.000     1.266405    1.381242
Diabetes,..  |   1.089109   .1378091     0.67   0.500     .8498956    1.395652
             |
1.myocardi~t |   1.148024   .0222035     7.14   0.000     1.105321    1.192378
       1.pad |   1.337231   .0328001    11.85   0.000     1.274464    1.403088
1.hyperten~n |   1.018039   .0155796     1.17   0.243      .987957    1.049037
1.heart_f~re |   1.266433   .0180417    16.58   0.000     1.231562    1.302293
1.stroke_tia |    1.17695   .0176499    10.86   0.000      1.14286    1.212056
       1.vte |   1.238491   .0274579     9.65   0.000     1.185827    1.293494
 1.oestrogen |   1.209698   .1065756     2.16   0.031     1.017853    1.437701
1.antiplat~t |   1.185834   .0301674     6.70   0.000     1.128157     1.24646
1.flu_vac~ne |    .956153    .016448    -2.61   0.009      .924453      .98894
1.care_ho~ce |   4.020269   .1021622    54.75   0.000      3.82494    4.225574
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar2_withoutethn
> .ster not found)
file /workspace/output/warfarin_tempdata/covidtest_multivar2_withoutethn.ster s
> aved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -118898.9
Iteration 1:   log likelihood =  -115105.8
Iteration 2:   log likelihood = -114517.26
Iteration 3:   log likelihood = -114516.52
Iteration 4:   log likelihood = -114516.52
Refining estimates:
Iteration 0:   log likelihood = -114516.52

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(38)      =     8764.76
Log likelihood  =   -114516.52                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8509642   .0139683    -9.83   0.000     .8240226    .8787866
      1.male |   1.029835   .0143232     2.11   0.035     1.002141    1.058294
        age1 |   .9881681    .002351    -5.00   0.000      .983571    .9927867
        age2 |   1.034159    .004448     7.81   0.000     1.025478    1.042914
        age3 |    .916898   .0255336    -3.12   0.002     .8681943    .9683339
             |
         imd |
          2  |    1.03524   .0243118     1.47   0.140     .9886694    1.084004
          3  |   1.040398   .0249153     1.65   0.098     .9926931    1.090395
          4  |    1.05895   .0263124     2.31   0.021     1.008615    1.111798
5 most de..  |   1.136079   .0291761     4.97   0.000      1.08031    1.194727
             |
   obese4cat |
Obese I ..)  |   .9163637   .0158367    -5.05   0.000     .8858441    .9479349
Obese II..)  |   1.024222   .0251236     0.98   0.329     .9761452    1.074666
Obese II..)  |   1.015977    .033916     0.47   0.635     .9516308    1.084674
             |
smoke_nomiss |
     Former  |   1.049005    .015515     3.23   0.001     1.019033    1.079859
    Current  |   1.101896   .0332329     3.22   0.001     1.038648    1.168995
             |
     diabcat |
Controlle..  |   1.106357   .0177066     6.32   0.000     1.072191    1.141611
Uncontrol..  |   1.272427   .0283543    10.81   0.000      1.21805    1.329232
Diabetes,..  |    1.07272   .1355972     0.56   0.579      .837318    1.374304
             |
1.myocardi~t |   1.117832   .0216506     5.75   0.000     1.076193    1.161082
       1.pad |   1.285522   .0315844    10.22   0.000     1.225085    1.348941
1.hyperten~n |   1.016558   .0156096     1.07   0.285     .9864192    1.047617
1.heart_f~re |   1.190965    .017251    12.07   0.000     1.157629    1.225261
1.stroke_tia |   1.140833   .0171384     8.77   0.000     1.107732    1.174923
       1.vte |   1.156519   .0257416     6.53   0.000     1.107151    1.208088
 1.oestrogen |   1.136668   .1003564     1.45   0.147     .9560511    1.351407
1.antiplat~t |   1.102133   .0281046     3.81   0.000     1.048402    1.158616
1.flu_vac~ne |   .9487613    .016404    -3.04   0.002     .9171486    .9814636
             |
         ckd |
        CKD  |   1.091275   .0158673     6.01   0.000     1.060614    1.122822
      1.copd |   1.215877   .0232257    10.23   0.000     1.171197    1.262261
1.other_re~y |   1.266717   .0312565     9.58   0.000     1.206914    1.329485
1.immunode~y |   1.250738   .0907834     3.08   0.002     1.084883    1.441949
    1.cancer |   1.218202   .0196918    12.21   0.000     1.180211    1.257415
1.ae_atten~r |   1.811776    .025169    42.78   0.000     1.763112    1.861784
1.gp_consult |   .8218091   .0373723    -4.32   0.000     .7517303     .898421
1.care_ho~ce |    3.79953   .0977245    51.90   0.000     3.612741    3.995977
             |
   ethnicity |
      Mixed  |   1.030175   .1372037     0.22   0.823      .793494    1.337451
Asian or ..  |   1.300472   .0731703     4.67   0.000     1.164686     1.45209
      Black  |    1.22628   .1023308     2.44   0.015     1.041258    1.444178
      Other  |   1.092259    .097763     0.99   0.324      .916513    1.301706
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar3_ethn.ster n
> ot found)
file /workspace/output/warfarin_tempdata/covidtest_multivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -118898.9
Iteration 1:   log likelihood = -115115.61
Iteration 2:   log likelihood = -114529.83
Iteration 3:   log likelihood =  -114529.1
Iteration 4:   log likelihood =  -114529.1
Refining estimates:
Iteration 0:   log likelihood =  -114529.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =       24,318
Time at risk    =     54221576
                                                LR chi2(34)      =     8739.61
Log likelihood  =    -114529.1                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8499624     .01395    -9.90   0.000     .8230559    .8777485
      1.male |   1.029398   .0143164     2.08   0.037     1.001718    1.057844
        age1 |   .9878451   .0023493    -5.14   0.000     .9832513    .9924603
        age2 |   1.034448   .0044493     7.87   0.000     1.025764    1.043206
        age3 |   .9155262   .0254978    -3.17   0.002     .8668909      .96689
             |
         imd |
          2  |   1.035103   .0243086     1.47   0.142     .9885391    1.083861
          3  |   1.040624   .0249198     1.66   0.096     .9929111    1.090631
          4  |   1.059387   .0263218     2.32   0.020     1.009033    1.112254
5 most de..  |   1.138093   .0292166     5.04   0.000     1.082246    1.196822
             |
   obese4cat |
Obese I ..)  |   .9150102   .0158102    -5.14   0.000     .8845416    .9465284
Obese II..)  |   1.021635   .0250539     0.87   0.383     .9736914    1.071939
Obese II..)  |   1.011203   .0337431     0.33   0.738     .9471843    1.079549
             |
smoke_nomiss |
     Former  |   1.043956   .0153991     2.92   0.004     1.014206    1.074578
    Current  |   1.094093   .0329611     2.98   0.003     1.031361    1.160641
             |
     diabcat |
Controlle..  |   1.110798   .0177482     6.58   0.000     1.076551    1.146134
Uncontrol..  |   1.279897   .0284723    11.09   0.000     1.225291    1.336936
Diabetes,..  |   1.077131   .1361503     0.59   0.557     .8407674    1.379943
             |
1.myocardi~t |   1.120483   .0216907     5.88   0.000     1.078766    1.163813
       1.pad |   1.284003   .0315454    10.18   0.000      1.22364    1.347344
1.hyperten~n |   1.017794    .015625     1.15   0.251     .9876256    1.048884
1.heart_f~re |   1.191447   .0172566    12.09   0.000       1.1581    1.225754
1.stroke_tia |   1.141753   .0171511     8.82   0.000     1.108627    1.175868
       1.vte |   1.155753    .025721     6.50   0.000     1.106425    1.207281
 1.oestrogen |   1.134399   .1001562     1.43   0.153     .9541423     1.34871
1.antiplat~t |   1.103995   .0281488     3.88   0.000      1.05018    1.160568
1.flu_vac~ne |   .9488851   .0164048    -3.03   0.002      .917271    .9815889
             |
         ckd |
        CKD  |   1.092142   .0158793     6.06   0.000     1.061459    1.123713
      1.copd |    1.21424    .023191    10.16   0.000     1.169626    1.260555
1.other_re~y |   1.266954    .031261     9.59   0.000     1.207142     1.32973
1.immunode~y |   1.249949   .0907271     3.07   0.002     1.084197    1.441042
    1.cancer |   1.216483   .0196586    12.13   0.000     1.178556     1.25563
1.ae_atten~r |    1.81323   .0251866    42.84   0.000     1.764531    1.863273
1.gp_consult |   .8212349   .0373417    -4.33   0.000     .7512131    .8977836
1.care_ho~ce |   3.789669   .0974632    51.80   0.000      3.60338     3.98559
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/covidtest_multivar3_withoutethn
> .ster not found)
file /workspace/output/warfarin_tempdata/covidtest_multivar3_withoutethn.ster s
> aved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table3_covidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,975    4.07e+07           0   4.07e+07   4.07e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,590    1.36e+07           0   1.36e+07   1.36e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7897195   .0124592   -14.96   0.000     .7656736    .8145206
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7702259   .0122085   -16.47   0.000     .7466655    .7945297
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7911007   .0129221   -14.35   0.000      .766175    .8168373
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7900844   .0129036   -14.43   0.000     .7651944    .8157841
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8509642   .0139683    -9.83   0.000     .8240226    .8787866
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8499624     .01395    -9.90   0.000     .8230559    .8777485
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_covidtest.l
> og
  log type:  text
 closed on:  31 Dec 2020, 03:02:53
-------------------------------------------------------------------------------
