-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_onsnoncovid
> death.log
  log type:  text
 opened on:  31 Dec 2020, 02:58:29

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   198,243      7,732 |   205,975 
             |     96.25       3.75 |    100.00 
-------------+----------------------+----------
warfarin use |    65,508      2,082 |    67,590 
             |     96.92       3.08 |    100.00 
-------------+----------------------+----------
       Total |   263,751      9,814 |   273,565 
             |     96.41       3.59 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -122607.93
Iteration 1:   log likelihood =  -122572.2
Iteration 2:   log likelihood = -122572.11
Iteration 3:   log likelihood = -122572.11
Refining estimates:
Iteration 0:   log likelihood = -122572.11

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        9,814
Time at risk    =     56144920
                                                LR chi2(1)       =       71.64
Log likelihood  =   -122572.11                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8146439   .0201143    -8.30   0.000     .7761593    .8550367
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_univar_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_univar_ethn.ster save
> d

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -122607.93
Iteration 1:   log likelihood = -121042.37
Iteration 2:   log likelihood = -119567.57
Iteration 3:   log likelihood = -119516.73
Iteration 4:   log likelihood = -119516.55
Iteration 5:   log likelihood = -119516.55
Refining estimates:
Iteration 0:   log likelihood = -119516.55

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        9,814
Time at risk    =     56144920
                                                LR chi2(5)       =     6182.75
Log likelihood  =   -119516.55                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7558826   .0187312   -11.29   0.000     .7200474    .7935012
      1.male |   1.212981   .0251081     9.33   0.000     1.164755    1.263204
        age1 |   1.033256   .0076156     4.44   0.000     1.018436     1.04829
        age2 |   1.069297   .0114209     6.27   0.000     1.047145    1.091917
        age3 |   .7979674   .0452836    -3.98   0.000      .713971    .8918457
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar1_ethn
> .ster not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar1_ethn.ster s
> aved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -48899.926
Iteration 1:   log likelihood = -45239.134
Iteration 2:   log likelihood = -44457.696
Iteration 3:   log likelihood = -44440.275
Iteration 4:   log likelihood = -44439.826
Iteration 5:   log likelihood = -44439.825
Refining estimates:
Iteration 0:   log likelihood = -44439.825

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        9,814
Time at risk    =     56144920
                                                LR chi2(31)      =     8920.20
Log likelihood  =   -44439.825                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7937759   .0203939    -8.99   0.000     .7547943    .8347708
      1.male |   1.190361    .026244     7.90   0.000      1.14002    1.242926
        age1 |   1.044331   .0079477     5.70   0.000      1.02887    1.060025
        age2 |   1.053291   .0115689     4.73   0.000     1.030858    1.076211
        age3 |   .8054935   .0469179    -3.71   0.000      .718591    .9029056
             |
         imd |
          2  |   1.050249   .0396153     1.30   0.194     .9754054    1.130836
          3  |   1.094008   .0414505     2.37   0.018      1.01571    1.178342
          4  |    1.13101   .0448566     3.10   0.002     1.046423    1.222435
5 most de..  |   1.335722    .054885     7.04   0.000     1.232367    1.447745
             |
   obese4cat |
Obese I ..)  |   .7522931   .0225451    -9.50   0.000     .7093782    .7978043
Obese II..)  |   .9036538   .0399171    -2.29   0.022     .8287088    .9853766
Obese II..)  |   1.160527   .0696508     2.48   0.013     1.031737    1.305394
             |
smoke_nomiss |
     Former  |   1.229624    .028965     8.78   0.000     1.174145    1.287725
    Current  |   2.012932   .0911284    15.45   0.000     1.842018    2.199704
             |
     diabcat |
Controlle..  |   1.215984   .0299844     7.93   0.000     1.158613    1.276195
Uncontrol..  |    1.45226   .0509438    10.64   0.000     1.355768    1.555621
Diabetes,..  |   1.301969   .2098086     1.64   0.102     .9493622    1.785539
             |
1.myocardi~t |   1.169057   .0332902     5.49   0.000     1.105596    1.236159
       1.pad |   1.462257    .050754    10.95   0.000     1.366089    1.565194
1.hyperten~n |   1.140586   .0293042     5.12   0.000     1.084573    1.199492
1.heart_f~re |   1.692146   .0362574    24.55   0.000     1.622554    1.764723
1.stroke_tia |   1.241631   .0280641     9.58   0.000     1.187827    1.297872
       1.vte |   1.302686   .0431104     7.99   0.000     1.220873    1.389981
 1.oestrogen |   1.141031   .1816879     0.83   0.407     .8351401    1.558961
1.antiplat~t |    1.08823    .044169     2.08   0.037     1.005014    1.178336
1.flu_vac~ne |   .7543003   .0197926   -10.75   0.000     .7164881     .794108
1.care_ho~ce |   3.074148    .105991    32.57   0.000     2.873273    3.289066
             |
   ethnicity |
      Mixed  |   .8988178   .2116562    -0.45   0.651     .5665369    1.425985
Asian or ..  |   1.012594   .1010392     0.13   0.900     .8327224    1.231318
      Black  |     .93383   .1408576    -0.45   0.650     .6948223    1.255052
      Other  |   .8203411   .1551688    -1.05   0.295     .5662241    1.188504
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2_ethn
> .ster not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2_ethn.ster s
> aved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -48899.926
Iteration 1:   log likelihood =  -45239.63
Iteration 2:   log likelihood = -44458.482
Iteration 3:   log likelihood = -44441.067
Iteration 4:   log likelihood = -44440.618
Iteration 5:   log likelihood = -44440.617
Refining estimates:
Iteration 0:   log likelihood = -44440.617

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        9,814
Time at risk    =     56144920
                                                LR chi2(27)      =     8918.62
Log likelihood  =   -44440.617                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7938146   .0203905    -8.99   0.000     .7548394    .8348023
      1.male |    1.19028   .0262407     7.90   0.000     1.139945    1.242838
        age1 |   1.044462   .0079472     5.72   0.000     1.029001    1.060155
        age2 |   1.053147   .0115654     4.72   0.000     1.030722    1.076061
        age3 |   .8059971   .0469391    -3.70   0.000     .7190545    .9034521
             |
         imd |
          2  |   1.050383   .0396194     1.30   0.193     .9755316    1.130979
          3  |   1.094173   .0414554     2.38   0.018     1.015865    1.178516
          4  |     1.1311   .0448565     3.11   0.002     1.046513    1.222524
5 most de..  |     1.3352   .0548495     7.04   0.000     1.231911     1.44715
             |
   obese4cat |
Obese I ..)  |   .7522604   .0225421    -9.50   0.000     .7093512    .7977653
Obese II..)  |   .9037265   .0399148    -2.29   0.022     .8287854    .9854441
Obese II..)  |   1.160566   .0696363     2.48   0.013     1.031802    1.305401
             |
smoke_nomiss |
     Former  |   1.229875   .0289007     8.81   0.000     1.174515    1.287844
    Current  |   2.013546   .0910367    15.48   0.000     1.842795    2.200119
             |
     diabcat |
Controlle..  |   1.215523   .0299456     7.92   0.000     1.158225    1.275655
Uncontrol..  |   1.451696   .0508615    10.64   0.000     1.355355    1.554885
Diabetes,..  |   1.302025   .2098046     1.64   0.101      .949422    1.785581
             |
1.myocardi~t |   1.169169   .0332828     5.49   0.000     1.105722    1.236256
       1.pad |   1.462388   .0507505    10.95   0.000     1.366227    1.565319
1.hyperten~n |    1.14036   .0292947     5.11   0.000     1.084365    1.199246
1.heart_f~re |   1.692262   .0362571    24.55   0.000     1.622671    1.764838
1.stroke_tia |   1.241517   .0280604     9.57   0.000      1.18772     1.29775
       1.vte |   1.302875   .0431124     8.00   0.000     1.221058    1.390174
 1.oestrogen |   1.140458   .1815975     0.83   0.409     .8347202    1.558181
1.antiplat~t |   1.087993   .0441564     2.08   0.038     1.004801    1.178073
1.flu_vac~ne |   .7545172   .0197972   -10.74   0.000     .7166963     .794334
1.care_ho~ce |   3.073935   .1059496    32.58   0.000     2.873137    3.288767
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2_with
> outethn.ster not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar2_withoutethn
> .ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -48899.926
Iteration 1:   log likelihood = -48169.074
Iteration 2:   log likelihood = -43528.705
Iteration 3:   log likelihood = -43443.303
Iteration 4:   log likelihood = -43443.208
Iteration 5:   log likelihood = -43443.208
Refining estimates:
Iteration 0:   log likelihood = -43443.208

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        9,814
Time at risk    =     56144920
                                                LR chi2(38)      =    10913.44
Log likelihood  =   -43443.208                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8852014   .0229067    -4.71   0.000     .8414247    .9312557
      1.male |   1.186071   .0261531     7.74   0.000     1.135904    1.238454
        age1 |   1.041471   .0078756     5.37   0.000     1.026149    1.057022
        age2 |   1.039699   .0113773     3.56   0.000     1.017637    1.062239
        age3 |    .887402   .0516423    -2.05   0.040     .7917441    .9946172
             |
         imd |
          2  |   1.046457   .0395628     1.20   0.230     .9717187    1.126944
          3  |   1.081025   .0410282     2.05   0.040     1.003529    1.164505
          4  |   1.105638   .0439552     2.53   0.012     1.022758    1.195234
5 most de..  |   1.271555   .0524942     5.82   0.000      1.17272    1.378718
             |
   obese4cat |
Obese I ..)  |   .7654053    .022991    -8.90   0.000     .7216446    .8118196
Obese II..)  |   .9097168   .0402692    -2.14   0.033     .8341175     .992168
Obese II..)  |   1.144126   .0687932     2.24   0.025     1.016936    1.287225
             |
smoke_nomiss |
     Former  |   1.136322   .0272854     5.32   0.000     1.084083    1.191079
    Current  |   1.753026   .0815229    12.07   0.000      1.60031    1.920316
             |
     diabcat |
Controlle..  |   1.183346   .0293005     6.80   0.000     1.127289     1.24219
Uncontrol..  |   1.388403   .0489684     9.30   0.000     1.295669    1.487774
Diabetes,..  |   1.293399   .2084558     1.60   0.110     .9430728    1.773862
             |
1.myocardi~t |   1.130924   .0322434     4.32   0.000     1.069461    1.195919
       1.pad |   1.387535   .0482997     9.41   0.000     1.296027    1.485505
1.hyperten~n |   1.140875   .0294065     5.11   0.000     1.084671    1.199991
1.heart_f~re |   1.552441   .0338861    20.15   0.000     1.487426    1.620298
1.stroke_tia |   1.190469   .0269955     7.69   0.000     1.138717    1.244573
       1.vte |     1.1746   .0390839     4.84   0.000     1.100441    1.253756
 1.oestrogen |   .9265275   .1480844    -0.48   0.633     .6773498     1.26737
1.antiplat~t |   1.006256   .0409526     0.15   0.878     .9291084     1.08981
1.flu_vac~ne |   .7438449   .0196384   -11.21   0.000     .7063332    .7833488
             |
         ckd |
        CKD  |   1.126828   .0251939     5.34   0.000     1.078515    1.177305
      1.copd |   1.344805   .0384973    10.35   0.000     1.271429    1.422415
1.other_re~y |   1.414518   .0495114     9.91   0.000     1.320732    1.514965
1.immunode~y |   1.404014   .1576524     3.02   0.003      1.12666    1.749646
    1.cancer |   1.612953   .0373669    20.64   0.000     1.541353    1.687879
1.ae_atten~r |   2.075478   .0457253    33.14   0.000     1.987766    2.167061
1.gp_consult |   .7951205   .0500506    -3.64   0.000     .7028332    .8995259
1.care_ho~ce |   2.903234    .101419    30.51   0.000     2.711109    3.108974
             |
   ethnicity |
      Mixed  |   .9179184   .2164708    -0.36   0.716     .5781852    1.457274
Asian or ..  |   1.035708   .1039386     0.35   0.727     .8507755     1.26084
      Black  |   .9496313   .1432828    -0.34   0.732     .7065185    1.276399
      Other  |   .8407661   .1596261    -0.91   0.361     .5795192    1.219783
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3_ethn
> .ster not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3_ethn.ster s
> aved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -48899.926
Iteration 1:   log likelihood = -48169.027
Iteration 2:   log likelihood = -43529.337
Iteration 3:   log likelihood = -43443.948
Iteration 4:   log likelihood = -43443.852
Iteration 5:   log likelihood = -43443.852
Refining estimates:
Iteration 0:   log likelihood = -43443.852

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        9,814
Time at risk    =     56144920
                                                LR chi2(34)      =    10912.15
Log likelihood  =   -43443.852                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8851341   .0229004    -4.72   0.000     .8413692    .9311755
      1.male |   1.186021   .0261491     7.74   0.000     1.135861    1.238396
        age1 |   1.041559   .0078746     5.39   0.000     1.026239    1.057108
        age2 |   1.039596   .0113741     3.55   0.000     1.017541     1.06213
        age3 |   .8877894   .0516556    -2.05   0.041     .7921058    .9950312
             |
         imd |
          2  |    1.04655   .0395655     1.20   0.229     .9718062    1.127042
          3  |    1.08106   .0410284     2.05   0.040     1.003563     1.16454
          4  |   1.105657   .0439527     2.53   0.012     1.022782    1.195247
5 most de..  |   1.271051   .0524606     5.81   0.000     1.172279    1.378145
             |
   obese4cat |
Obese I ..)  |   .7652714   .0229856    -8.91   0.000     .7215209    .8116749
Obese II..)  |   .9096095   .0402604    -2.14   0.032     .8340264    .9920424
Obese II..)  |   1.143698   .0687542     2.23   0.026     1.016578    1.286713
             |
smoke_nomiss |
     Former  |   1.136069   .0272187     5.32   0.000     1.083955     1.19069
    Current  |   1.752296   .0813904    12.08   0.000     1.599819    1.919305
             |
     diabcat |
Controlle..  |   1.183248   .0292714     6.80   0.000     1.127246    1.242033
Uncontrol..  |   1.388604    .048915     9.32   0.000     1.295967    1.487862
Diabetes,..  |   1.294087    .208558     1.60   0.110     .9435872    1.774782
             |
1.myocardi~t |   1.131186   .0322429     4.32   0.000     1.069723    1.196179
       1.pad |   1.387372   .0482887     9.41   0.000     1.295884    1.485319
1.hyperten~n |   1.140853   .0294023     5.11   0.000     1.084656     1.19996
1.heart_f~re |   1.552659   .0338886    20.16   0.000     1.487639    1.620521
1.stroke_tia |   1.190448   .0269939     7.69   0.000     1.138699    1.244549
       1.vte |   1.174682   .0390846     4.84   0.000     1.100522    1.253839
 1.oestrogen |   .9262673   .1480391    -0.48   0.632      .677165    1.267005
1.antiplat~t |   1.006044   .0409408     0.15   0.882     .9289178    1.089573
1.flu_vac~ne |   .7440818   .0196429   -11.20   0.000     .7065614    .7835947
             |
         ckd |
        CKD  |   1.126684   .0251882     5.34   0.000     1.078382    1.177149
      1.copd |   1.345019    .038499    10.36   0.000      1.27164    1.422633
1.other_re~y |    1.41456   .0495109     9.91   0.000     1.320774    1.515005
1.immunode~y |   1.404149   .1576447     3.02   0.003     1.126804    1.749759
    1.cancer |   1.612895   .0373528    20.64   0.000     1.541321    1.687792
1.ae_atten~r |    2.07548   .0457219    33.15   0.000     1.987774    2.167056
1.gp_consult |   .7949783    .050042    -3.64   0.000     .7027067    .8993659
1.care_ho~ce |   2.902428   .1013573    30.51   0.000     2.710418    3.108041
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3_with
> outethn.ster not found)
file /workspace/output/warfarin_tempdata/onsnoncoviddeath_multivar3_withoutethn
> .ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table3_onsnoncoviddeath.txt not f
> ound)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,975    4.22e+07           0   4.22e+07   4.22e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,590    1.40e+07           0   1.40e+07   1.40e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8146439   .0201143    -8.30   0.000     .7761593    .8550367
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7558826   .0187312   -11.29   0.000     .7200474    .7935012
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7937759   .0203939    -8.99   0.000     .7547943    .8347708
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7938146   .0203905    -8.99   0.000     .7548394    .8348023
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8852014   .0229067    -4.71   0.000     .8414247    .9312557
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8851341   .0229004    -4.72   0.000     .8413692    .9311755
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_onsnoncovid
> death.log
  log type:  text
 closed on:  31 Dec 2020, 03:01:25
-------------------------------------------------------------------------------
