-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_onscoviddea
> th.log
  log type:  text
 opened on:  31 Dec 2020, 02:50:52

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
 warfarin vs |         death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   204,632      1,343 |   205,975 
             |     99.35       0.65 |    100.00 
-------------+----------------------+----------
warfarin use |    67,273        317 |    67,590 
             |     99.53       0.47 |    100.00 
-------------+----------------------+----------
       Total |   271,905      1,660 |   273,565 
             |     99.39       0.61 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.831
Iteration 1:   log likelihood =  -20737.52
Iteration 2:   log likelihood = -20737.414
Iteration 3:   log likelihood = -20737.414
Refining estimates:
Iteration 0:   log likelihood = -20737.414

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(1)       =       30.83
Log likelihood  =   -20737.414                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7151225   .0446547    -5.37   0.000     .6327447    .8082252
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_univar_ethn.ster 
> not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.831
Iteration 1:   log likelihood = -20367.017
Iteration 2:   log likelihood = -20201.809
Iteration 3:   log likelihood = -20197.222
Iteration 4:   log likelihood = -20197.213
Refining estimates:
Iteration 0:   log likelihood = -20197.213

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(5)       =     1111.24
Log likelihood  =   -20197.213                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .647752   .0405734    -6.93   0.000     .5729171    .7323619
      1.male |    1.49642   .0761628     7.92   0.000     1.354348    1.653395
        age1 |   1.044163   .0212135     2.13   0.033     1.003402    1.086579
        age2 |   1.083903   .0308626     2.83   0.005      1.02507    1.146112
        age3 |   .6670501   .0985651    -2.74   0.006     .4993242    .8911161
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar1_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar1_ethn.ster save
> d

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.8728
Iteration 1:   log likelihood =  -7395.281
Iteration 2:   log likelihood = -7119.5598
Iteration 3:   log likelihood = -7117.0186
Iteration 4:   log likelihood = -7116.9282
Iteration 5:   log likelihood =  -7116.928
Refining estimates:
Iteration 0:   log likelihood =  -7116.928

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(31)      =     1993.89
Log likelihood  =    -7116.928                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7311882   .0478402    -4.79   0.000     .6431862    .8312307
      1.male |   1.550857   .0849594     8.01   0.000     1.392968    1.726643
        age1 |   1.054821   .0220775     2.55   0.011     1.012426    1.098992
        age2 |   1.070695    .031318     2.34   0.020     1.011039    1.133871
        age3 |   .6342473   .0960587    -3.01   0.003      .471348    .8534453
             |
         imd |
          2  |   1.000958    .097013     0.01   0.992     .8277845     1.21036
          3  |   1.192771   .1143418     1.84   0.066     .9884595    1.439313
          4  |   1.183325   .1191582     1.67   0.095     .9713817    1.441512
5 most de..  |   1.351018   .1374103     2.96   0.003     1.106844    1.649057
             |
   obese4cat |
Obese I ..)  |   1.005937   .0687832     0.09   0.931     .8797677    1.150201
Obese II..)  |   1.320586   .1291366     2.84   0.004     1.090259     1.59957
Obese II..)  |   1.213109   .1907106     1.23   0.219     .8914235     1.65088
             |
smoke_nomiss |
     Former  |   1.416175   .0832721     5.92   0.000     1.262018    1.589162
    Current  |   1.370252   .1810459     2.38   0.017     1.057632    1.775277
             |
     diabcat |
Controlle..  |   1.245884   .0739293     3.70   0.000     1.109094    1.399546
Uncontrol..  |   1.332646    .116271     3.29   0.001     1.123179    1.581177
Diabetes,..  |   .7943802   .3634382    -0.50   0.615     .3240364    1.947435
             |
1.myocardi~t |   1.342748   .0898649     4.40   0.000     1.177679    1.530954
       1.pad |   1.604407   .1320297     5.74   0.000     1.365424    1.885218
1.hyperten~n |   1.024309   .0634096     0.39   0.698     .9072723    1.156444
1.heart_f~re |   1.422928   .0754233     6.65   0.000     1.282521    1.578707
1.stroke_tia |   1.251753    .068548     4.10   0.000     1.124361     1.39358
       1.vte |    1.34094   .1067554     3.68   0.000     1.147211    1.567384
 1.oestrogen |   .3618526    .258616    -1.42   0.155     .0891617    1.468538
1.antiplat~t |   .9183729   .0943176    -0.83   0.407     .7509309    1.123151
1.flu_vac~ne |   .7354859   .0469825    -4.81   0.000     .6489332    .8335827
1.care_ho~ce |   6.762819   .4844501    26.68   0.000     5.876957    7.782211
             |
   ethnicity |
      Mixed  |    1.21244   .5189037     0.45   0.653     .5240355    2.805176
Asian or ..  |   1.399019   .2671832     1.76   0.079     .9621925     2.03416
      Black  |   1.201167   .3291345     0.67   0.504     .7020434    2.055148
      Other  |   1.354736   .4310949     0.95   0.340     .7260911    2.527658
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_ethn.ster save
> d

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.8728
Iteration 1:   log likelihood = -7396.7025
Iteration 2:   log likelihood = -7121.4843
Iteration 3:   log likelihood = -7118.9528
Iteration 4:   log likelihood = -7118.8628
Iteration 5:   log likelihood = -7118.8626
Refining estimates:
Iteration 0:   log likelihood = -7118.8626

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(27)      =     1990.02
Log likelihood  =   -7118.8626                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7293119   .0476958    -4.83   0.000     .6415731    .8290496
      1.male |    1.54984   .0848882     8.00   0.000     1.392081    1.725477
        age1 |   1.054102   .0220574     2.52   0.012     1.011745    1.098232
        age2 |   1.071556   .0313363     2.36   0.018     1.011865    1.134768
        age3 |   .6314485   .0956148    -3.04   0.002      .469297    .8496265
             |
         imd |
          2  |   1.000542   .0969724     0.01   0.996     .8274412    1.209856
          3  |   1.192946   .1143467     1.84   0.066     .9886236    1.439496
          4  |   1.184388   .1192335     1.68   0.093     .9723056    1.442731
5 most de..  |   1.353965   .1376627     2.98   0.003     1.109335    1.652541
             |
   obese4cat |
Obese I ..)  |   1.004797   .0686998     0.07   0.944     .8787798    1.148885
Obese II..)  |     1.3163   .1286896     2.81   0.005     1.086766    1.594313
Obese II..)  |   1.204695   .1893366     1.18   0.236     .8853143    1.639293
             |
smoke_nomiss |
     Former  |   1.403571   .0821748     5.79   0.000     1.251409    1.574236
    Current  |   1.357606   .1792243     2.32   0.021     1.048099    1.758511
             |
     diabcat |
Controlle..  |   1.253999   .0742367     3.82   0.000     1.116622    1.408277
Uncontrol..  |   1.349034    .117262     3.44   0.001     1.137717    1.599602
Diabetes,..  |   .7980747   .3651365    -0.49   0.622     .3255369    1.956531
             |
1.myocardi~t |   1.349205   .0901965     4.48   0.000     1.183515    1.538092
       1.pad |    1.60065   .1316735     5.72   0.000     1.362305    1.880695
1.hyperten~n |   1.024804   .0634218     0.40   0.692     .9077422    1.156961
1.heart_f~re |   1.424051   .0754587     6.67   0.000     1.283575      1.5799
1.stroke_tia |   1.252634    .068599     4.11   0.000     1.125147    1.394567
       1.vte |   1.337552   .1064678     3.65   0.000     1.144342    1.563383
 1.oestrogen |   .3602728   .2574722    -1.43   0.153     .0887795     1.46201
1.antiplat~t |   .9214511   .0946175    -0.80   0.426      .753474    1.126877
1.flu_vac~ne |   .7362685   .0470155    -4.79   0.000     .6496531    .8344321
1.care_ho~ce |   6.742946   .4829824    26.64   0.000     5.859762    7.759243
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_without
> ethn.ster not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar2_withoutethn.st
> er saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.8728
Iteration 1:   log likelihood = -7263.2849
Iteration 2:   log likelihood = -6963.9238
Iteration 3:   log likelihood = -6961.3462
Iteration 4:   log likelihood = -6961.2636
Iteration 5:   log likelihood = -6961.2634
Refining estimates:
Iteration 0:   log likelihood = -6961.2634

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(38)      =     2305.22
Log likelihood  =   -6961.2634                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8097266   .0533125    -3.21   0.001     .7116972    .9212587
      1.male |   1.581575   .0867257     8.36   0.000     1.420412    1.761025
        age1 |    1.05533   .0220531     2.58   0.010      1.01298    1.099451
        age2 |   1.052174   .0307478     1.74   0.082     .9936026    1.114198
        age3 |   .7056973   .1069461    -2.30   0.021     .5243505    .9497629
             |
         imd |
          2  |   1.000489    .097261     0.01   0.996     .8269208    1.210488
          3  |   1.173473   .1127358     1.67   0.096     .9720715    1.416603
          4  |   1.136678   .1149664     1.27   0.205     .9322767    1.385894
5 most de..  |   1.273789   .1301094     2.37   0.018     1.042684    1.556117
             |
   obese4cat |
Obese I ..)  |   1.013015   .0695852     0.19   0.851     .8854133    1.159007
Obese II..)  |   1.320041   .1295045     2.83   0.005     1.089129    1.599911
Obese II..)  |   1.171047   .1849903     1.00   0.318     .8592309    1.596021
             |
smoke_nomiss |
     Former  |   1.314046    .078735     4.56   0.000     1.168445     1.47779
    Current  |   1.202766   .1621831     1.37   0.171     .9234295    1.566602
             |
     diabcat |
Controlle..  |   1.213099   .0724491     3.23   0.001     1.079098    1.363742
Uncontrol..  |   1.220946   .1076114     2.26   0.024     1.027243    1.451174
Diabetes,..  |   .8287657   .3787776    -0.41   0.681     .3383764    2.029848
             |
1.myocardi~t |   1.280142   .0857558     3.69   0.000      1.12263    1.459753
       1.pad |   1.502398   .1241212     4.93   0.000     1.277799    1.766474
1.hyperten~n |   .9997426   .0622707    -0.00   0.997     .8848499    1.129553
1.heart_f~re |   1.263751   .0682103     4.34   0.000      1.13689    1.404769
1.stroke_tia |   1.196876   .0657381     3.27   0.001     1.074725    1.332911
       1.vte |   1.237559   .0990097     2.66   0.008     1.057953    1.447657
 1.oestrogen |   .3648978   .2610943    -1.41   0.159     .0897663      1.4833
1.antiplat~t |   .8422282   .0867368    -1.67   0.095     .6882859    1.030601
1.flu_vac~ne |   .7325282    .047116    -4.84   0.000     .6457663     .830947
             |
         ckd |
        CKD  |   1.332768   .0728959     5.25   0.000     1.197286     1.48358
      1.copd |   1.323941   .0919248     4.04   0.000     1.155493    1.516945
1.other_re~y |   1.459955   .1211906     4.56   0.000     1.240742    1.717899
1.immunode~y |   1.741679   .4674228     2.07   0.039     1.029265    2.947197
    1.cancer |   .9907538   .0632978    -0.15   0.884     .8741454    1.122917
1.ae_atten~r |    2.16448   .1173301    14.25   0.000     1.946312    2.407104
1.gp_consult |   .7278684   .0996559    -2.32   0.020     .5565586    .9519078
1.care_ho~ce |   6.245303   .4560137    25.09   0.000     5.412541     7.20619
             |
   ethnicity |
      Mixed  |   1.206364   .5149043     0.44   0.660     .5225955    2.784781
Asian or ..  |   1.383557   .2659223     1.69   0.091     .9492803    2.016506
      Black  |    1.14788   .3168172     0.50   0.617     .6682874     1.97165
      Other  |   1.300021   .4173822     0.82   0.414     .6928916    2.439133
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_ethn.st
> er not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_ethn.ster save
> d

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.8728
Iteration 1:   log likelihood = -7264.5773
Iteration 2:   log likelihood = -6965.5928
Iteration 3:   log likelihood = -6963.0325
Iteration 4:   log likelihood = -6962.9505
Iteration 5:   log likelihood = -6962.9504
Refining estimates:
Iteration 0:   log likelihood = -6962.9504

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(34)      =     2301.84
Log likelihood  =   -6962.9504                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8079187   .0531703    -3.24   0.001      .710148      .91915
      1.male |   1.581167   .0866824     8.36   0.000     1.420082    1.760525
        age1 |   1.054751   .0220462     2.55   0.011     1.012415    1.098858
        age2 |   1.052749    .030772     1.76   0.079     .9941317    1.114822
        age3 |   .7036583   .1066552    -2.32   0.020     .5228091    .9470665
             |
         imd |
          2  |   .9998004   .0971937    -0.00   0.998     .8263525    1.209654
          3  |   1.173247    .112701     1.66   0.096     .9719047    1.416299
          4  |   1.137043   .1149726     1.27   0.204     .9326254    1.386266
5 most de..  |   1.275334   .1302324     2.38   0.017     1.044005    1.557921
             |
   obese4cat |
Obese I ..)  |   1.011901   .0695048     0.17   0.863     .8844455    1.157723
Obese II..)  |   1.315751   .1290515     2.80   0.005     1.085641    1.594635
Obese II..)  |   1.163867    .183799     0.96   0.337     .8540455    1.586084
             |
smoke_nomiss |
     Former  |   1.303332   .0777933     4.44   0.000     1.159441    1.465081
    Current  |   1.192773   .1607182     1.31   0.191     .9159334    1.553286
             |
     diabcat |
Controlle..  |     1.2197   .0726979     3.33   0.001     1.085223    1.370842
Uncontrol..  |   1.235539   .1084499     2.41   0.016      1.04026    1.467475
Diabetes,..  |   .8310315   .3798364    -0.40   0.686      .339283    2.035508
             |
1.myocardi~t |   1.285682   .0860432     3.75   0.000     1.127632    1.465884
       1.pad |    1.49982   .1238447     4.91   0.000     1.275712    1.763297
1.hyperten~n |   1.000285    .062285     0.00   0.996     .8853642    1.130123
1.heart_f~re |   1.265073   .0682485     4.36   0.000     1.138137    1.406165
1.stroke_tia |   1.198034   .0657937     3.29   0.001     1.075778    1.334183
       1.vte |   1.234859   .0987734     2.64   0.008     1.055678    1.444451
 1.oestrogen |    .363464   .2600547    -1.41   0.157     .0894202    1.477363
1.antiplat~t |   .8450117   .0870098    -1.64   0.102     .6905825    1.033975
1.flu_vac~ne |   .7335806   .0471668    -4.82   0.000     .6467232    .8321032
             |
         ckd |
        CKD  |   1.333812    .072946     5.27   0.000     1.198236    1.484727
      1.copd |   1.323244   .0918748     4.03   0.000     1.154888    1.516143
1.other_re~y |   1.459396   .1211336     4.55   0.000     1.240284    1.717216
1.immunode~y |   1.737581   .4663541     2.06   0.040     1.026807    2.940366
    1.cancer |   .9880388   .0630933    -0.19   0.851     .8718037    1.119771
1.ae_atten~r |   2.166873   .1174509    14.27   0.000      1.94848    2.409745
1.gp_consult |   .7291254   .0998223    -2.31   0.021     .5575283    .9535371
1.care_ho~ce |    6.22752   .4545619    25.06   0.000     5.397391    7.185325
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_without
> ethn.ster not found)
file /workspace/output/warfarin_tempdata/onscoviddeath_multivar3_withoutethn.st
> er saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table3_onscoviddeath.txt not foun
> d)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    205,975    4.22e+07           0   4.22e+07   4.22e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     67,590    1.40e+07           0   1.40e+07   1.40e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7151225   .0446547    -5.37   0.000     .6327447    .8082252
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .647752   .0405734    -6.93   0.000     .5729171    .7323619
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7311882   .0478402    -4.79   0.000     .6431862    .8312307
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7293119   .0476958    -4.83   0.000     .6415731    .8290496
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8097266   .0533125    -3.21   0.001     .7116972    .9212587
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8079187   .0531703    -3.24   0.001      .710148      .91915
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/06b_an_models_ethnicity_onscoviddea
> th.log
  log type:  text
 closed on:  31 Dec 2020, 02:53:27
-------------------------------------------------------------------------------
