-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/08b_an_model_checks_positivecovidte
> st.log
  log type:  text
 opened on:  31 Dec 2020, 03:02:01

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00462         0.10        1         0.7497
      ------------+---------------------------------------------------
      global test |                      0.10        1         0.7497
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
.75

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot1.svg
>  not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot1.svg writt
> en in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -60950.915
Iteration 1:   log likelihood = -60296.606
Iteration 2:   log likelihood = -60168.561
Iteration 3:   log likelihood = -60166.232
Iteration 4:   log likelihood = -60166.231
Refining estimates:
Iteration 0:   log likelihood = -60166.231

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        4,761
Time at risk    =     75757223
                                                LR chi2(5)       =     1569.37
Log likelihood  =   -60166.231                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6576581    .024559   -11.22   0.000     .6112427    .7075982
      1.male |   1.152563   .0343789     4.76   0.000     1.087114    1.221953
        age1 |   .9703014   .0056418    -5.19   0.000     .9593064    .9814223
        age2 |   1.122255   .0116313    11.13   0.000     1.099688    1.145285
        age3 |   .6327955   .0404245    -7.16   0.000     .5583243    .7171999
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00392         0.07        1         0.7863
      0b.male     |            .            .        1             .
      1.male      |     -0.04509         9.71        1         0.0018
      age1        |     -0.05133         9.86        1         0.0017
      age2        |     -0.00542         0.12        1         0.7315
      age3        |      0.02740         3.21        1         0.0731
      ------------+---------------------------------------------------
      global test |                     69.08        5         0.0000
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot2.svg
>  not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot2.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist ,strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24603.451
Iteration 1:   log likelihood = -23311.224
Iteration 2:   log likelihood = -22741.716
Iteration 3:   log likelihood = -22738.052
Iteration 4:   log likelihood = -22738.051
Refining estimates:
Iteration 0:   log likelihood = -22738.051

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        4,761
Time at risk    =     75757223
                                                LR chi2(27)      =     3730.80
Log likelihood  =   -22738.051                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7322436   .0282662    -8.07   0.000     .6788868     .789794
      1.male |   1.229577   .0390968     6.50   0.000     1.155288    1.308644
        age1 |    .975019   .0059071    -4.18   0.000     .9635097    .9866658
        age2 |   1.119377   .0119362    10.58   0.000     1.096225    1.143017
        age3 |   .5709211   .0372419    -8.59   0.000     .5024017    .6487853
             |
         imd |
          2  |   1.107413   .0611349     1.85   0.065     .9938459    1.233958
          3  |   1.201119   .0668148     3.29   0.001     1.077051    1.339479
          4  |   1.296105    .074782     4.50   0.000     1.157518    1.451284
5 most de..  |   1.473165    .086278     6.61   0.000     1.313408    1.652355
             |
   obese4cat |
Obese I ..)  |   .9943433   .0394894    -0.14   0.886     .9198811    1.074833
Obese II..)  |   1.207317   .0673937     3.38   0.001     1.082197    1.346903
Obese II..)  |   1.324718   .1010168     3.69   0.000     1.140814    1.538268
             |
smoke_nomiss |
     Former  |   1.193716   .0393129     5.38   0.000     1.119098    1.273309
    Current  |   1.001432    .076591     0.02   0.985     .8620256    1.163382
             |
     diabcat |
Controlle..  |   1.207333   .0428696     5.31   0.000     1.126168    1.294349
Uncontrol..  |   1.556293   .0753626     9.13   0.000     1.415378    1.711237
Diabetes,..  |    .881036    .231395    -0.48   0.630     .5265436    1.474188
             |
1.myocardi~t |   1.105883   .0477803     2.33   0.020     1.016091     1.20361
       1.pad |   1.341228   .0714884     5.51   0.000     1.208184    1.488923
1.hyperten~n |   1.035659   .0367562     0.99   0.324     .9660666    1.110265
1.heart_f~re |    1.28088   .0405514     7.82   0.000     1.203816    1.362877
1.stroke_tia |   1.175101    .038844     4.88   0.000     1.101382    1.253754
       1.vte |   1.401807   .0652165     7.26   0.000      1.27964    1.535638
 1.oestrogen |   1.053666   .2395659     0.23   0.818      .674792    1.645264
1.antiplat~t |   1.008295   .0616326     0.14   0.892     .8944528    1.136627
1.flu_vac~ne |   .8185905    .030416    -5.39   0.000     .7610952    .8804291
1.care_ho~ce |   6.806822   .2936366    44.46   0.000     6.254964     7.40737
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00306         0.04        1         0.8329
      0b.male     |            .            .        1             .
      1.male      |     -0.02933         4.19        1         0.0407
      age1        |     -0.05315        11.09        1         0.0009
      age2        |     -0.00121         0.01        1         0.9385
      age3        |      0.02042         1.79        1         0.1813
      1b.imd      |            .            .        1             .
      2.imd       |     -0.01114         0.58        1         0.4453
      3.imd       |     -0.01532         1.11        1         0.2931
      4.imd       |     -0.02085         2.04        1         0.1530
      5.imd       |      0.00206         0.02        1         0.8884
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00249         0.03        1         0.8645
      3.obese4cat |     -0.02059         2.03        1         0.1542
      4.obese4cat |     -0.03714         6.53        1         0.0106
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03023         4.35        1         0.0369
      3.smoke_no~s|     -0.01778         1.54        1         0.2144
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.03477         5.81        1         0.0159
      3.diabcat   |     -0.02782         3.71        1         0.0542
      4.diabcat   |      0.03073         4.49        1         0.0340
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01543         1.15        1         0.2840
      0b.pad      |            .            .        1             .
      1.pad       |     -0.01820         1.63        1         0.2012
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00012         0.00        1         0.9935
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00789         0.30        1         0.5848
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02478         2.97        1         0.0848
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00533         0.14        1         0.7096
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00419         0.08        1         0.7721
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|     -0.00686         0.23        1         0.6338
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.00149         0.01        1         0.9174
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.04914        13.36        1         0.0003
      ------------+---------------------------------------------------
      global test |                    122.58       27         0.0000
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot3.svg
>  not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot3.svg writt
> en in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24603.451
Iteration 1:   log likelihood = -23021.441
Iteration 2:   log likelihood = -22383.374
Iteration 3:   log likelihood = -22379.546
Iteration 4:   log likelihood = -22379.546
Refining estimates:
Iteration 0:   log likelihood = -22379.546

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        4,761
Time at risk    =     75757223
                                                LR chi2(34)      =     4447.81
Log likelihood  =   -22379.546                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8002236   .0310332    -5.75   0.000     .7416538    .8634188
      1.male |   1.254196   .0398738     7.12   0.000      1.17843    1.334834
        age1 |   .9776728    .005902    -3.74   0.000     .9661733    .9893091
        age2 |   1.103235   .0117655     9.21   0.000     1.080414    1.126538
        age3 |   .6195448   .0404922    -7.33   0.000     .5450545    .7042153
             |
         imd |
          2  |   1.099074   .0607405     1.71   0.087      .986246     1.22481
          3  |   1.181283   .0657377     2.99   0.003     1.059217    1.317416
          4  |   1.256135   .0726145     3.94   0.000      1.12158    1.406833
5 most de..  |   1.397525   .0820401     5.70   0.000     1.245635    1.567937
             |
   obese4cat |
Obese I ..)  |   1.005509   .0400341     0.14   0.890     .9300267    1.087117
Obese II..)  |   1.215347   .0679794     3.49   0.000     1.089154    1.356162
Obese II..)  |   1.313559   .1003173     3.57   0.000     1.130948    1.525655
             |
smoke_nomiss |
     Former  |   1.129904   .0379047     3.64   0.000     1.058002    1.206693
    Current  |   .9032872   .0702719    -1.31   0.191     .7755432    1.052073
             |
     diabcat |
Controlle..  |   1.189598   .0423962     4.87   0.000     1.109339    1.275664
Uncontrol..  |    1.48251     .07228     8.08   0.000     1.347402    1.631166
Diabetes,..  |   .8655911   .2274418    -0.55   0.583     .5171923    1.448684
             |
1.myocardi~t |   1.066088   .0460526     1.48   0.138      .979542    1.160281
       1.pad |   1.279268   .0682991     4.61   0.000      1.15217    1.420386
1.hyperten~n |   1.029509   .0366882     0.82   0.414     .9600554    1.103988
1.heart_f~re |   1.178151   .0379347     5.09   0.000     1.106098    1.254898
1.stroke_tia |   1.125043   .0372549     3.56   0.000     1.054344    1.200483
       1.vte |   1.299581   .0607155     5.61   0.000     1.185866    1.424199
 1.oestrogen |   1.025405    .234059     0.11   0.912     .6555415     1.60395
1.antiplat~t |   .9198174   .0562937    -1.37   0.172     .8158443    1.037041
1.flu_vac~ne |   .8229735   .0307324    -5.22   0.000     .7648906     .885467
             |
         ckd |
        CKD  |   1.129956   .0364885     3.78   0.000     1.060656    1.203783
      1.copd |   1.237238   .0532091     4.95   0.000     1.137224    1.346047
1.other_re~y |   1.322197   .0696614     5.30   0.000     1.192476     1.46603
1.immunode~y |   1.151303   .2136005     0.76   0.448     .8003255    1.656199
    1.cancer |   1.040871   .0390716     1.07   0.286      .967041    1.120337
1.ae_atten~r |   2.118922   .0665726    23.90   0.000     1.992378    2.253503
1.gp_consult |   .7054732   .0575101    -4.28   0.000     .6012992    .8276952
1.care_ho~ce |   6.212961   .2722496    41.69   0.000     5.701634    6.770145
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00229         0.02        1         0.8749
      0b.male     |            .            .        1             .
      1.male      |     -0.02940         4.17        1         0.0411
      age1        |     -0.05401        11.32        1         0.0008
      age2        |      0.00411         0.07        1         0.7928
      age3        |      0.01481         0.94        1         0.3310
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00987         0.46        1         0.4985
      3.imd       |     -0.01470         1.02        1         0.3130
      4.imd       |     -0.01825         1.56        1         0.2109
      5.imd       |      0.00540         0.13        1         0.7136
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00358         0.06        1         0.8061
      3.obese4cat |     -0.02103         2.11        1         0.1461
      4.obese4cat |     -0.03649         6.30        1         0.0121
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02257         2.43        1         0.1191
      3.smoke_no~s|     -0.01388         0.93        1         0.3353
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.03104         4.63        1         0.0313
      3.diabcat   |     -0.02225         2.38        1         0.1229
      4.diabcat   |      0.03058         4.48        1         0.0343
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01103         0.58        1         0.4447
      0b.pad      |            .            .        1             .
      1.pad       |     -0.01610         1.28        1         0.2588
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00122         0.01        1         0.9325
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00282         0.04        1         0.8447
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02031         2.00        1         0.1577
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00054         0.00        1         0.9699
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00444         0.09        1         0.7584
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|     -0.00487         0.11        1         0.7350
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.00110         0.01        1         0.9386
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.02665         3.48        1         0.0619
      0b.copd     |            .            .        1             .
      1.copd      |     -0.00524         0.13        1         0.7172
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.04074         8.08        1         0.0045
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.03271         5.07        1         0.0243
      0b.cancer   |            .            .        1             .
      1.cancer    |     -0.00574         0.16        1         0.6914
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.05753        16.11        1         0.0001
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.01050         0.56        1         0.4544
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.04958        13.51        1         0.0002
      ------------+---------------------------------------------------
      global test |                    159.17       34         0.0000
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot4.svg
>  not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot4.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table5_positivecovidtest.txt not 
> found)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00895         0.29        1         0.5897
      ------------+---------------------------------------------------
      global test |                      0.29        1         0.5897
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
.75

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot1_com
> pletecase.svg not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot1_completec
> ase.svg written in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45362.245
Iteration 1:   log likelihood = -44832.005
Iteration 2:   log likelihood = -44731.679
Iteration 3:   log likelihood = -44729.722
Iteration 4:   log likelihood = -44729.721
Refining estimates:
Iteration 0:   log likelihood = -44729.721

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(5)       =     1265.05
Log likelihood  =   -44729.721                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .662653    .028218    -9.66   0.000     .6095919    .7203327
      1.male |   1.187057   .0405806     5.02   0.000     1.110126    1.269318
        age1 |   .9673552   .0063078    -5.09   0.000     .9550708    .9797977
        age2 |   1.137931   .0133574    11.01   0.000      1.11205    1.164414
        age3 |   .5740762   .0418937    -7.61   0.000      .497568    .6623488
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00050         0.00        1         0.9760
      0b.male     |            .            .        1             .
      1.male      |     -0.05036         9.28        1         0.0023
      age1        |     -0.05423         8.38        1         0.0038
      age2        |      0.00105         0.00        1         0.9537
      age3        |      0.01796         1.05        1         0.3050
      ------------+---------------------------------------------------
      global test |                     49.67        5         0.0000
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot2_com
> pletecase.svg not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot2_completec
> ase.svg written in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45362.245
Iteration 1:   log likelihood = -44935.067
Iteration 2:   log likelihood = -43772.568
Iteration 3:   log likelihood = -43753.223
Iteration 4:   log likelihood = -43753.168
Iteration 5:   log likelihood = -43753.168
Refining estimates:
Iteration 0:   log likelihood = -43753.168

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(31)      =     3218.16
Log likelihood  =   -43753.168                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7401359   .0318513    -6.99   0.000     .6802687    .8052717
      1.male |   1.262139   .0454923     6.46   0.000     1.176053    1.354528
        age1 |   .9704413   .0065603    -4.44   0.000     .9576681    .9833849
        age2 |   1.136425   .0136458    10.65   0.000     1.109992    1.163488
        age3 |   .5096165   .0377157    -9.11   0.000     .4408063     .589168
             |
         imd |
          2  |   1.094136   .0654882     1.50   0.133     .9730243    1.230323
          3  |   1.192609   .0690933     3.04   0.002     1.064595    1.336018
          4  |   1.276312   .0728646     4.27   0.000       1.1412    1.427421
5 most de..  |   1.711228   .0922564     9.96   0.000     1.539634    1.901946
             |
   obese4cat |
Obese I ..)  |   1.004764   .0449327     0.11   0.915     .9204463    1.096805
Obese II..)  |   1.285083   .0798081     4.04   0.000     1.137807    1.451422
Obese II..)  |   1.317574   .1158311     3.14   0.002     1.109032    1.565331
             |
smoke_nomiss |
     Former  |   1.202253   .0450144     4.92   0.000     1.117186    1.293797
    Current  |   .9979043   .0878693    -0.02   0.981     .8397254    1.185879
             |
     diabcat |
Controlle..  |   1.245061   .0487854     5.59   0.000     1.153023    1.344446
Uncontrol..  |   1.551087   .0841032     8.10   0.000     1.394704    1.725003
Diabetes,..  |   .9737933   .2945362    -0.09   0.930     .5382821    1.761666
             |
1.myocardi~t |   1.133985    .054439     2.62   0.009     1.032152    1.245864
       1.pad |   1.399171   .0819489     5.73   0.000      1.24743     1.56937
1.hyperten~n |   1.053253   .0427338     1.28   0.201     .9727396     1.14043
1.heart_f~re |   1.241809   .0442442     6.08   0.000     1.158051    1.331626
1.stroke_tia |   1.195449   .0443705     4.81   0.000     1.111572    1.285655
       1.vte |    1.35294   .0713575     5.73   0.000     1.220068    1.500282
 1.oestrogen |   .9820347   .2636267    -0.07   0.946     .5802595    1.662002
1.antiplat~t |   1.020456   .0690196     0.30   0.765     .8937632    1.165108
1.flu_vac~ne |   .8056434   .0341062    -5.10   0.000     .7414946     .875342
1.care_ho~ce |   6.931676   .3230414    41.54   0.000     6.326583    7.594643
             |
   ethnicity |
      Mixed  |   1.520248   .4401837     1.45   0.148     .8618887    2.681498
Asian or ..  |   1.854334    .187338     6.11   0.000     1.521226    2.260385
      Black  |   1.627478   .2710968     2.92   0.003     1.174158    2.255817
      Other  |   1.543021   .3043205     2.20   0.028     1.048322    2.271167
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00397         0.06        1         0.8107
      0b.male     |            .            .        1             .
      1.male      |     -0.03704         5.13        1         0.0235
      age1        |     -0.05140         7.92        1         0.0049
      age2        |      0.00213         0.01        1         0.9049
      age3        |      0.01227         0.50        1         0.4790
      1b.imd      |            .            .        1             .
      2.imd       |     -0.03025         3.32        1         0.0684
      3.imd       |     -0.03020         3.31        1         0.0688
      4.imd       |     -0.04663         7.92        1         0.0049
      5.imd       |     -0.00264         0.03        1         0.8727
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00186         0.01        1         0.9111
      3.obese4cat |     -0.01102         0.44        1         0.5052
      4.obese4cat |     -0.01967         1.39        1         0.2392
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00622         0.14        1         0.7081
      3.smoke_no~s|     -0.00711         0.19        1         0.6655
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.04337         6.87        1         0.0088
      3.diabcat   |     -0.02385         2.04        1         0.1530
      4.diabcat   |      0.02401         2.09        1         0.1482
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01674         1.04        1         0.3085
      0b.pad      |            .            .        1             .
      1.pad       |     -0.02114         1.65        1         0.1987
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00656         0.16        1         0.6916
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00293         0.03        1         0.8597
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.03078         3.47        1         0.0625
      0b.vte      |            .            .        1             .
      1.vte       |      0.00732         0.20        1         0.6575
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00510         0.09        1         0.7584
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|     -0.00089         0.00        1         0.9570
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.00178         0.01        1         0.9144
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.06048        15.39        1         0.0001
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.01732         1.09        1         0.2963
      3.ethnicity |      0.05970        12.91        1         0.0003
      4.ethnicity |     -0.02027         1.50        1         0.2212
      5.ethnicity |     -0.03809         5.23        1         0.0221
      ------------+---------------------------------------------------
      global test |                    117.51       31         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot3_com
> pletecase_ethn.svg not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot3_completec
> ase_ethn.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -45362.245
Iteration 1:   log likelihood = -44956.606
Iteration 2:   log likelihood = -43791.628
Iteration 3:   log likelihood = -43774.847
Iteration 4:   log likelihood = -43774.802
Iteration 5:   log likelihood = -43774.802
Refining estimates:
Iteration 0:   log likelihood = -43774.802

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(27)      =     3174.89
Log likelihood  =   -43774.802                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7332686   .0315404    -7.21   0.000     .6739847    .7977672
      1.male |    1.25968   .0453974     6.41   0.000     1.173772    1.351875
        age1 |   .9686463   .0065415    -4.72   0.000     .9559096    .9815526
        age2 |   1.138485    .013668    10.80   0.000     1.112008    1.165591
        age3 |   .5055092   .0374183    -9.22   0.000     .4372423    .5844345
             |
         imd |
          2  |   1.096527   .0656293     1.54   0.124     .9751544    1.233007
          3  |   1.200584   .0695387     3.16   0.002     1.071742    1.344915
          4  |   1.296517   .0739236     4.55   0.000     1.159432     1.44981
5 most de..  |    1.75654   .0943155    10.49   0.000      1.58108    1.951473
             |
   obese4cat |
Obese I ..)  |   .9968231   .0445725    -0.07   0.943     .9131812    1.088126
Obese II..)  |   1.268646   .0787815     3.83   0.000     1.123264    1.432845
Obese II..)  |   1.291233   .1134751     2.91   0.004     1.086926    1.533943
             |
smoke_nomiss |
     Former  |   1.174541   .0436895     4.32   0.000     1.091958    1.263369
    Current  |    .969297   .0852201    -0.35   0.723     .8158676     1.15158
             |
     diabcat |
Controlle..  |   1.278697   .0497359     6.32   0.000      1.18484    1.379989
Uncontrol..  |   1.593994   .0860911     8.63   0.000     1.433882    1.771984
Diabetes,..  |   1.003426   .3034416     0.01   0.991     .5547245     1.81507
             |
1.myocardi~t |   1.142716   .0548332     2.78   0.005     1.040144    1.255403
       1.pad |    1.38868   .0813269     5.61   0.000      1.23809    1.557586
1.hyperten~n |   1.060498   .0430048     1.45   0.147     .9794727    1.148226
1.heart_f~re |   1.242967   .0442862     6.10   0.000     1.159129    1.332869
1.stroke_tia |   1.198219   .0444779     4.87   0.000      1.11414    1.288644
       1.vte |   1.346148   .0709815     5.64   0.000     1.213974    1.492712
 1.oestrogen |   .9785002   .2626857    -0.08   0.935     .5781619    1.656046
1.antiplat~t |   1.035142   .0699742     0.51   0.609     .9066919    1.181789
1.flu_vac~ne |   .8037765   .0340238    -5.16   0.000     .7397824    .8733064
1.care_ho~ce |   6.814671   .3170049    41.25   0.000     6.220835    7.465194
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00311         0.04        1         0.8510
      0b.male     |            .            .        1             .
      1.male      |     -0.03753         5.27        1         0.0218
      age1        |     -0.05163         8.03        1         0.0046
      age2        |      0.00187         0.01        1         0.9163
      age3        |      0.01245         0.52        1         0.4722
      1b.imd      |            .            .        1             .
      2.imd       |     -0.02987         3.24        1         0.0719
      3.imd       |     -0.02933         3.12        1         0.0772
      4.imd       |     -0.04494         7.36        1         0.0067
      5.imd       |     -0.00084         0.00        1         0.9595
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00332         0.04        1         0.8424
      3.obese4cat |     -0.01271         0.59        1         0.4420
      4.obese4cat |     -0.02204         1.74        1         0.1871
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01156         0.49        1         0.4858
      3.smoke_no~s|     -0.01001         0.37        1         0.5417
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.04037         5.94        1         0.0148
      3.diabcat   |     -0.01985         1.42        1         0.2338
      4.diabcat   |      0.02444         2.17        1         0.1411
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01437         0.76        1         0.3822
      0b.pad      |            .            .        1             .
      1.pad       |     -0.02257         1.88        1         0.1698
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00742         0.20        1         0.6534
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00245         0.02        1         0.8825
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.03011         3.32        1         0.0683
      0b.vte      |            .            .        1             .
      1.vte       |      0.00604         0.13        1         0.7141
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00525         0.10        1         0.7514
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00099         0.00        1         0.9520
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.00075         0.00        1         0.9636
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.05856        14.42        1         0.0001
      ------------+---------------------------------------------------
      global test |                     96.02       27         0.0000
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot3_com
> pletecase.svg not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot3_completec
> ase.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(pract
> ice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17736.657
Iteration 1:   log likelihood = -16445.092
Iteration 2:   log likelihood = -16009.888
Iteration 3:   log likelihood = -16007.989
Iteration 4:   log likelihood = -16007.989
Refining estimates:
Iteration 0:   log likelihood = -16007.989

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(38)      =     3457.34
Log likelihood  =   -16007.989                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8170239   .0363113    -4.55   0.000     .7488666    .8913844
      1.male |   1.293392   .0473286     7.03   0.000     1.203878    1.389561
        age1 |   .9752034   .0066679    -3.67   0.000     .9622217    .9883602
        age2 |   1.115747   .0135806     9.00   0.000     1.089444    1.142684
        age3 |   .5708553   .0429505    -7.45   0.000     .4925866    .6615605
             |
         imd |
          2  |   1.104246   .0724614     1.51   0.131     .9709777    1.255805
          3  |   1.220447   .0795101     3.06   0.002     1.074149     1.38667
          4  |   1.256854   .0852306     3.37   0.001      1.10043    1.435513
5 most de..  |   1.368363   .0937432     4.58   0.000      1.19643    1.565002
             |
   obese4cat |
Obese I ..)  |   1.005623   .0457127     0.12   0.902     .9199029    1.099331
Obese II..)  |   1.263469   .0795971     3.71   0.000     1.116709    1.429517
Obese II..)  |   1.276737   .1136864     2.74   0.006     1.072276    1.520184
             |
smoke_nomiss |
     Former  |   1.148017   .0447166     3.54   0.000     1.063636    1.239092
    Current  |   .8870831   .0801283    -1.33   0.185     .7431511    1.058892
             |
     diabcat |
Controlle..  |   1.199349   .0489057     4.46   0.000     1.107226    1.299137
Uncontrol..  |   1.476103    .082253     6.99   0.000     1.323382    1.646449
Diabetes,..  |   .9199165     .28289    -0.27   0.786     .5034884    1.680766
             |
1.myocardi~t |   1.071647   .0524791     1.41   0.158     .9735722    1.179602
       1.pad |   1.359616    .081831     5.10   0.000     1.208329    1.529845
1.hyperten~n |   1.015366   .0421704     0.37   0.713     .9359884    1.101476
1.heart_f~re |   1.135573    .042131     3.43   0.001     1.055929    1.221225
1.stroke_tia |   1.152664   .0436437     3.75   0.000     1.070221    1.241458
       1.vte |   1.263949   .0683445     4.33   0.000      1.13685    1.405257
 1.oestrogen |   .9784237   .2675681    -0.08   0.936     .5724665     1.67226
1.antiplat~t |   .9367196   .0647316    -0.95   0.344     .8180648    1.072584
1.flu_vac~ne |     .81732   .0355859    -4.63   0.000      .750466    .8901296
             |
         ckd |
        CKD  |   1.144567   .0425261     3.63   0.000      1.06418    1.231027
      1.copd |   1.267911   .0615872     4.89   0.000      1.15277    1.394552
1.other_re~y |   1.230039   .0747162     3.41   0.001     1.091979    1.385553
1.immunode~y |   1.099016   .2341769     0.44   0.658     .7238212    1.668695
    1.cancer |   1.054246   .0454984     1.22   0.221      .968738    1.147301
1.ae_atten~r |   2.142007    .077555    21.04   0.000      1.99527    2.299535
1.gp_consult |    .683603   .0646726    -4.02   0.000      .567905     .822872
1.care_ho~ce |   6.223945   .3155766    36.06   0.000     5.635167    6.874241
             |
   ethnicity |
      Mixed  |   1.075261   .3227162     0.24   0.809     .5970964    1.936349
Asian or ..  |   1.364265   .1713812     2.47   0.013     1.066521    1.745131
      Black  |   1.366108    .244539     1.74   0.081     .9618705    1.940232
      Other  |   1.273782   .2758299     1.12   0.264     .8332447    1.947232
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00636         0.15        1         0.7023
      0b.male     |            .            .        1             .
      1.male      |     -0.03573         4.76        1         0.0291
      age1        |     -0.05909        10.44        1         0.0012
      age2        |      0.01453         0.66        1         0.4164
      age3        |      0.00238         0.02        1         0.8911
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00746         0.20        1         0.6579
      3.imd       |      0.00039         0.00        1         0.9813
      4.imd       |     -0.01383         0.68        1         0.4093
      5.imd       |      0.01325         0.62        1         0.4327
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00578         0.12        1         0.7296
      3.obese4cat |     -0.01459         0.77        1         0.3792
      4.obese4cat |     -0.02100         1.56        1         0.2112
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01133         0.47        1         0.4941
      3.smoke_no~s|     -0.00993         0.36        1         0.5479
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.03028         3.36        1         0.0669
      3.diabcat   |     -0.01540         0.87        1         0.3507
      4.diabcat   |      0.02529         2.32        1         0.1275
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01656         1.02        1         0.3133
      0b.pad      |            .            .        1             .
      1.pad       |     -0.01386         0.73        1         0.3927
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00409         0.06        1         0.8021
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00124         0.01        1         0.9405
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.03003         3.35        1         0.0673
      0b.vte      |            .            .        1             .
      1.vte       |      0.01459         0.80        1         0.3707
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00204         0.02        1         0.9020
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00510         0.10        1         0.7556
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.00444         0.07        1         0.7862
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.03146         3.75        1         0.0529
      0b.copd     |            .            .        1             .
      1.copd      |      0.00449         0.07        1         0.7856
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.04591         7.87        1         0.0050
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.03491         4.35        1         0.0370
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.00294         0.03        1         0.8592
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.05113         9.63        1         0.0019
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02196         1.87        1         0.1711
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.04829         9.77        1         0.0018
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.00492         0.09        1         0.7640
      3.ethnicity |      0.06580        16.11        1         0.0001
      4.ethnicity |      0.00717         0.19        1         0.6650
      5.ethnicity |     -0.02392         1.93        1         0.1652
      ------------+---------------------------------------------------
      global test |                    131.73       38         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot4_com
> pletecase_ethn.svg not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot4_completec
> ase_ethn.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -17736.657
Iteration 1:   log likelihood = -16448.119
Iteration 2:   log likelihood = -16014.183
Iteration 3:   log likelihood = -16012.311
Iteration 4:   log likelihood = -16012.311
Refining estimates:
Iteration 0:   log likelihood = -16012.311

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        3,630
Time at risk    =   55827257.5
                                                LR chi2(34)      =     3448.69
Log likelihood  =   -16012.311                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8153418   .0362291    -4.59   0.000     .7473382    .8895334
      1.male |   1.292672   .0472958     7.02   0.000      1.20322    1.388775
        age1 |   .9744481   .0066599    -3.79   0.000      .961482     .987589
        age2 |    1.11669    .013592     9.07   0.000     1.090365     1.14365
        age3 |   .5683998   .0427676    -7.51   0.000     .4904647    .6587188
             |
         imd |
          2  |   1.103825   .0724248     1.51   0.132      .970623    1.255306
          3  |   1.220715   .0795078     3.06   0.002     1.074419    1.386931
          4  |   1.257195   .0852392     3.38   0.001     1.100754     1.43587
5 most de..  |    1.37129   .0939071     4.61   0.000     1.199053    1.568268
             |
   obese4cat |
Obese I ..)  |   1.004875   .0456744     0.11   0.915     .9192263    1.098504
Obese II..)  |   1.259593   .0793424     3.66   0.000     1.113301    1.425108
Obese II..)  |   1.267786   .1128349     2.67   0.008     1.064848    1.509399
             |
smoke_nomiss |
     Former  |   1.138506   .0441731     3.34   0.001     1.055139    1.228461
    Current  |   .8766726   .0791032    -1.46   0.145     .7345689    1.046267
             |
     diabcat |
Controlle..  |   1.207282   .0491252     4.63   0.000     1.114738    1.307509
Uncontrol..  |   1.490792   .0828601     7.18   0.000     1.336922     1.66237
Diabetes,..  |   .9280991   .2853778    -0.24   0.808     .5079975    1.695615
             |
1.myocardi~t |   1.075625   .0526232     1.49   0.136     .9772757    1.183871
       1.pad |   1.357991   .0817207     5.09   0.000     1.206906    1.527989
1.hyperten~n |   1.017203   .0422351     0.41   0.681     .9377025    1.103444
1.heart_f~re |   1.136271   .0421453     3.44   0.001     1.056599    1.221951
1.stroke_tia |   1.154426   .0437061     3.79   0.000     1.071865    1.243347
       1.vte |   1.262789   .0682622     4.32   0.000     1.135841    1.403925
 1.oestrogen |   .9741482   .2663851    -0.10   0.924     .5699808    1.664907
1.antiplat~t |   .9394417   .0649182    -0.90   0.366     .8204447    1.075698
1.flu_vac~ne |    .816978   .0355545    -4.64   0.000     .7501817    .8897218
             |
         ckd |
        CKD  |   1.145988   .0425771     3.67   0.000     1.065505    1.232551
      1.copd |   1.265869   .0614829     4.85   0.000     1.150923    1.392295
1.other_re~y |   1.230376   .0747262     3.41   0.001     1.092297     1.38591
1.immunode~y |    1.09627   .2336349     0.43   0.666     .7219564    1.664654
    1.cancer |   1.051301   .0453491     1.16   0.246     .9660725    1.144049
1.ae_atten~r |    2.14494   .0776522    21.08   0.000     1.998018    2.302665
1.gp_consult |   .6854986   .0648713    -3.99   0.000      .569448    .8251996
1.care_ho~ce |    6.19406   .3139243    35.98   0.000     5.608351    6.840937
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00727         0.19        1         0.6624
      0b.male     |            .            .        1             .
      1.male      |     -0.03673         5.03        1         0.0250
      age1        |     -0.05992        10.79        1         0.0010
      age2        |      0.01457         0.67        1         0.4144
      age3        |      0.00237         0.02        1         0.8918
      1b.imd      |            .            .        1             .
      2.imd       |     -0.00754         0.20        1         0.6542
      3.imd       |      0.00045         0.00        1         0.9788
      4.imd       |     -0.01369         0.67        1         0.4143
      5.imd       |      0.01275         0.57        1         0.4502
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00710         0.18        1         0.6710
      3.obese4cat |     -0.01584         0.91        1         0.3395
      4.obese4cat |     -0.02288         1.86        1         0.1729
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01611         0.95        1         0.3303
      3.smoke_no~s|     -0.01266         0.59        1         0.4431
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02785         2.85        1         0.0916
      3.diabcat   |     -0.01201         0.53        1         0.4664
      4.diabcat   |      0.02574         2.41        1         0.1205
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01416         0.74        1         0.3891
      0b.pad      |            .            .        1             .
      1.pad       |     -0.01462         0.81        1         0.3670
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.00490         0.09        1         0.7640
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00224         0.02        1         0.8923
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.02888         3.10        1         0.0783
      0b.vte      |            .            .        1             .
      1.vte       |      0.01382         0.72        1         0.3964
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00238         0.02        1         0.8859
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.00581         0.13        1         0.7227
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.00311         0.04        1         0.8490
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.03143         3.74        1         0.0530
      0b.copd     |            .            .        1             .
      1.copd      |      0.00383         0.05        1         0.8165
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.04610         7.93        1         0.0049
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.03491         4.35        1         0.0369
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.00135         0.01        1         0.9349
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.05040         9.36        1         0.0022
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02189         1.86        1         0.1724
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.04570         8.75        1         0.0031
      ------------+---------------------------------------------------
      global test |                    112.56       34         0.0000
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot4_com
> pletecase.svg not found)
(file /workspace/output/warfarin_tabfig/positivecovidtest_schoenplot4_completec
> ase.svg written in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table6_positivecovidtest.txt not 
> found)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/08b_an_model_checks_positivecovidte
> st.log
  log type:  text
 closed on:  31 Dec 2020, 03:22:15
-------------------------------------------------------------------------------
