-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/08b_an_model_checks_onscoviddeath.l
> og
  log type:  text
 opened on:  31 Dec 2020, 02:51:21

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.01200         0.32        1         0.5688
      ------------+---------------------------------------------------
      global test |                      0.32        1         0.5688
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
.569

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot1.svg not
>  found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot1.svg written i
> n SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28867.132
Iteration 1:   log likelihood = -28339.002
Iteration 2:   log likelihood = -28155.108
Iteration 3:   log likelihood = -28150.778
Iteration 4:   log likelihood = -28150.772
Refining estimates:
Iteration 0:   log likelihood = -28150.772

Cox regression -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,254
Time at risk    =   76162013.5
                                                LR chi2(5)       =     1432.72
Log likelihood  =   -28150.772                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .6476585   .0348543    -8.07   0.000     .5828246    .7197046
      1.male |   1.487775   .0649582     9.10   0.000     1.365755    1.620697
        age1 |   1.049245   .0188198     2.68   0.007        1.013    1.086788
        age2 |   1.073246    .026798     2.83   0.005     1.021987    1.127075
        age3 |   .6970798   .0897034    -2.80   0.005     .5416841    .8970547
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00924         0.19        1         0.6600
      0b.male     |            .            .        1             .
      1.male      |     -0.06160         8.60        1         0.0034
      age1        |     -0.01662         0.48        1         0.4871
      age2        |      0.02526         1.16        1         0.2824
      age3        |     -0.02113         0.85        1         0.3566
      ------------+---------------------------------------------------
      global test |                     23.23        5         0.0003
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot2.svg not
>  found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot2.svg written i
> n SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist ,strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11661.301
Iteration 1:   log likelihood = -10767.942
Iteration 2:   log likelihood = -10333.956
Iteration 3:   log likelihood = -10330.832
Iteration 4:   log likelihood =  -10330.75
Iteration 5:   log likelihood =  -10330.75
Refining estimates:
Iteration 0:   log likelihood =  -10330.75

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,254
Time at risk    =   76162013.5
                                                LR chi2(27)      =     2661.10
Log likelihood  =    -10330.75                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .736504   .0411991    -5.47   0.000     .6600243    .8218456
      1.male |   1.535238   .0718595     9.16   0.000     1.400663    1.682742
        age1 |   1.056685   .0192468     3.03   0.002     1.019627    1.095089
        age2 |   1.064721   .0269853     2.47   0.013     1.013123    1.118947
        age3 |   .6506177   .0849546    -3.29   0.001     .5037093    .8403725
             |
         imd |
          2  |   1.007365   .0801832     0.09   0.927     .8618543    1.177443
          3  |   1.189046   .0946813     2.17   0.030     1.017231    1.389883
          4  |   1.142491   .0961273     1.58   0.113     .9688004    1.347322
5 most de..  |   1.345009   .1153584     3.46   0.001     1.136893    1.591223
             |
   obese4cat |
Obese I ..)  |   .9641112   .0570943    -0.62   0.537     .8584584    1.082767
Obese II..)  |   1.184787   .1027663     1.95   0.051      .999559    1.404339
Obese II..)  |   1.338062   .1688749     2.31   0.021     1.044834    1.713583
             |
smoke_nomiss |
     Former  |   1.375341   .0681691     6.43   0.000     1.248017    1.515655
    Current  |   1.360306   .1533273     2.73   0.006     1.090669    1.696602
             |
     diabcat |
Controlle..  |   1.251121   .0639021     4.39   0.000      1.13194     1.38285
Uncontrol..  |   1.463296   .1072154     5.20   0.000     1.267549    1.689271
Diabetes,..  |   .5474637   .2481929    -1.33   0.184     .2251453    1.331214
             |
1.myocardi~t |   1.332323   .0769447     4.97   0.000     1.189737    1.491999
       1.pad |   1.441842   .1046476     5.04   0.000     1.250657    1.662253
1.hyperten~n |   1.026785    .053439     0.51   0.612     .9272117    1.137052
1.heart_f~re |   1.485982   .0671288     8.77   0.000     1.360068    1.623552
1.stroke_tia |   1.197256   .0565244     3.81   0.000     1.091441    1.313329
       1.vte |   1.403876   .0942104     5.06   0.000     1.230855    1.601219
 1.oestrogen |   .6302898   .2858287    -1.02   0.309     .2591378    1.533027
1.antiplat~t |   .8986148   .0807571    -1.19   0.234     .7534899    1.071691
1.flu_vac~ne |   .8047729   .0443029    -3.95   0.000     .7224612    .8964626
1.care_ho~ce |   6.865598   .4156183    31.82   0.000      6.09747    7.730489
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.01273         0.37        1         0.5449
      0b.male     |            .            .        1             .
      1.male      |     -0.04892         5.56        1         0.0184
      age1        |     -0.01634         0.48        1         0.4880
      age2        |      0.02740         1.38        1         0.2396
      age3        |     -0.02502         1.21        1         0.2723
      1b.imd      |            .            .        1             .
      2.imd       |      0.00907         0.18        1         0.6703
      3.imd       |      0.00651         0.09        1         0.7602
      4.imd       |      0.01793         0.73        1         0.3920
      5.imd       |      0.02041         0.93        1         0.3348
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02274         1.16        1         0.2815
      3.obese4cat |      0.01010         0.23        1         0.6291
      4.obese4cat |     -0.01660         0.62        1         0.4303
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.01029         0.24        1         0.6275
      3.smoke_no~s|      0.03784         3.27        1         0.0707
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02377         1.28        1         0.2586
      3.diabcat   |     -0.01278         0.37        1         0.5437
      4.diabcat   |      0.01857         0.78        1         0.3771
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.02332         1.27        1         0.2600
      0b.pad      |            .            .        1             .
      1.pad       |     -0.03286         2.50        1         0.1137
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.03713         3.10        1         0.0784
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00316         0.02        1         0.8800
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.00971         0.22        1         0.6422
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00126         0.00        1         0.9518
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.00331         0.03        1         0.8733
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02269         1.17        1         0.2789
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.03014         2.07        1         0.1498
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.01766         0.83        1         0.3617
      ------------+---------------------------------------------------
      global test |                     44.04       27         0.0205
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot3.svg not
>  found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot3.svg written i
> n SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -11661.301
Iteration 1:   log likelihood = -10596.005
Iteration 2:   log likelihood = -10132.644
Iteration 3:   log likelihood = -10129.388
Iteration 4:   log likelihood = -10129.314
Iteration 5:   log likelihood = -10129.314
Refining estimates:
Iteration 0:   log likelihood = -10129.314

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      371,546                  Number of obs    =     371,546
No. of failures =        2,254
Time at risk    =   76162013.5
                                                LR chi2(34)      =     3063.97
Log likelihood  =   -10129.314                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8077574   .0454009    -3.80   0.000     .7234994     .901828
      1.male |   1.558828   .0729643     9.48   0.000     1.422184      1.7086
        age1 |   1.057574   .0192274     3.08   0.002     1.020552    1.095938
        age2 |   1.047162   .0265235     1.82   0.069     .9964467     1.10046
        age3 |   .7188155   .0939635    -2.53   0.012     .5563504    .9287235
             |
         imd |
          2  |   1.007603   .0803454     0.09   0.924     .8618174    1.178049
          3  |   1.173225   .0935411     2.00   0.045     1.003495    1.371664
          4  |   1.103733   .0931759     1.17   0.242     .9354196    1.302331
5 most de..  |   1.278583   .1100626     2.85   0.004      1.08008    1.513567
             |
   obese4cat |
Obese I ..)  |   .9691764   .0575886    -0.53   0.598     .8626295    1.088883
Obese II..)  |   1.178117   .1024215     1.89   0.059     .9935459    1.396976
Obese II..)  |   1.307808   .1655695     2.12   0.034     1.020425    1.676126
             |
smoke_nomiss |
     Former  |   1.289668   .0650198     5.05   0.000     1.168326    1.423614
    Current  |   1.214809   .1396093     1.69   0.090     .9698079    1.521706
             |
     diabcat |
Controlle..  |   1.219385   .0625803     3.86   0.000     1.102697    1.348421
Uncontrol..  |   1.357754   .1002898     4.14   0.000     1.174756    1.569259
Diabetes,..  |   .5503236   .2495544    -1.32   0.188      .226269    1.338478
             |
1.myocardi~t |   1.274026   .0735792     4.19   0.000     1.137676    1.426717
       1.pad |   1.359858   .0990257     4.22   0.000     1.178986    1.568478
1.hyperten~n |   1.005332   .0525944     0.10   0.919     .9073576    1.113885
1.heart_f~re |   1.333221   .0612543     6.26   0.000     1.218412    1.458849
1.stroke_tia |   1.146969    .054241     2.90   0.004     1.045437    1.258362
       1.vte |   1.300548   .0875058     3.91   0.000     1.139868    1.483879
 1.oestrogen |   .6181925   .2812153    -1.06   0.290      .253462    1.507769
1.antiplat~t |   .8227543    .074072    -2.17   0.030     .6896632    .9815293
1.flu_vac~ne |   .8053667   .0445475    -3.91   0.000     .7226215    .8975868
             |
         ckd |
        CKD  |   1.280988   .0595899     5.32   0.000      1.16936    1.403272
      1.copd |   1.244766   .0756599     3.60   0.000     1.104968    1.402251
1.other_re~y |   1.515269   .1086537     5.80   0.000     1.316599    1.743917
1.immunode~y |   1.622072   .3814026     2.06   0.040     1.023115    2.571672
    1.cancer |   1.022178   .0549796     0.41   0.683     .9199052    1.135821
1.ae_atten~r |   2.145591   .0990243    16.54   0.000     1.960027    2.348724
1.gp_consult |   .7335948    .085122    -2.67   0.008     .5843699    .9209257
1.care_ho~ce |   6.358042   .3915357    30.04   0.000     5.635149     7.17367
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.01173         0.31        1         0.5777
      0b.male     |            .            .        1             .
      1.male      |     -0.04933         5.58        1         0.0182
      age1        |     -0.01667         0.50        1         0.4812
      age2        |      0.02915         1.56        1         0.2117
      age3        |     -0.02724         1.43        1         0.2312
      1b.imd      |            .            .        1             .
      2.imd       |      0.01021         0.23        1         0.6316
      3.imd       |      0.00659         0.10        1         0.7567
      4.imd       |      0.01780         0.73        1         0.3934
      5.imd       |      0.02088         0.98        1         0.3234
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02383         1.28        1         0.2574
      3.obese4cat |      0.00876         0.18        1         0.6752
      4.obese4cat |     -0.01744         0.68        1         0.4081
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00900         0.18        1         0.6709
      3.smoke_no~s|      0.03567         2.89        1         0.0893
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02243         1.14        1         0.2862
      3.diabcat   |     -0.01036         0.25        1         0.6205
      4.diabcat   |      0.01881         0.80        1         0.3700
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.02561         1.53        1         0.2159
      0b.pad      |            .            .        1             .
      1.pad       |     -0.03152         2.30        1         0.1292
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.03862         3.38        1         0.0661
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.00141         0.00        1         0.9465
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.00767         0.13        1         0.7138
      0b.vte      |            .            .        1             .
      1.vte       |      0.00166         0.01        1         0.9365
      0b.oestrogen|            .            .        1             .
      1.oestrogen |      0.00367         0.03        1         0.8590
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02292         1.20        1         0.2741
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.02954         2.00        1         0.1568
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.01387         0.45        1         0.5023
      0b.copd     |            .            .        1             .
      1.copd      |      0.02425         1.34        1         0.2469
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.05072         6.11        1         0.0134
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.00744         0.12        1         0.7261
      0b.cancer   |            .            .        1             .
      1.cancer    |     -0.00566         0.07        1         0.7861
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.00925         0.20        1         0.6551
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.01723         0.70        1         0.4036
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.01872         0.93        1         0.3345
      ------------+---------------------------------------------------
      global test |                     52.59       34         0.0219
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot4.svg not
>  found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot4.svg written i
> n SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table5_onscoviddeath.txt not foun
> d)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(97,986 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00687         0.08        1         0.7796
      ------------+---------------------------------------------------
      global test |                      0.08        1         0.7796
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
.569

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot1_complet
> ecase.svg not found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot1_completecase.
> svg written in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.831
Iteration 1:   log likelihood = -20367.017
Iteration 2:   log likelihood = -20201.809
Iteration 3:   log likelihood = -20197.222
Iteration 4:   log likelihood = -20197.213
Refining estimates:
Iteration 0:   log likelihood = -20197.213

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(5)       =     1111.24
Log likelihood  =   -20197.213                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .647752   .0405734    -6.93   0.000     .5729171    .7323619
      1.male |    1.49642   .0761628     7.92   0.000     1.354348    1.653395
        age1 |   1.044163   .0212135     2.13   0.033     1.003402    1.086579
        age2 |   1.083903   .0308626     2.83   0.005      1.02507    1.146112
        age3 |   .6670501   .0985651    -2.74   0.006     .4993242    .8911161
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00395         0.03        1         0.8720
      0b.male     |            .            .        1             .
      1.male      |     -0.06904         7.95        1         0.0048
      age1        |     -0.01220         0.19        1         0.6604
      age2        |      0.01868         0.46        1         0.4960
      age3        |     -0.01658         0.38        1         0.5368
      ------------+---------------------------------------------------
      global test |                     13.16        5         0.0220
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot2_complet
> ecase.svg not found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot2_completecase.
> svg written in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.831
Iteration 1:   log likelihood = -20475.692
Iteration 2:   log likelihood = -19703.879
Iteration 3:   log likelihood = -19686.809
Iteration 4:   log likelihood = -19686.674
Iteration 5:   log likelihood = -19686.674
Refining estimates:
Iteration 0:   log likelihood = -19686.674

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(31)      =     2132.31
Log likelihood  =   -19686.674                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7361203    .046629    -4.84   0.000     .6501746    .8334271
      1.male |    1.52791   .0820829     7.89   0.000     1.375211    1.697565
        age1 |   1.050757   .0216522     2.40   0.016     1.009165    1.094063
        age2 |    1.07647   .0310239     2.56   0.011     1.017349    1.139026
        age3 |   .6129853   .0914458    -3.28   0.001     .4575799    .8211702
             |
         imd |
          2  |   1.060287   .0936469     0.66   0.507     .8917506    1.260676
          3  |   1.206365   .1020465     2.22   0.027     1.022057    1.423908
          4  |   1.271796   .1063573     2.88   0.004     1.079527     1.49831
5 most de..  |   1.645552   .1308186     6.27   0.000     1.408129    1.923006
             |
   obese4cat |
Obese I ..)  |   1.005658   .0675418     0.08   0.933     .8816215    1.147146
Obese II..)  |   1.331075   .1282007     2.97   0.003     1.102098    1.607626
Obese II..)  |   1.209056   .1876891     1.22   0.221      .891886    1.639018
             |
smoke_nomiss |
     Former  |   1.405006   .0807643     5.92   0.000     1.255302    1.572563
    Current  |   1.379979   .1800018     2.47   0.014      1.06867    1.781975
             |
     diabcat |
Controlle..  |   1.248484   .0710641     3.90   0.000     1.116689    1.395833
Uncontrol..  |   1.315634   .1122112     3.22   0.001     1.113104    1.555015
Diabetes,..  |   .9141988   .4101484    -0.20   0.842     .3794509     2.20255
             |
1.myocardi~t |   1.353685   .0884331     4.64   0.000     1.190997    1.538596
       1.pad |   1.546177    .123723     5.45   0.000     1.321744     1.80872
1.hyperten~n |   1.049471   .0636156     0.80   0.426     .9319089    1.181865
1.heart_f~re |   1.383962   .0713955     6.30   0.000     1.250871    1.531213
1.stroke_tia |    1.24368   .0666605     4.07   0.000     1.119656    1.381442
       1.vte |   1.317947   .1026423     3.54   0.000     1.131374    1.535289
 1.oestrogen |   .3559527   .2520337    -1.46   0.145     .0888578    1.425899
1.antiplat~t |   .9211959   .0927872    -0.81   0.415     .7561622    1.122249
1.flu_vac~ne |   .7254048   .0450371    -5.17   0.000      .642293    .8192712
1.care_ho~ce |     6.5577    .432396    28.52   0.000     5.762696     7.46238
             |
   ethnicity |
      Mixed  |   1.871566   .7665062     1.53   0.126     .8386728    4.176549
Asian or ..  |   1.994111   .3050464     4.51   0.000     1.477535    2.691291
      Black  |   1.696522   .4294297     2.09   0.037        1.033    2.786241
      Other  |   1.650052    .478948     1.73   0.084     .9341702    2.914536
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00475         0.04        1         0.8457
      0b.male     |            .            .        1             .
      1.male      |     -0.06319         6.80        1         0.0091
      age1        |     -0.01264         0.21        1         0.6446
      age2        |      0.02101         0.60        1         0.4398
      age3        |     -0.02160         0.66        1         0.4176
      1b.imd      |            .            .        1             .
      2.imd       |      0.00495         0.04        1         0.8405
      3.imd       |      0.00104         0.00        1         0.9660
      4.imd       |     -0.01870         0.58        1         0.4454
      5.imd       |      0.01931         0.62        1         0.4295
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00177         0.01        1         0.9427
      3.obese4cat |      0.02121         0.75        1         0.3875
      4.obese4cat |     -0.02202         0.80        1         0.3713
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.03783         2.35        1         0.1250
      3.smoke_no~s|      0.05035         4.28        1         0.0385
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.05202         4.48        1         0.0344
      3.diabcat   |     -0.01506         0.37        1         0.5434
      4.diabcat   |      0.01737         0.50        1         0.4795
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.03291         1.87        1         0.1712
      0b.pad      |            .            .        1             .
      1.pad       |     -0.04880         3.98        1         0.0460
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.04393         3.23        1         0.0721
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00687         0.08        1         0.7797
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01495         0.37        1         0.5407
      0b.vte      |            .            .        1             .
      1.vte       |     -0.01009         0.17        1         0.6797
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00794         0.10        1         0.7463
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02486         1.06        1         0.3043
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.02696         1.21        1         0.2722
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.04696         4.27        1         0.0387
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.01658         0.45        1         0.5002
      3.ethnicity |     -0.00777         0.10        1         0.7515
      4.ethnicity |     -0.04204         2.94        1         0.0863
      5.ethnicity |     -0.03155         1.64        1         0.2003
      ------------+---------------------------------------------------
      global test |                     49.52       31         0.0187
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot3_complet
> ecase_ethn.svg not found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot3_completecase_
> ethn.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -20752.831
Iteration 1:   log likelihood = -20487.137
Iteration 2:   log likelihood = -19712.885
Iteration 3:   log likelihood = -19698.824
Iteration 4:   log likelihood = -19698.737
Iteration 5:   log likelihood = -19698.737
Refining estimates:
Iteration 0:   log likelihood = -19698.737

Cox regression -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(27)      =     2108.19
Log likelihood  =   -19698.737                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7279179   .0460787    -5.02   0.000     .6429832    .8240721
      1.male |   1.528057   .0820753     7.89   0.000      1.37537    1.697694
        age1 |   1.048493   .0215852     2.30   0.021     1.007028    1.091664
        age2 |   1.078877   .0310712     2.64   0.008     1.019665    1.141527
        age3 |   .6069829   .0905141    -3.35   0.001     .4531522    .8130342
             |
         imd |
          2  |   1.063165   .0938979     0.69   0.488     .8941765     1.26409
          3  |   1.214719   .1027297     2.30   0.021     1.029175    1.433714
          4  |   1.292668   .1079739     3.07   0.002     1.097458    1.522601
5 most de..  |   1.692646   .1340083     6.65   0.000     1.449359    1.976772
             |
   obese4cat |
Obese I ..)  |   .9971307   .0669663    -0.04   0.966     .8741505    1.137412
Obese II..)  |   1.313642   .1265141     2.83   0.005     1.087676    1.586553
Obese II..)  |   1.187738   .1843499     1.11   0.268     .8762031    1.610039
             |
smoke_nomiss |
     Former  |   1.369958   .0782682     5.51   0.000     1.224832     1.53228
    Current  |   1.338699    .174381     2.24   0.025      1.03706    1.728072
             |
     diabcat |
Controlle..  |   1.284149   .0725515     4.43   0.000     1.149541     1.43452
Uncontrol..  |   1.355191   .1151779     3.58   0.000     1.147247    1.600827
Diabetes,..  |   .9384969   .4209951    -0.14   0.887     .3895804    2.260833
             |
1.myocardi~t |    1.36433   .0890781     4.76   0.000     1.200449    1.550583
       1.pad |   1.534617   .1227807     5.35   0.000     1.311891    1.795157
1.hyperten~n |   1.056464   .0639974     0.91   0.365     .9381916    1.189646
1.heart_f~re |   1.385582   .0714815     6.32   0.000     1.252331    1.533011
1.stroke_tia |   1.245963   .0667873     4.10   0.000     1.121704    1.383987
       1.vte |   1.311451   .1021094     3.48   0.000     1.125843    1.527659
 1.oestrogen |   .3552548   .2515431    -1.46   0.144     .0886819    1.423131
1.antiplat~t |   .9343816    .094072    -0.67   0.500     .7670554    1.138209
1.flu_vac~ne |   .7230647   .0448793    -5.22   0.000     .6402427    .8166006
1.care_ho~ce |   6.435542   .4234131    28.30   0.000     5.656947      7.3213
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |      0.00656         0.07        1         0.7884
      0b.male     |            .            .        1             .
      1.male      |     -0.06301         6.76        1         0.0093
      age1        |     -0.01125         0.17        1         0.6818
      age2        |      0.01982         0.53        1         0.4668
      age3        |     -0.02055         0.59        1         0.4410
      1b.imd      |            .            .        1             .
      2.imd       |      0.00460         0.04        1         0.8514
      3.imd       |      0.00035         0.00        1         0.9885
      4.imd       |     -0.02065         0.71        1         0.3994
      5.imd       |      0.01531         0.39        1         0.5320
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00096         0.00        1         0.9689
      3.obese4cat |      0.02219         0.82        1         0.3656
      4.obese4cat |     -0.02144         0.76        1         0.3833
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.04071         2.75        1         0.0975
      3.smoke_no~s|      0.05184         4.54        1         0.0330
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.05696         5.38        1         0.0204
      3.diabcat   |     -0.01751         0.50        1         0.4794
      4.diabcat   |      0.01664         0.46        1         0.4980
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.03286         1.87        1         0.1719
      0b.pad      |            .            .        1             .
      1.pad       |     -0.04862         3.95        1         0.0469
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.04254         3.04        1         0.0815
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.00669         0.07        1         0.7851
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01488         0.37        1         0.5422
      0b.vte      |            .            .        1             .
      1.vte       |     -0.01003         0.17        1         0.6814
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00794         0.10        1         0.7465
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02417         1.00        1         0.3172
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.02579         1.10        1         0.2932
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.04918         4.69        1         0.0303
      ------------+---------------------------------------------------
      global test |                     44.54       27         0.0182
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot3_complet
> ecase.svg not found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot3_completecase.
> svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(pract
> ice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.8728
Iteration 1:   log likelihood = -7263.2849
Iteration 2:   log likelihood = -6963.9238
Iteration 3:   log likelihood = -6961.3462
Iteration 4:   log likelihood = -6961.2636
Iteration 5:   log likelihood = -6961.2634
Refining estimates:
Iteration 0:   log likelihood = -6961.2634

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(38)      =     2305.22
Log likelihood  =   -6961.2634                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8097266   .0533125    -3.21   0.001     .7116972    .9212587
      1.male |   1.581575   .0867257     8.36   0.000     1.420412    1.761025
        age1 |    1.05533   .0220531     2.58   0.010      1.01298    1.099451
        age2 |   1.052174   .0307478     1.74   0.082     .9936026    1.114198
        age3 |   .7056973   .1069461    -2.30   0.021     .5243505    .9497629
             |
         imd |
          2  |   1.000489    .097261     0.01   0.996     .8269208    1.210488
          3  |   1.173473   .1127358     1.67   0.096     .9720715    1.416603
          4  |   1.136678   .1149664     1.27   0.205     .9322767    1.385894
5 most de..  |   1.273789   .1301094     2.37   0.018     1.042684    1.556117
             |
   obese4cat |
Obese I ..)  |   1.013015   .0695852     0.19   0.851     .8854133    1.159007
Obese II..)  |   1.320041   .1295045     2.83   0.005     1.089129    1.599911
Obese II..)  |   1.171047   .1849903     1.00   0.318     .8592309    1.596021
             |
smoke_nomiss |
     Former  |   1.314046    .078735     4.56   0.000     1.168445     1.47779
    Current  |   1.202766   .1621831     1.37   0.171     .9234295    1.566602
             |
     diabcat |
Controlle..  |   1.213099   .0724491     3.23   0.001     1.079098    1.363742
Uncontrol..  |   1.220946   .1076114     2.26   0.024     1.027243    1.451174
Diabetes,..  |   .8287657   .3787776    -0.41   0.681     .3383764    2.029848
             |
1.myocardi~t |   1.280142   .0857558     3.69   0.000      1.12263    1.459753
       1.pad |   1.502398   .1241212     4.93   0.000     1.277799    1.766474
1.hyperten~n |   .9997426   .0622707    -0.00   0.997     .8848499    1.129553
1.heart_f~re |   1.263751   .0682103     4.34   0.000      1.13689    1.404769
1.stroke_tia |   1.196876   .0657381     3.27   0.001     1.074725    1.332911
       1.vte |   1.237559   .0990097     2.66   0.008     1.057953    1.447657
 1.oestrogen |   .3648978   .2610943    -1.41   0.159     .0897663      1.4833
1.antiplat~t |   .8422282   .0867368    -1.67   0.095     .6882859    1.030601
1.flu_vac~ne |   .7325282    .047116    -4.84   0.000     .6457663     .830947
             |
         ckd |
        CKD  |   1.332768   .0728959     5.25   0.000     1.197286     1.48358
      1.copd |   1.323941   .0919248     4.04   0.000     1.155493    1.516945
1.other_re~y |   1.459955   .1211906     4.56   0.000     1.240742    1.717899
1.immunode~y |   1.741679   .4674228     2.07   0.039     1.029265    2.947197
    1.cancer |   .9907538   .0632978    -0.15   0.884     .8741454    1.122917
1.ae_atten~r |    2.16448   .1173301    14.25   0.000     1.946312    2.407104
1.gp_consult |   .7278684   .0996559    -2.32   0.020     .5565586    .9519078
1.care_ho~ce |   6.245303   .4560137    25.09   0.000     5.412541     7.20619
             |
   ethnicity |
      Mixed  |   1.206364   .5149043     0.44   0.660     .5225955    2.784781
Asian or ..  |   1.383557   .2659223     1.69   0.091     .9492803    2.016506
      Black  |    1.14788   .3168172     0.50   0.617     .6682874     1.97165
      Other  |   1.300021   .4173822     0.82   0.414     .6928916    2.439133
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00121         0.00        1         0.9606
      0b.male     |            .            .        1             .
      1.male      |     -0.05729         5.59        1         0.0181
      age1        |     -0.01274         0.22        1         0.6387
      age2        |      0.02208         0.67        1         0.4145
      age3        |     -0.02321         0.76        1         0.3823
      1b.imd      |            .            .        1             .
      2.imd       |      0.01581         0.40        1         0.5280
      3.imd       |      0.02102         0.72        1         0.3961
      4.imd       |      0.00774         0.10        1         0.7491
      5.imd       |      0.02704         1.24        1         0.2664
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00830         0.11        1         0.7351
      3.obese4cat |      0.01252         0.26        1         0.6077
      4.obese4cat |     -0.02512         1.03        1         0.3109
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.02719         1.22        1         0.2695
      3.smoke_no~s|      0.04036         2.71        1         0.0998
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.03997         2.66        1         0.1029
      3.diabcat   |     -0.01094         0.20        1         0.6543
      4.diabcat   |      0.01835         0.55        1         0.4584
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.03240         1.83        1         0.1759
      0b.pad      |            .            .        1             .
      1.pad       |     -0.04416         3.37        1         0.0663
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.04935         4.14        1         0.0419
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.01181         0.23        1         0.6331
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.00981         0.16        1         0.6880
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00981         0.16        1         0.6851
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00686         0.08        1         0.7761
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02378         0.95        1         0.3289
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.02463         1.02        1         0.3135
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.00453         0.04        1         0.8505
      0b.copd     |            .            .        1             .
      1.copd      |      0.02328         0.92        1         0.3379
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.05620         5.54        1         0.0186
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.00830         0.11        1         0.7413
      0b.cancer   |            .            .        1             .
      1.cancer    |     -0.02539         1.10        1         0.2948
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|      0.01303         0.29        1         0.5896
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02203         0.86        1         0.3546
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.03418         2.28        1         0.1307
      1b.ethnicity|            .            .        1             .
      2.ethnicity |      0.00039         0.00        1         0.9876
      3.ethnicity |     -0.01668         0.48        1         0.4896
      4.ethnicity |     -0.00032         0.00        1         0.9896
      5.ethnicity |      0.00101         0.00        1         0.9680
      ------------+---------------------------------------------------
      global test |                     45.85       38         0.1788
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot4_complet
> ecase_ethn.svg not found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot4_completecase_
> ethn.svg written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -8113.8728
Iteration 1:   log likelihood = -7264.5773
Iteration 2:   log likelihood = -6965.5928
Iteration 3:   log likelihood = -6963.0325
Iteration 4:   log likelihood = -6962.9505
Iteration 5:   log likelihood = -6962.9504
Refining estimates:
Iteration 0:   log likelihood = -6962.9504

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      273,561                  Number of obs    =     273,561
No. of failures =        1,660
Time at risk    =     56144920
                                                LR chi2(34)      =     2301.84
Log likelihood  =   -6962.9504                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8079187   .0531703    -3.24   0.001      .710148      .91915
      1.male |   1.581167   .0866824     8.36   0.000     1.420082    1.760525
        age1 |   1.054751   .0220462     2.55   0.011     1.012415    1.098858
        age2 |   1.052749    .030772     1.76   0.079     .9941317    1.114822
        age3 |   .7036583   .1066552    -2.32   0.020     .5228091    .9470665
             |
         imd |
          2  |   .9998004   .0971937    -0.00   0.998     .8263525    1.209654
          3  |   1.173247    .112701     1.66   0.096     .9719047    1.416299
          4  |   1.137043   .1149726     1.27   0.204     .9326254    1.386266
5 most de..  |   1.275334   .1302324     2.38   0.017     1.044005    1.557921
             |
   obese4cat |
Obese I ..)  |   1.011901   .0695048     0.17   0.863     .8844455    1.157723
Obese II..)  |   1.315751   .1290515     2.80   0.005     1.085641    1.594635
Obese II..)  |   1.163867    .183799     0.96   0.337     .8540455    1.586084
             |
smoke_nomiss |
     Former  |   1.303332   .0777933     4.44   0.000     1.159441    1.465081
    Current  |   1.192773   .1607182     1.31   0.191     .9159334    1.553286
             |
     diabcat |
Controlle..  |     1.2197   .0726979     3.33   0.001     1.085223    1.370842
Uncontrol..  |   1.235539   .1084499     2.41   0.016      1.04026    1.467475
Diabetes,..  |   .8310315   .3798364    -0.40   0.686      .339283    2.035508
             |
1.myocardi~t |   1.285682   .0860432     3.75   0.000     1.127632    1.465884
       1.pad |    1.49982   .1238447     4.91   0.000     1.275712    1.763297
1.hyperten~n |   1.000285    .062285     0.00   0.996     .8853642    1.130123
1.heart_f~re |   1.265073   .0682485     4.36   0.000     1.138137    1.406165
1.stroke_tia |   1.198034   .0657937     3.29   0.001     1.075778    1.334183
       1.vte |   1.234859   .0987734     2.64   0.008     1.055678    1.444451
 1.oestrogen |    .363464   .2600547    -1.41   0.157     .0894202    1.477363
1.antiplat~t |   .8450117   .0870098    -1.64   0.102     .6905825    1.033975
1.flu_vac~ne |   .7335806   .0471668    -4.82   0.000     .6467232    .8321032
             |
         ckd |
        CKD  |   1.333812    .072946     5.27   0.000     1.198236    1.484727
      1.copd |   1.323244   .0918748     4.03   0.000     1.154888    1.516143
1.other_re~y |   1.459396   .1211336     4.55   0.000     1.240284    1.717216
1.immunode~y |   1.737581   .4663541     2.06   0.040     1.026807    2.940366
    1.cancer |   .9880388   .0630933    -0.19   0.851     .8718037    1.119771
1.ae_atten~r |   2.166873   .1174509    14.27   0.000      1.94848    2.409745
1.gp_consult |   .7291254   .0998223    -2.31   0.021     .5575283    .9535371
1.care_ho~ce |    6.22752   .4545619    25.06   0.000     5.397391    7.185325
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00079         0.00        1         0.9741
      0b.male     |            .            .        1             .
      1.male      |     -0.05742         5.61        1         0.0179
      age1        |     -0.01250         0.21        1         0.6448
      age2        |      0.02187         0.65        1         0.4188
      age3        |     -0.02296         0.75        1         0.3877
      1b.imd      |            .            .        1             .
      2.imd       |      0.01567         0.39        1         0.5313
      3.imd       |      0.02098         0.72        1         0.3968
      4.imd       |      0.00779         0.10        1         0.7474
      5.imd       |      0.02658         1.19        1         0.2751
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00843         0.12        1         0.7311
      3.obese4cat |      0.01329         0.30        1         0.5856
      4.obese4cat |     -0.02452         0.98        1         0.3225
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.02924         1.41        1         0.2345
      3.smoke_no~s|      0.04164         2.88        1         0.0896
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.04072         2.76        1         0.0964
      3.diabcat   |     -0.01297         0.28        1         0.5954
      4.diabcat   |      0.01811         0.54        1         0.4636
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.03109         1.68        1         0.1943
      0b.pad      |            .            .        1             .
      1.pad       |     -0.04415         3.37        1         0.0666
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.04921         4.12        1         0.0424
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|     -0.01244         0.25        1         0.6149
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|     -0.01021         0.17        1         0.6757
      0b.vte      |            .            .        1             .
      1.vte       |     -0.00957         0.16        1         0.6924
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.00686         0.08        1         0.7760
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.02363         0.94        1         0.3314
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.02524         1.07        1         0.3012
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.00396         0.03        1         0.8689
      0b.copd     |            .            .        1             .
      1.copd      |      0.02312         0.90        1         0.3415
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.05613         5.53        1         0.0187
      0b.immunod~y|            .            .        1             .
      1.immunode~y|     -0.00821         0.11        1         0.7443
      0b.cancer   |            .            .        1             .
      1.cancer    |     -0.02458         1.03        1         0.3103
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|      0.01308         0.29        1         0.5882
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02270         0.91        1         0.3401
      0b.care_h~ce|            .            .        1             .
      1.care_ho~ce|      0.03455         2.34        1         0.1264
      ------------+---------------------------------------------------
      global test |                     45.52       34         0.0895
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot4_complet
> ecase.svg not found)
(file /workspace/output/warfarin_tabfig/onscoviddeath_schoenplot4_completecase.
> svg written in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/table6_onscoviddeath.txt not foun
> d)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/08b_an_model_checks_onscoviddeath.l
> og
  log type:  text
 closed on:  31 Dec 2020, 03:11:36
-------------------------------------------------------------------------------
