-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_positivecovidtes
> t.log
  log type:  text
 opened on:  31 Dec 2020, 13:10:43

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -27115.954                     Number of obs     =    371,546

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .7880695   .0298362    -6.29   0.000     .7317086    .8487718
    _Imale_1 |   1.250703   .0392792     7.12   0.000     1.176038    1.330107
     _Iimd_2 |   1.068202   .0541963     1.30   0.193     .9670897    1.179886
     _Iimd_3 |   1.091431   .0542721     1.76   0.079      .990079    1.203159
     _Iimd_4 |   1.190176   .0582694     3.56   0.000     1.081278    1.310041
     _Iimd_5 |   1.596391   .0738868    10.11   0.000      1.45795    1.747978
_Iobese4ca~2 |   1.005134   .0395391     0.13   0.896     .9305513    1.085695
_Iobese4ca~3 |   1.212317    .067104     3.48   0.001     1.087679    1.351238
_Iobese4ca~4 |    1.31056   .0990808     3.58   0.000     1.130068     1.51988
_Ismoke_no~2 |   1.110216   .0365135     3.18   0.001     1.040909    1.184138
_Ismoke_no~3 |   .9055757   .0698733    -1.29   0.199     .7784791    1.053422
 _Idiabcat_2 |    1.24096   .0426056     6.29   0.000     1.160202    1.327339
 _Idiabcat_3 |    1.52335   .0729262     8.79   0.000     1.386918    1.673203
 _Idiabcat_4 |   .9741705    .252284    -0.10   0.920     .5864036    1.618353
_Imyocardi~1 |   1.081128   .0460227     1.83   0.067     .9945857    1.175201
     _Ipad_1 |   1.265266   .0662191     4.50   0.000     1.141914    1.401943
_Ihyperten~1 |   1.065963   .0373432     1.82   0.068     .9952279    1.141726
_Iheart_fa~1 |   1.185095   .0373392     5.39   0.000     1.114125    1.260585
_Istroke_t~1 |   1.118771   .0364783     3.44   0.001     1.049511    1.192601
     _Ivte_1 |    1.28485   .0589172     5.47   0.000     1.174412    1.405674
_Ioestroge~1 |   1.020989    .229913     0.09   0.927     .6566622    1.587451
_Iantiplat~1 |   .9219459   .0555327    -1.35   0.177     .8192831    1.037473
_Iflu_vacc~1 |   .8196526   .0299819    -5.44   0.000     .7629462    .8805738
     _Ickd_1 |   1.099807   .0345554     3.03   0.002     1.034123    1.169663
    _Icopd_1 |   1.253456   .0530014     5.34   0.000     1.153763    1.361763
_Iother_re~1 |   1.341768   .0691167     5.71   0.000     1.212916    1.484309
_Iimmunode~1 |   1.135797    .208334     0.69   0.488     .7928092    1.627169
  _Icancer_1 |   1.026895   .0380553     0.72   0.474     .9549524    1.104258
_Iae_atten~1 |   2.061842   .0623115    23.94   0.000     1.943261     2.18766
_Igp_consu~1 |   .8022444   .0537544    -3.29   0.001     .7035127    .9148323
_Icare_hom~1 |   6.270784   .2569103    44.81   0.000     5.786935    6.795088
        age1 |   .9748239   .0058406    -4.26   0.000     .9634434    .9863388
        age2 |   1.106921   .0117198     9.59   0.000     1.084187    1.130132
        age3 |   .6089882   .0394921    -7.65   0.000     .5363022    .6915256
       _rcs1 |    1.88504   .0185485    64.43   0.000     1.849034    1.921747
       _rcs2 |   1.458434   .0100097    54.98   0.000     1.438946    1.478185
       _cons |   .0136132   .0052258   -11.19   0.000     .0064151    .0288879
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    371,546    203.8973    32.15445         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(371,339 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .01406616   .01363828   .01450748 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .01114222   .01043683   .01189529 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00292395         -.00377799          -.0020699 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_positivecovidtest.gph not found)
(file adj_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_positivecovidtest.svg 
> not found)
(file /workspace/output/warfarin_tabfig/adj_curves_positivecovidtest.svg writte
> n in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_positivecovidtest.gph not found)
(file diff_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_positivecovidtest.svg
>  not found)
(file /workspace/output/warfarin_tabfig/diff_curves_positivecovidtest.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_positivecovidtes
> t.log
  log type:  text
 closed on:  31 Dec 2020, 13:31:35
-------------------------------------------------------------------------------
