-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_onscoviddeath.lo
> g
  log type:  text
 opened on:  31 Dec 2020, 13:09:43

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -13531.052                     Number of obs     =    371,546

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .7888441    .043064    -4.34   0.000     .7087988     .877929
    _Imale_1 |   1.551476   .0714491     9.54   0.000     1.417573    1.698029
     _Iimd_2 |   1.040654   .0761673     0.54   0.586     .9015824    1.201178
     _Iimd_3 |   1.113272   .0788867     1.51   0.130     .9689136    1.279139
     _Iimd_4 |   1.147079   .0811131     1.94   0.052      .998625    1.317601
     _Iimd_5 |   1.501487   .1006831     6.06   0.000     1.316569    1.712377
_Iobese4ca~2 |   .9683488   .0565874    -0.55   0.582     .8635553    1.085859
_Iobese4ca~3 |   1.178644   .1011215     1.92   0.055     .9962174    1.394477
_Iobese4ca~4 |   1.306327   .1631578     2.14   0.032     1.022677    1.668651
_Ismoke_no~2 |   1.260755   .0622903     4.69   0.000     1.144393    1.388949
_Ismoke_no~3 |   1.202689   .1361457     1.63   0.103     .9633771    1.501448
 _Idiabcat_2 |   1.244564   .0611328     4.45   0.000     1.130333    1.370339
 _Idiabcat_3 |    1.37241   .0991165     4.38   0.000     1.191268    1.581096
 _Idiabcat_4 |   .6647212   .2979052    -0.91   0.362     .2761596    1.599996
_Imyocardi~1 |   1.291943    .073229     4.52   0.000     1.156102    1.443745
     _Ipad_1 |   1.331713   .0946532     4.03   0.000     1.158539    1.530774
_Ihyperten~1 |   1.047711   .0536439     0.91   0.363     .9476748    1.158308
_Iheart_fa~1 |   1.315039    .058902     6.11   0.000     1.204516    1.435704
_Istroke_t~1 |   1.137455   .0527988     2.77   0.006     1.038539    1.245792
     _Ivte_1 |   1.277129     .08417     3.71   0.000     1.122369    1.453228
_Ioestroge~1 |    .650409     .29204    -0.96   0.338      .269767    1.568138
_Iantiplat~1 |   .8220247   .0728047    -2.21   0.027     .6910287    .9778532
_Iflu_vacc~1 |   .7976786   .0430411    -4.19   0.000     .7176272    .8866598
     _Ickd_1 |   1.233757   .0554943     4.67   0.000     1.129647    1.347462
    _Icopd_1 |   1.267724   .0756183     3.98   0.000     1.127851    1.424945
_Iother_re~1 |   1.511943   .1056331     5.92   0.000     1.318456    1.733825
_Iimmunode~1 |   1.609514   .3715572     2.06   0.039     1.023752    2.530435
  _Icancer_1 |   1.006902    .053258     0.13   0.897     .9077464    1.116888
_Iae_atten~1 |   2.063958   .0910832    16.42   0.000     1.892941    2.250426
_Igp_consu~1 |   .7211168   .0662564    -3.56   0.000     .6022781    .8634043
_Icare_hom~1 |   6.124457   .3478194    31.91   0.000     5.479314    6.845559
        age1 |   1.053499   .0190051     2.89   0.004     1.016901    1.091415
        age2 |   1.053299   .0264608     2.07   0.039     1.002693     1.10646
        age3 |   .6944002   .0899299    -2.82   0.005     .5387323    .8950487
       _rcs1 |   2.211306   .0371556    47.23   0.000     2.139669    2.285342
       _rcs2 |   1.613895   .0167188    46.20   0.000     1.581457    1.646998
       _cons |   .0000188   .0000223    -9.19   0.000     1.85e-06    .0001916
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    371,546    204.9868     29.4512         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(371,339 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00669626   .00639954   .00700675 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00530025   .00482102   .00582711 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00139602         -.00198644         -.00080559 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_onscoviddeath.gph not found)
(file adj_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_onscoviddeath.svg not 
> found)
(file /workspace/output/warfarin_tabfig/adj_curves_onscoviddeath.svg written in
>  SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_onscoviddeath.gph not found)
(file diff_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_onscoviddeath.svg not
>  found)
(file /workspace/output/warfarin_tabfig/diff_curves_onscoviddeath.svg written i
> n SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_onscoviddeath.lo
> g
  log type:  text
 closed on:  31 Dec 2020, 13:31:03
-------------------------------------------------------------------------------
