-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 13:10:28

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -126618.42                     Number of obs     =    371,546

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8513275   .0117188   -11.69   0.000     .8286661    .8746086
    _Imale_1 |   1.014418    .012046     1.21   0.228      .991081    1.038305
     _Iimd_2 |   .9939397   .0180034    -0.34   0.737     .9592726     1.02986
     _Iimd_3 |   1.004745   .0179923     0.26   0.791     .9700928    1.040636
     _Iimd_4 |   1.057728   .0188514     3.15   0.002     1.021418    1.095329
     _Iimd_5 |   1.156817   .0203265     8.29   0.000     1.117656    1.197351
_Iobese4ca~2 |   .9191603   .0136305    -5.68   0.000     .8928295    .9462676
_Iobese4ca~3 |   .9914024   .0210906    -0.41   0.685     .9509155    1.033613
_Iobese4ca~4 |   1.007675   .0290466     0.27   0.791     .9523232    1.066244
_Ismoke_no~2 |   1.055761   .0131137     4.37   0.000     1.030369    1.081779
_Ismoke_no~3 |   1.081568   .0280791     3.02   0.003     1.027911    1.138026
 _Idiabcat_2 |   1.136498   .0151375     9.61   0.000     1.107213    1.166558
 _Idiabcat_3 |   1.308947   .0250295    14.08   0.000     1.260798    1.358934
 _Idiabcat_4 |   .8443082   .0907334    -1.57   0.115     .6839538    1.042258
_Imyocardi~1 |    1.13596   .0188161     7.70   0.000     1.099674    1.173444
     _Ipad_1 |   1.305853   .0273291    12.75   0.000     1.253373    1.360531
_Ihyperten~1 |   1.011593   .0130416     0.89   0.371      .986352     1.03748
_Iheart_fa~1 |   1.199377   .0146554    14.88   0.000     1.170994    1.228448
_Istroke_t~1 |    1.13829   .0145806    10.11   0.000     1.110068    1.167229
     _Ivte_1 |   1.166213   .0220269     8.14   0.000      1.12383    1.210194
_Ioestroge~1 |   1.023491   .0786456     0.30   0.763     .8803939    1.189846
_Iantiplat~1 |   1.101359    .023805     4.47   0.000     1.055677    1.149019
_Iflu_vacc~1 |   .9654964   .0139954    -2.42   0.015     .9384519    .9933203
     _Ickd_1 |   1.131069   .0138233    10.08   0.000     1.104298     1.15849
    _Icopd_1 |    1.21435   .0200097    11.79   0.000     1.175758    1.254208
_Iother_re~1 |   1.244665   .0264699    10.29   0.000     1.193852    1.297642
_Iimmunode~1 |   1.322529   .0823352     4.49   0.000     1.170612    1.494161
  _Icancer_1 |   1.234187   .0168427    15.42   0.000     1.201614    1.267644
_Iae_atten~1 |   1.576502    .017939    40.00   0.000     1.541731    1.612057
_Igp_consu~1 |   .9191793   .0271383    -2.85   0.004      .867499    .9739384
_Icare_hom~1 |    3.88445   .0814573    64.71   0.000     3.728033     4.04743
        age1 |   .9874126   .0020538    -6.09   0.000     .9833954    .9914462
        age2 |   1.032524     .00385     8.58   0.000     1.025006    1.040097
        age3 |   .9287629   .0221721    -3.10   0.002     .8863074    .9732522
       _rcs1 |   2.285517   .0178027   106.12   0.000     2.250889    2.320677
       _rcs2 |   1.262522   .0094801    31.04   0.000     1.244078     1.28124
       _rcs3 |   .9993283   .0012132    -0.55   0.580     .9969533    1.001709
       _cons |   .0885726   .0119005   -18.04   0.000     .0680664    .1152565
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    371,546    198.1013    39.93234         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(371,339 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +---------------------------------+
  |      _at1   _at1_lci   _at1_uci |
  |---------------------------------|
  | .09571501   .0946367   .0968056 |
  +---------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .08241787   .08059982   .08427693 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.01329714         -.01544507         -.01114921 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_covidtest.gph not found)
(file adj_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_covidtest.svg not foun
> d)
(file /workspace/output/warfarin_tabfig/adj_curves_covidtest.svg written in SVG
>  format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_covidtest.gph not found)
(file diff_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_covidtest.svg not fou
> nd)
(file /workspace/output/warfarin_tabfig/diff_curves_covidtest.svg written in SV
> G format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 13:31:48
-------------------------------------------------------------------------------
