-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_onsnoncoviddeath
> .log
  log type:  text
 opened on:  31 Dec 2020, 13:10:12

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)
i.care_home_r~e   _Icare_home_0-1     (naturally coded; _Icare_home_0 omitted)

. 
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood =  -67353.63                     Number of obs     =    371,546

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8765476   .0184084    -6.27   0.000     .8412002    .9133803
    _Imale_1 |   1.180256   .0214342     9.13   0.000     1.138984    1.223023
     _Iimd_2 |   1.008368   .0283848     0.30   0.767     .9542412    1.065564
     _Iimd_3 |   1.068765   .0293192     2.42   0.015     1.012818    1.127802
     _Iimd_4 |   1.104899   .0303051     3.64   0.000     1.047071    1.165922
     _Iimd_5 |   1.232426   .0331613     7.77   0.000     1.169116    1.299166
_Iobese4ca~2 |   .7842753     .01957    -9.74   0.000     .7468417    .8235852
_Iobese4ca~3 |   .9102909   .0340252    -2.51   0.012     .8459869    .9794827
_Iobese4ca~4 |   1.171981   .0590038     3.15   0.002     1.061858    1.293524
_Ismoke_no~2 |    1.13508    .022023     6.53   0.000     1.092726    1.179075
_Ismoke_no~3 |   1.754503   .0676601    14.58   0.000     1.626779    1.892254
 _Idiabcat_2 |    1.14721   .0230218     6.84   0.000     1.102964    1.193231
 _Idiabcat_3 |    1.37322   .0403299    10.80   0.000     1.296407    1.454585
 _Idiabcat_4 |   1.176402   .1606291     1.19   0.234     .9001822     1.53738
_Imyocardi~1 |   1.123801   .0267545     4.90   0.000     1.072568    1.177482
     _Ipad_1 |   1.358281   .0390846    10.64   0.000     1.283797    1.437087
_Ihyperten~1 |   1.099366   .0226542     4.60   0.000     1.055849    1.144676
_Iheart_fa~1 |   1.505938   .0268066    23.00   0.000     1.454304    1.559405
_Istroke_t~1 |     1.1604   .0216934     7.96   0.000     1.118651    1.203707
     _Ivte_1 |   1.157476   .0319482     5.30   0.000     1.096522    1.221818
_Ioestroge~1 |   1.045541   .1268019     0.37   0.713     .8243441    1.326093
_Iantiplat~1 |   1.011797   .0340374     0.35   0.727     .9472371    1.080758
_Iflu_vacc~1 |   .7672311   .0163596   -12.43   0.000     .7358277    .7999748
     _Ickd_1 |   1.114727   .0201105     6.02   0.000     1.075999    1.154848
    _Icopd_1 |   1.327058    .031749    11.83   0.000     1.266267    1.390767
_Iother_re~1 |   1.422474   .0411608    12.18   0.000     1.344045    1.505479
_Iimmunode~1 |   1.615363   .1426481     5.43   0.000     1.358635    1.920602
  _Icancer_1 |   1.584955    .030089    24.26   0.000     1.527066     1.64504
_Iae_atten~1 |   1.998379   .0350255    39.50   0.000     1.930896     2.06822
_Igp_consu~1 |   .8523025   .0353167    -3.86   0.000     .7858193    .9244104
_Icare_hom~1 |   2.979931   .0810889    40.13   0.000     2.825164    3.143177
        age1 |   1.042801    .006708     6.52   0.000     1.029736    1.056032
        age2 |   1.038664   .0095978     4.11   0.000     1.020022    1.057647
        age3 |     .89282   .0434515    -2.33   0.020     .8115922    .9821774
       _rcs1 |   1.408125    .004445   108.42   0.000      1.39944    1.416864
       _rcs2 |   1.010688   .0024401     4.40   0.000     1.005916    1.015481
       _rcs3 |    .996986   .0008487    -3.55   0.000     .9953239    .9986508
       _cons |   .0003294   .0001386   -19.06   0.000     .0001444    .0007513
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    371,546    204.9868     29.4512         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(371,339 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +----------------------------------+
  |      _at1    _at1_lci   _at1_uci |
  |----------------------------------|
  | .03956649   .03887286   .0402725 |
  +----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .03493381   .03375017   .03615897 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00463268         -.00603504         -.00323031 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "DOAC use" 2 "Warfarin use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_onsnoncoviddeath.gph not found)
(file adj_curves_onsnoncoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/adj_curves_onsnoncoviddeath.svg n
> ot found)
(file /workspace/output/warfarin_tabfig/adj_curves_onsnoncoviddeath.svg written
>  in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_onsnoncoviddeath.gph not found)
(file diff_curves_onsnoncoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/warfarin_tabfig/diff_curves_onsnoncoviddeath.svg 
> not found)
(file /workspace/output/warfarin_tabfig/diff_curves_onsnoncoviddeath.svg writte
> n in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.  
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/09b_an_models_plot_onsnoncoviddeath
> .log
  log type:  text
 closed on:  31 Dec 2020, 13:31:52
-------------------------------------------------------------------------------
