-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/02c_cr_create_population_positivec
> ovidtest.log
  log type:  text
 opened on:   2 Mar 2021, 06:03:15

. 
. /* APPLY INCLUSION/EXCLUIONS in the general population cohort (control cohort
> ) ===============================*/ 
. use $tempdir/cr_dataset_af , clear

. 
. noi di "DROP AGE <18:" 
DROP AGE <18:

. *DONE BY PYTHON
. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. *DONE BY PYTHON
. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. *DONE BY PYTHON
. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. *DONE BY PYTHON
. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. *DONE BY PYTHON
. 
. noi di "DROP PEOPLE WHO HAD NO GP CONSULTATION IN THE PAST YEAR"
DROP PEOPLE WHO HAD NO GP CONSULTATION IN THE PAST YEAR

. *DONE BY PYTHON
. 
. noi di "DROP ATRIAL FIBRILLATION:"
DROP ATRIAL FIBRILLATION:

. *DONE BY PYTHON
. 
. noi di "PEOPLE PRESCRIBED INJECTABLE ANTICOAGULANT IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED INJECTABLE ANTICOAGULANT IN THE PAST FOUR MONTHS

. *DONE BY PYTHON
. 
. noi di "PEOPLE PRESCRIBED WARFARIN IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED WARFARIN IN THE PAST FOUR MONTHS

. *DONE BY PYTHON
. 
. noi di "PEOPLE PRESCRIBED DOACs IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED DOACs IN THE PAST FOUR MONTHS

. *DONE BY PYTHON
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 2: >=18 and <=110 at 1 March 2020 
. assert age < .

. datacheck age >= 18, nol

. datacheck age <= 110, nol

.  
. * INCLUSION 3: M or F gender at 1 March 2020 
. assert inlist(sex, "M", "F")

. 
. * EXCLUSION 1: 12 months or baseline time 
. * [VARIABLE NOT EXPORTED, CANNOT QUANTIFY]
. 
. * EXCLUSION 2: MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUSION 3: NO GP VISIT IN THE PAST YEAR
. datacheck gp_consult_count>0, nol

. 
. * EXCLUSION 4: no atrial fibrillation diagnosis before 1 March 2020 
. datacheck af_date == . , nol

. 
. * EXCLUSION 5: EXCLUDE PEOPLE WITH INJECTABLE ANTICOAGULANT
. datacheck lmwh_last_four_months_date == ., nol

. 
. * EXCLUSION 6: EXCLUDE PEOPLE WITH WARFARIN 
. cap datacheck warfarin_last_four_months == . , nol

. 
. * EXCLUSION 6: EXCLUDE PEOPLE WITH DOACs 
. cap datacheck doac_last_four_months == . , nol

. 
. /* SAVE DATA=================================================================
> =*/
. save $tempdir/matched_control_`outcome'.dta , replace
(note: file /workspace/output/oac_match_tempdata/matched_control_positivecovidt
> est.dta not found)
file /workspace/output/oac_match_tempdata/matched_control_positivecovidtest.dta
>  saved

. 
. /* Combine the case cohort after matching==================================*/
>    
. * Exposed cohort after matching
. import delimited `c(pwd)'/output/`exposed_after_matching_dataset'.csv, clear
(195 vars, 51,784 obs)

. safecount
  51,784

. 
. keep patient_id case set_id

. 
. * merge the previous dataset which already formatted in 00 and 01 program
. merge 1:1 patient_id using $outdir/input_af_oac.dta , keep(master match) 

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            51,784  (_merge==3)
    -----------------------------------------

. 
. * check if no extra people from master dataset
. assert _merge==3

. drop _merge

. 
. * Append the matched case cohort
. append using $tempdir/matched_control_`outcome'.dta, force
(note: variable mi_date_ons was str10 in the using data, but will be float
       now)
(note: variable stroke_date_ons was str10 in the using data, but will be
       float now)
(note: variable vte_date_ons was str10 in the using data, but will be float
       now)
(note: variable gi_bleed_date_ons was str10 in the using data, but will be
       float now)
(note: variable intracranial_bleed_date_ons was str10 in the using data, but
       will be float now)
(label diabcat already defined)
(label hba1ccat already defined)
(label eskf_exclusion already defined)
(label ckd already defined)
(label smoke already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label imd already defined)
(label ethnicity already defined)

. 
. * drop unnecessary variable (the indicator is generated by python shown below
> )
. drop exposure exposure_warfarin 

. 
. * Case variable was generated by matching.py (indicating exposed group=1 & ma
> tched group=0)
. rename case exposure 

. sort set_id patient_id

. 
. label var exposure "Oral anticoagulant Treatment Exposure"

. label define case 0 "non-use" 1 "current use"

. label values exposure case 

. 
. safecount
  563,145

. 
. * Drop the whole matched set if end of study before index in OAC exposed
. noi di "DROP IF END OF STUDY PERIOD BEFORE INDEX"
DROP IF END OF STUDY PERIOD BEFORE INDEX

. 
. gen remove_invalid_period = 1 if stime_`outcome' < date("$indexdate", "DMY") 
> & exposure == 1
(563,145 missing values generated)

. replace remove_invalid_period = 0  if remove_invalid_period == .
(563,145 real changes made)

. bysort set_id: egen max_remove_invalid_period = max(remove_invalid_period)

. drop if max_remove_invalid_period == 1
(0 observations deleted)

. drop if stime_`outcome' < date("$indexdate", "DMY") & exposure == 0
(0 observations deleted)

. 
. /* LABEL VARIABLE============================================================
> ======*/
. label var set_id                                "Matched setid = patient_id o
> f the case"

. label var exposure                              "Variable indicating the expo
> sure status"

. 
. /* SAVE DATA=================================================================
> =*/
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_match_tempdata/analysis_dataset_positivecovid
> test.dta not found)
file /workspace/output/oac_match_tempdata/analysis_dataset_positivecovidtest.dt
> a saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  positivecovidtest != 0 & positivecovidtest < .
obs. time interval:  (stime_positivecovidtest[_n-1], stime_positivecovidtest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    563,145  total observations
          0  exclusions
------------------------------------------------------------------------------
    563,145  observations remaining, representing
    563,145  subjects
      3,134  failures in single-failure-per-subject data
  117298093  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_match_tempdata/analysis_dataset_STSET_positiv
> ecovidtest.dta not found)
file /workspace/output/oac_match_tempdata/analysis_dataset_STSET_positivecovidt
> est.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/02c_cr_create_population_positivec
> ovidtest.log
  log type:  text
 closed on:   2 Mar 2021, 06:03:46
-------------------------------------------------------------------------------
