-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/03_an_checks_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 11:23:25

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_`outcome', clear

. 
. *Duplicate patient check
. sort patient_id

. datacheck _n==1, by(patient_id) nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. * Check date ranges for all treatment variables  
. foreach i in warfarin_last_four_months  ///
>              doac_last_four_months      ///
>               {
  2.         
.         summ `i', format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
warfarin_l~s |     12,198   02feb2020    23.47804  01nov2019  28feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doac_last_~s |     39,924   05feb2020    20.13656  01nov2019  28feb2020

. 
. * Check date ranges for all comorbidities/ medications 
. foreach var of varlist  ckd                                             ///  
>                    
>                                                 hypertension                 
>            ///
>                                                 other_respiratory            
>            ///
>                                                 heart_failure                
>            ///
>                                                 copd                         
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 cancer                       
>            ///
>                                                 myocardial_infarct           
>            ///
>                                                 stroke                       
>                    ///
>                                                 tia                          
>                            ///
>                                                 pad                          
>                            ///
>                                                 vte                          
>                            ///
>                                                 antiplatelet                /
> //
>                                                 oestrogen                   /
> //
>                                                  { 
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ckd_date |     73,693   02oct2019    454.3561  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |    271,317   20oct2003    7114.783  15dec1840  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_resp~e |     18,747   03jan2009    6413.059  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
heart_fai~te |     21,080   28jun2013    4110.583  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   copd_date |     49,579   07dec2009    5994.305  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |    116,708   22nov2007    6555.499  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 cancer_date |     78,234   25may2010    4431.667  15dec1840  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
myocardial~e |     33,969   23mar2009    3737.492  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 stroke_date |     26,329   15dec2013    3608.001  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    tia_date |     21,400   10mar2013    3158.547  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    pad_date |     14,808   27oct2012    3347.239  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    vte_date |     13,459   31jan2007    5007.136  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
antiplatel~e |    107,762   02feb2020     21.4571  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
oestrogen_~e |      4,665   16jan2020     30.4131  15nov2019  15feb2020

. 
. summ immunodef_any, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
immunodef_~y |    563,123    .0069985    .0833637          0          1

. 
. * Death outcome flag (covid)
. //Underlying Covid-death should be a subset of Any Covid-death
. datacheck !(died_ons_covid_flag_underlying==1 & died_ons_covid_flag_any!=1), 
> nolist

. 
. * Outcome dates
. summ  stime_onscoviddeath stime_onsnoncoviddeath ///
> stime_admitcovid stime_covidtest stime_positivecovidtest,  format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_onsc~h |    563,123   25sep2020    18.01947  01mar2020  28sep2020
stime_onsn~h |    563,123   25sep2020    18.01947  01mar2020  28sep2020
stime_admi~d |    563,123   25sep2020    19.18854  01mar2020  28sep2020
stime_covi~t |    563,123   21sep2020     27.3321  01mar2020  28sep2020
stime_posi~t |    563,123   25sep2020    20.10171  01mar2020  28sep2020

. summ  died_date_ons died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     11,171   11jul2020    83.36349  01mar2020  06dec2020
died_date_~d |      1,645   24jun2020    93.56001  16mar2020  06dec2020

. summ  covid_admission_date covid_admission_primary_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
covid~n_date |      2,660   11may2020    64.13308  01mar2020  31oct2020
covid~y_date |      1,764   10may2020    64.81032  01mar2020  31oct2020

. summ  first_tested_for_covid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_test~d |     45,779   22aug2020    77.23459  01mar2020  17dec2020

. summ  first_positive_test_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_posi~e |     10,170   13sep2020    90.16559  04mar2020  17dec2020

. 
. * Follow-up for outcomes
. datacheck follow_up_`outcome' > 0, nol

. 
. summ  follow_up_`outcome', detail

       Number of days (follow-up) for ONS covid death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           96            1.5
 5%          212            1.5
10%          212            1.5       Obs             563,123
25%          212            1.5       Sum of Wgt.     563,123

50%          212                      Mean           209.7757
                        Largest       Std. Dev.      18.01947
75%          212            212
90%          212            212       Variance       324.7013
95%          212            212       Skewness      -8.856932
99%          212            212       Kurtosis       83.97176

. 
. * Outcome date day lags since cohort entry (only ONS dataset)
. * check how the death count tail out
. gen days_died_since_entry = died_date_ons - enter_date
(551,952 missing values generated)

. su days_died_since_entry, detail

                    days_died_since_entry
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             .5
 5%           16             .5
10%           28             .5       Obs              11,171
25%           54             .5       Sum of Wgt.      11,171

50%          127                      Mean            132.654
                        Largest       Std. Dev.      83.36349
75%          209            278
90%          251            278       Variance       6949.471
95%          264            278       Skewness       .1385272
99%          274            280       Kurtosis       1.664403

. 
. * check the dates of first positive covid test date and covid first test date
. datacheck first_positive_test_date == first_tested_for_covid, nol

 (35643 contradictions)

. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      5,642    17.37125    .8594116         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    144,048    22.79034    1.593444       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    216,134    27.32706    1.404855         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    106,545    32.01669    1.402631         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     33,959    36.98227     1.38803         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     13,971    43.21429    2.584376         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     5,642          0          0          0 |     5,642 
  Normal (18.5-24.9) |   144,048          0          0          0 |   144,048 
Overweight (25-29.9) |   216,134          0          0          0 |   216,134 
   Obese I (30-34.9) |         0    106,545          0          0 |   106,545 
  Obese II (35-39.9) |         0          0     33,959          0 |    33,959 
     Obese III (40+) |         0          0          0     13,971 |    13,971 
        Unknown (.u) |    42,824          0          0          0 |    42,824 
---------------------+--------------------------------------------+----------
               Total |   408,648    106,545     33,959     13,971 |   563,123 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,373    34.25929    4.743547         18         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,242    46.29435    2.560656         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     50,692    55.73134    2.702011         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    171,482    65.42192     2.77217         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    246,421    73.25124    2.463091         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     84,913    84.50241    3.636954         80        101


. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |   201,908          0          0 |   201,908 
      Former |         0    302,228          0 |   302,228 
     Current |         0          0     57,706 |    57,706 
Unknown (.u) |     1,281          0          0 |     1,281 
-------------+---------------------------------+----------
       Total |   203,189    302,228     57,706 |   563,123 

. 
. * Diabetes
. safetab diabcat diabetes, m
17

                      |       Diabetes
    Diabetes Severity |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |   446,415          0 |   446,415 
  Controlled diabetes |         0     80,815 |    80,815 
Uncontrolled diabetes |         0     34,560 |    34,560 
Diabetes, no hba1c me |         0      1,333 |     1,333 
----------------------+----------------------+----------
                Total |   446,415    116,708 |   563,123 

. 
. * CKD
. safetab ckd egfr_cat, m
13

   Chronic |
    kidney |                    Calculated eGFR
   disease |         0         15         30         45         60 |     Total
-----------+-------------------------------------------------------+----------
    No CKD |         0          0          0          0    318,330 |   489,430 
       CKD |       893      4,007     16,693     51,544        202 |    73,693 
-----------+-------------------------------------------------------+----------
     Total |       893      4,007     16,693     51,544    318,532 |   563,123 


   Chronic | Calculated
    kidney |    eGFR
   disease |         . |     Total
-----------+-----------+----------
    No CKD |   171,100 |   489,430 
       CKD |       354 |    73,693 
-----------+-----------+----------
     Total |   171,454 |   563,123 

. 
. /* RELATIONSHIP WITH EXPOSURE AND COVARIATES (past 4 months)=============*/
. 
. foreach var of varlist  agegroup                    ///
>                         sex                         ///
>                                                 bmicat                      /
> //
>                                                 ethnicity                   /
> //
>                                                 care_home_residence          
>            ///
>                                                 imd                         /
> //
>                                                 smoke_nomiss                /
> //
>                                                 hypertension                 
>            ///
>                                                 heart_failure                
>            ///
>                                                 diabcat                      
>                    ///
>                                                 copd                         
>                    ///                                             
>                                                 other_respiratory            
>            ///
>                                                 cancer                       
>            ///
>                                                 immunodef_any                
>            ///
>                                                 ckd                          
>                    ///
>                                                 myocardial_infarct           
>            ///
>                                                 pad                          
>                            ///
>                                                 stroke_tia                   
>                    ///
>                                                 vte                          
>                            ///
>                                                 flu_vaccine                  
>                    ///                                             
>                                                 oestrogen                    
>                    ///
>                                                 antiplatelet                 
>            ///
>                                                 gp_consult                   
>            ///
>                                                 ae_attendance_last_year     /
> //
>                                               {
  2.                                                         
.         safetab `var' exposure , col m
  3. }
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
   Grouped |  the exposure status
       age |   non-use  current u |     Total
-----------+----------------------+----------
    18-<40 |     1,247        126 |     1,373 
           |      0.24       0.24 |      0.24 
-----------+----------------------+----------
    40-<50 |     7,490        752 |     8,242 
           |      1.46       1.45 |      1.46 
-----------+----------------------+----------
    50-<60 |    46,059      4,633 |    50,692 
           |      9.01       8.95 |      9.00 
-----------+----------------------+----------
    60-<70 |   155,830     15,652 |   171,482 
           |     30.47      30.25 |     30.45 
-----------+----------------------+----------
    70-<80 |   223,943     22,478 |   246,421 
           |     43.79      43.44 |     43.76 
-----------+----------------------+----------
       80+ |    76,806      8,107 |    84,913 
           |     15.02      15.67 |     15.08 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
           |  the exposure status
       Sex |   non-use  current u |     Total
-----------+----------------------+----------
         F |   107,387     10,801 |   118,188 
           |     21.00      20.87 |     20.99 
-----------+----------------------+----------
         M |   403,988     40,947 |   444,935 
           |     79.00      79.13 |     79.01 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Variable indicating
                     |  the exposure status
         Grouped BMI |   non-use  current u |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     5,149        493 |     5,642 
                     |      1.01       0.95 |      1.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   132,425     11,623 |   144,048 
                     |     25.90      22.46 |     25.58 
---------------------+----------------------+----------
Overweight (25-29.9) |   198,462     17,672 |   216,134 
                     |     38.81      34.15 |     38.38 
---------------------+----------------------+----------
   Obese I (30-34.9) |    95,560     10,985 |   106,545 
                     |     18.69      21.23 |     18.92 
---------------------+----------------------+----------
  Obese II (35-39.9) |    29,252      4,707 |    33,959 
                     |      5.72       9.10 |      6.03 
---------------------+----------------------+----------
     Obese III (40+) |    11,118      2,853 |    13,971 
                     |      2.17       5.51 |      2.48 
---------------------+----------------------+----------
        Unknown (.u) |    39,409      3,415 |    42,824 
                     |      7.71       6.60 |      7.60 
---------------------+----------------------+----------
               Total |   511,375     51,748 |   563,123 
                     |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Variable indicating
                      |  the exposure status
            Ethnicity |   non-use  current u |     Total
----------------------+----------------------+----------
                White |   372,812     37,408 |   410,220 
                      |     72.90      72.29 |     72.85 
----------------------+----------------------+----------
                Mixed |     1,603        102 |     1,705 
                      |      0.31       0.20 |      0.30 
----------------------+----------------------+----------
Asian or Asian Britis |    11,055        503 |    11,558 
                      |      2.16       0.97 |      2.05 
----------------------+----------------------+----------
                Black |     3,894        183 |     4,077 
                      |      0.76       0.35 |      0.72 
----------------------+----------------------+----------
                Other |     3,023        215 |     3,238 
                      |      0.59       0.42 |      0.58 
----------------------+----------------------+----------
              Unknown |   118,988     13,337 |   132,325 
                      |     23.27      25.77 |     23.50 
----------------------+----------------------+----------
                Total |   511,375     51,748 |   563,123 
                      |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
 Care home |  the exposure status
 residence |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   508,339     51,432 |   559,771 
           |     99.41      99.39 |     99.40 
-----------+----------------------+----------
         1 |     3,036        316 |     3,352 
           |      0.59       0.61 |      0.60 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Variable indicating
     Deprivation |  the exposure status
           (IMD) |   non-use  current u |     Total
-----------------+----------------------+----------
1 least deprived |   102,382     11,234 |   113,616 
                 |     20.02      21.71 |     20.18 
-----------------+----------------------+----------
               2 |   103,627     10,740 |   114,367 
                 |     20.26      20.75 |     20.31 
-----------------+----------------------+----------
               3 |   102,249     10,536 |   112,785 
                 |     19.99      20.36 |     20.03 
-----------------+----------------------+----------
               4 |   101,426      9,817 |   111,243 
                 |     19.83      18.97 |     19.75 
-----------------+----------------------+----------
 5 most deprived |   101,691      9,421 |   111,112 
                 |     19.89      18.21 |     19.73 
-----------------+----------------------+----------
           Total |   511,375     51,748 |   563,123 
                 |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |
      status |  Variable indicating
(missing set |  the exposure status
     to non) |   non-use  current u |     Total
-------------+----------------------+----------
       Never |   184,335     18,854 |   203,189 
             |     36.05      36.43 |     36.08 
-------------+----------------------+----------
      Former |   273,179     29,049 |   302,228 
             |     53.42      56.14 |     53.67 
-------------+----------------------+----------
     Current |    53,861      3,845 |    57,706 
             |     10.53       7.43 |     10.25 
-------------+----------------------+----------
       Total |   511,375     51,748 |   563,123 
             |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Variable indicating
hypertensi |  the exposure status
        on |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   261,656     30,150 |   291,806 
           |     51.17      58.26 |     51.82 
-----------+----------------------+----------
         1 |   249,719     21,598 |   271,317 
           |     48.83      41.74 |     48.18 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
     Heart |  the exposure status
   Failure |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   495,854     46,189 |   542,043 
           |     96.96      89.26 |     96.26 
-----------+----------------------+----------
         1 |    15,521      5,559 |    21,080 
           |      3.04      10.74 |      3.74 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Variable indicating
                      |  the exposure status
    Diabetes Severity |   non-use  current u |     Total
----------------------+----------------------+----------
          No diabetes |   401,003     45,412 |   446,415 
                      |     78.42      87.76 |     79.27 
----------------------+----------------------+----------
  Controlled diabetes |    76,616      4,199 |    80,815 
                      |     14.98       8.11 |     14.35 
----------------------+----------------------+----------
Uncontrolled diabetes |    32,493      2,067 |    34,560 
                      |      6.35       3.99 |      6.14 
----------------------+----------------------+----------
Diabetes, no hba1c me |     1,263         70 |     1,333 
                      |      0.25       0.14 |      0.24 
----------------------+----------------------+----------
                Total |   511,375     51,748 |   563,123 
                      |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
           |  the exposure status
      COPD |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   466,938     46,606 |   513,544 
           |     91.31      90.06 |     91.20 
-----------+----------------------+----------
         1 |    44,437      5,142 |    49,579 
           |      8.69       9.94 |      8.80 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |  Variable indicating
Respirator |  the exposure status
y Diseases |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   494,709     49,667 |   544,376 
           |     96.74      95.98 |     96.67 
-----------+----------------------+----------
         1 |    16,666      2,081 |    18,747 
           |      3.26       4.02 |      3.33 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
           |  the exposure status
    Cancer |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   440,961     43,928 |   484,889 
           |     86.23      84.89 |     86.11 
-----------+----------------------+----------
         1 |    70,414      7,820 |    78,234 
           |     13.77      15.11 |     13.89 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Variable indicating
        on |  the exposure status
algorithm) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   507,868     51,314 |   559,182 
           |     99.31      99.16 |     99.30 
-----------+----------------------+----------
         1 |     3,507        434 |     3,941 
           |      0.69       0.84 |      0.70 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Variable indicating
    kidney |  the exposure status
   disease |   non-use  current u |     Total
-----------+----------------------+----------
    No CKD |   445,970     43,460 |   489,430 
           |     87.21      83.98 |     86.91 
-----------+----------------------+----------
       CKD |    65,405      8,288 |    73,693 
           |     12.79      16.02 |     13.09 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
Myocardial |  the exposure status
infarction |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   479,001     50,153 |   529,154 
           |     93.67      96.92 |     93.97 
-----------+----------------------+----------
         1 |    32,374      1,595 |    33,969 
           |      6.33       3.08 |      6.03 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Peripheral |  Variable indicating
  arterial |  the exposure status
   disease |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   496,986     51,329 |   548,315 
           |     97.19      99.19 |     97.37 
-----------+----------------------+----------
         1 |    14,389        419 |    14,808 
           |      2.81       0.81 |      2.63 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Stroke/Tra |
    nsient |  Variable indicating
 ischaemic |  the exposure status
    attack |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   475,186     50,727 |   525,913 
           |     92.92      98.03 |     93.39 
-----------+----------------------+----------
         1 |    36,189      1,021 |    37,210 
           |      7.08       1.97 |      6.61 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Venous |  Variable indicating
thromboemb |  the exposure status
     olism |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   498,459     51,205 |   549,664 
           |     97.47      98.95 |     97.61 
-----------+----------------------+----------
         1 |    12,916        543 |    13,459 
           |      2.53       1.05 |      2.39 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
       Flu |  the exposure status
   vaccine |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   175,367     12,667 |   188,034 
           |     34.29      24.48 |     33.39 
-----------+----------------------+----------
         1 |   336,008     39,081 |   375,089 
           |     65.71      75.52 |     66.61 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
    Recent |  the exposure status
 Oestrogen |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   507,061     51,397 |   558,458 
           |     99.16      99.32 |     99.17 
-----------+----------------------+----------
         1 |     4,314        351 |     4,665 
           |      0.84       0.68 |      0.83 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |  Variable indicating
antiplatel |  the exposure status
        et |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   405,871     49,490 |   455,361 
           |     79.37      95.64 |     80.86 
-----------+----------------------+----------
         1 |   105,504      2,258 |   107,762 
           |     20.63       4.36 |     19.14 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        GP |
consultati |
on in last |  Variable indicating
      year |  the exposure status
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |         0      1,077 |     1,077 
           |      0.00       2.08 |      0.19 
-----------+----------------------+----------
         1 |   511,375     50,671 |   562,046 
           |    100.00      97.92 |     99.81 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       A&E |
attendance |
   rate in |  Variable indicating
 last year |  the exposure status
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   425,641     37,845 |   463,486 
           |     83.23      73.13 |     82.31 
-----------+----------------------+----------
         1 |    85,734     13,903 |    99,637 
           |     16.77      26.87 |     17.69 
-----------+----------------------+----------
     Total |   511,375     51,748 |   563,123 
           |    100.00     100.00 |    100.00 

. 
. bysort exposure: su gp_consult_count, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs             511,375
25%            3              1       Sum of Wgt.     511,375

50%            6                      Mean           8.272649
                        Largest       Std. Dev.      8.327546
75%           11            234
90%           17            332       Variance       69.34802
95%           22            358       Skewness       4.595741
99%           39            386       Kurtosis       62.42681

-------------------------------------------------------------------------------
-> exposure = current use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%            3              0       Obs              51,748
25%            5              0       Sum of Wgt.      51,748

50%           10                      Mean           12.73054
                        Largest       Std. Dev.      11.53414
75%           17            180
90%           26            184       Variance       133.0363
95%           33            194       Skewness       2.962675
99%           56            198       Kurtosis       20.87976


. bysort exposure: su ae_attendance_count , detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             511,375
25%            0              0       Sum of Wgt.     511,375

50%            0                      Mean           .2534011
                        Largest       Std. Dev.      .7692058
75%            0             56
90%            1             70       Variance       .5916776
95%            1             70       Skewness       12.42927
99%            3             71       Kurtosis       631.9323

-------------------------------------------------------------------------------
-> exposure = current use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              51,748
25%            0              0       Sum of Wgt.      51,748

50%            0                      Mean           .4424519
                        Largest       Std. Dev.      1.031399
75%            1             22
90%            1             25       Variance       1.063784
95%            2             43       Skewness        8.15105
99%            4             54       Kurtosis       235.2854


. bysort exposure: su age, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           47             18
 5%           55             18
10%           59             18       Obs             511,375
25%           66             18       Sum of Wgt.     511,375

50%           71                      Mean           70.48308
                        Largest       Std. Dev.      8.926655
75%           75            100
90%           82            100       Variance       79.68516
95%           86            100       Skewness      -.2795373
99%           91            101       Kurtosis       3.870681

-------------------------------------------------------------------------------
-> exposure = current use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           47             18
 5%           55             20
10%           59             23       Obs              51,748
25%           66             23       Sum of Wgt.      51,748

50%           71                      Mean           70.63311
                        Largest       Std. Dev.      9.079492
75%           75            100
90%           83            100       Variance       82.43717
95%           86            100       Skewness      -.2183792
99%           92            100       Kurtosis       3.856174


. bysort exposure: su follow_up_`outcome', detail

-------------------------------------------------------------------------------
-> exposure = non-use

       Number of days (follow-up) for ONS covid death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           97            1.5
 5%          212            1.5
10%          212            1.5       Obs             511,375
25%          212            1.5       Sum of Wgt.     511,375

50%          212                      Mean           209.8049
                        Largest       Std. Dev.      17.90566
75%          212            212
90%          212            212       Variance       320.6126
95%          212            212       Skewness       -8.91984
99%          212            212       Kurtosis       85.15233

-------------------------------------------------------------------------------
-> exposure = current use

       Number of days (follow-up) for ONS covid death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           80            1.5
 5%          212            1.5
10%          212            1.5       Obs              51,748
25%          212            1.5       Sum of Wgt.      51,748

50%          212                      Mean           209.4877
                        Largest       Std. Dev.      19.10553
75%          212            212
90%          212            212       Variance       365.0212
95%          212            212       Skewness      -8.296336
99%          212            212       Kurtosis       73.82103


. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab `outcome', m
14

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  ONS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    561,968       99.79       99.79
          1 |      1,155        0.21      100.00
------------+-----------------------------------
      Total |    563,123      100.00

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/03_an_checks_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 11:23:58
-------------------------------------------------------------------------------
