-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/03_an_checks_admitcovid.log
  log type:  text
 opened on:   2 Mar 2021, 06:10:34

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_`outcome', clear

. 
. *Duplicate patient check
. sort patient_id

. datacheck _n==1, by(patient_id) nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. * Check date ranges for all treatment variables  
. foreach i in warfarin_last_four_months  ///
>              doac_last_four_months      ///
>               {
  2.         
.         summ `i', format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
warfarin_l~s |     12,193   02feb2020    23.49663  01nov2019  28feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doac_last_~s |     39,964   05feb2020     20.1294  01nov2019  28feb2020

. 
. * Check date ranges for all comorbidities/ medications 
. foreach var of varlist  ckd                                             ///  
>                    
>                                                 hypertension                 
>            ///
>                                                 other_respiratory            
>            ///
>                                                 heart_failure                
>            ///
>                                                 copd                         
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 cancer                       
>            ///
>                                                 myocardial_infarct           
>            ///
>                                                 stroke                       
>                    ///
>                                                 tia                          
>                            ///
>                                                 pad                          
>                            ///
>                                                 vte                          
>                            ///
>                                                 antiplatelet                /
> //
>                                                 oestrogen                   /
> //
>                                                 has_bled_score               
>            ///
>                                                  { 
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ckd_date |     73,788   01oct2019    504.0934  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |    271,496   02oct2003    7162.736  15jan1840  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_resp~e |     18,683   10jan2009    6363.223  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
heart_fai~te |     21,387   30jun2013    4109.278  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   copd_date |     49,626   13oct2009    6162.773  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |    116,795   03dec2007     6544.57  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 cancer_date |     78,579   29may2010    4417.326  15dec1840  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
myocardial~e |     33,984   11mar2009    3707.269  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 stroke_date |     26,289   01dec2013    3669.345  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    tia_date |     21,389   16apr2013    3007.898  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    pad_date |     14,881   16oct2012     3432.45  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    vte_date |     13,492   22feb2007    4915.574  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
antiplatel~e |    107,650   02feb2020    21.38288  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
oestrogen_~e |      4,559   16jan2020    30.52107  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_bled_~te |     21,357   14jun2017     578.389  15nov2012  15feb2020

. 
. summ immunodef_any, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
immunodef_~y |    563,145    .0069982    .0833621          0          1

. 
. * Death outcome flag (covid)
. //Underlying Covid-death should be a subset of Any Covid-death
. datacheck !(died_ons_covid_flag_underlying==1 & died_ons_covid_flag_any!=1), 
> nolist

. 
. * Outcome dates
. summ  stime_onscoviddeath stime_onsnoncoviddeath ///
> stime_admitcovid stime_covidtest stime_positivecovidtest,  format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_onsc~h |    563,145   25sep2020    18.00834  01mar2020  28sep2020
stime_onsn~h |    563,145   25sep2020    18.00834  01mar2020  28sep2020
stime_admi~d |    563,145   25sep2020    19.10318  01mar2020  28sep2020
stime_covi~t |    563,145   16sep2020    34.82146  01mar2020  28sep2020
stime_posi~t |    563,145   25sep2020     20.0517  01mar2020  28sep2020

. summ  died_date_ons died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     15,138   27aug2020    107.2352  01mar2020  13feb2021
died_date_~d |      3,175   27sep2020    121.8561  16mar2020  12feb2021

. summ  covid_admission_date covid_admission_primary_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
covid~n_date |      4,574   30jul2020     105.276  01mar2020  31dec2020
covid~y_date |      2,782   22jul2020     106.821  01mar2020  31dec2020

. summ  first_tested_for_covid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_test~d |    160,983   05oct2020    90.36629  01mar2020  25feb2021

. summ  first_positive_test_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_posi~e |     20,119   12nov2020    88.83527  04mar2020  25feb2021

. summ  mi_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 mi_date_ons |         63   31aug2020     109.063  19mar2020  10feb2021

. summ  stroke_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dat~s |          7   28jul2020    113.5442  23mar2020  01jan2021

. summ  vte_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
vte_date_ons |     [redacted]   21mar2020    5.656854  17mar2020  25mar2020

. summ  gi_bleed_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gi_bleed_d~s |          8   07oct2020    96.79424  26apr2020  19jan2021

. summ  intracranial_bleed_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
intrac~e_ons |         26   22sep2020    101.9019  06apr2020  07feb2021

. 
. * Follow-up for outcomes
. datacheck follow_up_`outcome' > 0, nol

. 
. summ  follow_up_`outcome', detail

        Number of days (follow-up) for covid hospital
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%           78            1.5
 5%          212            1.5
10%          212            1.5       Obs             563,145
25%          212            1.5       Sum of Wgt.     563,145

50%          212                      Mean           209.5483
                        Largest       Std. Dev.      19.10318
75%          212            212
90%          212            212       Variance       364.9315
95%          212            212       Skewness      -8.432027
99%          212            212       Kurtosis       75.79008

. 
. * Outcome date day lags since cohort entry (only ONS dataset)
. * check how the death count tail out
. gen days_died_since_entry = died_date_ons - enter_date
(548,007 missing values generated)

. su days_died_since_entry, detail

                    days_died_since_entry
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3             .5
 5%           20             .5
10%           34             .5       Obs              15,138
25%           75             .5       Sum of Wgt.      15,138

50%          188                      Mean           179.9418
                        Largest       Std. Dev.      107.2352
75%          280            348
90%          321            348       Variance       11499.38
95%          332            348       Skewness      -.0801992
99%          343            349       Kurtosis       1.609905

. 
. * check the dates of first positive covid test date and covid first test date
. datacheck first_positive_test_date == first_tested_for_covid, nol

 (140918 contradictions)

. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      5,614    17.37075    .8549202         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    144,699    22.78214    1.600003       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    216,442    27.32635    1.404449         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |    106,336    32.01796     1.40246         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     34,238    36.98023    1.394791         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     13,873    43.21119     2.58075         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     5,614          0          0          0 |     5,614 
  Normal (18.5-24.9) |   144,699          0          0          0 |   144,699 
Overweight (25-29.9) |   216,442          0          0          0 |   216,442 
   Obese I (30-34.9) |         0    106,336          0          0 |   106,336 
  Obese II (35-39.9) |         0          0     34,238          0 |    34,238 
     Obese III (40+) |         0          0          0     13,873 |    13,873 
        Unknown (.u) |    41,943          0          0          0 |    41,943 
---------------------+--------------------------------------------+----------
               Total |   408,698    106,336     34,238     13,873 |   563,145 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,373    34.26074    4.736393         18         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,244    46.29949    2.558252         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     50,742     55.7304    2.702276         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    171,527     65.4197    2.773742         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    246,436    73.25123    2.463201         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     84,823    84.50281    3.635514         80        101


. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |   201,394          0          0 |   201,394 
      Former |         0    302,684          0 |   302,684 
     Current |         0          0     57,824 |    57,824 
Unknown (.u) |     1,243          0          0 |     1,243 
-------------+---------------------------------+----------
       Total |   202,637    302,684     57,824 |   563,145 

. 
. * Diabetes
. safetab diabcat diabetes, m
17

                      |       Diabetes
    Diabetes Severity |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |   446,350          0 |   446,350 
  Controlled diabetes |         0     80,954 |    80,954 
Uncontrolled diabetes |         0     34,462 |    34,462 
Diabetes, no hba1c me |         0      1,379 |     1,379 
----------------------+----------------------+----------
                Total |   446,350    116,795 |   563,145 

. 
. * CKD
. safetab ckd egfr_cat, m
13

   Chronic |
    kidney |                    Calculated eGFR
   disease |         0         15         30         45         60 |     Total
-----------+-------------------------------------------------------+----------
    No CKD |         0          0          0          0    318,401 |   489,357 
       CKD |       873      3,974     16,658     51,761        195 |    73,788 
-----------+-------------------------------------------------------+----------
     Total |       873      3,974     16,658     51,761    318,596 |   563,145 


   Chronic | Calculated
    kidney |    eGFR
   disease |         . |     Total
-----------+-----------+----------
    No CKD |   170,956 |   489,357 
       CKD |       327 |    73,788 
-----------+-----------+----------
     Total |   171,283 |   563,145 

. 
. /* RELATIONSHIP WITH EXPOSURE AND COVARIATES (past 4 months)=============*/
. 
. foreach var of varlist  agegroup                    ///
>                         sex                         ///
>                                                 bmicat                      /
> //
>                                                 ethnicity                   /
> //
>                                                 care_home_residence          
>            ///
>                                                 imd                         /
> //
>                                                 smoke_nomiss                /
> //
>                                                 hypertension                 
>            ///
>                                                 heart_failure                
>            ///
>                                                 diabcat                      
>                    ///
>                                                 copd                         
>                    ///                                             
>                                                 other_respiratory            
>            ///
>                                                 cancer                       
>            ///
>                                                 immunodef_any                
>            ///
>                                                 ckd                          
>                    ///
>                                                 myocardial_infarct           
>            ///
>                                                 pad                          
>                            ///
>                                                 stroke_tia                   
>                    ///
>                                                 vte                          
>                            ///
>                                                 flu_vaccine                  
>                    ///                                             
>                                                 oestrogen                    
>                    ///
>                                                 antiplatelet                 
>            ///
>                                                 gp_consult                   
>            ///
>                                                 ae_attendance_last_year     /
> //
>                                               {
  2.                                                         
.         safetab `var' exposure , col m
  3. }
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
   Grouped |  the exposure status
       age |   non-use  current u |     Total
-----------+----------------------+----------
    18-<40 |     1,247        126 |     1,373 
           |      0.24       0.24 |      0.24 
-----------+----------------------+----------
    40-<50 |     7,491        753 |     8,244 
           |      1.46       1.45 |      1.46 
-----------+----------------------+----------
    50-<60 |    46,100      4,642 |    50,742 
           |      9.02       8.96 |      9.01 
-----------+----------------------+----------
    60-<70 |   155,854     15,673 |   171,527 
           |     30.48      30.27 |     30.46 
-----------+----------------------+----------
    70-<80 |   223,949     22,487 |   246,436 
           |     43.79      43.42 |     43.76 
-----------+----------------------+----------
       80+ |    76,720      8,103 |    84,823 
           |     15.00      15.65 |     15.06 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
           |  the exposure status
       Sex |   non-use  current u |     Total
-----------+----------------------+----------
         F |   107,444     10,819 |   118,263 
           |     21.01      20.89 |     21.00 
-----------+----------------------+----------
         M |   403,917     40,965 |   444,882 
           |     78.99      79.11 |     79.00 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Variable indicating
                     |  the exposure status
         Grouped BMI |   non-use  current u |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     5,118        496 |     5,614 
                     |      1.00       0.96 |      1.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |   133,032     11,667 |   144,699 
                     |     26.02      22.53 |     25.69 
---------------------+----------------------+----------
Overweight (25-29.9) |   198,691     17,751 |   216,442 
                     |     38.86      34.28 |     38.43 
---------------------+----------------------+----------
   Obese I (30-34.9) |    95,352     10,984 |   106,336 
                     |     18.65      21.21 |     18.88 
---------------------+----------------------+----------
  Obese II (35-39.9) |    29,518      4,720 |    34,238 
                     |      5.77       9.11 |      6.08 
---------------------+----------------------+----------
     Obese III (40+) |    11,022      2,851 |    13,873 
                     |      2.16       5.51 |      2.46 
---------------------+----------------------+----------
        Unknown (.u) |    38,628      3,315 |    41,943 
                     |      7.55       6.40 |      7.45 
---------------------+----------------------+----------
               Total |   511,361     51,784 |   563,145 
                     |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Variable indicating
                      |  the exposure status
            Ethnicity |   non-use  current u |     Total
----------------------+----------------------+----------
                White |   375,297     37,729 |   413,026 
                      |     73.39      72.86 |     73.34 
----------------------+----------------------+----------
                Mixed |     1,635        102 |     1,737 
                      |      0.32       0.20 |      0.31 
----------------------+----------------------+----------
Asian or Asian Britis |    10,975        506 |    11,481 
                      |      2.15       0.98 |      2.04 
----------------------+----------------------+----------
                Black |     4,039        182 |     4,221 
                      |      0.79       0.35 |      0.75 
----------------------+----------------------+----------
                Other |     3,080        217 |     3,297 
                      |      0.60       0.42 |      0.59 
----------------------+----------------------+----------
              Unknown |   116,335     13,048 |   129,383 
                      |     22.75      25.20 |     22.98 
----------------------+----------------------+----------
                Total |   511,361     51,784 |   563,145 
                      |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
 Care home |  the exposure status
 residence |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   508,343     51,469 |   559,812 
           |     99.41      99.39 |     99.41 
-----------+----------------------+----------
         1 |     3,018        315 |     3,333 
           |      0.59       0.61 |      0.59 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Variable indicating
     Deprivation |  the exposure status
           (IMD) |   non-use  current u |     Total
-----------------+----------------------+----------
1 least deprived |   102,420     11,242 |   113,662 
                 |     20.03      21.71 |     20.18 
-----------------+----------------------+----------
               2 |   103,620     10,914 |   114,534 
                 |     20.26      21.08 |     20.34 
-----------------+----------------------+----------
               3 |   101,931     10,371 |   112,302 
                 |     19.93      20.03 |     19.94 
-----------------+----------------------+----------
               4 |   101,868      9,818 |   111,686 
                 |     19.92      18.96 |     19.83 
-----------------+----------------------+----------
 5 most deprived |   101,522      9,439 |   110,961 
                 |     19.85      18.23 |     19.70 
-----------------+----------------------+----------
           Total |   511,361     51,784 |   563,145 
                 |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |
      status |  Variable indicating
(missing set |  the exposure status
     to non) |   non-use  current u |     Total
-------------+----------------------+----------
       Never |   183,772     18,865 |   202,637 
             |     35.94      36.43 |     35.98 
-------------+----------------------+----------
      Former |   273,612     29,072 |   302,684 
             |     53.51      56.14 |     53.75 
-------------+----------------------+----------
     Current |    53,977      3,847 |    57,824 
             |     10.56       7.43 |     10.27 
-------------+----------------------+----------
       Total |   511,361     51,784 |   563,145 
             |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Variable indicating
hypertensi |  the exposure status
        on |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   261,478     30,171 |   291,649 
           |     51.13      58.26 |     51.79 
-----------+----------------------+----------
         1 |   249,883     21,613 |   271,496 
           |     48.87      41.74 |     48.21 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
     Heart |  the exposure status
   Failure |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   495,544     46,214 |   541,758 
           |     96.91      89.24 |     96.20 
-----------+----------------------+----------
         1 |    15,817      5,570 |    21,387 
           |      3.09      10.76 |      3.80 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Variable indicating
                      |  the exposure status
    Diabetes Severity |   non-use  current u |     Total
----------------------+----------------------+----------
          No diabetes |   400,918     45,432 |   446,350 
                      |     78.40      87.73 |     79.26 
----------------------+----------------------+----------
  Controlled diabetes |    76,745      4,209 |    80,954 
                      |     15.01       8.13 |     14.38 
----------------------+----------------------+----------
Uncontrolled diabetes |    32,389      2,073 |    34,462 
                      |      6.33       4.00 |      6.12 
----------------------+----------------------+----------
Diabetes, no hba1c me |     1,309         70 |     1,379 
                      |      0.26       0.14 |      0.24 
----------------------+----------------------+----------
                Total |   511,361     51,784 |   563,145 
                      |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
           |  the exposure status
      COPD |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   466,886     46,633 |   513,519 
           |     91.30      90.05 |     91.19 
-----------+----------------------+----------
         1 |    44,475      5,151 |    49,626 
           |      8.70       9.95 |      8.81 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |  Variable indicating
Respirator |  the exposure status
y Diseases |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   494,759     49,703 |   544,462 
           |     96.75      95.98 |     96.68 
-----------+----------------------+----------
         1 |    16,602      2,081 |    18,683 
           |      3.25       4.02 |      3.32 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
           |  the exposure status
    Cancer |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   440,614     43,952 |   484,566 
           |     86.16      84.88 |     86.05 
-----------+----------------------+----------
         1 |    70,747      7,832 |    78,579 
           |     13.84      15.12 |     13.95 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Variable indicating
        on |  the exposure status
algorithm) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   507,854     51,350 |   559,204 
           |     99.31      99.16 |     99.30 
-----------+----------------------+----------
         1 |     3,507        434 |     3,941 
           |      0.69       0.84 |      0.70 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Variable indicating
    kidney |  the exposure status
   disease |   non-use  current u |     Total
-----------+----------------------+----------
    No CKD |   445,864     43,493 |   489,357 
           |     87.19      83.99 |     86.90 
-----------+----------------------+----------
       CKD |    65,497      8,291 |    73,788 
           |     12.81      16.01 |     13.10 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
Myocardial |  the exposure status
infarction |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   478,974     50,187 |   529,161 
           |     93.67      96.92 |     93.97 
-----------+----------------------+----------
         1 |    32,387      1,597 |    33,984 
           |      6.33       3.08 |      6.03 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Peripheral |  Variable indicating
  arterial |  the exposure status
   disease |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   496,899     51,365 |   548,264 
           |     97.17      99.19 |     97.36 
-----------+----------------------+----------
         1 |    14,462        419 |    14,881 
           |      2.83       0.81 |      2.64 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Stroke/Tra |
    nsient |  Variable indicating
 ischaemic |  the exposure status
    attack |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   475,177     50,761 |   525,938 
           |     92.92      98.02 |     93.39 
-----------+----------------------+----------
         1 |    36,184      1,023 |    37,207 
           |      7.08       1.98 |      6.61 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Venous |  Variable indicating
thromboemb |  the exposure status
     olism |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   498,413     51,240 |   549,653 
           |     97.47      98.95 |     97.60 
-----------+----------------------+----------
         1 |    12,948        544 |    13,492 
           |      2.53       1.05 |      2.40 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
       Flu |  the exposure status
   vaccine |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   175,500     12,669 |   188,169 
           |     34.32      24.47 |     33.41 
-----------+----------------------+----------
         1 |   335,861     39,115 |   374,976 
           |     65.68      75.53 |     66.59 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Variable indicating
    Recent |  the exposure status
 Oestrogen |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   507,154     51,432 |   558,586 
           |     99.18      99.32 |     99.19 
-----------+----------------------+----------
         1 |     4,207        352 |     4,559 
           |      0.82       0.68 |      0.81 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |  Variable indicating
antiplatel |  the exposure status
        et |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   405,975     49,520 |   455,495 
           |     79.39      95.63 |     80.88 
-----------+----------------------+----------
         1 |   105,386      2,264 |   107,650 
           |     20.61       4.37 |     19.12 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        GP |
consultati |
on in last |  Variable indicating
      year |  the exposure status
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |         0      1,127 |     1,127 
           |      0.00       2.18 |      0.20 
-----------+----------------------+----------
         1 |   511,361     50,657 |   562,018 
           |    100.00      97.82 |     99.80 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       A&E |
attendance |
   rate in |  Variable indicating
 last year |  the exposure status
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |   425,745     37,879 |   463,624 
           |     83.26      73.15 |     82.33 
-----------+----------------------+----------
         1 |    85,616     13,905 |    99,521 
           |     16.74      26.85 |     17.67 
-----------+----------------------+----------
     Total |   511,361     51,784 |   563,145 
           |    100.00     100.00 |    100.00 

. 
. bysort exposure: su gp_consult_count, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs             511,361
25%            3              1       Sum of Wgt.     511,361

50%            6                      Mean           8.266282
                        Largest       Std. Dev.      8.276138
75%           11            300
90%           17            332       Variance       68.49446
95%           22            360       Skewness       4.614139
99%           39            386       Kurtosis       66.69325

-------------------------------------------------------------------------------
-> exposure = current use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%            3              0       Obs              51,784
25%            5              0       Sum of Wgt.      51,784

50%           10                      Mean           12.72706
                        Largest       Std. Dev.      11.55123
75%           16            180
90%           26            184       Variance       133.4309
95%           34            194       Skewness       2.956381
99%           56            198       Kurtosis        20.7754


. bysort exposure: su has_bled_score_ever, detail

-------------------------------------------------------------------------------
-> exposure = non-use

          Ever record of HAS-BLED score in 10 years
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs                 393
25%            1              0       Sum of Wgt.         393

50%            2                      Mean           1.715013
                        Largest       Std. Dev.      1.007727
75%            2              4
90%            3              5       Variance       1.015514
95%            3              5       Skewness       .5327407
99%            4              5       Kurtosis       3.146433

-------------------------------------------------------------------------------
-> exposure = current use

          Ever record of HAS-BLED score in 10 years
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              20,963
25%            1              0       Sum of Wgt.      20,963

50%            1                      Mean           1.313505
                        Largest       Std. Dev.      .8413863
75%            2              9
90%            2              9       Variance       .7079309
95%            3              9       Skewness        .970974
99%            4              9       Kurtosis       6.141462


. bysort exposure: su has_bled_score_recent, detail

-------------------------------------------------------------------------------
-> exposure = non-use

               Recent record of HAS-BLED score
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              1       Obs                  97
25%            1              1       Sum of Wgt.          97

50%            2                      Mean            1.85567
                        Largest       Std. Dev.      .9681349
75%            2              4
90%            3              4       Variance       .9372852
95%            4              4       Skewness        .637555
99%            4              4       Kurtosis       2.643079

-------------------------------------------------------------------------------
-> exposure = current use

               Recent record of HAS-BLED score
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               4,772
25%            1              0       Sum of Wgt.       4,772

50%            1                      Mean           1.297569
                        Largest       Std. Dev.      .6978501
75%            2              4
90%            2              4       Variance       .4869947
95%            3              5       Skewness        .758735
99%            3              5       Kurtosis       4.241255


. bysort exposure: su ae_attendance_count , detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             511,361
25%            0              0       Sum of Wgt.     511,361

50%            0                      Mean            .253101
                        Largest       Std. Dev.      .7554326
75%            0             47
90%            1             50       Variance       .5706785
95%            1             56       Skewness       9.770816
99%            3             70       Kurtosis       376.1514

-------------------------------------------------------------------------------
-> exposure = current use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              51,784
25%            0              0       Sum of Wgt.      51,784

50%            0                      Mean           .4425112
                        Largest       Std. Dev.      1.032325
75%            1             22
90%            1             25       Variance       1.065694
95%            2             43       Skewness       8.140692
99%            4             54       Kurtosis       234.4094


. bysort exposure: su age, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           47             18
 5%           55             18
10%           59             18       Obs             511,361
25%           66             18       Sum of Wgt.     511,361

50%           71                      Mean           70.47858
                        Largest       Std. Dev.      8.926345
75%           75            100
90%           82            100       Variance       79.67964
95%           86            100       Skewness      -.2794198
99%           91            101       Kurtosis       3.868981

-------------------------------------------------------------------------------
-> exposure = current use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           47             18
 5%           55             20
10%           59             23       Obs              51,784
25%           66             23       Sum of Wgt.      51,784

50%           71                      Mean           70.62749
                        Largest       Std. Dev.      9.080468
75%           75            100
90%           83            100       Variance        82.4549
95%           86            100       Skewness      -.2172435
99%           92            100       Kurtosis       3.853825


. bysort exposure: su follow_up_`outcome', detail

-------------------------------------------------------------------------------
-> exposure = non-use

        Number of days (follow-up) for covid hospital
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%           80            1.5
 5%          212            1.5
10%          212            1.5       Obs             511,361
25%          212            1.5       Sum of Wgt.     511,361

50%          212                      Mean            209.583
                        Largest       Std. Dev.       18.9767
75%          212            212
90%          212            212       Variance       360.1151
95%          212            212       Skewness      -8.498754
99%          212            212       Kurtosis       76.96978

-------------------------------------------------------------------------------
-> exposure = current use

        Number of days (follow-up) for covid hospital
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%           66            1.5
 5%          212            1.5
10%          212            1.5       Obs              51,784
25%          212            1.5       Sum of Wgt.      51,784

50%          212                      Mean           209.2054
                        Largest       Std. Dev.      20.30692
75%          212            212
90%          212            212       Variance       412.3711
95%          212            212       Skewness      -7.843509
99%          212            212       Kurtosis        65.7798


. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab `outcome', m
11

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  SUS covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    561,599       99.73       99.73
          1 |      1,546        0.27      100.00
------------+-----------------------------------
      Total |    563,145      100.00

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/03_an_checks_admitcovid.log
  log type:  text
 closed on:   2 Mar 2021, 06:11:07
-------------------------------------------------------------------------------
