-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_onscoviddeath.log
  log type:  text
 opened on:   2 Mar 2021, 06:06:09

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |  outcome: ONS covid
   exposure |         death
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   510,326      1,035 |   511,361 
            |     99.80       0.20 |    100.00 
------------+----------------------+----------
current use |    51,654        130 |    51,784 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Total |   561,980      1,165 |   563,145 
            |     99.79       0.21 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2744.1172
Iteration 1:   log likelihood = -2742.2756
Iteration 2:   log likelihood = -2742.2643
Iteration 3:   log likelihood = -2742.2643
Refining estimates:
Iteration 0:   log likelihood = -2742.2643

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,145                  Number of obs    =     563,145
No. of failures =        1,165
Time at risk    =  117577336.5
                                                LR chi2(1)       =        3.71
Log likelihood  =   -2742.2643                  Prob > chi2      =      0.0542

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.202219   .1123424     1.97   0.049     1.001019    1.443859
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_univar.ster not 
> found)
file /workspace/output/oac_match_tempdata/onscoviddeath_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2744.1172
Iteration 1:   log likelihood = -2738.6417
Iteration 2:   log likelihood = -2738.4585
Iteration 3:   log likelihood = -2738.4584
Refining estimates:
Iteration 0:   log likelihood = -2738.4584

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,145                  Number of obs    =     563,145
No. of failures =        1,165
Time at risk    =  117577336.5
                                                LR chi2(4)       =       11.32
Log likelihood  =   -2738.4584                  Prob > chi2      =      0.0232

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.70903   .2927296     3.13   0.002     1.221666    2.390821
      1.male |          1  (omitted)
        age1 |   .6423284   .1077204    -2.64   0.008     .4623896    .8922904
        age2 |   1.266476   .1299034     2.30   0.021      1.03583    1.548479
        age3 |   .8849723   .1703026    -0.64   0.525     .6069122    1.290427
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1.ster n
> ot found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2744.1172
Iteration 1:   log likelihood = -2600.2274
Iteration 2:   log likelihood = -2593.0134
Iteration 3:   log likelihood = -2593.0119
Refining estimates:
Iteration 0:   log likelihood = -2593.0119

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,145                  Number of obs    =     563,145
No. of failures =        1,165
Time at risk    =  117577336.5
                                                LR chi2(25)      =      302.21
Log likelihood  =   -2593.0119                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.757409   .3054582     3.24   0.001     1.250041    2.470709
      1.male |          1  (omitted)
        age1 |   .7522484   .1274004    -1.68   0.093     .5397619    1.048384
        age2 |   1.206004    .125041     1.81   0.071     .9842252    1.477757
        age3 |   .7568558   .1517028    -1.39   0.165     .5109752    1.121054
             |
         imd |
          2  |   1.038792   .1177667     0.34   0.737     .8318189    1.297264
          3  |   1.222797   .1395455     1.76   0.078     .9777216    1.529302
          4  |   1.227404   .1461718     1.72   0.085     .9718915    1.550091
5 most de..  |   1.987929   .2412093     5.66   0.000     1.567179     2.52164
             |
   obese4cat |
Obese I ..)  |   1.143587   .0974021     1.58   0.115      .967766    1.351351
Obese II..)  |   1.668145   .2271035     3.76   0.000     1.277468    2.178299
Obese II..)  |   1.838826   .4071485     2.75   0.006     1.191433    2.837995
             |
smoke_nomiss |
     Former  |    1.32098   .0990192     3.71   0.000     1.140489    1.530034
    Current  |    1.02284   .1454136     0.16   0.874     .7740973    1.351513
             |
     diabcat |
Controlle..  |   1.350959   .1112853     3.65   0.000     1.149541    1.587669
Uncontrol..  |   1.784834   .1917612     5.39   0.000     1.445924    2.203181
Diabetes,..  |   1.396649   .7569447     0.62   0.538     .4827916     4.04031
             |
1.myocardi~t |   1.375991   .1466575     2.99   0.003     1.116586    1.695663
       1.pad |   1.708014   .2226146     4.11   0.000      1.32297    2.205125
1.hyperten~n |   .9055248   .0636571    -1.41   0.158     .7889728    1.039294
1.heart_f~re |   1.366809   .1626977     2.63   0.009     1.082394    1.725959
1.stroke_tia |   2.219458   .2038732     8.68   0.000     1.853779    2.657272
       1.vte |   1.598793   .2279144     3.29   0.001     1.209066    2.114143
 1.oestrogen |   1.562438   .8675253     0.80   0.422     .5262389    4.638979
1.antiplat~t |   .8911553   .0758138    -1.35   0.176     .7542904    1.052854
1.flu_vac~ne |   1.014856   .0819892     0.18   0.855     .8662373    1.188974
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2.ster n
> ot found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2744.1172
Iteration 1:   log likelihood = -2454.8295
Iteration 2:   log likelihood = -2442.9121
Iteration 3:   log likelihood = -2442.8942
Refining estimates:
Iteration 0:   log likelihood = -2442.8942

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      563,145                  Number of obs    =     563,145
No. of failures =        1,165
Time at risk    =  117577336.5
                                                LR chi2(32)      =      602.45
Log likelihood  =   -2442.8942                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.487849   .2640525     2.24   0.025     1.050737    2.106803
      1.male |          1  (omitted)
        age1 |   .7294163    .126144    -1.82   0.068     .5197208    1.023719
        age2 |   1.236225   .1322719     1.98   0.047     1.002356    1.524661
        age3 |   .7237097   .1507114    -1.55   0.120     .4811749    1.088493
             |
         imd |
          2  |   1.015626   .1169869     0.13   0.893     .8103753    1.272861
          3  |     1.1573   .1344763     1.26   0.209     .9215899    1.453296
          4  |   1.130824   .1374518     1.01   0.312     .8911101    1.435022
5 most de..  |   1.731594   .2148955     4.42   0.000     1.357718    2.208424
             |
   obese4cat |
Obese I ..)  |   1.157614   .1008483     1.68   0.093     .9759086     1.37315
Obese II..)  |   1.702092   .2378943     3.81   0.000     1.294238    2.238473
Obese II..)  |   1.668711   .3852488     2.22   0.027     1.061372    2.623582
             |
smoke_nomiss |
     Former  |   1.225185   .0947736     2.63   0.009     1.052828    1.425759
    Current  |   .9137634   .1340201    -0.61   0.539     .6854716    1.218086
             |
     diabcat |
Controlle..  |   1.282575   .1086383     2.94   0.003     1.086383    1.514197
Uncontrol..  |    1.74499   .1931574     5.03   0.000      1.40466    2.167777
Diabetes,..  |   1.397292   .7699343     0.61   0.544     .4745251    4.114483
             |
1.myocardi~t |   1.249971   .1355978     2.06   0.040     1.010557    1.546104
       1.pad |   1.579194   .2126651     3.39   0.001     1.212849    2.056194
1.hyperten~n |    .903304   .0649716    -1.41   0.157     .7845307    1.040059
1.heart_f~re |   1.168043   .1434295     1.26   0.206     .9181964    1.485873
1.stroke_tia |    1.99323   .1881446     7.31   0.000     1.656574    2.398302
       1.vte |   1.415629   .2071478     2.38   0.018     1.062659    1.885841
 1.oestrogen |   1.427118   .8067043     0.63   0.529     .4713055    4.321326
1.antiplat~t |   .8381148   .0723569    -2.05   0.041     .7076472    .9926365
1.flu_vac~ne |    1.00299   .0826985     0.04   0.971     .8533227    1.178908
             |
         ckd |
        CKD  |    1.32027   .1001732     3.66   0.000     1.137835    1.531956
      1.copd |   1.293423   .1228751     2.71   0.007     1.073684    1.558133
1.other_re~y |    1.72485   .2106517     4.46   0.000     1.357677    2.191324
1.immunode~y |   1.952978   .5674527     2.30   0.021     1.105031      3.4516
    1.cancer |   1.151039   .0899874     1.80   0.072      .987515    1.341641
1.ae_atten~r |   2.791584   .1917712    14.94   0.000     2.439924    3.193927
1.gp_consult |   .2875009   .1614841    -2.22   0.026     .0956169     .864458
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3.ster n
> ot found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table2_onscoviddeath.txt not fou
> nd)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.202219   .1123424     1.97   0.049     1.001019    1.443859
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.70903   .2927296     3.13   0.002     1.221666    2.390821
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.757409   .3054582     3.24   0.001     1.250041    2.470709
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.487849   .2640525     2.24   0.025     1.050737    2.106803
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/05c_an_models_onscoviddeath.log
  log type:  text
 closed on:   2 Mar 2021, 06:08:18
-------------------------------------------------------------------------------
