-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_onscovidde
> ath.log
  log type:  text
 opened on:  31 Dec 2020, 11:24:26

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(132,325 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |  outcome: ONS covid
   exposure |         death
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   391,639        748 |   392,387 
            |     99.81       0.19 |    100.00 
------------+----------------------+----------
current use |    38,319         92 |    38,411 
            |     99.76       0.24 |    100.00 
------------+----------------------+----------
      Total |   429,958        840 |   430,798 
            |     99.81       0.19 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1778.5814
Iteration 1:   log likelihood = -1776.9387
Iteration 2:   log likelihood = -1776.9271
Iteration 3:   log likelihood = -1776.9271
Refining estimates:
Iteration 0:   log likelihood = -1776.9271

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =          840
Time at risk    =   90010265.5
                                                LR chi2(1)       =        3.31
Log likelihood  =   -1776.9271                  Prob > chi2      =      0.0689

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.235762    .140289     1.86   0.062     .9892423    1.543714
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_univar_ethn.ster
>  not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1778.5814
Iteration 1:   log likelihood = -1774.6194
Iteration 2:   log likelihood = -1774.4551
Iteration 3:   log likelihood =  -1774.455
Refining estimates:
Iteration 0:   log likelihood =  -1774.455

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =          840
Time at risk    =   90010265.5
                                                LR chi2(4)       =        8.25
Log likelihood  =    -1774.455                  Prob > chi2      =      0.0827

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.624454   .3283689     2.40   0.016     1.093062    2.414183
      1.male |          1  (omitted)
        age1 |   .6754698   .1354731    -1.96   0.050     .4559192    1.000746
        age2 |   1.313451   .1617634     2.21   0.027     1.031765    1.672042
        age3 |   .7483266   .1760679    -1.23   0.218      .471866    1.186762
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1_ethn.s
> ter not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1_ethn.ster sav
> ed

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1778.5814
Iteration 1:   log likelihood = -1656.1043
Iteration 2:   log likelihood = -1651.3494
Iteration 3:   log likelihood = -1651.3479
Refining estimates:
Iteration 0:   log likelihood = -1651.3479

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =          840
Time at risk    =   90010265.5
                                                LR chi2(29)      =      254.47
Log likelihood  =   -1651.3479                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.557272   .3220253     2.14   0.032     1.038355    2.335516
      1.male |          1  (omitted)
        age1 |   .8711003   .1778717    -0.68   0.499     .5837939    1.299801
        age2 |   1.181986   .1481555     1.33   0.182     .9245255    1.511144
        age3 |   .6042924   .1491071    -2.04   0.041      .372577    .9801176
             |
         imd |
          2  |   1.190718   .1732105     1.20   0.230     .8953381    1.583547
          3  |    1.20001   .1737813     1.26   0.208      .903476     1.59387
          4  |   1.543191   .2287227     2.93   0.003     1.154142    2.063382
5 most de..  |   2.001841   .3027002     4.59   0.000     1.488396    2.692406
             |
   obese4cat |
Obese I ..)  |   1.090688   .1102838     0.86   0.391     .8946068    1.329747
Obese II..)  |   1.511533   .2459763     2.54   0.011     1.098751    2.079391
Obese II..)  |   2.108124   .5448131     2.89   0.004     1.270328    3.498457
             |
smoke_nomiss |
     Former  |   1.592909   .1524293     4.87   0.000     1.320497    1.921518
    Current  |   1.120112   .1949039     0.65   0.514     .7964324    1.575338
             |
     diabcat |
Controlle..  |   1.580814   .1564307     4.63   0.000     1.302115    1.919164
Uncontrol..  |     2.2364   .2801912     6.42   0.000     1.749465    2.858866
Diabetes,..  |   1.599168   1.323134     0.57   0.570     .3159505    8.094109
             |
1.myocardi~t |   1.238844   .1633462     1.62   0.104     .9567149    1.604171
       1.pad |   1.370661   .2278643     1.90   0.058     .9895157    1.898616
1.hyperten~n |     1.0861    .093524     0.96   0.337     .9174304    1.285781
1.heart_f~re |   1.697293    .234058     3.84   0.000     1.295316    2.224017
1.stroke_tia |   1.921612   .2193243     5.72   0.000     1.536432    2.403356
       1.vte |   1.472014   .2760703     2.06   0.039     1.019231    2.125942
 1.oestrogen |    1.66576   1.324862     0.64   0.521      .350437    7.917994
1.antiplat~t |   .8740097   .0894289    -1.32   0.188     .7151895    1.068099
1.flu_vac~ne |   1.001631   .0982038     0.02   0.987     .8265182    1.213844
             |
   ethnicity |
      Mixed  |   .5069754   .3782892    -0.91   0.363     .1174483    2.188401
Asian or ..  |   1.804132   .3724527     2.86   0.004     1.203768    2.703921
      Black  |   1.688684   .4758222     1.86   0.063      .972086    2.933542
      Other  |   .9727371   .4402174    -0.06   0.951     .4006634    2.361627
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_ethn.s
> ter not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_ethn.ster sav
> ed

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1778.5814
Iteration 1:   log likelihood = -1661.4121
Iteration 2:   log likelihood =  -1656.918
Iteration 3:   log likelihood = -1656.9166
Refining estimates:
Iteration 0:   log likelihood = -1656.9166

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =          840
Time at risk    =   90010265.5
                                                LR chi2(25)      =      243.33
Log likelihood  =   -1656.9166                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.503845   .3094709     1.98   0.047     1.004702    2.250965
      1.male |          1  (omitted)
        age1 |   .8846932   .1800502    -0.60   0.547     .5936885    1.318338
        age2 |   1.173536   .1470387     1.28   0.202     .9180045    1.500196
        age3 |   .5954915   .1469444    -2.10   0.036       .36714    .9658715
             |
         imd |
          2  |   1.182603   .1722773     1.15   0.250     .8888713    1.573399
          3  |   1.197781   .1733332     1.25   0.212     .9019834    1.590584
          4  |   1.538822   .2281518     2.91   0.004     1.150763    2.057742
5 most de..  |   2.014056   .3045102     4.63   0.000     1.497533    2.708737
             |
   obese4cat |
Obese I ..)  |   1.067674   .1076327     0.65   0.516     .8762511    1.300914
Obese II..)  |   1.487611   .2412971     2.45   0.014     1.082482    2.044363
Obese II..)  |   2.031408   .5236357     2.75   0.006     1.225697    3.366753
             |
smoke_nomiss |
     Former  |   1.536749   .1452998     4.54   0.000     1.276796    1.849626
    Current  |   1.065972   .1839758     0.37   0.711     .7600412    1.495046
             |
     diabcat |
Controlle..  |   1.624136    .159313     4.94   0.000     1.340069    1.968419
Uncontrol..  |   2.351806   .2905995     6.92   0.000     1.845964    2.996261
Diabetes,..  |   1.570273   1.297621     0.55   0.585     .3108641    7.931944
             |
1.myocardi~t |    1.24319   .1636986     1.65   0.098     .9604051    1.609239
       1.pad |   1.365514    .226723     1.88   0.061     .9862047    1.890712
1.hyperten~n |   1.098014   .0943516     1.09   0.277     .9278217    1.299424
1.heart_f~re |   1.727679    .237746     3.97   0.000     1.319256    2.262543
1.stroke_tia |   1.932821   .2201687     5.79   0.000     1.546076    2.416309
       1.vte |    1.46925   .2752588     2.05   0.040     1.017715     2.12112
 1.oestrogen |   1.596494   1.266035     0.59   0.555     .3374088    7.554021
1.antiplat~t |    .872022    .089024    -1.34   0.180     .7138862    1.065187
1.flu_vac~ne |   .9969647   .0975922    -0.03   0.975     .8229173    1.207823
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_withou
> tethn.ster not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_withoutethn.s
> ter saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1778.5814
Iteration 1:   log likelihood = -1552.8181
Iteration 2:   log likelihood = -1545.4826
Iteration 3:   log likelihood = -1545.4714
Iteration 4:   log likelihood = -1545.4714
Refining estimates:
Iteration 0:   log likelihood = -1545.4714

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =          840
Time at risk    =   90010265.5
                                                LR chi2(36)      =      466.22
Log likelihood  =   -1545.4714                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.394745   .3012355     1.54   0.123     .9133836    2.129788
      1.male |          1  (omitted)
        age1 |   .8313887   .1731833    -0.89   0.375     .5527054    1.250589
        age2 |   1.203384   .1544949     1.44   0.149     .9356728    1.547693
        age3 |    .583386   .1479113    -2.13   0.034     .3549302    .9588906
             |
         imd |
          2  |   1.103047   .1643776     0.66   0.510     .8236579    1.477207
          3  |   1.085112   .1610286     0.55   0.582     .8112556    1.451414
          4  |   1.370867   .2096445     2.06   0.039     1.015834    1.849985
5 most de..  |   1.731945   .2695961     3.53   0.000     1.276543    2.349811
             |
   obese4cat |
Obese I ..)  |   1.157014   .1209481     1.40   0.163     .9426672    1.420099
Obese II..)  |    1.65565   .2791511     2.99   0.003     1.189739    2.304016
Obese II..)  |   2.081773   .5604578     2.72   0.006     1.228208     3.52854
             |
smoke_nomiss |
     Former  |    1.49229   .1478113     4.04   0.000     1.228972    1.812028
    Current  |   1.027228   .1839674     0.15   0.881     .7231427    1.459182
             |
     diabcat |
Controlle..  |   1.527886   .1557811     4.16   0.000     1.251134    1.865857
Uncontrol..  |   2.021926   .2633641     5.41   0.000     1.566364    2.609983
Diabetes,..  |   1.369615   1.153666     0.37   0.709     .2627888    7.138225
             |
1.myocardi~t |   1.195436   .1617358     1.32   0.187      .916988    1.558437
       1.pad |   1.308745   .2245207     1.57   0.117     .9350351    1.831818
1.hyperten~n |   1.092446   .0967812     1.00   0.318     .9183137    1.299598
1.heart_f~re |   1.330265   .1925931     1.97   0.049      1.00162    1.766743
1.stroke_tia |   1.745074   .2061345     4.71   0.000     1.384417    2.199687
       1.vte |   1.336221   .2579126     1.50   0.133       .91534    1.950627
 1.oestrogen |   1.648162   1.292798     0.64   0.524     .3542645    7.667822
1.antiplat~t |   .8276733   .0869298    -1.80   0.072     .6736867    1.016857
1.flu_vac~ne |    .975681   .0985138    -0.24   0.807     .8005024    1.189195
             |
         ckd |
        CKD  |   1.380273   .1272025     3.50   0.000      1.15218     1.65352
      1.copd |   1.165481   .1330408     1.34   0.180     .9318361    1.457708
1.other_re~y |    2.12837   .3029504     5.31   0.000      1.61023    2.813238
1.immunode~y |   1.430322   .5512753     0.93   0.353     .6719911    3.044418
    1.cancer |   1.381146   .1299788     3.43   0.001     1.148507    1.660909
1.ae_atten~r |   2.622696   .2199371    11.50   0.000     2.225189    3.091214
1.gp_consult |   .3579611   .2709504    -1.36   0.175     .0811967    1.578096
             |
   ethnicity |
      Mixed  |     .56766   .4262271    -0.75   0.451     .1303059    2.472933
Asian or ..  |   1.966298   .4232682     3.14   0.002     1.289491    2.998336
      Black  |   1.792159   .5228471     2.00   0.046     1.011686    3.174734
      Other  |    1.01772   .4786357     0.04   0.970     .4048617    2.558292
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_ethn.s
> ter not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_ethn.ster sav
> ed

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1778.5814
Iteration 1:   log likelihood = -1559.0047
Iteration 2:   log likelihood = -1551.7859
Iteration 3:   log likelihood = -1551.7743
Iteration 4:   log likelihood = -1551.7743
Refining estimates:
Iteration 0:   log likelihood = -1551.7743

Stratified Cox regr. -- no ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =          840
Time at risk    =   90010265.5
                                                LR chi2(32)      =      453.61
Log likelihood  =   -1551.7743                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.346034   .2889557     1.38   0.166     .8837451    2.050148
      1.male |          1  (omitted)
        age1 |   .8432269   .1748776    -0.82   0.411     .5615818    1.266123
        age2 |   1.198592   .1535597     1.41   0.157     .9324339    1.540722
        age3 |   .5727679   .1450494    -2.20   0.028     .3486727    .9408911
             |
         imd |
          2  |    1.09784   .1639615     0.63   0.532     .8192436    1.471179
          3  |   1.086873   .1611377     0.56   0.574     .8127959    1.453371
          4  |   1.374497   .2101643     2.08   0.037     1.018575     1.85479
5 most de..  |   1.752005   .2726293     3.60   0.000     1.291457    2.376789
             |
   obese4cat |
Obese I ..)  |   1.128855   .1175618     1.16   0.244     .9204324    1.384473
Obese II..)  |   1.619588   .2722421     2.87   0.004     1.164993    2.251572
Obese II..)  |   1.999638   .5369506     2.58   0.010     1.181363    3.384693
             |
smoke_nomiss |
     Former  |   1.434256    .140458     3.68   0.000     1.183771    1.737743
    Current  |   .9719371   .1727069    -0.16   0.873     .6860965    1.376864
             |
     diabcat |
Controlle..  |   1.569117   .1588641     4.45   0.000     1.286696    1.913527
Uncontrol..  |   2.143264   .2749744     5.94   0.000     1.666745     2.75602
Diabetes,..  |   1.353021   1.138735     0.36   0.719      .259964    7.042001
             |
1.myocardi~t |   1.195913     .16145     1.33   0.185     .9178801    1.558163
       1.pad |   1.310743   .2242693     1.58   0.114     .9372947    1.832985
1.hyperten~n |   1.105556   .0977046     1.14   0.256     .9297262    1.314639
1.heart_f~re |   1.361531   .1965598     2.14   0.033     1.025989    1.806811
1.stroke_tia |   1.753298   .2067208     4.76   0.000      1.39154    2.209102
       1.vte |   1.333322   .2574986     1.49   0.136     .9131586    1.946811
 1.oestrogen |   1.567166   1.227184     0.57   0.566     .3377333     7.27204
1.antiplat~t |   .8284314    .086807    -1.80   0.072     .6746268    1.017301
1.flu_vac~ne |   .9683915   .0976175    -0.32   0.750     .7947795    1.179927
             |
         ckd |
        CKD  |   1.380984   .1269242     3.51   0.000     1.153336    1.653565
      1.copd |   1.158897   .1319297     1.30   0.195     .9271356    1.448592
1.other_re~y |    2.12411   .3021761     5.30   0.000     1.607256    2.807172
1.immunode~y |   1.543447    .584441     1.15   0.252      .734812    3.241958
    1.cancer |   1.375734   .1292469     3.40   0.001     1.144369    1.653875
1.ae_atten~r |   2.598972    .217286    11.42   0.000     2.206161    3.061723
1.gp_consult |    .377619   .2866256    -1.28   0.199     .0853027    1.671647
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_withou
> tethn.ster not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_withoutethn.s
> ter saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table3_onscoviddeath.txt not fou
> nd)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    392,387    8.20e+07           0   8.20e+07   8.20e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,411     8018490           0    8018490    8018490

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.235762    .140289     1.86   0.062     .9892423    1.543714
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.624454   .3283689     2.40   0.016     1.093062    2.414183
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.557272   .3220253     2.14   0.032     1.038355    2.335516
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.503845   .3094709     1.98   0.047     1.004702    2.250965
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.394745   .3012355     1.54   0.123     .9133836    2.129788
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.346034   .2889557     1.38   0.166     .8837451    2.050148
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_onscovidde
> ath.log
  log type:  text
 closed on:  31 Dec 2020, 11:27:39
-------------------------------------------------------------------------------
