-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_onscovidde
> ath.log
  log type:  text
 opened on:   2 Mar 2021, 06:06:50

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(129,383 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |  outcome: ONS covid
   exposure |         death
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   394,272        754 |   395,026 
            |     99.81       0.19 |    100.00 
------------+----------------------+----------
current use |    38,644         92 |    38,736 
            |     99.76       0.24 |    100.00 
------------+----------------------+----------
      Total |   432,916        846 |   433,762 
            |     99.80       0.20 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1780.4987
Iteration 1:   log likelihood =  -1778.935
Iteration 2:   log likelihood = -1778.9244
Iteration 3:   log likelihood = -1778.9244
Refining estimates:
Iteration 0:   log likelihood = -1778.9244

Stratified Cox regr. -- no ties

No. of subjects =      433,762                  Number of obs    =     433,762
No. of failures =          846
Time at risk    =     90635073
                                                LR chi2(1)       =        3.15
Log likelihood  =   -1778.9244                  Prob > chi2      =      0.0760

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.23065   .1404869     1.82   0.069       .98393    1.539235
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_univar_ethn.ster
>  not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1780.4987
Iteration 1:   log likelihood = -1776.4524
Iteration 2:   log likelihood = -1776.2982
Iteration 3:   log likelihood = -1776.2981
Refining estimates:
Iteration 0:   log likelihood = -1776.2981

Stratified Cox regr. -- no ties

No. of subjects =      433,762                  Number of obs    =     433,762
No. of failures =          846
Time at risk    =     90635073
                                                LR chi2(4)       =        8.40
Log likelihood  =   -1776.2981                  Prob > chi2      =      0.0779

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.667641   .3393154     2.51   0.012     1.119201     2.48483
      1.male |          1  (omitted)
        age1 |   .6616679   .1319081    -2.07   0.038     .4476588    .9779867
        age2 |   1.321871   .1643766     2.24   0.025     1.035955    1.686697
        age3 |   .7636648   .1803928    -1.14   0.254     .4806535    1.213315
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1_ethn.s
> ter not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar1_ethn.ster sav
> ed

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1780.4987
Iteration 1:   log likelihood =  -1648.719
Iteration 2:   log likelihood = -1643.7377
Iteration 3:   log likelihood = -1643.7363
Refining estimates:
Iteration 0:   log likelihood = -1643.7363

Stratified Cox regr. -- no ties

No. of subjects =      433,762                  Number of obs    =     433,762
No. of failures =          846
Time at risk    =     90635073
                                                LR chi2(29)      =      273.52
Log likelihood  =   -1643.7363                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.668964    .349058     2.45   0.014     1.107698    2.514623
      1.male |          1  (omitted)
        age1 |   .8406743   .1710002    -0.85   0.394      .564269    1.252476
        age2 |   1.211959   .1529165     1.52   0.128     .9464313    1.551981
        age3 |   .6639902   .1636305    -1.66   0.097     .4096338    1.076286
             |
         imd |
          2  |    1.04081   .1496762     0.28   0.781     .7851672    1.379686
          3  |   1.182025   .1701886     1.16   0.245     .8913955    1.567412
          4  |    1.29251    .190283     1.74   0.081     .9685464    1.724836
5 most de..  |   1.948986   .2918162     4.46   0.000     1.453318    2.613706
             |
   obese4cat |
Obese I ..)  |   1.047791   .1081655     0.45   0.651     .8558611    1.282761
Obese II..)  |   1.760621   .2815748     3.54   0.000     1.286868    2.408784
Obese II..)  |   1.917886   .4907104     2.55   0.011      1.16154    3.166732
             |
smoke_nomiss |
     Former  |   1.590468   .1520946     4.85   0.000     1.318637    1.918334
    Current  |    1.39533   .2284989     2.03   0.042     1.012242      1.9234
             |
     diabcat |
Controlle..  |   1.417907   .1412787     3.50   0.000     1.166366    1.723695
Uncontrol..  |   1.876886   .2456228     4.81   0.000     1.452257    2.425673
Diabetes,..  |   1.494895   .9660437     0.62   0.534     .4212501    5.304951
             |
1.myocardi~t |   1.307384   .1716841     2.04   0.041     1.010705    1.691149
       1.pad |    1.93792   .3129608     4.10   0.000     1.412124    2.659495
1.hyperten~n |   .9376187   .0807952    -0.75   0.455     .7919133    1.110133
1.heart_f~re |   1.502045   .2185733     2.80   0.005     1.129324    1.997779
1.stroke_tia |   2.422761   .2730531     7.85   0.000     1.942573    3.021647
       1.vte |   1.589587   .2793441     2.64   0.008     1.126417    2.243206
 1.oestrogen |   2.991851   1.857708     1.76   0.078     .8859511    10.10346
1.antiplat~t |   .7906802   .0828897    -2.24   0.025      .643823    .9710359
1.flu_vac~ne |   .9727289   .0939046    -0.29   0.775      .805043    1.175343
             |
   ethnicity |
      Mixed  |   1.102809   .7001165     0.15   0.877     .3177726    3.827227
Asian or ..  |   2.046567   .4458323     3.29   0.001     1.335355    3.136571
      Black  |   1.894124   .5515807     2.19   0.028     1.070368    3.351843
      Other  |   3.033301   1.154369     2.92   0.004     1.438725    6.395186
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_ethn.s
> ter not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_ethn.ster sav
> ed

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1780.4987
Iteration 1:   log likelihood = -1658.0721
Iteration 2:   log likelihood = -1653.0286
Iteration 3:   log likelihood = -1653.0275
Refining estimates:
Iteration 0:   log likelihood = -1653.0275

Stratified Cox regr. -- no ties

No. of subjects =      433,762                  Number of obs    =     433,762
No. of failures =          846
Time at risk    =     90635073
                                                LR chi2(25)      =      254.94
Log likelihood  =   -1653.0275                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.62526   .3376258     2.34   0.019     1.081676    2.442016
      1.male |          1  (omitted)
        age1 |   .8466531   .1717963    -0.82   0.412     .5688349    1.260157
        age2 |   1.213945   .1533353     1.53   0.125     .9477254    1.554947
        age3 |   .6530532    .160929    -1.73   0.084     .4028939    1.058538
             |
         imd |
          2  |   1.028858    .147871     0.20   0.843     .7762792    1.363619
          3  |   1.169844   .1682235     1.09   0.275     .8825213     1.55071
          4  |   1.287501   .1893856     1.72   0.086     .9650271    1.717732
5 most de..  |   1.944537   .2905942     4.45   0.000     1.450813    2.606278
             |
   obese4cat |
Obese I ..)  |   1.034114   .1065947     0.33   0.745     .8449446    1.265637
Obese II..)  |   1.703032   .2704109     3.35   0.001     1.247577    2.324762
Obese II..)  |   1.895035   .4828544     2.51   0.012     1.150088    3.122505
             |
smoke_nomiss |
     Former  |   1.527422   .1443658     4.48   0.000     1.269133    1.838278
    Current  |   1.350489   .2194595     1.85   0.064     .9821272    1.857011
             |
     diabcat |
Controlle..  |   1.462393   .1446795     3.84   0.000     1.204625    1.775319
Uncontrol..  |   2.009813   .2583097     5.43   0.000     1.562268    2.585566
Diabetes,..  |    1.48148   .9535612     0.61   0.541     .4195812    5.230889
             |
1.myocardi~t |   1.298881   .1702505     2.00   0.046     1.004612    1.679347
       1.pad |   1.924602   .3095098     4.07   0.000     1.404277    2.637723
1.hyperten~n |   .9520892   .0818291    -0.57   0.568     .8044879    1.126771
1.heart_f~re |   1.519066   .2204885     2.88   0.004     1.142949    2.018953
1.stroke_tia |   2.435154   .2734636     7.93   0.000     1.954061    3.034694
       1.vte |   1.599231   .2802133     2.68   0.007     1.134399    2.254533
 1.oestrogen |   2.958454   1.839402     1.74   0.081     .8746512    10.00679
1.antiplat~t |   .7909916   .0825983    -2.25   0.025      .644594    .9706384
1.flu_vac~ne |   .9727328   .0937364    -0.29   0.774     .8053198    1.174948
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_withou
> tethn.ster not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar2_withoutethn.s
> ter saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1780.4987
Iteration 1:   log likelihood = -1539.7677
Iteration 2:   log likelihood = -1532.8718
Iteration 3:   log likelihood =  -1532.857
Refining estimates:
Iteration 0:   log likelihood =  -1532.857

Stratified Cox regr. -- no ties

No. of subjects =      433,762                  Number of obs    =     433,762
No. of failures =          846
Time at risk    =     90635073
                                                LR chi2(36)      =      495.28
Log likelihood  =    -1532.857                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.466393   .3143088     1.79   0.074     .9633908     2.23202
      1.male |          1  (omitted)
        age1 |   .7796333   .1613866    -1.20   0.229     .5196236    1.169747
        age2 |   1.263547   .1621591     1.82   0.068     .9825423    1.624918
        age3 |   .6144159   .1557965    -1.92   0.055     .3737874    1.009951
             |
         imd |
          2  |   .9634142   .1411297    -0.25   0.799     .7229716    1.283822
          3  |    1.07236   .1576158     0.48   0.635     .8039529    1.430376
          4  |   1.141745   .1728605     0.88   0.381     .8485881    1.536177
5 most de..  |   1.605958   .2471195     3.08   0.002      1.18783    2.171273
             |
   obese4cat |
Obese I ..)  |   1.090043   .1157352     0.81   0.417     .8852535    1.342209
Obese II..)  |   1.811592   .2986704     3.60   0.000     1.311372    2.502619
Obese II..)  |   1.726903   .4662734     2.02   0.043     1.017276    2.931548
             |
smoke_nomiss |
     Former  |   1.436927   .1425289     3.65   0.000     1.183052    1.745281
    Current  |   1.179622   .2017264     0.97   0.334     .8436833    1.649325
             |
     diabcat |
Controlle..  |    1.36548   .1406057     3.03   0.002     1.115927     1.67084
Uncontrol..  |   1.798542   .2453049     4.30   0.000     1.376653    2.349724
Diabetes,..  |   1.579724   1.022108     0.71   0.480     .4444671    5.614653
             |
1.myocardi~t |    1.19173   .1606777     1.30   0.193     .9149824    1.552184
       1.pad |    1.78602   .3018358     3.43   0.001     1.282431     2.48736
1.hyperten~n |   .9340333   .0831232    -0.77   0.443      .784532    1.112024
1.heart_f~re |   1.187772    .180566     1.13   0.258     .8817242    1.600049
1.stroke_tia |   2.181867   .2563315     6.64   0.000     1.733113    2.746817
       1.vte |   1.440465   .2623406     2.00   0.045     1.008046    2.058379
 1.oestrogen |   2.883496   1.786808     1.71   0.087     .8559685    9.713618
1.antiplat~t |   .7428699   .0802653    -2.75   0.006     .6010941    .9180852
1.flu_vac~ne |   .9372325   .0935115    -0.65   0.516     .7707607     1.13966
             |
         ckd |
        CKD  |    1.36592    .129178     3.30   0.001     1.134815    1.644088
      1.copd |   1.415669   .1588491     3.10   0.002     1.136188    1.763896
1.other_re~y |   1.978736   .2894695     4.67   0.000     1.485475    2.635787
1.immunode~y |   1.390685   .5305676     0.86   0.387     .6583886    2.937482
    1.cancer |   1.338571   .1280428     3.05   0.002     1.109733    1.614598
1.ae_atten~r |   2.761778    .234533    11.96   0.000     2.338319    3.261922
1.gp_consult |   .2684486   .2035172    -1.73   0.083     .0607499    1.186252
             |
   ethnicity |
      Mixed  |   1.260416    .806828     0.36   0.718     .3594478    4.419693
Asian or ..  |   2.120293   .4809328     3.31   0.001     1.359325    3.307262
      Black  |   2.103636    .640881     2.44   0.015     1.157841    3.822016
      Other  |   3.275066   1.283012     3.03   0.002     1.519709    7.057965
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_ethn.s
> ter not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_ethn.ster sav
> ed

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1780.4987
Iteration 1:   log likelihood = -1550.1632
Iteration 2:   log likelihood = -1542.8866
Iteration 3:   log likelihood = -1542.8703
Refining estimates:
Iteration 0:   log likelihood = -1542.8703

Stratified Cox regr. -- no ties

No. of subjects =      433,762                  Number of obs    =     433,762
No. of failures =          846
Time at risk    =     90635073
                                                LR chi2(32)      =      475.26
Log likelihood  =   -1542.8703                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.419443   .3029447     1.64   0.101     .9342226     2.15668
      1.male |          1  (omitted)
        age1 |   .7892976   .1629734    -1.15   0.252     .5266057    1.183031
        age2 |   1.267254   .1628189     1.84   0.065     .9851442    1.630149
        age3 |   .6021987   .1526374    -2.00   0.045     .3664278    .9896718
             |
         imd |
          2  |   .9563511   .1399327    -0.31   0.760     .7179102    1.273986
          3  |   1.066859   .1565107     0.44   0.659     .8002648    1.422264
          4  |   1.145442   .1731743     0.90   0.369     .8516942    1.540503
5 most de..  |   1.618743   .2483904     3.14   0.002     1.198295    2.186713
             |
   obese4cat |
Obese I ..)  |   1.070071   .1133316     0.64   0.523     .8694844    1.316933
Obese II..)  |   1.751799   .2872062     3.42   0.001      1.27037    2.415673
Obese II..)  |   1.681315   .4536506     1.93   0.054     .9907837    2.853116
             |
smoke_nomiss |
     Former  |   1.384425   .1358915     3.31   0.001     1.142136    1.678113
    Current  |   1.149997   .1948991     0.82   0.410     .8249679    1.603086
             |
     diabcat |
Controlle..  |   1.404695   .1438326     3.32   0.001     1.149275     1.71688
Uncontrol..  |   1.927243   .2576256     4.91   0.000     1.483036    2.504503
Diabetes,..  |   1.554131   1.003256     0.68   0.495     .4385319    5.507744
             |
1.myocardi~t |   1.173275    .157794     1.19   0.235     .9014081    1.527137
       1.pad |   1.778205   .2997668     3.41   0.001     1.277873    2.474434
1.hyperten~n |   .9490631   .0841936    -0.59   0.556      .797596    1.129294
1.heart_f~re |   1.210217    .183405     1.26   0.208     .8992206    1.628773
1.stroke_tia |     2.1851   .2555263     6.68   0.000     1.737527    2.747965
       1.vte |   1.449601    .263252     2.04   0.041     1.015471    2.069328
 1.oestrogen |   2.853234   1.769089     1.69   0.091     .8463843    9.618498
1.antiplat~t |   .7447792   .0800564    -2.74   0.006     .6032978    .9194399
1.flu_vac~ne |    .936491   .0932516    -0.66   0.510     .7704505    1.138315
             |
         ckd |
        CKD  |   1.377752   .1299411     3.40   0.001     1.145225    1.657491
      1.copd |   1.401501   .1567076     3.02   0.003     1.125685    1.744897
1.other_re~y |    1.96109   .2857998     4.62   0.000      1.47383    2.609441
1.immunode~y |   1.458875   .5426763     1.02   0.310     .7036971    3.024477
    1.cancer |   1.337546   .1276116     3.05   0.002     1.109425    1.612574
1.ae_atten~r |   2.744935   .2322629    11.93   0.000     2.325453    3.240086
1.gp_consult |   .3010227    .231017    -1.56   0.118     .0668887    1.354708
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_withou
> tethn.ster not found)
file /workspace/output/oac_match_tempdata/onscoviddeath_multivar3_withoutethn.s
> ter saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table3_onscoviddeath.txt not fou
> nd)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    395,026    8.25e+07           0   8.25e+07   8.25e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,736     8086935           0    8086935    8086935

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.23065   .1404869     1.82   0.069       .98393    1.539235
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.667641   .3393154     2.51   0.012     1.119201     2.48483
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.668964    .349058     2.45   0.014     1.107698    2.514623
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.62526   .3376258     2.34   0.019     1.081676    2.442016
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.466393   .3143088     1.79   0.074     .9633908     2.23202
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.419443   .3029447     1.64   0.101     .9342226     2.15668
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_onscovidde
> ath.log
  log type:  text
 closed on:   2 Mar 2021, 06:09:57
-------------------------------------------------------------------------------
