-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_positiveco
> vidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:33:48

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(132,325 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   390,175      2,212 |   392,387 
            |     99.44       0.56 |    100.00 
------------+----------------------+----------
current use |    38,163        248 |    38,411 
            |     99.35       0.65 |    100.00 
------------+----------------------+----------
      Total |   428,338      2,460 |   430,798 
            |     99.43       0.57 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5294.6184
Iteration 1:   log likelihood =  -5293.698
Iteration 2:   log likelihood = -5293.6968
Refining estimates:
Iteration 0:   log likelihood = -5293.6968

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        2,460
Time at risk    =   89785472.5
                                                LR chi2(1)       =        1.84
Log likelihood  =   -5293.6968                  Prob > chi2      =      0.1746

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.098762   .0753492     1.37   0.170     .9605745    1.256828
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_univar_ethn.
> ster not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_univar_ethn.ster sa
> ved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5294.6184
Iteration 1:   log likelihood = -5292.2936
Iteration 2:   log likelihood =  -5292.286
Iteration 3:   log likelihood =  -5292.286
Refining estimates:
Iteration 0:   log likelihood =  -5292.286

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        2,460
Time at risk    =   89785472.5
                                                LR chi2(4)       =        4.66
Log likelihood  =    -5292.286                  Prob > chi2      =      0.3234

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.179769   .1172254     1.66   0.096     .9709998    1.433425
      1.male |          1  (omitted)
        age1 |   .9414519   .1236365    -0.46   0.646      .727803    1.217818
        age2 |   1.121448   .0990675     1.30   0.194     .9431587    1.333439
        age3 |   .8431808   .1560039    -0.92   0.357     .5867226    1.211738
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar1_et
> hn.ster not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar1_ethn.ster
>  saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5294.6184
Iteration 1:   log likelihood = -5098.4984
Iteration 2:   log likelihood = -5094.4003
Iteration 3:   log likelihood = -5094.3992
Refining estimates:
Iteration 0:   log likelihood = -5094.3992

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        2,460
Time at risk    =   89785472.5
                                                LR chi2(29)      =      400.44
Log likelihood  =   -5094.3992                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.166659   .1198119     1.50   0.133      .953956    1.426788
      1.male |          1  (omitted)
        age1 |   1.090483   .1462892     0.65   0.518     .8383578    1.418431
        age2 |   1.038534   .0938081     0.42   0.676     .8700288    1.239674
        age3 |   .7558394   .1453343    -1.46   0.145      .518512    1.101794
             |
         imd |
          2  |   1.298792   .1119998     3.03   0.002     1.096824    1.537949
          3  |    1.33269   .1166859     3.28   0.001     1.122538    1.582186
          4  |   1.519132   .1354079     4.69   0.000     1.275627     1.80912
5 most de..  |   1.873593   .1682695     6.99   0.000     1.571187    2.234204
             |
   obese4cat |
Obese I ..)  |   1.061302   .0608156     1.04   0.299     .9485555     1.18745
Obese II..)  |   1.233917   .1099096     2.36   0.018     1.036254    1.469284
Obese II..)  |   1.353017   .1798087     2.28   0.023     1.042757    1.755591
             |
smoke_nomiss |
     Former  |   1.240806   .0628779     4.26   0.000      1.12349    1.370372
    Current  |   .6291794   .0594499    -4.90   0.000     .5228128    .7571864
             |
     diabcat |
Controlle..  |   1.356865   .0812547     5.10   0.000     1.206599    1.525843
Uncontrol..  |   1.715384   .1310551     7.06   0.000     1.476827    1.992476
Diabetes,..  |   .8100525   .4052745    -0.42   0.674     .3038446    2.159607
             |
1.myocardi~t |   1.019898   .0891557     0.23   0.822      .859306    1.210502
       1.pad |    1.35778   .1531667     2.71   0.007     1.088449    1.693755
1.hyperten~n |   1.013308   .0490359     0.27   0.785     .9216159    1.114122
1.heart_f~re |   1.175749   .1138661     1.67   0.095     .9724771    1.421509
1.stroke_tia |   1.728422   .1284866     7.36   0.000     1.494079    1.999522
       1.vte |   1.528716   .1715265     3.78   0.000     1.226929    1.904734
 1.oestrogen |   1.127686   .3132897     0.43   0.665     .6541996    1.943864
1.antiplat~t |   1.038275   .0665356     0.59   0.558     .9157248    1.177226
1.flu_vac~ne |   .8591547   .0456781    -2.86   0.004     .7741339    .9535131
             |
   ethnicity |
      Mixed  |    1.07507   .3130929     0.25   0.804     .6074931    1.902534
Asian or ..  |   1.987866    .217346     6.28   0.000     1.604427    2.462943
      Black  |    1.66097   .2675682     3.15   0.002     1.211269     2.27763
      Other  |   1.407973   .3178764     1.52   0.130     .9045231     2.19164
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar2_et
> hn.ster not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar2_ethn.ster
>  saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5294.6184
Iteration 1:   log likelihood = -5119.3524
Iteration 2:   log likelihood =  -5115.714
Iteration 3:   log likelihood = -5115.7128
Refining estimates:
Iteration 0:   log likelihood = -5115.7128

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        2,460
Time at risk    =   89785472.5
                                                LR chi2(25)      =      357.81
Log likelihood  =   -5115.7128                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.129428   .1154715     1.19   0.234     .9243418    1.380017
      1.male |          1  (omitted)
        age1 |   1.095143   .1465382     0.68   0.497     .8425075    1.423534
        age2 |   1.032251   .0932137     0.35   0.725     .8648103    1.232112
        age3 |   .7476591   .1439632    -1.51   0.131     .5126289    1.090446
             |
         imd |
          2  |   1.302124    .112237     3.06   0.002     1.099721    1.541778
          3  |   1.330828   .1164547     3.27   0.001     1.121082    1.579817
          4  |   1.527949   .1360669     4.76   0.000     1.283239    1.819324
5 most de..  |   1.894385   .1698991     7.12   0.000     1.589014    2.258441
             |
   obese4cat |
Obese I ..)  |   1.038425   .0593296     0.66   0.509      .928416     1.16147
Obese II..)  |   1.192191   .1058285     1.98   0.048     1.001812    1.418748
Obese II..)  |   1.288799   .1709258     1.91   0.056     .9937913    1.671379
             |
smoke_nomiss |
     Former  |    1.19637   .0599728     3.58   0.000     1.084415    1.319883
    Current  |   .5971265   .0561355    -5.48   0.000     .4966442    .7179386
             |
     diabcat |
Controlle..  |   1.410658   .0837532     5.79   0.000     1.255696    1.584744
Uncontrol..  |   1.827246   .1377908     7.99   0.000     1.576191     2.11829
Diabetes,..  |   .8457863   .4164958    -0.34   0.734     .3221797    2.220359
             |
1.myocardi~t |   1.025189   .0894722     0.29   0.776     .8640053    1.216443
       1.pad |   1.345868   .1517365     2.63   0.008     1.079035    1.678684
1.hyperten~n |   1.022064   .0493693     0.45   0.651     .9297411    1.123554
1.heart_f~re |   1.176877   .1138383     1.68   0.092     .9736321    1.422548
1.stroke_tia |   1.742747   .1291343     7.50   0.000     1.507169    2.015148
       1.vte |   1.522812     .17062     3.75   0.000     1.222574    1.896781
 1.oestrogen |   1.114878   .3089835     0.39   0.695     .6476206    1.919261
1.antiplat~t |   1.043841   .0667416     0.67   0.502     .9208949    1.183202
1.flu_vac~ne |   .8538294   .0452646    -2.98   0.003     .7695659    .9473192
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar2_wi
> thoutethn.ster not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar2_withoutet
> hn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5294.6184
Iteration 1:   log likelihood = -4945.5329
Iteration 2:   log likelihood = -4937.6778
Iteration 3:   log likelihood = -4937.6766
Refining estimates:
Iteration 0:   log likelihood = -4937.6766

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        2,460
Time at risk    =   89785472.5
                                                LR chi2(36)      =      713.88
Log likelihood  =   -4937.6766                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.082683   .1127149     0.76   0.445      .882847    1.327754
      1.male |          1  (omitted)
        age1 |   1.049785   .1415099     0.36   0.719     .8060453     1.36723
        age2 |   1.050565   .0954129     0.54   0.587     .8792583    1.255248
        age3 |   .7341493    .142097    -1.60   0.110      .502379    1.072846
             |
         imd |
          2  |   1.265314   .1101136     2.70   0.007     1.066898    1.500631
          3  |   1.281196   .1136393     2.79   0.005     1.076753    1.524458
          4  |   1.424275   .1289074     3.91   0.000     1.192762    1.700724
5 most de..  |   1.736605   .1584401     6.05   0.000      1.45225    2.076639
             |
   obese4cat |
Obese I ..)  |    1.06852    .061953     1.14   0.253       .95374    1.197114
Obese II..)  |   1.246753   .1124606     2.44   0.014      1.04472    1.487857
Obese II..)  |   1.247837   .1679143     1.65   0.100     .9585537    1.624423
             |
smoke_nomiss |
     Former  |   1.187218   .0616529     3.30   0.001     1.072327    1.314419
    Current  |   .5743561   .0554764    -5.74   0.000     .4752966    .6940612
             |
     diabcat |
Controlle..  |   1.310289   .0795834     4.45   0.000     1.163235    1.475934
Uncontrol..  |   1.615992   .1260839     6.15   0.000     1.386839    1.883007
Diabetes,..  |   .7194954   .3601554    -0.66   0.511     .2697397     1.91916
             |
1.myocardi~t |   .9786158   .0866056    -0.24   0.807     .8227778     1.16397
       1.pad |   1.256307   .1453517     1.97   0.049     1.001415    1.576078
1.hyperten~n |   1.005212   .0494452     0.11   0.916     .9128257    1.106948
1.heart_f~re |   .9983383   .0987855    -0.02   0.987       .82234    1.212004
1.stroke_tia |   1.596222   .1204618     6.20   0.000     1.376753    1.850678
       1.vte |   1.358061   .1550475     2.68   0.007     1.085773    1.698633
 1.oestrogen |   1.175497   .3276928     0.58   0.562     .6806635    2.030068
1.antiplat~t |   .9819972   .0636743    -0.28   0.779     .8648025    1.115074
1.flu_vac~ne |   .8425471   .0452895    -3.19   0.001     .7582973    .9361573
             |
         ckd |
        CKD  |   1.300745   .0785262     4.36   0.000     1.155593    1.464129
      1.copd |   1.243739    .089835     3.02   0.003     1.079561    1.432885
1.other_re~y |   1.518966   .1459519     4.35   0.000     1.258227    1.833736
1.immunode~y |   .8771485   .2211108    -0.52   0.603      .535184    1.437617
    1.cancer |   1.151341    .069355     2.34   0.019     1.023125    1.295624
1.ae_atten~r |   2.128576   .1047464    15.35   0.000     1.932866    2.344101
1.gp_consult |   2.106592   1.353073     1.16   0.246     .5982048     7.41841
             |
   ethnicity |
      Mixed  |   1.145479   .3363593     0.46   0.644     .6442282    2.036735
Asian or ..  |   1.975234   .2188316     6.14   0.000     1.589702    2.454263
      Black  |   1.631108   .2659962     3.00   0.003     1.184872    2.245402
      Other  |   1.512105   .3441592     1.82   0.069     .9679347    2.362206
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar3_et
> hn.ster not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar3_ethn.ster
>  saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5294.6184
Iteration 1:   log likelihood = -4965.8097
Iteration 2:   log likelihood = -4958.1821
Iteration 3:   log likelihood =  -4958.181
Refining estimates:
Iteration 0:   log likelihood =  -4958.181

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      430,798                  Number of obs    =     430,798
No. of failures =        2,460
Time at risk    =   89785472.5
                                                LR chi2(32)      =      672.87
Log likelihood  =    -4958.181                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.050567   .1089213     0.48   0.634     .8573781    1.287286
      1.male |          1  (omitted)
        age1 |   1.054428   .1419348     0.39   0.694     .8099127    1.372764
        age2 |   1.044778    .094931     0.48   0.630     .8743435    1.248436
        age3 |   .7277296   .1411475    -1.64   0.101     .4975931    1.064304
             |
         imd |
          2  |   1.270082   .1104673     2.75   0.006     1.071019    1.506143
          3  |   1.280332    .113496     2.79   0.005     1.076136    1.523274
          4  |   1.435516   .1297723     4.00   0.000     1.202426     1.71379
5 most de..  |   1.756979   .1600593     6.19   0.000      1.46968     2.10044
             |
   obese4cat |
Obese I ..)  |   1.044611   .0604029     0.75   0.450     .9326859    1.169968
Obese II..)  |   1.203248   .1081679     2.06   0.040      1.00887    1.435077
Obese II..)  |    1.18791   .1595774     1.28   0.200     .9129306    1.545715
             |
smoke_nomiss |
     Former  |    1.14504   .0588364     2.64   0.008     1.035339    1.266364
    Current  |   .5453946   .0524242    -6.31   0.000     .4517437    .6584604
             |
     diabcat |
Controlle..  |   1.361865   .0820509     5.13   0.000      1.21018    1.532562
Uncontrol..  |   1.723914    .132637     7.08   0.000     1.482602    2.004502
Diabetes,..  |   .7413495   .3666657    -0.61   0.545     .2812065    1.954432
             |
1.myocardi~t |   .9817666   .0867188    -0.21   0.835     .8256997    1.167332
       1.pad |   1.245748   .1437348     1.90   0.057     .9936155     1.56186
1.hyperten~n |   1.014191   .0497934     0.29   0.774     .9211458    1.116634
1.heart_f~re |   .9988689   .0987428    -0.01   0.991     .8229308    1.212422
1.stroke_tia |   1.605865   .1208071     6.30   0.000     1.385717     1.86099
       1.vte |   1.351946   .1542344     2.64   0.008     1.081064    1.690703
 1.oestrogen |   1.166969   .3244257     0.56   0.579     .6767363    2.012331
1.antiplat~t |   .9889495   .0639985    -0.17   0.864     .8711437    1.122686
1.flu_vac~ne |   .8370884   .0448742    -3.32   0.001     .7535994     .929827
             |
         ckd |
        CKD  |    1.30517    .078627     4.42   0.000     1.159814    1.468743
      1.copd |   1.241267   .0895277     3.00   0.003     1.077634    1.429746
1.other_re~y |    1.51056   .1448718     4.30   0.000     1.251707    1.822944
1.immunode~y |   .9053549    .226898    -0.40   0.692     .5539781    1.479603
    1.cancer |    1.14315   .0687294     2.23   0.026     1.016077    1.286115
1.ae_atten~r |    2.13279   .1047141    15.43   0.000      1.93712    2.348225
1.gp_consult |   2.133363   1.364663     1.18   0.236     .6089351    7.474095
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/positivecovidtest_multivar3_wi
> thoutethn.ster not found)
file /workspace/output/oac_match_tempdata/positivecovidtest_multivar3_withoutet
> hn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/table3_positivecovidtest.txt not
>  found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    392,387    8.18e+07           0   8.18e+07   8.18e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,411     7996183           0    7996183    7996183

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.098762   .0753492     1.37   0.170     .9605745    1.256828
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.179769   .1172254     1.66   0.096     .9709998    1.433425
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.166659   .1198119     1.50   0.133      .953956    1.426788
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.129428   .1154715     1.19   0.234     .9243418    1.380017
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.082683   .1127149     0.76   0.445      .882847    1.327754
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.050567   .1089213     0.48   0.634     .8573781    1.287286
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/06c_an_models_ethnicity_positiveco
> vidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:37:18
-------------------------------------------------------------------------------
