-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_positivecovidte
> st.log
  log type:  text
 opened on:   2 Mar 2021, 06:28:05

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -21246.061                     Number of obs     =    563,145

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   1.258436   .0806832     3.59   0.000     1.109832    1.426937
    _Imale_1 |    1.10221   .0598562     1.79   0.073     .9909214    1.225997
     _Iimd_2 |   1.073812   .0673979     1.13   0.257     .9495163    1.214378
     _Iimd_3 |   1.122701   .0700067     1.86   0.063     .9935437    1.268648
     _Iimd_4 |   1.254367   .0763951     3.72   0.000     1.113226    1.413401
     _Iimd_5 |   1.904714   .1089581    11.26   0.000     1.702697      2.1307
_Iobese4ca~2 |   1.094403   .0512181     1.93   0.054     .9984842    1.199537
_Iobese4ca~3 |   1.201469   .0872184     2.53   0.011     1.042129    1.385173
_Iobese4ca~4 |   1.231329     .13144     1.95   0.051     .9988755    1.517878
_Ismoke_no~2 |   1.089007   .0444694     2.09   0.037     1.005245    1.179748
_Ismoke_no~3 |   .5852436   .0464244    -6.75   0.000      .500974    .6836883
 _Idiabcat_2 |   1.358089   .0644803     6.45   0.000     1.237412    1.490535
 _Idiabcat_3 |   1.581807   .0991027     7.32   0.000     1.399022    1.788474
 _Idiabcat_4 |   1.051469   .3725525     0.14   0.887     .5250518    2.105674
_Imyocardi~1 |   1.093962   .0757356     1.30   0.195     .9551537    1.252944
     _Ipad_1 |   1.307285   .1116368     3.14   0.002     1.105811    1.545465
_Ihyperten~1 |    .938454   .0363822    -1.64   0.101     .8697881    1.012541
_Iheart_fa~1 |   1.025557   .0786183     0.33   0.742     .8824852    1.191824
_Istroke_t~1 |   1.608158   .0939262     8.13   0.000     1.434213    1.803201
     _Ivte_1 |   1.389449   .1230718     3.71   0.000      1.16801    1.652869
_Ioestroge~1 |   1.078025   .2399773     0.34   0.736     .6968579    1.667682
_Iantiplat~1 |   .9909599   .0514308    -0.17   0.861     .8951148    1.097068
_Iflu_vacc~1 |   .8418077   .0359081    -4.04   0.000     .7742907     .915212
     _Ickd_1 |   1.254288   .0591706     4.80   0.000     1.143515    1.375791
    _Icopd_1 |   1.294908   .0737271     4.54   0.000     1.158177    1.447782
_Iother_re~1 |   1.446833   .1095395     4.88   0.000     1.247309    1.678273
_Iimmunode~1 |   1.365362   .2399155     1.77   0.076     .9675608    1.926714
  _Icancer_1 |   1.118104   .0537628     2.32   0.020     1.017544    1.228602
_Iae_atten~1 |   2.151156    .082432    19.99   0.000      1.99551    2.318941
_Igp_consu~1 |   1.230018    .507145     0.50   0.616     .5482206    2.759738
        age1 |   .9613831   .0046355    -8.17   0.000     .9523405    .9705115
        age2 |   1.072779    .014362     5.25   0.000     1.044996      1.1013
        age3 |   1.018394   .0827187     0.22   0.822     .8685147    1.194137
       _rcs1 |    1.54511   .0255292    26.33   0.000     1.495875    1.595965
       _rcs2 |   1.325744   .0238126    15.70   0.000     1.279885    1.373247
       _rcs3 |   .9873231   .0042312    -2.98   0.003     .9790649    .9956511
       _rcs4 |   .9931409   .0006983    -9.79   0.000     .9917732    .9945104
       _cons |   .0201649   .0101197    -7.78   0.000     .0075409    .0539223
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,145    208.2911     20.0517         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,933 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00553333   .00533202   .00574225 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00695281   .00618303   .00781844 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    .00141948          .00056873          .00227023 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_positivecovidtest.gph not found)
(file adj_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_positivecovidtest.svg
>  not found)
(file /workspace/output/oac_match_tabfig/adj_curves_positivecovidtest.svg writt
> en in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_positivecovidtest.gph not found)
(file diff_curves_positivecovidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_positivecovidtest.sv
> g not found)
(file /workspace/output/oac_match_tabfig/diff_curves_positivecovidtest.svg writ
> ten in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_positivecovidte
> st.log
  log type:  text
 closed on:   2 Mar 2021, 06:49:22
-------------------------------------------------------------------------------
