-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_onscoviddeath.l
> og
  log type:  text
 opened on:   2 Mar 2021, 06:08:56

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -8910.2554                     Number of obs     =    563,145

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   1.352992   .1630058     2.51   0.012     1.068425     1.71335
    _Imale_1 |   1.866274   .2591813     4.49   0.000     1.421555    2.450119
     _Iimd_2 |   .9306712   .0933441    -0.72   0.474     .7645798    1.132843
     _Iimd_3 |   1.054153    .103024     0.54   0.589     .8703907    1.276711
     _Iimd_4 |   1.084439   .1061779     0.83   0.408     .8950832    1.313852
     _Iimd_5 |   1.807362   .1636536     6.54   0.000     1.513458    2.158341
_Iobese4ca~2 |   1.155189   .0912447     1.83   0.068     .9895085    1.348611
_Iobese4ca~3 |   1.583237   .1930413     3.77   0.000     1.246695    2.010627
_Iobese4ca~4 |   1.680252   .3319586     2.63   0.009     1.140794     2.47481
_Ismoke_no~2 |   1.200979   .0852587     2.58   0.010      1.04498    1.380267
_Ismoke_no~3 |   .9024745   .1228639    -0.75   0.451     .6911166     1.17847
 _Idiabcat_2 |   1.399542   .1054714     4.46   0.000     1.207364    1.622309
 _Idiabcat_3 |    1.86026   .1795228     6.43   0.000     1.539675    2.247595
 _Idiabcat_4 |    1.44343   .7240707     0.73   0.464     .5400149    3.858209
_Imyocardi~1 |   1.301488   .1260766     2.72   0.007     1.076423    1.573609
     _Ipad_1 |   1.498886   .1733764     3.50   0.000     1.194841      1.8803
_Ihyperten~1 |   .9412994   .0612298    -0.93   0.352     .8286263    1.069293
_Iheart_fa~1 |    1.13572   .1225768     1.18   0.238     .9191836    1.403267
_Istroke_t~1 |   1.999734   .1652915     8.38   0.000     1.700649    2.351418
     _Ivte_1 |   1.538853   .1969861     3.37   0.001     1.197391    1.977689
_Ioestroge~1 |   1.546323   .7837485     0.86   0.390     .5726266    4.175695
_Iantiplat~1 |   .8404092   .0659292    -2.22   0.027     .7206344    .9800915
_Iflu_vacc~1 |   .9531309   .0720169    -0.64   0.525     .8219347    1.105269
     _Ickd_1 |   1.292404   .0874157     3.79   0.000     1.131944    1.475612
    _Icopd_1 |    1.27753   .1085965     2.88   0.004     1.081471    1.509133
_Iother_re~1 |   1.654561   .1736178     4.80   0.000     1.346989    2.032366
_Iimmunode~1 |   2.282747   .5443252     3.46   0.001     1.430498    3.642742
  _Icancer_1 |   1.169016   .0829743     2.20   0.028     1.017194    1.343497
_Iae_atten~1 |     2.5875   .1578576    15.58   0.000     2.295887    2.916153
_Igp_consu~1 |   .5522851   .2524958    -1.30   0.194     .2254279    1.353066
        age1 |   1.064777   .0189347     3.53   0.000     1.028305    1.102543
        age2 |   1.041151    .031865     1.32   0.188     .9805333    1.105517
        age3 |   .9229641   .1385877    -0.53   0.593     .6876582    1.238788
       _rcs1 |   1.170122   .0053378    34.44   0.000     1.159707    1.180631
       _cons |   5.21e-06   6.32e-06   -10.03   0.000     4.84e-07    .0000561
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,145     208.787    18.00834         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,933 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00206882   .00194469   .00220087 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00279309   .00224567   .00347396 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    .00072427          .00008595          .00136259 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_onscoviddeath.gph not found)
(file adj_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_onscoviddeath.svg not
>  found)
(file /workspace/output/oac_match_tabfig/adj_curves_onscoviddeath.svg written i
> n SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_onscoviddeath.gph not found)
(file diff_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_onscoviddeath.svg no
> t found)
(file /workspace/output/oac_match_tabfig/diff_curves_onscoviddeath.svg written 
> in SVG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_onscoviddeath.l
> og
  log type:  text
 closed on:   2 Mar 2021, 06:27:40
-------------------------------------------------------------------------------
