-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_covidtest.log
  log type:  text
 opened on:   2 Mar 2021, 06:23:39

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -235975.72                     Number of obs     =    563,145

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |    1.33543   .0169863    22.74   0.000     1.302549    1.369141
    _Imale_1 |   .9738591   .0099969    -2.58   0.010     .9544612    .9936511
     _Iimd_2 |   1.022054   .0124325     1.79   0.073     .9979747    1.046714
     _Iimd_3 |   1.043697    .012697     3.52   0.000     1.019106    1.068882
     _Iimd_4 |   1.049079   .0127765     3.93   0.000     1.024335    1.074422
     _Iimd_5 |   1.077937   .0132392     6.11   0.000     1.052299      1.1042
_Iobese4ca~2 |    1.00397   .0100359     0.40   0.692     .9844916    1.023834
_Iobese4ca~3 |    1.02851   .0164421     1.76   0.079     .9967834    1.061246
_Iobese4ca~4 |   .9923662   .0240182    -0.32   0.752     .9463906    1.040575
_Ismoke_no~2 |   1.088987   .0093863     9.89   0.000     1.070745     1.10754
_Ismoke_no~3 |   1.095466   .0152254     6.56   0.000     1.066027    1.125717
 _Idiabcat_2 |   1.070949   .0116488     6.30   0.000      1.04836    1.094026
 _Idiabcat_3 |   1.179695   .0176721    11.03   0.000     1.145562    1.214845
 _Idiabcat_4 |   1.052276   .0783689     0.68   0.494     .9093605    1.217653
_Imyocardi~1 |   1.048791   .0168275     2.97   0.003     1.016323    1.082296
     _Ipad_1 |   1.222987   .0250155     9.84   0.000     1.174927    1.273012
_Ihyperten~1 |   1.001391   .0081184     0.17   0.864     .9856053     1.01743
_Iheart_fa~1 |   1.207246   .0205891    11.04   0.000     1.167559    1.248282
_Istroke_t~1 |   1.215068   .0176417    13.42   0.000     1.180978    1.250142
     _Ivte_1 |   1.239807   .0264056    10.09   0.000     1.189119    1.292657
_Ioestroge~1 |   1.296373   .0495715     6.79   0.000     1.202766    1.397265
_Iantiplat~1 |    1.09388   .0126957     7.73   0.000     1.069278    1.119048
_Iflu_vacc~1 |   1.034803   .0094739     3.74   0.000       1.0164    1.053539
     _Ickd_1 |   1.133018   .0124955    11.32   0.000      1.10879    1.157776
    _Icopd_1 |   1.200735   .0153257    14.33   0.000      1.17107    1.231152
_Iother_re~1 |   1.341568   .0241534    16.32   0.000     1.295054    1.389753
_Iimmunode~1 |   1.328118   .0498694     7.56   0.000     1.233886    1.429547
  _Icancer_1 |   1.484889   .0144921    40.51   0.000     1.456755    1.513567
_Iae_atten~1 |   1.745556    .015022    64.73   0.000      1.71636    1.775248
_Igp_consu~1 |   .8755463   .0648209    -1.80   0.073     .7572871    1.012273
        age1 |     .97817   .0010691   -20.20   0.000     .9760769    .9802675
        age2 |   1.017219   .0030734     5.65   0.000     1.011213    1.023261
        age3 |   1.111484    .020825     5.64   0.000     1.071408    1.153059
       _rcs1 |   1.951386   .0078919   165.31   0.000     1.935979    1.966915
       _rcs2 |   1.100449   .0048879    21.55   0.000     1.090911    1.110071
       _rcs3 |   1.009503   .0008861    10.77   0.000     1.007767    1.011241
       _cons |   .3315774   .0328457   -11.14   0.000     .2730649    .4026281
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |    563,145     199.558    34.82146         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(562,933 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .12266914   .12177386   .12357101 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +---------------------------------+
  |     _at2   _at2_lci    _at2_uci |
  |---------------------------------|
  | .1596682   .1563558   .16305076 |
  +---------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    .03699905          .03349964          .04049847 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_covidtest.gph not found)
(file adj_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/adj_curves_covidtest.svg not fou
> nd)
(file /workspace/output/oac_match_tabfig/adj_curves_covidtest.svg written in SV
> G format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_covidtest.gph not found)
(file diff_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_match_tabfig/diff_curves_covidtest.svg not fo
> und)
(file /workspace/output/oac_match_tabfig/diff_curves_covidtest.svg written in S
> VG format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/09a_an_models_plot_covidtest.log
  log type:  text
 closed on:   2 Mar 2021, 06:45:10
-------------------------------------------------------------------------------
