-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_posi
> tivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:41:42

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   386,285      1,850 |   388,135 
            |     99.52       0.48 |    100.00 
------------+----------------------+----------
current use |    49,169        321 |    49,490 
            |     99.35       0.65 |    100.00 
------------+----------------------+----------
      Total |   435,454      2,171 |   437,625 
            |     99.50       0.50 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4635.2517
Iteration 1:   log likelihood = -4628.9873
Iteration 2:   log likelihood = -4628.9396
Iteration 3:   log likelihood = -4628.9396
Refining estimates:
Iteration 0:   log likelihood = -4628.9396

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        2,171
Time at risk    =     91301708
                                                LR chi2(1)       =       12.62
Log likelihood  =   -4628.9396                  Prob > chi2      =      0.0004

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.250237   .0766016     3.65   0.000     1.108765     1.40976
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_univar.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_uni
> var.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4635.2517
Iteration 1:   log likelihood = -4624.7722
Iteration 2:   log likelihood = -4624.6648
Iteration 3:   log likelihood = -4624.6648
Refining estimates:
Iteration 0:   log likelihood = -4624.6648

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        2,171
Time at risk    =     91301708
                                                LR chi2(4)       =       21.17
Log likelihood  =   -4624.6648                  Prob > chi2      =      0.0003

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.363717   .1202746     3.52   0.000     1.147233    1.621052
      1.male |          1  (omitted)
        age1 |   1.189625   .1613074     1.28   0.200     .9119921    1.551775
        age2 |   1.022804   .0840315     0.27   0.784     .8706822    1.201505
        age3 |    1.11897   .1877079     0.67   0.503     .8054323    1.554562
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4635.2517
Iteration 1:   log likelihood = -4510.2434
Iteration 2:   log likelihood = -4506.6266
Iteration 3:   log likelihood = -4506.6232
Iteration 4:   log likelihood = -4506.6232
Refining estimates:
Iteration 0:   log likelihood = -4506.6232

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        2,171
Time at risk    =     91301708
                                                LR chi2(24)      =      257.26
Log likelihood  =   -4506.6232                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.213042   .1131734     2.07   0.038     1.010325    1.456433
      1.male |          1  (omitted)
        age1 |   1.377259   .1917508     2.30   0.021     1.048349    1.809361
        age2 |   .9406337   .0798659    -0.72   0.471     .7964307    1.110946
        age3 |   1.018027   .1788668     0.10   0.919     .7214453     1.43653
             |
         imd |
          2  |   1.270695   .1102756     2.76   0.006     1.071941      1.5063
          3  |   1.274971   .1155293     2.68   0.007     1.067505    1.522756
          4  |   1.481329    .135694     4.29   0.000     1.237881    1.772654
5 most de..  |   1.788048   .1680977     6.18   0.000     1.487154     2.14982
             |
   obese4cat |
Obese I ..)  |   1.115864   .0681289     1.80   0.073     .9900141    1.257712
Obese II..)  |   1.188651   .1119394     1.84   0.066     .9883114    1.429601
Obese II..)  |   1.255359   .1698905     1.68   0.093      .962882    1.636677
             |
smoke_nomiss |
     Former  |   1.128393   .0576164     2.37   0.018     1.020934    1.247163
    Current  |   .6297885   .0624496    -4.66   0.000     .5185491     .764891
             |
     diabcat |
Controlle..  |   1.446259   .0952883     5.60   0.000     1.271054    1.645616
Uncontrol..  |    1.62936   .1462516     5.44   0.000     1.366511    1.942768
Diabetes,..  |   .4799891   .3532742    -1.00   0.319     .1134339    2.031046
             |
1.myocardi~t |    1.29561   .2165198     1.55   0.121     .9337339    1.797734
       1.pad |   2.107559   .3857214     4.07   0.000     1.472294    3.016929
1.hyperten~n |   .9828433   .0498276    -0.34   0.733     .8898782     1.08552
1.heart_f~re |   1.184045   .1550717     1.29   0.197     .9159847    1.530552
1.stroke_tia |   1.828602   .2085404     5.29   0.000     1.462329    2.286616
       1.vte |   1.861838   .2228155     5.19   0.000     1.472565    2.354017
 1.oestrogen |   1.047007    .271297     0.18   0.859     .6300702    1.739843
1.flu_vac~ne |   .9017197   .0499116    -1.87   0.062     .8090144    1.005048
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -4635.2517
Iteration 1:   log likelihood = -4390.4502
Iteration 2:   log likelihood = -4383.8592
Iteration 3:   log likelihood = -4383.8574
Iteration 4:   log likelihood = -4383.8574
Refining estimates:
Iteration 0:   log likelihood = -4383.8574

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        2,171
Time at risk    =     91301708
                                                LR chi2(31)      =      502.79
Log likelihood  =   -4383.8574                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.10686   .1047099     1.07   0.283     .9195355    1.332346
      1.male |          1  (omitted)
        age1 |    1.35133   .1894252     2.15   0.032     1.026698    1.778608
        age2 |   .9422364   .0806866    -0.69   0.487     .7966524    1.114425
        age3 |   1.024852   .1812271     0.14   0.890     .7246718    1.449377
             |
         imd |
          2  |   1.251273    .109462     2.56   0.010     1.054117    1.485305
          3  |   1.227444   .1124819     2.24   0.025     1.025648    1.468944
          4  |   1.406125   .1302673     3.68   0.000     1.172644    1.686093
5 most de..  |   1.677375    .159728     5.43   0.000     1.391793    2.021556
             |
   obese4cat |
Obese I ..)  |   1.114679   .0686849     1.76   0.078      .987871    1.257766
Obese II..)  |   1.182943   .1123052     1.77   0.077      .982094    1.424867
Obese II..)  |   1.180219   .1618535     1.21   0.227      .902049     1.54417
             |
smoke_nomiss |
     Former  |   1.084903   .0567593     1.56   0.119     .9791702    1.202053
    Current  |   .5778341   .0585327    -5.41   0.000     .4737827    .7047371
             |
     diabcat |
Controlle..  |   1.415326   .0945402     5.20   0.000     1.241647    1.613298
Uncontrol..  |   1.556846   .1416965     4.86   0.000     1.302487    1.860878
Diabetes,..  |   .4407113   .3262773    -1.11   0.268     .1032698    1.880767
             |
1.myocardi~t |   1.201566   .2044173     1.08   0.280     .8608675      1.6771
       1.pad |   1.991937   .3747672     3.66   0.000     1.377618    2.880199
1.hyperten~n |   .9809803   .0504302    -0.37   0.709     .8869553    1.084973
1.heart_f~re |   1.021619   .1366779     0.16   0.873     .7859785    1.327907
1.stroke_tia |   1.698374   .1983472     4.54   0.000     1.350904    2.135218
       1.vte |   1.651528   .2012259     4.12   0.000     1.300689    2.096999
 1.oestrogen |   1.046316   .2702424     0.18   0.861     .6306876    1.735845
1.flu_vac~ne |   .8785015     .04914    -2.32   0.021     .7872805    .9802921
             |
         ckd |
        CKD  |   1.241762   .0849703     3.16   0.002     1.085908    1.419985
      1.copd |   1.217908    .099548     2.41   0.016     1.037624    1.429516
1.other_re~y |   1.575091   .1782594     4.01   0.000     1.261746    1.966254
1.immunode~y |   1.172735    .292085     0.64   0.522     .7197753    1.910745
    1.cancer |   1.095315   .0718339     1.39   0.165     .9631967    1.245556
1.ae_atten~r |   2.106873   .1116853    14.06   0.000     1.898961    2.337548
1.gp_consult |   1.176986   .6088822     0.31   0.753     .4269969    3.244275
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table2_positivec
> ovidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.250237   .0766016     3.65   0.000     1.108765     1.40976
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.363717   .1202746     3.52   0.000     1.147233    1.621052
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.213042   .1131734     2.07   0.038     1.010325    1.456433
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.10686   .1047099     1.07   0.283     .9195355    1.332346
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_posi
> tivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:43:41
-------------------------------------------------------------------------------
