-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_covi
> dtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:40:35

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the | outcome: first covid
   exposure |         test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   372,207     15,928 |   388,135 
            |     95.90       4.10 |    100.00 
------------+----------------------+----------
current use |    46,401      3,089 |    49,490 
            |     93.76       6.24 |    100.00 
------------+----------------------+----------
      Total |   418,608     19,017 |   437,625 
            |     95.65       4.35 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -40591.957
Iteration 1:   log likelihood = -40413.379
Iteration 2:   log likelihood = -40408.431
Iteration 3:   log likelihood = -40408.429
Refining estimates:
Iteration 0:   log likelihood = -40408.429

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =       19,017
Time at risk    =     89985874
                                                LR chi2(1)       =      367.06
Log likelihood  =   -40408.429                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.490487   .0297244    20.01   0.000     1.433352    1.549899
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_univ
> ar.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_univar.ster
>  saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -40591.957
Iteration 1:   log likelihood = -40397.581
Iteration 2:   log likelihood = -40389.293
Iteration 3:   log likelihood = -40389.286
Refining estimates:
Iteration 0:   log likelihood = -40389.286

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =       19,017
Time at risk    =     89985874
                                                LR chi2(4)       =      405.34
Log likelihood  =   -40389.286                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.660496   .0479773    17.55   0.000     1.569076    1.757244
      1.male |          1  (omitted)
        age1 |   .9550892   .0498829    -0.88   0.379     .8621581    1.058037
        age2 |   1.053687    .031503     1.75   0.080     .9937161    1.117276
        age3 |   1.121248   .0726245     1.77   0.077     .9875708    1.273019
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar1.s
> ter saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -40591.957
Iteration 1:   log likelihood = -40087.029
Iteration 2:   log likelihood = -40070.547
Iteration 3:   log likelihood = -40070.532
Refining estimates:
Iteration 0:   log likelihood = -40070.532

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =       19,017
Time at risk    =     89985874
                                                LR chi2(24)      =     1042.85
Log likelihood  =   -40070.532                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.475382   .0452231    12.69   0.000     1.389356    1.566734
      1.male |          1  (omitted)
        age1 |   1.066788    .056442     1.22   0.222     .9617067    1.183352
        age2 |   .9786142   .0299884    -0.71   0.481     .9215684    1.039191
        age3 |   1.064762   .0709444     0.94   0.346     .9344103    1.213298
             |
         imd |
          2  |   1.057111   .0287257     2.04   0.041     1.002283    1.114939
          3  |   1.063001   .0298404     2.18   0.030     1.006095    1.123126
          4  |   1.086017   .0320357     2.80   0.005     1.025008    1.150656
5 most de..  |   1.233337   .0382205     6.77   0.000     1.160656     1.31057
             |
   obese4cat |
Obese I ..)  |   1.011092   .0210496     0.53   0.596     .9706657    1.053202
Obese II..)  |   1.012668   .0340368     0.37   0.708     .9481072    1.081626
Obese II..)  |    1.07037   .0519502     1.40   0.161     .9732428    1.177191
             |
smoke_nomiss |
     Former  |   1.130775   .0196005     7.09   0.000     1.093004    1.169851
    Current  |   1.221207   .0341327     7.15   0.000     1.156107    1.289972
             |
     diabcat |
Controlle..  |   1.180402   .0279958     6.99   0.000     1.126787    1.236568
Uncontrol..  |   1.379638   .0459094     9.67   0.000     1.292529    1.472618
Diabetes,..  |   1.022449   .1745224     0.13   0.897      .731728    1.428676
             |
1.myocardi~t |   1.261147   .0761261     3.84   0.000     1.120431    1.419536
       1.pad |   1.479926   .1045692     5.55   0.000     1.288532    1.699747
1.hyperten~n |   1.036513   .0174882     2.13   0.034     1.002797    1.071362
1.heart_f~re |   1.420466   .0613679     8.12   0.000     1.305138    1.545984
1.stroke_tia |   1.516133   .0673155     9.37   0.000     1.389775     1.65398
       1.vte |   1.513141     .06832     9.17   0.000      1.38499    1.653149
 1.oestrogen |   1.130484   .0884257     1.57   0.117     .9698041    1.317786
1.flu_vac~ne |   1.051485   .0196987     2.68   0.007     1.013577    1.090811
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar2.s
> ter saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -40591.957
Iteration 1:   log likelihood = -39092.321
Iteration 2:   log likelihood =  -39047.19
Iteration 3:   log likelihood = -39047.183
Refining estimates:
Iteration 0:   log likelihood = -39047.183

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =       19,017
Time at risk    =     89985874
                                                LR chi2(31)      =     3089.55
Log likelihood  =   -39047.183                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.35108   .0421915     9.64   0.000     1.270866    1.436357
      1.male |          1  (omitted)
        age1 |   1.043845    .055879     0.80   0.423     .9398741    1.159318
        age2 |   .9849552    .030567    -0.49   0.625     .9268306    1.046725
        age3 |   1.054473   .0710757     0.79   0.431     .9239768      1.2034
             |
         imd |
          2  |   1.047133   .0286514     1.68   0.092     .9924568    1.104822
          3  |   1.042503    .029507     1.47   0.141     .9862455     1.10197
          4  |   1.056998   .0314248     1.86   0.062     .9971662    1.120419
5 most de..  |   1.173827   .0367802     5.11   0.000     1.103908    1.248174
             |
   obese4cat |
Obese I ..)  |   1.016201   .0213368     0.77   0.444     .9752303    1.058893
Obese II..)  |   1.021583   .0346166     0.63   0.529     .9559399    1.091734
Obese II..)  |     1.0662   .0522142     1.31   0.191     .9686199     1.17361
             |
smoke_nomiss |
     Former  |   1.092075   .0193088     4.98   0.000     1.054879    1.130583
    Current  |   1.158024    .033334     5.10   0.000       1.0945    1.225236
             |
     diabcat |
Controlle..  |   1.145678   .0274745     5.67   0.000     1.093074    1.200812
Uncontrol..  |   1.343498   .0452908     8.76   0.000     1.257598    1.435264
Diabetes,..  |   .9960566   .1718543    -0.02   0.982      .710268    1.396837
             |
1.myocardi~t |   1.187903   .0727408     2.81   0.005     1.053557    1.339381
       1.pad |   1.399886   .1005706     4.68   0.000      1.21602    1.611553
1.hyperten~n |   1.023928   .0175284     1.38   0.167     .9901429    1.058866
1.heart_f~re |   1.280546   .0562917     5.63   0.000     1.174836    1.395768
1.stroke_tia |   1.391376   .0628368     7.31   0.000     1.273512     1.52015
       1.vte |   1.359186   .0622571     6.70   0.000     1.242481    1.486853
 1.oestrogen |    1.09447   .0861783     1.15   0.252      .937952    1.277107
1.flu_vac~ne |   1.015089   .0192586     0.79   0.430     .9780364    1.053546
             |
         ckd |
        CKD  |    1.22025   .0290668     8.36   0.000     1.164589    1.278571
      1.copd |   1.166849   .0325138     5.54   0.000     1.104832    1.232347
1.other_re~y |    1.48518   .0584251    10.05   0.000     1.374973    1.604222
1.immunode~y |   1.346514    .110958     3.61   0.000     1.145694    1.582535
    1.cancer |   1.605698   .0326499    23.29   0.000     1.542964    1.670983
1.ae_atten~r |    1.90741   .0358167    34.39   0.000     1.838487    1.978917
1.gp_consult |   .8764769   .1263529    -0.91   0.360      .660741    1.162652
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar3.s
> ter saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table2_covidtest
> .txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.490487   .0297244    20.01   0.000     1.433352    1.549899
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.660496   .0479773    17.55   0.000     1.569076    1.757244
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.475382   .0452231    12.69   0.000     1.389356    1.566734
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.35108   .0421915     9.64   0.000     1.270866    1.436357
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_covi
> dtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:42:33
-------------------------------------------------------------------------------
