-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_onsc
> oviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 11:38:27

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |  outcome: ONS covid
   exposure |         death
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   387,543        592 |   388,135 
            |     99.85       0.15 |    100.00 
------------+----------------------+----------
current use |    49,362        128 |    49,490 
            |     99.74       0.26 |    100.00 
------------+----------------------+----------
      Total |   436,905        720 |   437,625 
            |     99.84       0.16 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1463.4233
Iteration 1:   log likelihood =  -1458.569
Iteration 2:   log likelihood =  -1458.497
Iteration 3:   log likelihood =  -1458.497
Refining estimates:
Iteration 0:   log likelihood =  -1458.497

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =          720
Time at risk    =     91503496
                                                LR chi2(1)       =        9.85
Log likelihood  =    -1458.497                  Prob > chi2      =      0.0017

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.377681   .1359717     3.25   0.001     1.135372    1.671702
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_
> univar.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_univar.
> ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1463.4233
Iteration 1:   log likelihood =  -1455.814
Iteration 2:   log likelihood = -1455.4581
Iteration 3:   log likelihood = -1455.4578
Refining estimates:
Iteration 0:   log likelihood = -1455.4578

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =          720
Time at risk    =     91503496
                                                LR chi2(4)       =       15.93
Log likelihood  =   -1455.4578                  Prob > chi2      =      0.0031

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.916921   .3413576     3.65   0.000     1.352152    2.717583
      1.male |          1  (omitted)
        age1 |   .8739445   .1716239    -0.69   0.493     .5947386    1.284226
        age2 |   1.178576   .1282116     1.51   0.131     .9522683    1.458665
        age3 |   1.032171   .2113599     0.15   0.877     .6909545    1.541893
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_
> multivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_multiva
> r1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1463.4233
Iteration 1:   log likelihood = -1383.6968
Iteration 2:   log likelihood = -1380.4457
Iteration 3:   log likelihood =  -1380.445
Refining estimates:
Iteration 0:   log likelihood =  -1380.445

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =          720
Time at risk    =     91503496
                                                LR chi2(24)      =      165.96
Log likelihood  =    -1380.445                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.609664   .2959753     2.59   0.010     1.122591     2.30807
      1.male |          1  (omitted)
        age1 |   1.066877    .215867     0.32   0.749     .7176062    1.586144
        age2 |   1.070437   .1198612     0.61   0.543     .8595053    1.333133
        age3 |   .8198212   .1785266    -0.91   0.362     .5350065    1.256259
             |
         imd |
          2  |    1.20042   .1760202     1.25   0.213     .9005744    1.600099
          3  |   1.302125   .1960824     1.75   0.080     .9693337     1.74917
          4  |   1.502185   .2368545     2.58   0.010     1.102837    2.046139
5 most de..  |   2.157145   .3464794     4.79   0.000     1.574563    2.955282
             |
   obese4cat |
Obese I ..)  |   1.185078   .1342622     1.50   0.134     .9490975    1.479731
Obese II..)  |   1.593406   .2852697     2.60   0.009     1.121849    2.263175
Obese II..)  |   1.774925   .5153888     1.98   0.048      1.00465    3.135778
             |
smoke_nomiss |
     Former  |   1.297879   .1231621     2.75   0.006     1.077604    1.563179
    Current  |    1.19569   .2203799     0.97   0.332     .8331673    1.715953
             |
     diabcat |
Controlle..  |   1.555024   .1729365     3.97   0.000     1.250471    1.933751
Uncontrol..  |    1.82186   .2824397     3.87   0.000     1.344482     2.46874
Diabetes,..  |   .9115185   .9934757    -0.09   0.932      .107654    7.717931
             |
1.myocardi~t |   2.014724   .4577661     3.08   0.002     1.290666    3.144976
       1.pad |    1.43248   .4071298     1.26   0.206     .8206648     2.50041
1.hyperten~n |   1.058636   .0964316     0.63   0.532     .8855442    1.265561
1.heart_f~re |   1.901108   .3542619     3.45   0.001      1.31944    2.739201
1.stroke_tia |   1.883764   .3322398     3.59   0.000     1.333214    2.661663
       1.vte |   2.155391   .4243336     3.90   0.000     1.465377    3.170318
 1.oestrogen |   .7328087   .7819907    -0.29   0.771     .0905026    5.933624
1.flu_vac~ne |   1.151479   .1187508     1.37   0.171     .9407459    1.409417
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_
> multivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_multiva
> r2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1463.4233
Iteration 1:   log likelihood = -1297.7247
Iteration 2:   log likelihood =  -1290.823
Iteration 3:   log likelihood = -1290.8083
Iteration 4:   log likelihood = -1290.8083
Refining estimates:
Iteration 0:   log likelihood = -1290.8083

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =          720
Time at risk    =     91503496
                                                LR chi2(31)      =      345.23
Log likelihood  =   -1290.8083                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.367603   .2629972     1.63   0.104     .9381444    1.993658
      1.male |          1  (omitted)
        age1 |   1.081214   .2247398     0.38   0.707     .7194188    1.624955
        age2 |    1.05628    .123148     0.47   0.639     .8405056    1.327449
        age3 |     .82112   .1845569    -0.88   0.381      .528553     1.27563
             |
         imd |
          2  |   1.169012   .1749063     1.04   0.297     .8718925    1.567382
          3  |    1.22075   .1884487     1.29   0.196     .9020399    1.652068
          4  |   1.397941   .2254723     2.08   0.038     1.019059    1.917689
5 most de..  |   1.966562   .3239383     4.11   0.000     1.423951     2.71594
             |
   obese4cat |
Obese I ..)  |   1.188315   .1385322     1.48   0.139     .9455827    1.493356
Obese II..)  |   1.615113   .2998897     2.58   0.010     1.122417    2.324083
Obese II..)  |   1.833373     .55468     2.00   0.045     1.013265    3.317253
             |
smoke_nomiss |
     Former  |   1.201714   .1187679     1.86   0.063     .9900913     1.45857
    Current  |   1.036147   .1984549     0.19   0.853     .7118519    1.508181
             |
     diabcat |
Controlle..  |   1.459372   .1689789     3.26   0.001     1.163072    1.831157
Uncontrol..  |   1.620291    .260398     3.00   0.003     1.182485     2.22019
Diabetes,..  |   1.004365    1.10316     0.00   0.997     .1166707    8.646126
             |
1.myocardi~t |   1.705551   .4071514     2.24   0.025      1.06823    2.723107
       1.pad |   1.425293    .419519     1.20   0.229     .8005025    2.537732
1.hyperten~n |   1.111996   .1044998     1.13   0.259     .9249359    1.336888
1.heart_f~re |   1.493078   .2927717     2.04   0.041     1.016655    2.192761
1.stroke_tia |   1.707828   .3160106     2.89   0.004      1.18834    2.454412
       1.vte |   1.906901    .389522     3.16   0.002     1.277773    2.845789
 1.oestrogen |   .7039687   .7436606    -0.33   0.740     .0887889    5.581465
1.flu_vac~ne |   1.085637   .1151886     0.77   0.439     .8818005    1.336593
             |
         ckd |
        CKD  |   1.238073   .1294797     2.04   0.041     1.008617    1.519729
      1.copd |   1.218931   .1564868     1.54   0.123     .9477674    1.567678
1.other_re~y |   2.378427   .3897197     5.29   0.000     1.725104    3.279173
1.immunode~y |   2.126389   .8694877     1.84   0.065     .9540771    4.739166
    1.cancer |   1.270788   .1283753     2.37   0.018     1.042521    1.549037
1.ae_atten~r |   2.675361   .2441575    10.78   0.000     2.237178    3.199369
1.gp_consult |    .444627   .2660506    -1.35   0.176     .1376145    1.436573
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_
> multivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/onscoviddeath_multiva
> r3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table2_onscovidd
> eath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.377681   .1359717     3.25   0.001     1.135372    1.671702
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.916921   .3413576     3.65   0.000     1.352152    2.717583
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.609664   .2959753     2.59   0.010     1.122591     2.30807
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.367603   .2629972     1.63   0.104     .9381444    1.993658
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_onsc
> oviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 11:40:22
-------------------------------------------------------------------------------
