-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/06c_an_models_ethn
> icity_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:42:04

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(100,542 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   298,859      1,466 |   300,325 
            |     99.51       0.49 |    100.00 
------------+----------------------+----------
current use |    36,516        242 |    36,758 
            |     99.34       0.66 |    100.00 
------------+----------------------+----------
      Total |   335,375      1,708 |   337,083 
            |     99.49       0.51 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3304.3568
Iteration 1:   log likelihood = -3300.8131
Iteration 2:   log likelihood = -3300.7961
Iteration 3:   log likelihood = -3300.7961
Refining estimates:
Iteration 0:   log likelihood = -3300.7961

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =        1,708
Time at risk    =   70371943.5
                                                LR chi2(1)       =        7.12
Log likelihood  =   -3300.7961                  Prob > chi2      =      0.0076

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.217392   .0879006     2.72   0.006     1.056745     1.40246
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_univar_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_uni
> var_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3304.3568
Iteration 1:   log likelihood = -3298.9929
Iteration 2:   log likelihood = -3298.9659
Iteration 3:   log likelihood = -3298.9659
Refining estimates:
Iteration 0:   log likelihood = -3298.9659

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =        1,708
Time at risk    =   70371943.5
                                                LR chi2(4)       =       10.78
Log likelihood  =   -3298.9659                  Prob > chi2      =      0.0291

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.290668   .1330269     2.48   0.013     1.054588    1.579597
      1.male |          1  (omitted)
        age1 |   1.085599   .1680883     0.53   0.596     .8014455    1.470499
        age2 |   1.083791   .1050327     0.83   0.406     .8963004    1.310501
        age3 |    .905807   .1839274    -0.49   0.626     .6084096    1.348575
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar1_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3304.3568
Iteration 1:   log likelihood = -3175.8132
Iteration 2:   log likelihood = -3172.8083
Iteration 3:   log likelihood = -3172.8073
Refining estimates:
Iteration 0:   log likelihood = -3172.8073

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =        1,708
Time at risk    =   70371943.5
                                                LR chi2(28)      =      263.10
Log likelihood  =   -3172.8073                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.184243   .1299691     1.54   0.123     .9550427     1.46845
      1.male |          1  (omitted)
        age1 |   1.244578   .1994731     1.37   0.172     .9090694    1.703913
        age2 |   1.004011   .1005827     0.04   0.968     .8250196    1.221835
        age3 |   .7912462   .1683592    -1.10   0.271     .5214291    1.200682
             |
         imd |
          2  |   1.260489   .1306276     2.23   0.025      1.02879    1.544369
          3  |   1.270781   .1366297     2.23   0.026     1.029326    1.568877
          4  |   1.504966      .1629     3.78   0.000     1.217282    1.860639
5 most de..  |   1.804711   .1983054     5.37   0.000     1.455043    2.238409
             |
   obese4cat |
Obese I ..)  |   1.181871   .0820673     2.41   0.016     1.031487    1.354179
Obese II..)  |   1.197047   .1323193     1.63   0.104     .9638758    1.486625
Obese II..)  |   1.170693   .1845672     1.00   0.317     .8594996    1.594558
             |
smoke_nomiss |
     Former  |   1.245643   .0752578     3.64   0.000     1.106539    1.402234
    Current  |   .6539856    .074327    -3.74   0.000     .5233921    .8171639
             |
     diabcat |
Controlle..  |    1.39714   .1081309     4.32   0.000     1.200499    1.625992
Uncontrol..  |   1.610585   .1668037     4.60   0.000     1.314702     1.97306
Diabetes,..  |   .4670014   .3688643    -0.96   0.335     .0993095    2.196068
             |
1.myocardi~t |   1.343322   .2597988     1.53   0.127     .9195124    1.962469
       1.pad |   2.351863    .520698     3.86   0.000     1.523904    3.629664
1.hyperten~n |   1.031396   .0609644     0.52   0.601     .9185697    1.158081
1.heart_f~re |   1.126445   .1748341     0.77   0.443     .8309908    1.526947
1.stroke_tia |   2.086516   .2772035     5.54   0.000     1.608183    2.707122
       1.vte |   1.889997   .2641379     4.55   0.000     1.437146    2.485544
 1.oestrogen |   1.193828   .3465953     0.61   0.542     .6758012    2.108943
1.flu_vac~ne |   .8753863   .0563064    -2.07   0.039     .7717009     .993003
             |
   ethnicity |
      Mixed  |   1.008508    .350341     0.02   0.981     .5104865     1.99239
Asian or ..  |    2.16896   .2992485     5.61   0.000     1.655055    2.842436
      Black  |   1.684585   .3264465     2.69   0.007     1.152241    2.462876
      Other  |   1.547412   .4096105     1.65   0.099     .9210583    2.599709
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar2_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3304.3568
Iteration 1:   log likelihood =  -3192.684
Iteration 2:   log likelihood = -3189.7992
Iteration 3:   log likelihood = -3189.7982
Refining estimates:
Iteration 0:   log likelihood = -3189.7982

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =        1,708
Time at risk    =   70371943.5
                                                LR chi2(24)      =      229.12
Log likelihood  =   -3189.7982                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.147423   .1253193     1.26   0.208     .9263114    1.421314
      1.male |          1  (omitted)
        age1 |   1.266156   .2027648     1.47   0.141     .9250688    1.733007
        age2 |   .9955501   .0997854    -0.04   0.965     .8179861    1.211659
        age3 |    .788188   .1680181    -1.12   0.264      .519014    1.196963
             |
         imd |
          2  |    1.27053   .1314321     2.31   0.021     1.037364    1.556105
          3  |   1.277727   .1371088     2.28   0.022     1.035377    1.576804
          4  |   1.515647   .1637312     3.85   0.000     1.226437    1.873058
5 most de..  |   1.838981   .2014412     5.56   0.000     1.483669    2.279384
             |
   obese4cat |
Obese I ..)  |   1.156091   .0800388     2.10   0.036     1.009395    1.324105
Obese II..)  |   1.155694   .1271225     1.32   0.188     .9315662    1.433746
Obese II..)  |   1.111404   .1747516     0.67   0.502     .8166453    1.512554
             |
smoke_nomiss |
     Former  |   1.195532   .0712888     3.00   0.003     1.063665    1.343748
    Current  |   .6187114   .0699079    -4.25   0.000     .4958054    .7720847
             |
     diabcat |
Controlle..  |   1.460767   .1120663     4.94   0.000     1.256837    1.697786
Uncontrol..  |   1.711799   .1755086     5.24   0.000     1.400168    2.092789
Diabetes,..  |   .5351224    .408499    -0.82   0.413     .1198581    2.389126
             |
1.myocardi~t |   1.360033   .2618821     1.60   0.110     .9324932    1.983596
       1.pad |   2.346958   .5193305     3.86   0.000     1.521084    3.621243
1.hyperten~n |   1.039715   .0613417     0.66   0.509     .9261779    1.167169
1.heart_f~re |   1.124341   .1742602     0.76   0.450     .8297965    1.523438
1.stroke_tia |   2.118398   .2802352     5.67   0.000     1.634577    2.745428
       1.vte |   1.877788   .2620855     4.51   0.000     1.428378    2.468595
 1.oestrogen |   1.177982   .3407756     0.57   0.571     .6681844    2.076733
1.flu_vac~ne |   .8693635   .0557051    -2.18   0.029      .766761    .9856956
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar2_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3304.3568
Iteration 1:   log likelihood = -3076.0174
Iteration 2:   log likelihood = -3071.6366
Iteration 3:   log likelihood =  -3071.635
Iteration 4:   log likelihood =  -3071.635
Refining estimates:
Iteration 0:   log likelihood =  -3071.635

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =        1,708
Time at risk    =   70371943.5
                                                LR chi2(35)      =      465.44
Log likelihood  =    -3071.635                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.095789   .1223769     0.82   0.413     .8803703    1.363919
      1.male |          1  (omitted)
        age1 |   1.223622   .1977093     1.25   0.212     .8914819    1.679507
        age2 |   1.008005   .1019749     0.08   0.937     .8267059    1.229065
        age3 |   .7820523   .1679963    -1.14   0.252     .5133166    1.191479
             |
         imd |
          2  |   1.237262   .1298279     2.03   0.042     1.007265    1.519777
          3  |   1.222277   .1332857     1.84   0.066     .9870718    1.513529
          4  |   1.395224   .1534774     3.03   0.002     1.124631    1.730923
5 most de..  |   1.665531   .1859138     4.57   0.000     1.338252    2.072848
             |
   obese4cat |
Obese I ..)  |   1.172143   .0825018     2.26   0.024       1.0211    1.345528
Obese II..)  |   1.192255   .1335788     1.57   0.117     .9571978    1.485035
Obese II..)  |   1.072792   .1713993     0.44   0.660     .7843677    1.467275
             |
smoke_nomiss |
     Former  |   1.191135   .0741556     2.81   0.005      1.05431    1.345716
    Current  |   .5888222   .0684061    -4.56   0.000     .4689174    .7393873
             |
     diabcat |
Controlle..  |   1.364167   .1075198     3.94   0.000     1.168903    1.592051
Uncontrol..  |   1.567535   .1649264     4.27   0.000     1.275437    1.926528
Diabetes,..  |   .4194581   .3312788    -1.10   0.271      .089213    1.972191
             |
1.myocardi~t |   1.257802   .2502109     1.15   0.249     .8516976    1.857545
       1.pad |   2.174714   .5007186     3.37   0.001     1.384894    3.414976
1.hyperten~n |   1.026883   .0618733     0.44   0.660     .9125009    1.155604
1.heart_f~re |   .9137557   .1465173    -0.56   0.574     .6673338    1.251172
1.stroke_tia |   1.933164   .2645827     4.82   0.000     1.478321     2.52795
       1.vte |   1.647758   .2351056     3.50   0.000     1.245782    2.179439
 1.oestrogen |   1.223365   .3550179     0.69   0.487       .69269    2.160592
1.flu_vac~ne |   .8343836   .0545997    -2.77   0.006     .7339484    .9485626
             |
         ckd |
        CKD  |   1.385033   .1119582     4.03   0.000     1.182099    1.622805
      1.copd |   1.304622   .1223984     2.83   0.005      1.08549    1.567991
1.other_re~y |   1.833274   .2387887     4.65   0.000     1.420222    2.366457
1.immunode~y |    .898826   .2714698    -0.35   0.724     .4972671    1.624657
    1.cancer |   1.069653   .0825636     0.87   0.383      .919477    1.244356
1.ae_atten~r |   2.069352    .128959    11.67   0.000     1.831423    2.338191
1.gp_consult |   2.713951   2.105964     1.29   0.198     .5930471    12.41981
             |
   ethnicity |
      Mixed  |   1.068359   .3730009     0.19   0.850     .5389313    2.117878
Asian or ..  |   2.202629   .3072472     5.66   0.000     1.675739    2.895186
      Black  |   1.762299   .3441463     2.90   0.004     1.201863    2.584071
      Other  |   1.725278   .4586036     2.05   0.040     1.024702     2.90483
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar3_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -3304.3568
Iteration 1:   log likelihood = -3094.0882
Iteration 2:   log likelihood = -3089.5844
Iteration 3:   log likelihood =  -3089.583
Iteration 4:   log likelihood =  -3089.583
Refining estimates:
Iteration 0:   log likelihood =  -3089.583

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =        1,708
Time at risk    =   70371943.5
                                                LR chi2(31)      =      429.55
Log likelihood  =    -3089.583                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.061967   .1180169     0.54   0.588     .8541155      1.3204
      1.male |          1  (omitted)
        age1 |   1.243178   .2006513     1.35   0.177     .9060405    1.705763
        age2 |   1.002047   .1013232     0.02   0.984     .8218981    1.221683
        age3 |   .7755777   .1668165    -1.18   0.237     .5087953    1.182245
             |
         imd |
          2  |   1.249622   .1308298     2.13   0.033     1.017798    1.534248
          3  |   1.229881   .1337702     1.90   0.057     .9937577    1.522108
          4  |    1.40788    .154478     3.12   0.002     1.135451    1.745672
5 most de..  |   1.699407   .1890593     4.77   0.000     1.366473    2.113458
             |
   obese4cat |
Obese I ..)  |   1.146359   .0804448     1.95   0.052     .9990523    1.315385
Obese II..)  |   1.148354   .1280659     1.24   0.215     .9228875    1.428903
Obese II..)  |   1.015291   .1618054     0.10   0.924     .7429089    1.387539
             |
smoke_nomiss |
     Former  |   1.139829   .0700357     2.13   0.033     1.010505    1.285704
    Current  |   .5564771   .0642946    -5.07   0.000     .4437115    .6979011
             |
     diabcat |
Controlle..  |   1.431293   .1117817     4.59   0.000     1.228149    1.668038
Uncontrol..  |   1.664102   .1733989     4.89   0.000     1.356704    2.041149
Diabetes,..  |   .4719192   .3615581    -0.98   0.327     .1051295    2.118413
             |
1.myocardi~t |   1.274878   .2525456     1.23   0.220     .8646707    1.879691
       1.pad |   2.168757   .4989822     3.36   0.001     1.381556    3.404499
1.hyperten~n |   1.036784   .0623233     0.60   0.548     .9215542    1.166423
1.heart_f~re |   .9198353   .1470278    -0.52   0.601     .6724389    1.258251
1.stroke_tia |   1.965053   .2679084     4.95   0.000     1.504265    2.566989
       1.vte |   1.634504   .2330676     3.45   0.001      1.23598    2.161528
 1.oestrogen |   1.212511   .3502938     0.67   0.505      .688294    2.135981
1.flu_vac~ne |   .8285839   .0540155    -2.88   0.004     .7291998    .9415133
             |
         ckd |
        CKD  |   1.380513   .1114836     3.99   0.000     1.178424    1.617258
      1.copd |   1.304971   .1221774     2.84   0.004     1.086194    1.567813
1.other_re~y |   1.823909    .237204     4.62   0.000     1.413521    2.353445
1.immunode~y |   .9343065   .2809912    -0.23   0.821     .5181934    1.684561
    1.cancer |   1.060949   .0817835     0.77   0.443     .9121775    1.233984
1.ae_atten~r |   2.057665   .1278781    11.61   0.000     1.821691    2.324205
1.gp_consult |   2.756458   2.131497     1.31   0.190     .6055354    12.54768
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar3_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table3_positivec
> ovidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    300,325    6.27e+07           0   6.27e+07   6.27e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     36,758     7650206           0    7650206    7650206

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.217392   .0879006     2.72   0.006     1.056745     1.40246
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.290668   .1330269     2.48   0.013     1.054588    1.579597
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.184243   .1299691     1.54   0.123     .9550427     1.46845
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.147423   .1253193     1.26   0.208     .9263114    1.421314
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.095789   .1223769     0.82   0.413     .8803703    1.363919
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.061967   .1180169     0.54   0.588     .8541155      1.3204
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/06c_an_models_ethn
> icity_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:44:46
-------------------------------------------------------------------------------
