-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/06c_an_models_ethn
> icity_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:41:00

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(100,542 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the | outcome: first covid
   exposure |         test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   288,122     12,203 |   300,325 
            |     95.94       4.06 |    100.00 
------------+----------------------+----------
current use |    34,445      2,313 |    36,758 
            |     93.71       6.29 |    100.00 
------------+----------------------+----------
      Total |   322,567     14,516 |   337,083 
            |     95.69       4.31 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28055.386
Iteration 1:   log likelihood = -27920.112
Iteration 2:   log likelihood = -27916.859
Iteration 3:   log likelihood = -27916.858
Refining estimates:
Iteration 0:   log likelihood = -27916.858

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =       14,516
Time at risk    =     69366354
                                                LR chi2(1)       =      277.06
Log likelihood  =   -27916.858                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.508551   .0357809    17.33   0.000     1.440027    1.580336
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_univ
> ar_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_univar_ethn
> .ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28055.386
Iteration 1:   log likelihood = -27910.711
Iteration 2:   log likelihood = -27905.624
Iteration 3:   log likelihood = -27905.621
Refining estimates:
Iteration 0:   log likelihood = -27905.621

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =       14,516
Time at risk    =     69366354
                                                LR chi2(4)       =      299.53
Log likelihood  =   -27905.621                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.664433     .05687    14.91   0.000      1.55662    1.779713
      1.male |          1  (omitted)
        age1 |   .9506623   .0597617    -0.80   0.421     .8404599    1.075315
        age2 |   1.062342   .0397439     1.62   0.106     .9872331    1.143166
        age3 |   1.083948    .091515     0.95   0.340     .9186359    1.279008
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar1_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar1_e
> thn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28055.386
Iteration 1:   log likelihood = -27614.374
Iteration 2:   log likelihood = -27603.893
Iteration 3:   log likelihood = -27603.888
Refining estimates:
Iteration 0:   log likelihood = -27603.888

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =       14,516
Time at risk    =     69366354
                                                LR chi2(28)      =      903.00
Log likelihood  =   -27603.888                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.494107    .054498    11.01   0.000     1.391021    1.604831
      1.male |          1  (omitted)
        age1 |   1.068438    .068129     1.04   0.299     .9429151    1.210671
        age2 |   .9818703   .0376232    -0.48   0.633     .9108312     1.05845
        age3 |   1.051921   .0909105     0.59   0.558     .8880129    1.246082
             |
         imd |
          2  |   1.028171   .0333817     0.86   0.392     .9647821    1.095724
          3  |   1.065492   .0356028     1.90   0.058     .9979475    1.137608
          4  |   1.081466   .0376508     2.25   0.024     1.010133    1.157836
5 most de..  |   1.212004   .0440113     5.29   0.000     1.128742    1.301408
             |
   obese4cat |
Obese I ..)  |   1.030571   .0247694     1.25   0.210     .9831495     1.08028
Obese II..)  |   1.033381   .0402924     0.84   0.400     .9573517    1.115449
Obese II..)  |   1.075982   .0610982     1.29   0.197     .9626547     1.20265
             |
smoke_nomiss |
     Former  |   1.156582   .0236414     7.12   0.000     1.111161    1.203859
    Current  |   1.256202   .0409565     7.00   0.000      1.17844    1.339096
             |
     diabcat |
Controlle..  |   1.148188   .0321371     4.94   0.000     1.086896    1.212935
Uncontrol..  |   1.386746   .0541198     8.38   0.000     1.284628    1.496981
Diabetes,..  |   .9853278   .2071074    -0.07   0.944     .6526277    1.487634
             |
1.myocardi~t |   1.230985   .0896675     2.85   0.004     1.067209    1.419894
       1.pad |   1.681335   .1386861     6.30   0.000      1.43035    1.976361
1.hyperten~n |    1.02281   .0202949     1.14   0.256     .9837958    1.063371
1.heart_f~re |   1.403843   .0717864     6.63   0.000     1.269965    1.551834
1.stroke_tia |   1.496481   .0795016     7.59   0.000     1.348498    1.660702
       1.vte |   1.451756   .0782255     6.92   0.000     1.306255    1.613464
 1.oestrogen |   1.114495   .1008193     1.20   0.231     .9334197    1.330698
1.flu_vac~ne |   1.050124   .0232333     2.21   0.027     1.005561    1.096662
             |
   ethnicity |
      Mixed  |   1.689236   .2054807     4.31   0.000     1.330912    2.144033
Asian or ..  |   1.751923   .1003905     9.79   0.000     1.565808     1.96016
      Black  |    1.59372   .1316735     5.64   0.000     1.355456    1.873865
      Other  |   1.229044   .1214098     2.09   0.037     1.012703      1.4916
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar2_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar2_e
> thn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28055.386
Iteration 1:   log likelihood = -27675.284
Iteration 2:   log likelihood = -27665.033
Iteration 3:   log likelihood = -27665.027
Refining estimates:
Iteration 0:   log likelihood = -27665.027

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =       14,516
Time at risk    =     69366354
                                                LR chi2(24)      =      780.72
Log likelihood  =   -27665.027                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.468511   .0534527    10.56   0.000     1.367396    1.577104
      1.male |          1  (omitted)
        age1 |   1.076138   .0686033     1.15   0.250      .949739    1.219359
        age2 |   .9753607   .0373932    -0.65   0.515     .9047571    1.051474
        age3 |   1.055674   .0913292     0.63   0.531      .891025    1.250747
             |
         imd |
          2  |   1.028132    .033356     0.86   0.392     .9647912    1.095632
          3  |   1.065849    .035593     1.91   0.056     .9983225    1.137944
          4  |   1.086781   .0377914     2.39   0.017     1.015179    1.163434
5 most de..  |   1.225747   .0444278     5.62   0.000     1.141691    1.315991
             |
   obese4cat |
Obese I ..)  |    1.02033   .0244874     0.84   0.402     .9734466    1.069471
Obese II..)  |   1.017427   .0396165     0.44   0.657     .9426694    1.098114
Obese II..)  |   1.051484   .0596278     0.89   0.376     .9408764    1.175095
             |
smoke_nomiss |
     Former  |   1.136783   .0231147     6.31   0.000      1.09237    1.183002
    Current  |    1.22783   .0399082     6.31   0.000     1.152051    1.308594
             |
     diabcat |
Controlle..  |   1.182408   .0328806     6.03   0.000     1.119688    1.248641
Uncontrol..  |   1.435639   .0557335     9.31   0.000     1.330456    1.549138
Diabetes,..  |    1.01464   .2127041     0.07   0.945     .6727754    1.530219
             |
1.myocardi~t |   1.238992   .0901066     2.95   0.003     1.074396    1.428804
       1.pad |   1.672468   .1378071     6.24   0.000     1.423053    1.965598
1.hyperten~n |   1.028008   .0203818     1.39   0.164     .9888266    1.068742
1.heart_f~re |   1.406019   .0718591     6.67   0.000     1.272002    1.554156
1.stroke_tia |   1.501487   .0796459     7.66   0.000     1.353225    1.665994
       1.vte |   1.440968    .077581     6.79   0.000      1.29666    1.601336
 1.oestrogen |   1.104513   .0998571     1.10   0.272     .9251566    1.318641
1.flu_vac~ne |    1.04826   .0231588     2.13   0.033     1.003838    1.094647
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar2_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar2_w
> ithoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28055.386
Iteration 1:   log likelihood = -26909.087
Iteration 2:   log likelihood = -26884.883
Iteration 3:   log likelihood = -26884.881
Refining estimates:
Iteration 0:   log likelihood = -26884.881

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =       14,516
Time at risk    =     69366354
                                                LR chi2(35)      =     2341.01
Log likelihood  =   -26884.881                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.368634   .0509291     8.43   0.000     1.272368    1.472184
      1.male |          1  (omitted)
        age1 |    1.05619   .0682907     0.85   0.398     .9304765    1.198888
        age2 |   .9861081   .0382804    -0.36   0.719     .9138632    1.064064
        age3 |   1.041594   .0911415     0.47   0.641     .8774386    1.236461
             |
         imd |
          2  |   1.018883   .0333589     0.57   0.568     .9555545    1.086409
          3  |   1.052812   .0354882     1.53   0.127     .9855044    1.124717
          4  |   1.059044      .0372     1.63   0.102     .9885863    1.134523
5 most de..  |   1.154687    .042401     3.92   0.000     1.074503    1.240855
             |
   obese4cat |
Obese I ..)  |    1.03676   .0251954     1.49   0.137     .9885358    1.087337
Obese II..)  |   1.044178   .0411285     1.10   0.272     .9666005    1.127981
Obese II..)  |   1.067557   .0611929     1.14   0.254     .9541131     1.19449
             |
smoke_nomiss |
     Former  |   1.116074    .023326     5.25   0.000     1.071279    1.162741
    Current  |    1.18526   .0398719     5.05   0.000     1.109633    1.266041
             |
     diabcat |
Controlle..  |   1.109924   .0314767     3.68   0.000     1.049914    1.173364
Uncontrol..  |   1.351709   .0535026     7.61   0.000      1.25081    1.460746
Diabetes,..  |   .9508873   .2023625    -0.24   0.813     .6265866    1.443035
             |
1.myocardi~t |   1.143165   .0846742     1.81   0.071     .9886907    1.321775
       1.pad |   1.557995   .1311717     5.27   0.000     1.320995    1.837515
1.hyperten~n |   1.009349   .0203406     0.46   0.644     .9702595    1.050014
1.heart_f~re |   1.270895   .0662391     4.60   0.000      1.14748    1.407585
1.stroke_tia |    1.37837   .0745848     5.93   0.000     1.239671    1.532587
       1.vte |   1.294327   .0708611     4.71   0.000     1.162634    1.440937
 1.oestrogen |   1.084882   .0990581     0.89   0.372     .9071129    1.297489
1.flu_vac~ne |   1.011261   .0226856     0.50   0.618      .967761    1.056716
             |
         ckd |
        CKD  |   1.226758   .0352935     7.10   0.000     1.159498     1.29792
      1.copd |   1.179758   .0384069     5.08   0.000     1.106833    1.257488
1.other_re~y |   1.526666   .0702955     9.19   0.000     1.394924    1.670851
1.immunode~y |   1.251259   .1236182     2.27   0.023     1.030986    1.518594
    1.cancer |    1.55963   .0378384    18.32   0.000     1.487204    1.635583
1.ae_atten~r |   1.903729   .0422154    29.03   0.000      1.82276    1.988294
1.gp_consult |   .9941386   .1825582    -0.03   0.974     .6936445     1.42481
             |
   ethnicity |
      Mixed  |    1.74481   .2138546     4.54   0.000     1.372207    2.218587
Asian or ..  |   1.792626    .103845    10.08   0.000     1.600223    2.008163
      Black  |   1.557612   .1303772     5.29   0.000     1.321937    1.835302
      Other  |   1.279695   .1273536     2.48   0.013     1.052922     1.55531
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar3_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar3_e
> thn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -28055.386
Iteration 1:   log likelihood = -26973.323
Iteration 2:   log likelihood = -26948.381
Iteration 3:   log likelihood = -26948.379
Refining estimates:
Iteration 0:   log likelihood = -26948.379

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      337,083                  Number of obs    =     337,083
No. of failures =       14,516
Time at risk    =     69366354
                                                LR chi2(31)      =     2214.01
Log likelihood  =   -26948.379                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.34497   .0499365     7.98   0.000     1.250573    1.446493
      1.male |          1  (omitted)
        age1 |   1.062483   .0686904     0.94   0.349     .9360331    1.206016
        age2 |   .9798308   .0380588    -0.52   0.600     .9080056    1.057338
        age3 |   1.044277   .0914824     0.49   0.621     .8795233    1.239892
             |
         imd |
          2  |   1.019187   .0333434     0.58   0.561     .9558862     1.08668
          3  |   1.053699    .035496     1.55   0.120     .9863755    1.125618
          4  |   1.064532   .0373492     1.78   0.075     .9937887     1.14031
5 most de..  |   1.168146   .0428168     4.24   0.000      1.08717    1.255153
             |
   obese4cat |
Obese I ..)  |   1.026151   .0249005     1.06   0.287      .978489    1.076134
Obese II..)  |    1.02679   .0403867     0.67   0.501     .9506082    1.109078
Obese II..)  |   1.042535    .059665     0.73   0.467     .9319141    1.166288
             |
smoke_nomiss |
     Former  |    1.09653   .0227985     4.43   0.000     1.052744    1.142137
    Current  |   1.158984   .0388757     4.40   0.000      1.08524    1.237739
             |
     diabcat |
Controlle..  |   1.144275   .0322425     4.78   0.000     1.082794    1.209246
Uncontrol..  |    1.39949   .0551209     8.53   0.000     1.295519    1.511804
Diabetes,..  |   .9816831   .2081957    -0.09   0.931     .6478108    1.487628
             |
1.myocardi~t |   1.151736    .085131     1.91   0.056     .9964054    1.331281
       1.pad |   1.546275   .1300558     5.18   0.000     1.311272    1.823394
1.hyperten~n |   1.014306   .0204243     0.71   0.481     .9750546    1.055137
1.heart_f~re |   1.272867   .0663005     4.63   0.000     1.149334    1.409679
1.stroke_tia |   1.380254   .0745989     5.96   0.000     1.241521     1.53449
       1.vte |    1.28458   .0702723     4.58   0.000     1.153975    1.429966
 1.oestrogen |   1.076376   .0982005     0.81   0.420      .900133    1.287126
1.flu_vac~ne |   1.010094   .0226244     0.45   0.654       .96671    1.055425
             |
         ckd |
        CKD  |   1.229086   .0353251     7.18   0.000     1.161764    1.300309
      1.copd |   1.172337   .0381232     4.89   0.000     1.099949     1.24949
1.other_re~y |   1.527041   .0702641     9.20   0.000     1.395353    1.671157
1.immunode~y |   1.268854   .1252894     2.41   0.016     1.045592    1.539789
    1.cancer |   1.550371   .0375572    18.10   0.000     1.478481    1.625757
1.ae_atten~r |   1.905696   .0422168    29.11   0.000     1.824724    1.990262
1.gp_consult |   .9952573   .1827093    -0.03   0.979     .6944993    1.426261
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_mult
> ivar3_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/covidtest_multivar3_w
> ithoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table3_covidtest
> .txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    300,325    6.19e+07           0   6.19e+07   6.19e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     36,758     7489914           0    7489914    7489914

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.508551   .0357809    17.33   0.000     1.440027    1.580336
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.664433     .05687    14.91   0.000      1.55662    1.779713
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.494107    .054498    11.01   0.000     1.391021    1.604831
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.468511   .0534527    10.56   0.000     1.367396    1.577104
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.368634   .0509291     8.43   0.000     1.272368    1.472184
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.34497   .0499365     7.98   0.000     1.250573    1.446493
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/06c_an_models_ethn
> icity_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:43:38
-------------------------------------------------------------------------------
