-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_admi
> tcovid.log
  log type:  text
 opened on:  31 Dec 2020, 11:39:30

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |
 indicating |   Failure/censoring
        the |     indicator for
   exposure |  outcome: SUS covid
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   387,268        867 |   388,135 
            |     99.78       0.22 |    100.00 
------------+----------------------+----------
current use |    49,330        160 |    49,490 
            |     99.68       0.32 |    100.00 
------------+----------------------+----------
      Total |   436,598      1,027 |   437,625 
            |     99.77       0.23 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2152.5136
Iteration 1:   log likelihood = -2149.1587
Iteration 2:   log likelihood = -2149.1318
Iteration 3:   log likelihood = -2149.1318
Refining estimates:
Iteration 0:   log likelihood = -2149.1318

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        1,027
Time at risk    =     91407042
                                                LR chi2(1)       =        6.76
Log likelihood  =   -2149.1318                  Prob > chi2      =      0.0093

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.262245   .1101197     2.67   0.008     1.063858    1.497626
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_uni
> var.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_univar.ste
> r saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2152.5136
Iteration 1:   log likelihood = -2144.5373
Iteration 2:   log likelihood = -2144.4445
Iteration 3:   log likelihood = -2144.4445
Refining estimates:
Iteration 0:   log likelihood = -2144.4445

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        1,027
Time at risk    =     91407042
                                                LR chi2(4)       =       16.14
Log likelihood  =   -2144.4445                  Prob > chi2      =      0.0028

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.524454   .2136367     3.01   0.003     1.158316    2.006326
      1.male |          1  (omitted)
        age1 |   1.114481   .2128831     0.57   0.570     .7664436    1.620561
        age2 |   1.167327   .1338814     1.35   0.177      .932326    1.461563
        age3 |    .911894   .2054763    -0.41   0.682     .5863324    1.418224
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar1.
> ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2152.5136
Iteration 1:   log likelihood = -2061.1865
Iteration 2:   log likelihood = -2058.2541
Iteration 3:   log likelihood = -2058.2528
Iteration 4:   log likelihood = -2058.2528
Refining estimates:
Iteration 0:   log likelihood = -2058.2528

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        1,027
Time at risk    =     91407042
                                                LR chi2(24)      =      188.52
Log likelihood  =   -2058.2528                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.206202   .1794431     1.26   0.208      .901134    1.614548
      1.male |          1  (omitted)
        age1 |    1.35547   .2649139     1.56   0.120     .9241245     1.98815
        age2 |    1.02472   .1207033     0.21   0.836     .8134691    1.290832
        age3 |   .8043011   .1899284    -0.92   0.356     .5063084     1.27768
             |
         imd |
          2  |   1.264025   .1585138     1.87   0.062     .9885795    1.616217
          3  |   1.265309   .1670344     1.78   0.075     .9768519    1.638945
          4  |   1.417058   .1903184     2.60   0.009     1.089097    1.843777
5 most de..  |    1.77635   .2428942     4.20   0.000     1.358743    2.322309
             |
   obese4cat |
Obese I ..)  |   1.214678   .1102655     2.14   0.032     1.016696    1.451213
Obese II..)  |   1.750504    .228127     4.30   0.000      1.35592    2.259917
Obese II..)  |   1.549723   .3298372     2.06   0.040     1.021146     2.35191
             |
smoke_nomiss |
     Former  |   1.327059   .1028124     3.65   0.000     1.140104    1.544671
    Current  |   .8478934   .1266618    -1.10   0.269     .6326817    1.136311
             |
     diabcat |
Controlle..  |   1.613349   .1496898     5.16   0.000     1.345092    1.935105
Uncontrol..  |   1.719468    .221701     4.20   0.000       1.3355    2.213831
Diabetes,..  |   .5629957   .5842445    -0.55   0.580     .0736507    4.303611
             |
1.myocardi~t |   1.728325   .3615252     2.62   0.009     1.147028    2.604215
       1.pad |   1.343005   .3777019     1.05   0.294     .7739067    2.330593
1.hyperten~n |   .9567046     .07107    -0.60   0.551     .8270758     1.10665
1.heart_f~re |   1.715395   .2902951     3.19   0.001     1.231164     2.39008
1.stroke_tia |   1.589932   .2717099     2.71   0.007       1.1374    2.222511
       1.vte |   2.085147   .3639246     4.21   0.000     1.481068    2.935611
 1.oestrogen |   1.339785   .6323974     0.62   0.535     .5311977    3.379203
1.flu_vac~ne |   .8983365   .0727349    -1.32   0.185     .7665147    1.052828
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar2.
> ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2152.5136
Iteration 1:   log likelihood = -1983.5257
Iteration 2:   log likelihood = -1979.1667
Iteration 3:   log likelihood = -1979.1648
Iteration 4:   log likelihood = -1979.1648
Refining estimates:
Iteration 0:   log likelihood = -1979.1648

Stratified Cox regr. -- no ties

No. of subjects =      437,625                  Number of obs    =     437,625
No. of failures =        1,027
Time at risk    =     91407042
                                                LR chi2(31)      =      346.70
Log likelihood  =   -1979.1648                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    1.18877   .1800901     1.14   0.254      .883379    1.599738
      1.male |          1  (omitted)
        age1 |   1.244342   .2485799     1.09   0.274     .8411949    1.840698
        age2 |   1.087777   .1322707     0.69   0.489     .8571096    1.380523
        age3 |   .7839864   .1890544    -1.01   0.313     .4887036    1.257684
             |
         imd |
          2  |   1.246408   .1580361     1.74   0.082     .9721506    1.598037
          3  |   1.178987   .1581264     1.23   0.220     .9064528    1.533461
          4  |   1.312664   .1788772     2.00   0.046     1.004986    1.714538
5 most de..  |   1.588469   .2209618     3.33   0.001     1.209409    2.086334
             |
   obese4cat |
Obese I ..)  |   1.225439    .113063     2.20   0.028     1.022721    1.468339
Obese II..)  |   1.752272   .2318416     4.24   0.000      1.35201    2.271032
Obese II..)  |   1.441186   .3103655     1.70   0.090     .9449527    2.198011
             |
smoke_nomiss |
     Former  |   1.217845    .096973     2.48   0.013      1.04187    1.423542
    Current  |   .7345408   .1123981    -2.02   0.044     .5442101    .9914372
             |
     diabcat |
Controlle..  |   1.568265   .1481783     4.76   0.000     1.303146     1.88732
Uncontrol..  |   1.576554   .2072101     3.46   0.001     1.218522    2.039784
Diabetes,..  |   .5080601   .5456812    -0.63   0.528     .0618989    4.170104
             |
1.myocardi~t |   1.633192   .3534343     2.27   0.023     1.068639    2.495992
       1.pad |   1.038738   .3067364     0.13   0.898     .5823027    1.852949
1.hyperten~n |   .9699068   .0734075    -0.40   0.686     .8361935    1.125002
1.heart_f~re |    1.36885   .2409791     1.78   0.075     .9694072    1.932883
1.stroke_tia |   1.405654   .2477371     1.93   0.053     .9950845    1.985624
       1.vte |   1.848203   .3297712     3.44   0.001     1.302781    2.621971
 1.oestrogen |   1.230485   .5746661     0.44   0.657      .492657    3.073321
1.flu_vac~ne |   .8500388   .0699806    -1.97   0.048     .7233731    .9988841
             |
         ckd |
        CKD  |   1.354866   .1255084     3.28   0.001     1.129913    1.624604
      1.copd |   1.661267   .1765471     4.78   0.000     1.348901    2.045967
1.other_re~y |   1.503153   .2229167     2.75   0.006      1.12401    2.010184
1.immunode~y |   .7916296   .3384379    -0.55   0.585     .3424648    1.829903
    1.cancer |   1.225007   .1081086     2.30   0.021     1.030431    1.456325
1.ae_atten~r |   2.155709   .1685811     9.82   0.000     1.849372    2.512788
1.gp_consult |   .5797023   .3647142    -0.87   0.386     .1689194    1.989438
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar3.
> ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table2_admitcovi
> d.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.262245   .1101197     2.67   0.008     1.063858    1.497626
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.524454   .2136367     3.01   0.003     1.158316    2.006326
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.206202   .1794431     1.26   0.208      .901134    1.614548
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.18877   .1800901     1.14   0.254      .883379    1.599738
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_admi
> tcovid.log
  log type:  text
 closed on:  31 Dec 2020, 11:41:22
-------------------------------------------------------------------------------
