-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_posi
> tivecovidtest.log
  log type:  text
 opened on:   2 Mar 2021, 06:41:33

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |   Failure/censoring
 indicating |     indicator for
        the |    outcome: first
   exposure |  positive covid test
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   386,381      1,851 |   388,232 
            |     99.52       0.48 |    100.00 
------------+----------------------+----------
current use |    49,199        321 |    49,520 
            |     99.35       0.65 |    100.00 
------------+----------------------+----------
      Total |   435,580      2,172 |   437,752 
            |     99.50       0.50 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -4644.024
Iteration 1:   log likelihood = -4637.8311
Iteration 2:   log likelihood = -4637.7844
Iteration 3:   log likelihood = -4637.7844
Refining estimates:
Iteration 0:   log likelihood = -4637.7844

Stratified Cox regr. -- no ties

No. of subjects =      437,752                  Number of obs    =     437,752
No. of failures =        2,172
Time at risk    =   91340564.5
                                                LR chi2(1)       =       12.48
Log likelihood  =   -4637.7844                  Prob > chi2      =      0.0004

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.249124   .0766766     3.62   0.000     1.107529    1.408821
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_univar.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_uni
> var.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -4644.024
Iteration 1:   log likelihood = -4636.8536
Iteration 2:   log likelihood = -4636.7542
Iteration 3:   log likelihood = -4636.7542
Refining estimates:
Iteration 0:   log likelihood = -4636.7542

Stratified Cox regr. -- no ties

No. of subjects =      437,752                  Number of obs    =     437,752
No. of failures =        2,172
Time at risk    =   91340564.5
                                                LR chi2(4)       =       14.54
Log likelihood  =   -4636.7542                  Prob > chi2      =      0.0058

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.333917    .117791     3.26   0.001     1.121925    1.585966
      1.male |          1  (omitted)
        age1 |   .9838966   .1365814    -0.12   0.907     .7495289    1.291548
        age2 |   .9887798   .0820863    -0.14   0.892     .8403007    1.163495
        age3 |   1.171075   .1986386     0.93   0.352     .8398529    1.632924
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar1.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(set_id) 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -4644.024
Iteration 1:   log likelihood = -4529.4814
Iteration 2:   log likelihood = -4524.4661
Iteration 3:   log likelihood =   -4524.44
Iteration 4:   log likelihood = -4524.4398
Iteration 5:   log likelihood = -4524.4398
Refining estimates:
Iteration 0:   log likelihood = -4524.4398

Stratified Cox regr. -- no ties

No. of subjects =      437,752                  Number of obs    =     437,752
No. of failures =        2,172
Time at risk    =   91340564.5
                                                LR chi2(24)      =      239.17
Log likelihood  =   -4524.4398                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.161425   .1078412     1.61   0.107     .9681776    1.393244
      1.male |          1  (omitted)
        age1 |    1.15012   .1636102     0.98   0.326     .8702728    1.519955
        age2 |   .9106834   .0780495    -1.09   0.275     .7698672    1.077256
        age3 |    1.07713   .1914378     0.42   0.676     .7602989     1.52599
             |
         imd |
          2  |   1.114928   .0948284     1.28   0.201     .9437335    1.317178
          3  |   1.127932   .0992807     1.37   0.171     .9492046    1.340311
          4  |   1.199254   .1084378     2.01   0.044     1.004488    1.431785
5 most de..  |   1.482654    .135335     4.31   0.000     1.239776    1.773114
             |
   obese4cat |
Obese I ..)  |   1.107937   .0674006     1.68   0.092     .9834055    1.248237
Obese II..)  |   1.218868   .1152143     2.09   0.036     1.012737    1.466956
Obese II..)  |   1.205359   .1654948     1.36   0.174     .9209733    1.577559
             |
smoke_nomiss |
     Former  |   1.196144   .0613794     3.49   0.000     1.081694    1.322703
    Current  |   .6152214   .0612907    -4.88   0.000     .5060944     .747879
             |
     diabcat |
Controlle..  |   1.345558   .0901131     4.43   0.000      1.18004    1.534292
Uncontrol..  |    1.43826   .1332528     3.92   0.000      1.19943    1.724646
Diabetes,..  |   .2117091   .2144625    -1.53   0.125     .0290715    1.541741
             |
1.myocardi~t |   1.437841   .2448341     2.13   0.033     1.029838    2.007486
       1.pad |   2.087145   .3609381     4.25   0.000     1.487137    2.929235
1.hyperten~n |    .936081   .0476813    -1.30   0.195     .8471409    1.034359
1.heart_f~re |   1.287413   .1655233     1.96   0.049     1.000642     1.65637
1.stroke_tia |   2.098387   .2373396     6.55   0.000     1.681163    2.619156
       1.vte |   1.698436   .2070215     4.35   0.000     1.337509     2.15676
 1.oestrogen |   1.074018    .271376     0.28   0.777     .6545392    1.762332
1.flu_vac~ne |   .9329407   .0511594    -1.27   0.206     .8378706    1.038798
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar2.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(set_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -4644.024
Iteration 1:   log likelihood = -4399.9734
Iteration 2:   log likelihood = -4391.3809
Iteration 3:   log likelihood = -4391.3567
Iteration 4:   log likelihood = -4391.3566
Iteration 5:   log likelihood = -4391.3566
Refining estimates:
Iteration 0:   log likelihood = -4391.3566

Stratified Cox regr. -- no ties

No. of subjects =      437,752                  Number of obs    =     437,752
No. of failures =        2,172
Time at risk    =   91340564.5
                                                LR chi2(31)      =      505.33
Log likelihood  =   -4391.3566                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.063347   .0998327     0.65   0.513     .8846258    1.278175
      1.male |          1  (omitted)
        age1 |   1.104862   .1592105     0.69   0.489     .8330091    1.465433
        age2 |   .9245912   .0801154    -0.90   0.366     .7801778    1.095736
        age3 |   1.045767    .187727     0.25   0.803     .7355876     1.48674
             |
         imd |
          2  |   1.103068   .0946333     1.14   0.253     .9323452    1.305051
          3  |   1.081905   .0963549     0.88   0.377     .9086167    1.288242
          4  |   1.141856   .1043209     1.45   0.147     .9546517    1.365771
5 most de..  |   1.368251   .1264716     3.39   0.001     1.141528    1.640004
             |
   obese4cat |
Obese I ..)  |   1.109282   .0682366     1.69   0.092     .9832883    1.251419
Obese II..)  |   1.231162   .1178034     2.17   0.030      1.02063    1.485122
Obese II..)  |   1.153981   .1601887     1.03   0.302     .8791036    1.514807
             |
smoke_nomiss |
     Former  |   1.135277   .0596487     2.41   0.016     1.024186    1.258418
    Current  |   .5625118   .0574537    -5.63   0.000     .4604599    .6871815
             |
     diabcat |
Controlle..  |   1.299112     .08839     3.85   0.000     1.136925    1.484436
Uncontrol..  |   1.396085   .1312101     3.55   0.000     1.161214    1.678461
Diabetes,..  |   .2239862   .2272576    -1.47   0.140     .0306611     1.63627
             |
1.myocardi~t |    1.31478   .2296761     1.57   0.117     .9335952    1.851602
       1.pad |   1.848046    .329607     3.44   0.001     1.302859     2.62137
1.hyperten~n |   .9286814   .0478928    -1.43   0.151     .8394013    1.027457
1.heart_f~re |   1.098799   .1440035     0.72   0.472     .8498921    1.420603
1.stroke_tia |   1.953982   .2258038     5.80   0.000     1.557955    2.450677
       1.vte |   1.542316   .1914901     3.49   0.000     1.209178    1.967236
 1.oestrogen |   1.124677    .284234     0.46   0.642     .6853429    1.845643
1.flu_vac~ne |   .9040449   .0502321    -1.82   0.069     .8107634    1.008059
             |
         ckd |
        CKD  |   1.255447   .0873902     3.27   0.001     1.095335    1.438963
      1.copd |   1.432872   .1162051     4.44   0.000     1.222293    1.679729
1.other_re~y |   1.561362   .1741616     3.99   0.000     1.254749    1.942901
1.immunode~y |   1.267955   .3222781     0.93   0.350     .7704648    2.086676
    1.cancer |   1.124007   .0746201     1.76   0.078     .9868698    1.280201
1.ae_atten~r |   2.082218   .1097552    13.91   0.000     1.877841    2.308839
1.gp_consult |   1.261305   .6468747     0.45   0.651     .4616064    3.446423
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidt
> est_multivar3.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/positivecovidtest_mul
> tivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table2_positivec
> ovidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.249124   .0766766     3.62   0.000     1.107529    1.408821
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.333917    .117791     3.26   0.001     1.121925    1.585966
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.161425   .1078412     1.61   0.107     .9681776    1.393244
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.063347   .0998327     0.65   0.513     .8846258    1.278175
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/05c_an_models_posi
> tivecovidtest.log
  log type:  text
 closed on:   2 Mar 2021, 06:43:40
-------------------------------------------------------------------------------
