-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/06c_an_models_ethn
> icity_admitcovid.log
  log type:  text
 opened on:   2 Mar 2021, 06:38:12

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(98,117 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Variable |
 indicating |   Failure/censoring
        the |     indicator for
   exposure |  outcome: SUS covid
     status |         0          1 |     Total
------------+----------------------+----------
    non-use |   301,897        667 |   302,564 
            |     99.78       0.22 |    100.00 
------------+----------------------+----------
current use |    36,952        119 |    37,071 
            |     99.68       0.32 |    100.00 
------------+----------------------+----------
      Total |   338,849        786 |   339,635 
            |     99.77       0.23 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure, strata(set_id) 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1501.3984
Iteration 1:   log likelihood = -1498.5118
Iteration 2:   log likelihood = -1498.4873
Iteration 3:   log likelihood = -1498.4873
Refining estimates:
Iteration 0:   log likelihood = -1498.4873

Stratified Cox regr. -- no ties

No. of subjects =      339,635                  Number of obs    =     339,635
No. of failures =          786
Time at risk    =     71002175
                                                LR chi2(1)       =        5.82
Log likelihood  =   -1498.4873                  Prob > chi2      =      0.0158

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.293113   .1341502     2.48   0.013     1.055191    1.584681
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_uni
> var_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_univar_eth
> n.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3, strata(set_id)  

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1501.3984
Iteration 1:   log likelihood = -1496.5028
Iteration 2:   log likelihood = -1496.3973
Iteration 3:   log likelihood = -1496.3973
Refining estimates:
Iteration 0:   log likelihood = -1496.3973

Stratified Cox regr. -- no ties

No. of subjects =      339,635                  Number of obs    =     339,635
No. of failures =          786
Time at risk    =     71002175
                                                LR chi2(4)       =       10.00
Log likelihood  =   -1496.3973                  Prob > chi2      =      0.0404

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.486372   .2504679     2.35   0.019     1.068296     2.06806
      1.male |          1  (omitted)
        age1 |   .7476096   .1713815    -1.27   0.204     .4770303    1.171666
        age2 |   1.332685   .1946123     1.97   0.049     1.000982    1.774306
        age3 |   .5723469   .1647904    -1.94   0.053     .3255224    1.006324
------------------------------------------------------------------------------
                                                          Stratified by set_id

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar1_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar1_
> ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(set_id)     

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1501.3984
Iteration 1:   log likelihood = -1400.1178
Iteration 2:   log likelihood = -1396.0142
Iteration 3:   log likelihood = -1395.8904
Iteration 4:   log likelihood = -1395.8478
Iteration 5:   log likelihood = -1395.8323
Iteration 6:   log likelihood = -1395.8267
Iteration 7:   log likelihood = -1395.8246
Iteration 8:   log likelihood = -1395.8239
Iteration 9:   log likelihood = -1395.8236
Iteration 10:  log likelihood = -1395.8235
Iteration 11:  log likelihood = -1395.8235
Iteration 12:  log likelihood = -1395.8234
Iteration 13:  log likelihood = -1395.8234
Iteration 14:  log likelihood = -1395.8234
Iteration 15:  log likelihood = -1395.8234
Iteration 16:  log likelihood = -1395.8234
Iteration 17:  log likelihood = -1395.8234
Iteration 18:  log likelihood = -1395.8234
Iteration 19:  log likelihood = -1395.8234
Iteration 20:  log likelihood = -1395.8234
Iteration 21:  log likelihood = -1395.8234
Iteration 22:  log likelihood = -1395.8234
Iteration 23:  log likelihood = -1395.8234
Iteration 24:  log likelihood = -1395.8234
Iteration 25:  log likelihood = -1395.8234
Iteration 26:  log likelihood = -1395.8234
Iteration 27:  log likelihood = -1395.8234
Iteration 28:  log likelihood = -1395.8234
Iteration 29:  log likelihood = -1395.8234
Iteration 30:  log likelihood = -1395.8234
Iteration 31:  log likelihood = -1395.8234
Iteration 32:  log likelihood = -1395.8234
Iteration 33:  log likelihood = -1395.8234
Refining estimates:
Iteration 0:   log likelihood = -1395.8234
Iteration 1:   log likelihood = -1395.8234

Stratified Cox regr. -- no ties

No. of subjects =      339,635                  Number of obs    =     339,635
No. of failures =          786
Time at risk    =     71002175
                                                LR chi2(28)      =      211.15
Log likelihood  =   -1395.8234                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.148418   .2025819     0.78   0.433     .8127322    1.622754
      1.male |          1  (omitted)
        age1 |   .9728953   .2305844    -0.12   0.908     .6113982    1.548132
        age2 |   1.178467   .1747841     1.11   0.268     .8811937    1.576025
        age3 |   .4664308   .1402495    -2.54   0.011     .2587273    .8408765
             |
         imd |
          2  |   1.198964   .1788321     1.22   0.224     .8950444    1.606081
          3  |   1.137088   .1766189     0.83   0.408       .83865    1.541727
          4  |   1.189862   .1877197     1.10   0.271      .873385    1.621015
5 most de..  |   1.702494     .27118     3.34   0.001     1.245956    2.326314
             |
   obese4cat |
Obese I ..)  |    1.32242   .1363707     2.71   0.007     1.080418    1.618628
Obese II..)  |   1.497573   .2430016     2.49   0.013     1.089605    2.058293
Obese II..)  |   2.481662   .6078039     3.71   0.000     1.535564    4.010673
             |
smoke_nomiss |
     Former  |    1.39782   .1294761     3.62   0.000     1.165754    1.676083
    Current  |   .7251487   .1300277    -1.79   0.073     .5102659    1.030523
             |
     diabcat |
Controlle..  |   1.572364   .1742937     4.08   0.000     1.265316    1.953922
Uncontrol..  |   1.746452   .2733751     3.56   0.000      1.28504    2.373541
Diabetes,..  |   1.04e-15   2.19e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   1.896917   .4853434     2.50   0.012     1.148843    3.132102
       1.pad |   1.329563   .4541281     0.83   0.404     .6807241    2.596851
1.hyperten~n |   .9295183   .0817139    -0.83   0.406     .7824001      1.1043
1.heart_f~re |    2.51397   .4954328     4.68   0.000     1.708489    3.699201
1.stroke_tia |   2.816867   .5539143     5.27   0.000     1.915951    4.141411
       1.vte |    2.07729   .4203577     3.61   0.000      1.39717    3.088483
 1.oestrogen |   .6648364   .5007993    -0.54   0.588     .1518913    2.910026
1.flu_vac~ne |   1.017085   .0981546     0.18   0.861     .8418047    1.228862
             |
   ethnicity |
      Mixed  |   .4331761   .3215791    -1.13   0.260     .1011006    1.855988
Asian or ..  |   2.001134   .4164278     3.33   0.001     1.330897      3.0089
      Black  |   1.419486   .3945374     1.26   0.208     .8232751     2.44747
      Other  |   1.917962    .715057     1.75   0.081     .9236211    3.982777
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar2_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar2_
> ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(set_id)      

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1501.3984
Iteration 1:   log likelihood = -1407.6184
Iteration 2:   log likelihood = -1403.5315
Iteration 3:   log likelihood = -1403.4169
Iteration 4:   log likelihood = -1403.3761
Iteration 5:   log likelihood = -1403.3613
Iteration 6:   log likelihood = -1403.3558
Iteration 7:   log likelihood = -1403.3538
Iteration 8:   log likelihood = -1403.3531
Iteration 9:   log likelihood = -1403.3528
Iteration 10:  log likelihood = -1403.3527
Iteration 11:  log likelihood = -1403.3527
Iteration 12:  log likelihood = -1403.3527
Iteration 13:  log likelihood = -1403.3527
Iteration 14:  log likelihood = -1403.3526
Iteration 15:  log likelihood = -1403.3526
Iteration 16:  log likelihood = -1403.3526
Iteration 17:  log likelihood = -1403.3526
Iteration 18:  log likelihood = -1403.3526
Iteration 19:  log likelihood = -1403.3526
Iteration 20:  log likelihood = -1403.3526
Iteration 21:  log likelihood = -1403.3526
Iteration 22:  log likelihood = -1403.3526
Iteration 23:  log likelihood = -1403.3526
Iteration 24:  log likelihood = -1403.3526
Iteration 25:  log likelihood = -1403.3526
Iteration 26:  log likelihood = -1403.3526
Iteration 27:  log likelihood = -1403.3526
Iteration 28:  log likelihood = -1403.3526
Iteration 29:  log likelihood = -1403.3526
Iteration 30:  log likelihood = -1403.3526
Refining estimates:
Iteration 0:   log likelihood = -1403.3526
Iteration 1:   log likelihood = -1403.3526
Iteration 2:   log likelihood = -1403.3526
Iteration 3:   log likelihood = -1403.3526
Iteration 4:   log likelihood = -1403.3526
Iteration 5:   log likelihood = -1403.3526

Stratified Cox regr. -- no ties

No. of subjects =      339,635                  Number of obs    =     339,635
No. of failures =          786
Time at risk    =     71002175
                                                LR chi2(24)      =      196.09
Log likelihood  =   -1403.3526                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.125358   .1970576     0.67   0.500     .7984351     1.58614
      1.male |          1  (omitted)
        age1 |   .9654582   .2269275    -0.15   0.881     .6090621    1.530402
        age2 |   1.181207   .1745211     1.13   0.260     .8842244    1.577936
        age3 |   .4623319   .1386975    -2.57   0.010     .2568013    .8323586
             |
         imd |
          2  |   1.190383   .1772566     1.17   0.242     .8890713     1.59381
          3  |   1.131705    .175563     0.80   0.425     .8349976    1.533845
          4  |   1.182058   .1862897     1.06   0.289     .8679429    1.609853
5 most de..  |    1.70299   .2706424     3.35   0.001     1.247204    2.325341
             |
   obese4cat |
Obese I ..)  |   1.293827   .1329677     2.51   0.012     1.057785    1.582541
Obese II..)  |   1.460308   .2365178     2.34   0.019     1.063115    2.005897
Obese II..)  |   2.413304   .5882755     3.61   0.000      1.49665    3.891383
             |
smoke_nomiss |
     Former  |   1.361858   .1248333     3.37   0.001     1.137909    1.629883
    Current  |   .6917054   .1234254    -2.07   0.039     .4875687    .9813107
             |
     diabcat |
Controlle..  |    1.61973   .1787002     4.37   0.000     1.304764    2.010728
Uncontrol..  |   1.831224   .2831844     3.91   0.000     1.352415    2.479551
Diabetes,..  |   4.96e-16   1.75e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   1.903444   .4853444     2.52   0.012     1.154779    3.137483
       1.pad |   1.329048    .453988     0.83   0.405      .680424    2.595982
1.hyperten~n |   .9358614   .0820836    -0.76   0.450     .7880492    1.111398
1.heart_f~re |   2.509292   .4934715     4.68   0.000     1.706695    3.689322
1.stroke_tia |   2.846775   .5574227     5.34   0.000     1.939459     4.17855
       1.vte |   2.045839   .4132001     3.54   0.000     1.377061    3.039411
 1.oestrogen |   .6848851    .515651    -0.50   0.615     .1565838    2.995633
1.flu_vac~ne |   1.008639   .0968581     0.09   0.929     .8355953    1.217518
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar2_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar2_
> withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(set_id)          

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1501.3984
Iteration 1:   log likelihood = -1335.0294
Iteration 2:   log likelihood = -1330.6926
Iteration 3:   log likelihood = -1330.5433
Iteration 4:   log likelihood = -1330.4929
Iteration 5:   log likelihood = -1330.4748
Iteration 6:   log likelihood = -1330.4681
Iteration 7:   log likelihood = -1330.4657
Iteration 8:   log likelihood = -1330.4648
Iteration 9:   log likelihood = -1330.4644
Iteration 10:  log likelihood = -1330.4643
Iteration 11:  log likelihood = -1330.4643
Iteration 12:  log likelihood = -1330.4643
Iteration 13:  log likelihood = -1330.4643
Iteration 14:  log likelihood = -1330.4643
Iteration 15:  log likelihood = -1330.4643
Iteration 16:  log likelihood = -1330.4643
Iteration 17:  log likelihood = -1330.4643
Iteration 18:  log likelihood = -1330.4643
Iteration 19:  log likelihood = -1330.4643
Iteration 20:  log likelihood = -1330.4643
Iteration 21:  log likelihood = -1330.4643
Iteration 22:  log likelihood = -1330.4643
Iteration 23:  log likelihood = -1330.4643
Iteration 24:  log likelihood = -1330.4643
Iteration 25:  log likelihood = -1330.4643
Iteration 26:  log likelihood = -1330.4643
Iteration 27:  log likelihood = -1330.4643
Iteration 28:  log likelihood = -1330.4643
Iteration 29:  log likelihood = -1330.4643
Iteration 30:  log likelihood = -1330.4643
Iteration 31:  log likelihood = -1330.4643
Iteration 32:  log likelihood = -1330.4643
Iteration 33:  log likelihood = -1330.4643
Iteration 34:  log likelihood = -1330.4643
Refining estimates:
Iteration 0:   log likelihood = -1330.4643
Iteration 1:   log likelihood = -1330.4643
Iteration 2:   log likelihood = -1330.4643
Iteration 3:   log likelihood = -1330.4643
Iteration 4:   log likelihood = -1330.4643

Stratified Cox regr. -- no ties

No. of subjects =      339,635                  Number of obs    =     339,635
No. of failures =          786
Time at risk    =     71002175
                                                LR chi2(35)      =      341.87
Log likelihood  =   -1330.4643                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.078715   .1939974     0.42   0.674     .7582728    1.534574
      1.male |          1  (omitted)
        age1 |   .8731917    .214773    -0.55   0.581     .5391944    1.414079
        age2 |   1.274031   .1957859     1.58   0.115     .9426971     1.72182
        age3 |   .4213804   .1302539    -2.80   0.005     .2299098    .7723094
             |
         imd |
          2  |    1.20268   .1831723     1.21   0.226     .8922967     1.62103
          3  |   1.110607   .1762355     0.66   0.509      .813745    1.515767
          4  |   1.118624   .1795587     0.70   0.485     .8166787    1.532205
5 most de..  |   1.534618   .2500928     2.63   0.009     1.115019     2.11212
             |
   obese4cat |
Obese I ..)  |   1.325534   .1402381     2.66   0.008     1.077298    1.630969
Obese II..)  |    1.45073   .2422632     2.23   0.026     1.045781    2.012482
Obese II..)  |   2.432985    .604339     3.58   0.000     1.495224    3.958885
             |
smoke_nomiss |
     Former  |   1.240387    .119261     2.24   0.025     1.027344     1.49761
    Current  |   .5799906   .1082584    -2.92   0.004     .4022902     .836185
             |
     diabcat |
Controlle..  |   1.491343   .1695981     3.51   0.000     1.193377    1.863707
Uncontrol..  |    1.68544   .2705921     3.25   0.001     1.230426    2.308718
Diabetes,..  |   1.75e-17   2.51e-09    -0.00   1.000            0           .
             |
1.myocardi~t |   1.832674   .4901833     2.26   0.024     1.084964    3.095673
       1.pad |   1.092837   .3882049     0.25   0.803     .5447358    2.192426
1.hyperten~n |   .9164969   .0827896    -0.97   0.334     .7677852    1.094012
1.heart_f~re |   1.933023   .3918495     3.25   0.001     1.299233    2.875987
1.stroke_tia |   2.616835   .5308423     4.74   0.000     1.758347    3.894469
       1.vte |   1.792563   .3752197     2.79   0.005     1.189325    2.701768
 1.oestrogen |   .5416759    .416382    -0.80   0.425     .1200681     2.44372
1.flu_vac~ne |   .9341772   .0928871    -0.68   0.493     .7687632    1.135183
             |
         ckd |
        CKD  |   1.700629   .1891983     4.77   0.000     1.367451    2.114986
      1.copd |   1.968443   .2476852     5.38   0.000     1.538218    2.518998
1.other_re~y |   1.465405   .2634667     2.13   0.034     1.030195    2.084472
1.immunode~y |   1.107199   .4479594     0.25   0.801     .5010022    2.446874
    1.cancer |    1.52388   .1611637     3.98   0.000     1.238593    1.874877
1.ae_atten~r |   1.903792   .1815614     6.75   0.000     1.579217    2.295076
1.gp_consult |   1.221521   1.047177     0.23   0.815     .2276085     6.55561
             |
   ethnicity |
      Mixed  |   .4669241   .3477327    -1.02   0.306     .1084752    2.009843
Asian or ..  |    1.93871   .4095525     3.13   0.002     1.281435    2.933116
      Black  |   1.547136   .4346522     1.55   0.120     .8920557    2.683273
      Other  |   2.089323   .7829252     1.97   0.049     1.002392    4.354854
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar3_ethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar3_
> ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(set_id)         
>    

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1501.3984
Iteration 1:   log likelihood = -1342.2135
Iteration 2:   log likelihood =  -1337.963
Iteration 3:   log likelihood = -1337.8224
Iteration 4:   log likelihood = -1337.7737
Iteration 5:   log likelihood =  -1337.756
Iteration 6:   log likelihood = -1337.7496
Iteration 7:   log likelihood = -1337.7472
Iteration 8:   log likelihood = -1337.7463
Iteration 9:   log likelihood =  -1337.746
Iteration 10:  log likelihood = -1337.7459
Iteration 11:  log likelihood = -1337.7458
Iteration 12:  log likelihood = -1337.7458
Iteration 13:  log likelihood = -1337.7458
Iteration 14:  log likelihood = -1337.7458
Iteration 15:  log likelihood = -1337.7458
Iteration 16:  log likelihood = -1337.7458
Iteration 17:  log likelihood = -1337.7458
Iteration 18:  log likelihood = -1337.7458
Iteration 19:  log likelihood = -1337.7458
Iteration 20:  log likelihood = -1337.7458
Iteration 21:  log likelihood = -1337.7458
Iteration 22:  log likelihood = -1337.7458
Iteration 23:  log likelihood = -1337.7458
Iteration 24:  log likelihood = -1337.7458
Iteration 25:  log likelihood = -1337.7458
Iteration 26:  log likelihood = -1337.7458
Iteration 27:  log likelihood = -1337.7458
Iteration 28:  log likelihood = -1337.7458
Iteration 29:  log likelihood = -1337.7458
Iteration 30:  log likelihood = -1337.7458
Iteration 31:  log likelihood = -1337.7458
Iteration 32:  log likelihood = -1337.7458
Refining estimates:
Iteration 0:   log likelihood = -1337.7458
Iteration 1:   log likelihood = -1337.7458
Iteration 2:   log likelihood = -1337.7458

Stratified Cox regr. -- no ties

No. of subjects =      339,635                  Number of obs    =     339,635
No. of failures =          786
Time at risk    =     71002175
                                                LR chi2(31)      =      327.31
Log likelihood  =   -1337.7458                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.057693   .1889106     0.31   0.753     .7452973     1.50103
      1.male |          1  (omitted)
        age1 |   .8710265   .2120517    -0.57   0.571     .5405129    1.403643
        age2 |   1.274577   .1949069     1.59   0.113     .9444985    1.720009
        age3 |   .4188266   .1291836    -2.82   0.005     .2288169    .7666204
             |
         imd |
          2  |   1.194272   .1816384     1.17   0.243     .8864265    1.609028
          3  |   1.103588   .1749258     0.62   0.534     .8088832    1.505663
          4  |   1.113999   .1785368     0.67   0.501     .8137025     1.52512
5 most de..  |    1.54003   .2502924     2.66   0.008     1.119923    2.117728
             |
   obese4cat |
Obese I ..)  |    1.29646   .1367135     2.46   0.014     1.054384    1.594115
Obese II..)  |   1.403962   .2341147     2.03   0.042     1.012546    1.946684
Obese II..)  |    2.36735   .5853491     3.49   0.000     1.458126    3.843527
             |
smoke_nomiss |
     Former  |   1.205765    .114671     1.97   0.049     1.000718    1.452827
    Current  |   .5524665   .1023845    -3.20   0.001     .3842015    .7944249
             |
     diabcat |
Controlle..  |   1.534875   .1737456     3.78   0.000     1.229471    1.916142
Uncontrol..  |   1.761342   .2795812     3.57   0.000     1.290419    2.404122
Diabetes,..  |   1.19e-15   2.35e-08    -0.00   1.000            0           .
             |
1.myocardi~t |    1.82999   .4880365     2.27   0.023     1.085034    3.086412
       1.pad |    1.09344   .3884709     0.25   0.801     .5449855    2.193839
1.hyperten~n |    .923687   .0832567    -0.88   0.378     .7741081    1.102169
1.heart_f~re |   1.929503   .3898287     3.25   0.001     1.298591     2.86694
1.stroke_tia |   2.632965   .5323291     4.79   0.000     1.771537     3.91327
       1.vte |   1.777028   .3714701     2.75   0.006     1.179666    2.676884
 1.oestrogen |    .590765   .4507172    -0.69   0.490     .1324343    2.635293
1.flu_vac~ne |   .9270851    .091782    -0.76   0.444     .7635723    1.125613
             |
         ckd |
        CKD  |   1.702721   .1894918     4.78   0.000     1.369037    2.117735
      1.copd |   1.982997   .2482398     5.47   0.000     1.551547    2.534422
1.other_re~y |   1.449111   .2601368     2.07   0.039     1.019292    2.060179
1.immunode~y |   1.179551   .4768165     0.41   0.683     .5341101     2.60497
    1.cancer |   1.518239   .1602525     3.96   0.000     1.234509    1.867178
1.ae_atten~r |   1.902007   .1812016     6.75   0.000     1.578045    2.292477
1.gp_consult |   1.338173     1.1407     0.34   0.733     .2517223    7.113817
------------------------------------------------------------------------------
                                                          Stratified by set_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_mul
> tivar3_withoutethn.ster not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/admitcovid_multivar3_
> withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_match_tabfig/sens_analysis_1/table3_admitcovi
> d.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    302,564    6.33e+07           0   6.33e+07   6.33e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     37,071     7727601           0    7727601    7727601

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.293113   .1341502     2.48   0.013     1.055191    1.584681
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.486372   .2504679     2.35   0.019     1.068296     2.06806
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.148418   .2025819     0.78   0.433     .8127322    1.622754
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.125358   .1970576     0.67   0.500     .7984351     1.58614
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.078715   .1939974     0.42   0.674     .7582728    1.534574
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.057693   .1889106     0.31   0.753     .7452973     1.50103
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/06c_an_models_ethn
> icity_admitcovid.log
  log type:  text
 closed on:   2 Mar 2021, 06:48:08
-------------------------------------------------------------------------------
