-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/SA1_02c_cr_create_
> population_covidtest.log
  log type:  text
 opened on:   2 Mar 2021, 06:31:20

. 
. /* Use the dataset we derived from the 02c program ==========================
> =*/ 
. 
. use $tempdir_main_analysis/analysis_dataset_`outcome', clear

. 
. * Drop the whole matched set if end of study before index in OAC exposed
. noi di "PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS

. 
. gen remove_antiplatelet = 1 if antiplatelet_date != . & exposure == 1
(560,881 missing values generated)

. replace remove_antiplatelet = 0  if remove_antiplatelet == .
(560,881 real changes made)

. bysort set_id: egen max_remove_antiplatelet = max(remove_antiplatelet)

. drop if max_remove_antiplatelet == 1
(24,673 observations deleted)

. drop if antiplatelet_date != . & exposure == 0
(100,720 observations deleted)

. 
. /* SAVE DATA=================================================================
> =*/
. 
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_datas
> et_covidtest.dta not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_dataset_covi
> dtest.dta saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  covidtest != 0 & covidtest < .
obs. time interval:  (stime_covidtest[_n-1], stime_covidtest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    437,752  total observations
          0  exclusions
------------------------------------------------------------------------------
    437,752  observations remaining, representing
    437,752  subjects
     51,332  failures in single-failure-per-subject data
   87732234  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_datas
> et_STSET_covidtest.dta not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_dataset_STSE
> T_covidtest.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/SA1_02c_cr_create_
> population_covidtest.log
  log type:  text
 closed on:   2 Mar 2021, 06:31:41
-------------------------------------------------------------------------------
