-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/SA1_02c_cr_create_
> population_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 11:37:03

. 
. /* Use the dataset we derived from the 02c program ==========================
> =*/ 
. 
. use $tempdir_main_analysis/analysis_dataset_`outcome', clear

. 
. * Drop the whole matched set if end of study before index in OAC exposed
. noi di "PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS"
PEOPLE PRESCRIBED ANTIPLATELET IN THE PAST FOUR MONTHS

. 
. gen remove_antiplatelet = 1 if antiplatelet_date != . & exposure == 1
(560,865 missing values generated)

. replace remove_antiplatelet = 0  if remove_antiplatelet == .
(560,865 real changes made)

. bysort set_id: egen max_remove_antiplatelet = max(remove_antiplatelet)

. drop if max_remove_antiplatelet == 1
(24,623 observations deleted)

. drop if antiplatelet_date != . & exposure == 0
(100,875 observations deleted)

. 
. /* SAVE DATA=================================================================
> =*/
. 
. save $tempdir/analysis_dataset_`outcome', replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_datas
> et_positivecovidtest.dta not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_dataset_posi
> tivecovidtest.dta saved

. 
. * Save a version set on outcomes
. stset stime_`outcome', fail(`outcome') id(patient_id) enter(enter_date) origi
> n(enter_date)      

                id:  patient_id
     failure event:  positivecovidtest != 0 & positivecovidtest < .
obs. time interval:  (stime_positivecovidtest[_n-1], stime_positivecovidtest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    437,625  total observations
          0  exclusions
------------------------------------------------------------------------------
    437,625  observations remaining, representing
    437,625  subjects
      2,171  failures in single-failure-per-subject data
   91301708  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       211

. save $tempdir/analysis_dataset_STSET_`outcome', replace
(note: file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_datas
> et_STSET_positivecovidtest.dta not found)
file /workspace/output/oac_match_tempdata/sens_analysis_1/analysis_dataset_STSE
> T_positivecovidtest.dta saved

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_match_log/sens_analysis_1/SA1_02c_cr_create_
> population_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 11:37:25
-------------------------------------------------------------------------------
