-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/01_cr_create_exposure_outcome_af.log
  log type:  text
 opened on:   1 Mar 2021, 20:32:49

. 
. /*===========================================================================
> ===*/
. * import the dataset from 00 program
. use $tempdir/format_dataset, clear

. 
. sort patient_id

. 
. * Date of cohort entry, 1 Mar 2020
. gen enter_date = date("$indexdate", "DMY")

. format enter_date %td

. 
. * Format treatment variables
. foreach var of varlist  warfarin_last_four_months   ///
>                                                 doac_last_four_months      //
> /
>                                                 {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(411,392 missing values generated)
(230,055 missing values generated)

. /* TREATMENT EXPOSURE========================================================
> =*/        
. 
. *Derive oral anticoagulant (Warfarin/DOACs) exposure within 4 months before c
> ohort entry
. *Objective 1: comparison group - untreated people with atrial fibrillation
. gen exposure = 1 if warfarin_last_four_months != .
(411,392 missing values generated)

. replace exposure = 1 if doac_last_four_months != .
(286,514 real changes made)

. replace exposure = 0 if exposure == .
(124,878 real changes made)

. 
. label var exposure "Oral anticoagulant Treatment Exposure"

. label define exposure 0 "non-use" 1 "current use"

. label values exposure exposure 

. 
. *Objective 2: comparing warfarin vs DOACs
. *Derive warfarin & DOACs exposure within 4 months before cohort entry
. gen exposure_warfarin = 1 if warfarin_last_four_months!=. & ///
> warfarin_last_four_months == max(warfarin_last_four_months, doac_last_four_mo
> nths)
(415,114 missing values generated)

. 
. replace exposure_warfarin = 0 if doac_last_four_months!=. & ///
> doac_last_four_months == max(warfarin_last_four_months, doac_last_four_months
> )
(290,269 real changes made)

. 
. *If the latest date of warfarin and DOAC are the same, classify it as warfari
> n exposure
. replace exposure_warfarin = 1 if exposure == 1 & ///
> warfarin_last_four_months == max(warfarin_last_four_months, doac_last_four_mo
> nths) & ///
> warfarin_last_four_months == doac_last_four_months
(33 real changes made)

. 
. label var exposure_warfarin "warfarin vs DOACs"

. label define exposure_warfarin 0 "DOAC use" 1 "warfarin use" 2 "warfarin & DO
> AC same latest prescription"

. label values exposure_warfarin exposure_warfarin 

. 
. * Sensitivity analysis: exclude people who were prescribed both warfarin and 
> DOACs on the same day as the latest OAC prescription
. clonevar sens_exposure_warfarin = exposure_warfarin
(124,878 missing values generated)

. replace sens_exposure_warfarin = 2 if exposure == 1 & ///
> warfarin_last_four_months == max(warfarin_last_four_months, doac_last_four_mo
> nths) & ///
> warfarin_last_four_months == doac_last_four_months
(33 real changes made)

. 
. label var sens_exposure_warfarin "sensitivity analysis: flag warfarin & DOAC 
> same latest prescription"

. label values sens_exposure_warfarin exposure_warfarin 

. 
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. * Date of data available
. gen onscoviddeathcensor_date    = date("$onscoviddeathcensor",  "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 onscoviddeathcensor_date        %td

. 
. /*   Outcomes/censoring variable   */
. 
. * Dates of: ONS any death, hospital admission (Primary diagnosis) due to covi
> d
. * Recode to dates from the strings 
. foreach var of varlist  died_date_ons               ///
>                                                 first_tested_for_covid      /
> //
>                                                 first_positive_test_date    /
> //
>                                                 covid_admission_date        /
> //
>                                                 dereg_date                   
>                    ///
>                                                 mi_date_ons                  
>                    ///
>                                                 stroke_date_ons              
>            ///
>                                                 vte_date_ons                 
>            ///
>                                                 gi_bleed_date_ons            
>            ///
>                                                 intracranial_bleed_date_ons  
>    /// 
>                                                 {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7.         
. }
(477,418 missing values generated)
(321,393 missing values generated)
(490,920 missing values generated)
(510,555 missing values generated)
(483,548 missing values generated)
(519,561 missing values generated)
(520,593 missing values generated)
(520,699 missing values generated)
(520,646 missing values generated)
(520,234 missing values generated)

. 
. * Add half-day buffer if outcome on indexdate
. replace died_date_ons=died_date_ons+0.5 if died_date_ons==enter_date
(134 real changes made)

. 
. * Generate date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(512,313 missing values generated)

. 
. * Generate date of non-Covid death in ONS
. gen died_date_onsnoncoviddeath = died_date_ons if died_ons_covid_flag_any != 
> 1
(485,901 missing values generated)

. 
. * Generate date of hospital admission due to Covid
. gen covid_admission_primary_date = covid_admission_date ///
> if (covid_admission_primary_dx == "U071"| covid_admission_primary_dx == "U072
> ")
(515,222 missing values generated)

. 
. * Add half-day buffer if outcome on indexdate
. replace covid_admission_primary_date=covid_admission_primary_date+0.5 if covi
> d_admission_primary_date==enter_date
([redacted] real changes made)

. replace first_tested_for_covid=first_tested_for_covid+0.5 if first_tested_for
> _covid==enter_date
([redacted] real changes made)

. replace first_positive_test_date=first_positive_test_date+0.5 if first_positi
> ve_test_date==enter_date
([redacted] real change made)

. 
. replace mi_date_ons=mi_date_ons+0.5 if mi_date_ons==enter_date
([redacted] real changes made)

. replace stroke_date_ons=stroke_date_ons+0.5 if stroke_date_ons==enter_date
([redacted] real change made)

. replace vte_date_ons=vte_date_ons+0.5 if vte_date_ons==enter_date
(0 real changes made)

. replace gi_bleed_date_ons=gi_bleed_date_ons+0.5 if gi_bleed_date_ons==enter_d
> ate
(0 real changes made)

. replace intracranial_bleed_date_ons=intracranial_bleed_date_ons+0.5 if intrac
> ranial_bleed_date_ons==enter_date
([redacted] real change made)

. 
. * Format outcome dates
. format died_date_ons died_date_onscovid died_date_onsnoncoviddeath covid_admi
> ssion_primary_date dereg_date %td

. format mi_date_ons stroke_date_ons vte_date_ons %td 

. format gi_bleed_date_ons intracranial_bleed_date_ons %td

. 
. /*  Identify date of end of follow-up
> (first: end data availability, death, deregistration from GP or outcome) */
. * For looping later, name must be stime_binary_outcome_name
. 
. * Primary outcome: ONS covid-19 death (use onscoviddeathcensor_date because i
> t is the earliest date in all linkage dataset - treat it as end of study)
. gen stime_onscoviddeath = min(onscoviddeathcensor_date, died_date_ons, dereg_
> date)

. gen stime_admitcovid = min(onscoviddeathcensor_date, died_date_ons, dereg_dat
> e, covid_admission_primary_date)

. 
. * Exploratory outcomes: ONS non-covid death; covid test; positive covid test
. gen stime_onsnoncoviddeath = min(onscoviddeathcensor_date, died_date_ons, der
> eg_date)

. gen stime_covidtest = min(onscoviddeathcensor_date, died_date_ons, dereg_date
> , first_tested_for_covid)

. gen stime_positivecovidtest = min(onscoviddeathcensor_date, died_date_ons, de
> reg_date, first_positive_test_date)

. 
. * Post-hoc analyses outcomes: 
. * Death due to myocardial infarction, ischaemic stroke, vte, GI & intracrania
> l bleed
. gen stime_mi_ons = min(onscoviddeathcensor_date, died_date_ons, dereg_date)

. gen stime_stroke_ons = min(onscoviddeathcensor_date, died_date_ons, dereg_dat
> e)

. gen stime_vte_ons = min(onscoviddeathcensor_date, died_date_ons, dereg_date)

. gen stime_gi_bleed_ons = min(onscoviddeathcensor_date, died_date_ons, dereg_d
> ate)

. gen stime_intracranial_bleed_ons = min(onscoviddeathcensor_date, died_date_on
> s, dereg_date)

. 
. * Generate variables for follow-up person-days for each outcome
. gen follow_up_onscoviddeath = stime_onscoviddeath - enter_date + 1

. gen follow_up_admitcovid = stime_admitcovid - enter_date + 1

. gen follow_up_onsnoncoviddeath = stime_onsnoncoviddeath - enter_date + 1

. gen follow_up_covidtest = stime_covidtest - enter_date + 1

. gen follow_up_positivecovidtest = stime_positivecovidtest - enter_date + 1

. 
. gen follow_up_mi_ons = stime_mi_ons - enter_date + 1

. gen follow_up_stroke_ons = stime_stroke_ons - enter_date + 1

. gen follow_up_vte_ons = stime_vte_ons - enter_date + 1

. gen follow_up_gi_bleed_ons = stime_gi_bleed_ons - enter_date + 1

. gen follow_up_intracranial_bleed_ons = stime_intracranial_bleed_ons - enter_d
> ate + 1

.  
. * Format date variables
. format stime* %td 

. 
. * Binary indicators for outcomes
. * Primary outcome: ONS covid-19 death
. gen onscoviddeath = 1 if died_date_onscovid!=. & ///
> died_date_onscovid>=enter_date & died_date_onscovid<=stime_onscoviddeath
(517,425 missing values generated)

. 
. replace onscoviddeath = 0 if onscoviddeath == .
(517,425 real changes made)

. 
. * Hospital admission due to COVID-19
. gen admitcovid = 1 if covid_admission_primary_date!=. & ///
> covid_admission_primary_date>=enter_date & covid_admission_primary_date<=stim
> e_admitcovid
(517,346 missing values generated)

. 
. replace admitcovid = 0 if admitcovid == .
(517,346 real changes made)

.  
. * Exploratory outcomes: Non-Covid death; Covid-19 test; positive Covid-19 tes
> t
. * Non-Covid death
. gen onsnoncoviddeath = 1 if died_date_onsnoncoviddeath!=. & ///
> died_date_onsnoncoviddeath>=enter_date & died_date_onsnoncoviddeath<=stime_on
> snoncoviddeath
(499,141 missing values generated)

. 
. replace onsnoncoviddeath = 0 if onsnoncoviddeath == .
(499,141 real changes made)

. 
. * COVID test
. gen covidtest = 1 if first_tested_for_covid!=. & ///
> first_tested_for_covid>=enter_date & first_tested_for_covid<=stime_covidtest
(416,118 missing values generated)

. 
. replace covidtest = 0 if covidtest == .
(416,118 real changes made)

. 
. * Positive COVID test
. gen positivecovidtest = 1 if first_positive_test_date!=. & ///
> first_positive_test_date>=enter_date & first_positive_test_date<=stime_positi
> vecovidtest
(513,737 missing values generated)

. 
. replace positivecovidtest = 0 if positivecovidtest == .
(513,737 real changes made)

. 
. * Post-hoc analyses: death due to MI, ischaemic stroke, vte, GI & intracrania
> l bleed
. * Only explore the causes of death among non-COVID-death analyses
. * Therefore set outcome to be 0 if the patients has a record of any underlyin
> g COVID-19 death
. 
. * MI
. gen mi_ons = 1 if mi_date_ons!=. & mi_date_ons>=enter_date & mi_date_ons<=sti
> me_mi_ons
(520,024 missing values generated)

. 
. replace mi_ons = 0 if mi_ons == .
(520,024 real changes made)

. replace mi_ons = 0 if onscoviddeath == 1
(8 real changes made)

. 
. * Ischaemic stroke
. gen stroke_ons = 1 if stroke_date_ons!=. & ///
> stroke_date_ons>=enter_date & stroke_date_ons<=stime_stroke_ons
(520,670 missing values generated)

. 
. replace stroke_ons = 0 if stroke_ons == .
(520,670 real changes made)

. replace stroke_ons = 0 if onscoviddeath == 1
([redacted] real changes made)

. 
. * VTE
. gen vte_ons = 1 if vte_date_ons!=. & ///
> vte_date_ons>=enter_date & vte_date_ons<=stime_vte_ons
(520,737 missing values generated)

. 
. replace vte_ons = 0 if vte_ons == .
(520,737 real changes made)

. replace vte_ons = 0 if onscoviddeath == 1
(0 real changes made)

. 
. * GI bleed
. gen gi_bleed_ons = 1 if gi_bleed_date_ons!=. & ///
> gi_bleed_date_ons>=enter_date & gi_bleed_date_ons<=stime_gi_bleed_ons
(520,708 missing values generated)

. 
. replace gi_bleed_ons = 0 if gi_bleed_ons == .
(520,708 real changes made)

. replace gi_bleed_ons = 0 if onscoviddeath == 1
(0 real changes made)

. 
. * Intracranial bleed
. gen intracranial_bleed_ons = 1 if intracranial_bleed_date_ons!=. & ///
> intracranial_bleed_date_ons>=enter_date & intracranial_bleed_date_ons<=stime_
> intracranial_bleed_ons
(520,443 missing values generated)

. 
. replace intracranial_bleed_ons = 0 if intracranial_bleed_ons == .
(520,443 real changes made)

. replace intracranial_bleed_ons = 0 if onscoviddeath == 1
([redacted] real changes made)

. 
. /* LABEL VARIABLES===========================================================
> =*/
. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var onscoviddeathcensor_date              "Date of admin censoring for 
> ONS deaths"

. 
. label var onscoviddeath                                 "Failure/censoring in
> dicator for outcome: ONS covid death"

. label var died_date_onscovid                    "Date of ONS Death (Covid-19 
> only)"

. label var admitcovid                                "Failure/censoring indica
> tor for outcome: SUS covid"

. label var covid_admission_primary_date  "Date of hospital admission due to co
> vid as primary dx"

. label var onsnoncoviddeath              "Failure/censoring indicator for outc
> ome: ONS non-covid death"

. label var died_date_onsnoncoviddeath    "Date of ONS non-covid death"

. label var covidtest                             "Failure/censoring indicator 
> for outcome: first covid test"

. label var first_tested_for_covid                "Date of first covid test"

. label var positivecovidtest             "Failure/censoring indicator for outc
> ome: first positive covid test"

. label var first_positive_test_date              "Date of positive covid test"

. 
. label var died_date_ons                 "ONS death date (any cause)"

. 
. label var mi_date_ons                                   "Date of ONS myocardi
> al infarction death"

. label var stroke_date_ons                               "Date of ONS ischaemi
> c stroke death"

. label var vte_date_ons                                  "Date of ONS VTE deat
> h"

. label var gi_bleed_date_ons                             "Date of ONS GI bleed
>  death"

. label var intracranial_bleed_date_ons   "Date of ONS intracranial bleed death
> "

. 
. label var mi_ons                                                "Failure/cens
> oring indicator for outcome: myocardial infarction death"

. label var stroke_ons                                    "Failure/censoring in
> dicator for outcome: ischaemic stroke death"

. label var vte_ons                                               "Failure/cens
> oring indicator for outcome: VTE death"

. label var gi_bleed_ons                                  "Failure/censoring in
> dicator for outcome: GI bleed death"

. label var intracranial_bleed_ons                "Failure/censoring indicator 
> for outcome: intracranial bleed death"

. 
. * End of follow-up (date)
. label var stime_onscoviddeath                   "End of follow-up: ONS covid 
> death"

. label var stime_admitcovid                      "End of follow-up: SUS covid"

. label var stime_onsnoncoviddeath                "End of follow-up: ONS non-co
> vid death"

. label var stime_covidtest                       "End of follow-up: covid test
> "

. label var stime_positivecovidtest               "End of follow-up: positive c
> ovid test"

. 
. label var stime_mi_ons                              "End of follow-up: ONS my
> ocardial infarction death"

. label var stime_stroke_ons                              "End of follow-up: ON
> S ischaemic stroke death"

. label var stime_vte_ons                                 "End of follow-up: ON
> S VTE death"

. label var stime_gi_bleed_ons                    "End of follow-up: ONS GI ble
> ed death"

. label var stime_intracranial_bleed_ons  "End of follow-up: ONS intracranial b
> leed death"

. 
. * Duration of follow-up
. label var follow_up_onscoviddeath       "Number of days (follow-up) for ONS c
> ovid death"

. label var follow_up_admitcovid                  "Number of days (follow-up) f
> or covid hospital admission"

. label var follow_up_onsnoncoviddeath    "Number of days (follow-up) for ONS n
> on-covid death"

. label var follow_up_covidtest                   "Number of days (follow-up) f
> or covid test"

. label var follow_up_positivecovidtest   "Number of days (follow-up) for posit
> ive covid test"

. 
. label var follow_up_mi_ons                                      "Number of da
> ys (follow-up) for ONS myocardial infarction death"

. label var follow_up_stroke_ons                          "Number of days (foll
> ow-up) for ONS ischaemic stroke death"

. label var follow_up_vte_ons                                     "Number of da
> ys (follow-up) for ONS VTE death"

. label var follow_up_gi_bleed_ons        "Number of days (follow-up) for ONS G
> I bleed death"

. label var follow_up_intracranial_bleed_ons      "Number of days (follow-up) f
> or ONS intracranial bleed death"

.  
. /* ==========================================================================
> */
. 
. save $tempdir/cr_dataset_af, replace
(note: file /workspace/output/oac_tempdata/cr_dataset_af.dta not found)
file /workspace/output/oac_tempdata/cr_dataset_af.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/01_cr_create_exposure_outcome_af.log
  log type:  text
 closed on:   1 Mar 2021, 20:33:00
-------------------------------------------------------------------------------
