-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/03_an_checks_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 02:42:51

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_`outcome', clear

. 
. *Duplicate patient check
. sort patient_id

. datacheck _n==1, by(patient_id) nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. * Check date ranges for all treatment variables  
. foreach i in warfarin_last_four_months  ///
>              doac_last_four_months      ///
>               {
  2.         
.         summ `i', format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
warfarin_l~s |     12,326   02feb2020      23.472  01nov2019  28feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doac_last_~s |     40,337   05feb2020    20.13739  01nov2019  28feb2020

. 
. * Check date ranges for all comorbidities/ medications 
. foreach var of varlist  ckd                                             ///  
>                    
>                                                 hypertension                 
>            ///
>                                                 other_respiratory            
>            ///
>                                                 heart_failure                
>            ///
>                                                 copd                         
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 cancer                       
>            ///
>                                                 myocardial_infarct           
>            ///
>                                                 stroke                       
>                    ///
>                                                 tia                          
>                            ///
>                                                 pad                          
>                            ///
>                                                 vte                          
>                            ///
>                                                 antiplatelet                /
> //
>                                                 oestrogen                   /
> //
>                                                  { 
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ckd_date |     10,430   23sep2019    621.0987  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |     29,255   15may2004    7108.006  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_resp~e |      2,838   07may2009    6382.958  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
heart_fai~te |      6,995   13dec2013    4099.441  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   copd_date |      6,714   24aug2009    6474.537  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |      9,007   21sep2010    5700.757  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 cancer_date |     10,672   22apr2010     4545.21  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
myocardial~e |      2,359   15may2012    3016.121  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 stroke_date |        951   12aug2015    3757.224  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    tia_date |        692   30oct2015    2192.999  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    pad_date |        633   22oct2014    2138.852  15aug1969  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    vte_date |        865   08nov2012    3534.948  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
antiplatel~e |      6,224   29jan2020    25.40145  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
oestrogen_~e |        597   18jan2020    31.32818  15nov2019  15feb2020

. 
. summ immunodef_any, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
immunodef_~y |     70,266    .0098768    .0988906          0          1

. 
. * Death outcome flag (covid)
. //Underlying Covid-death should be a subset of Any Covid-death
. datacheck !(died_ons_covid_flag_underlying==1 & died_ons_covid_flag_any!=1), 
> nolist

. 
. * Outcome dates
. summ  stime_onscoviddeath stime_onsnoncoviddeath ///
> stime_admitcovid stime_covidtest stime_positivecovidtest,  format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_onsc~h |     70,266   25sep2020    20.78708  01mar2020  28sep2020
stime_onsn~h |     70,266   25sep2020    20.78708  01mar2020  28sep2020
stime_admi~d |     70,266   24sep2020    21.92679  01mar2020  28sep2020
stime_covi~t |     70,266   20sep2020    31.21329  01mar2020  28sep2020
stime_posi~t |     70,266   24sep2020    22.99921  01mar2020  28sep2020

. summ  died_date_ons died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |      1,808   08jul2020    83.94057  01mar2020  06dec2020
died_date_~d |        254   19jun2020    91.35265  18mar2020  06dec2020

. summ  covid_admission_date covid_admission_primary_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
covid~n_date |        418   12may2020    63.27511  04mar2020  27oct2020
covid~y_date |        256   13may2020    65.48036  05mar2020  27oct2020

. summ  first_tested_for_covid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_test~d |      7,133   17aug2020    76.07044  01mar2020  16dec2020

. summ  first_positive_test_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_posi~e |      1,443   08sep2020    91.41991  12mar2020  17dec2020

. 
. * Follow-up for outcomes
. datacheck follow_up_`outcome' > 0, nol

. 
. summ  follow_up_`outcome', detail

       Number of days (follow-up) for ONS covid death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           64            1.5
 5%          212            1.5
10%          212            1.5       Obs              70,266
25%          212            1.5       Sum of Wgt.      70,266

50%          212                      Mean           209.0458
                        Largest       Std. Dev.      20.78708
75%          212            212
90%          212            212       Variance       432.1029
95%          212            212       Skewness      -7.651052
99%          212            212       Kurtosis        62.9372

. 
. * Outcome date day lags since cohort entry (only ONS dataset)
. * check how the death count tail out
. gen days_died_since_entry = died_date_ons - enter_date
(68,458 missing values generated)

. su days_died_since_entry, detail

                    days_died_since_entry
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             .5
 5%           12             .5
10%           24             .5       Obs               1,808
25%           52             .5       Sum of Wgt.       1,808

50%          121                      Mean           129.6886
                        Largest       Std. Dev.      83.94057
75%        206.5            277
90%          251            277       Variance       7046.019
95%          265            277       Skewness       .1746649
99%          275            280       Kurtosis       1.690203

. 
. * check the dates of first positive covid test date and covid first test date
. datacheck first_positive_test_date == first_tested_for_covid, nol

 (5694 contradictions)

. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        754    17.40504     .857775         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     16,421    22.70829    1.634302       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     23,797    27.38699    1.411202         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     14,356    32.12166    1.426606         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      6,134    37.09708    1.431689         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      3,610    43.55604    2.689348         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |       754          0          0          0 |       754 
  Normal (18.5-24.9) |    16,421          0          0          0 |    16,421 
Overweight (25-29.9) |    23,797          0          0          0 |    23,797 
   Obese I (30-34.9) |         0     14,356          0          0 |    14,356 
  Obese II (35-39.9) |         0          0      6,134          0 |     6,134 
     Obese III (40+) |         0          0          0      3,610 |     3,610 
        Unknown (.u) |     5,194          0          0          0 |     5,194 
---------------------+--------------------------------------------+----------
               Total |    46,166     14,356      6,134      3,610 |    70,266 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        296    34.33108    4.411677         18         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,371    46.07586    2.623603         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      7,022    55.61279    2.736757         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     21,886    65.39071    2.751136         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     28,881    73.26415    2.478298         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     10,810    85.10759    4.204504         80        106


. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |    25,846          0          0 |    25,846 
      Former |         0     38,623          0 |    38,623 
     Current |         0          0      5,658 |     5,658 
Unknown (.u) |       139          0          0 |       139 
-------------+---------------------------------+----------
       Total |    25,985     38,623      5,658 |    70,266 

. 
. * Diabetes
. safetab diabcat diabetes, m
17

                      |       Diabetes
    Diabetes Severity |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |    61,259          0 |    61,259 
  Controlled diabetes |         0      6,027 |     6,027 
Uncontrolled diabetes |         0      2,848 |     2,848 
Diabetes, no hba1c me |         0        132 |       132 
----------------------+----------------------+----------
                Total |    61,259      9,007 |    70,266 

. 
. * CKD
. safetab ckd egfr_cat, m
13

   Chronic |
    kidney |                    Calculated eGFR
   disease |         0         15         30         45         60 |     Total
-----------+-------------------------------------------------------+----------
    No CKD |         0          0          0          0     46,803 |    59,836 
       CKD |       116        397      1,934      7,843         43 |    10,430 
-----------+-------------------------------------------------------+----------
     Total |       116        397      1,934      7,843     46,846 |    70,266 


   Chronic | Calculated
    kidney |    eGFR
   disease |         . |     Total
-----------+-----------+----------
    No CKD |    13,033 |    59,836 
       CKD |        97 |    10,430 
-----------+-----------+----------
     Total |    13,130 |    70,266 

. 
. /* RELATIONSHIP WITH EXPOSURE AND COVARIATES (past 4 months)=============*/
. 
. foreach var of varlist  agegroup                    ///
>                         sex                         ///
>                                                 bmicat                      /
> //
>                                                 ethnicity                   /
> //
>                                                 care_home_residence          
>            ///
>                                                 imd                         /
> //
>                                                 smoke_nomiss                /
> //
>                                                 hypertension                 
>            ///
>                                                 heart_failure                
>            ///
>                                                 diabcat                      
>                    ///
>                                                 copd                         
>                    ///                                             
>                                                 other_respiratory            
>            ///
>                                                 cancer                       
>            ///
>                                                 immunodef_any                
>            ///
>                                                 ckd                          
>                    ///
>                                                 myocardial_infarct           
>            ///
>                                                 pad                          
>                            ///
>                                                 stroke_tia                   
>                    ///
>                                                 vte                          
>                            ///
>                                                 flu_vaccine                  
>                    ///                                             
>                                                 oestrogen                    
>                    ///
>                                                 antiplatelet                 
>            ///
>                                                 gp_consult                   
>            ///
>                                                 ae_attendance_last_year     /
> //
>                                               {
  2.                                                         
.         safetab `var' exposure , col m
  3. }
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
   Grouped |  Treatment Exposure
       age |   non-use  current u |     Total
-----------+----------------------+----------
    18-<40 |       170        126 |       296 
           |      0.95       0.24 |      0.42 
-----------+----------------------+----------
    40-<50 |       613        758 |     1,371 
           |      3.41       1.45 |      1.95 
-----------+----------------------+----------
    50-<60 |     2,361      4,661 |     7,022 
           |     13.13       8.92 |      9.99 
-----------+----------------------+----------
    60-<70 |     6,123     15,763 |    21,886 
           |     34.05      30.15 |     31.15 
-----------+----------------------+----------
    70-<80 |     6,204     22,677 |    28,881 
           |     34.50      43.37 |     41.10 
-----------+----------------------+----------
       80+ |     2,513      8,297 |    10,810 
           |     13.97      15.87 |     15.38 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
           |  Treatment Exposure
       Sex |   non-use  current u |     Total
-----------+----------------------+----------
         F |     5,333     10,865 |    16,198 
           |     29.65      20.78 |     23.05 
-----------+----------------------+----------
         M |    12,651     41,417 |    54,068 
           |     70.35      79.22 |     76.95 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Oral anticoagulant
                     |  Treatment Exposure
         Grouped BMI |   non-use  current u |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       255        499 |       754 
                     |      1.42       0.95 |      1.07 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,652     11,769 |    16,421 
                     |     25.87      22.51 |     23.37 
---------------------+----------------------+----------
Overweight (25-29.9) |     5,933     17,864 |    23,797 
                     |     32.99      34.17 |     33.87 
---------------------+----------------------+----------
   Obese I (30-34.9) |     3,280     11,076 |    14,356 
                     |     18.24      21.19 |     20.43 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,388      4,746 |     6,134 
                     |      7.72       9.08 |      8.73 
---------------------+----------------------+----------
     Obese III (40+) |       738      2,872 |     3,610 
                     |      4.10       5.49 |      5.14 
---------------------+----------------------+----------
        Unknown (.u) |     1,738      3,456 |     5,194 
                     |      9.66       6.61 |      7.39 
---------------------+----------------------+----------
               Total |    17,984     52,282 |    70,266 
                     |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Oral anticoagulant
                      |  Treatment Exposure
            Ethnicity |   non-use  current u |     Total
----------------------+----------------------+----------
                White |    12,792     37,793 |    50,585 
                      |     71.13      72.29 |     71.99 
----------------------+----------------------+----------
                Mixed |        48        102 |       150 
                      |      0.27       0.20 |      0.21 
----------------------+----------------------+----------
Asian or Asian Britis |       326        506 |       832 
                      |      1.81       0.97 |      1.18 
----------------------+----------------------+----------
                Black |       123        184 |       307 
                      |      0.68       0.35 |      0.44 
----------------------+----------------------+----------
                Other |        90        215 |       305 
                      |      0.50       0.41 |      0.43 
----------------------+----------------------+----------
              Unknown |     4,605     13,482 |    18,087 
                      |     25.61      25.79 |     25.74 
----------------------+----------------------+----------
                Total |    17,984     52,282 |    70,266 
                      |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
 Care home |  Treatment Exposure
 residence |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,765     51,958 |    69,723 
           |     98.78      99.38 |     99.23 
-----------+----------------------+----------
         1 |       218        324 |       542 
           |      1.21       0.62 |      0.77 
-----------+----------------------+----------
         . |         1          0 |         1 
           |      0.01       0.00 |      0.00 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Oral anticoagulant
     Deprivation |  Treatment Exposure
           (IMD) |   non-use  current u |     Total
-----------------+----------------------+----------
1 least deprived |     3,716     11,331 |    15,047 
                 |     20.66      21.67 |     21.41 
-----------------+----------------------+----------
               2 |     3,652     10,850 |    14,502 
                 |     20.31      20.75 |     20.64 
-----------------+----------------------+----------
               3 |     3,663     10,688 |    14,351 
                 |     20.37      20.44 |     20.42 
-----------------+----------------------+----------
               4 |     3,532      9,909 |    13,441 
                 |     19.64      18.95 |     19.13 
-----------------+----------------------+----------
 5 most deprived |     3,421      9,504 |    12,925 
                 |     19.02      18.18 |     18.39 
-----------------+----------------------+----------
           Total |    17,984     52,282 |    70,266 
                 |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |
      status |  Oral anticoagulant
(missing set |  Treatment Exposure
     to non) |   non-use  current u |     Total
-------------+----------------------+----------
       Never |     6,943     19,042 |    25,985 
             |     38.61      36.42 |     36.98 
-------------+----------------------+----------
      Former |     9,267     29,356 |    38,623 
             |     51.53      56.15 |     54.97 
-------------+----------------------+----------
     Current |     1,774      3,884 |     5,658 
             |      9.86       7.43 |      8.05 
-------------+----------------------+----------
       Total |    17,984     52,282 |    70,266 
             |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Oral anticoagulant
hypertensi |  Treatment Exposure
        on |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    10,509     30,502 |    41,011 
           |     58.44      58.34 |     58.37 
-----------+----------------------+----------
         1 |     7,475     21,780 |    29,255 
           |     41.56      41.66 |     41.63 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
     Heart |  Treatment Exposure
   Failure |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    16,596     46,675 |    63,271 
           |     92.28      89.28 |     90.04 
-----------+----------------------+----------
         1 |     1,388      5,607 |     6,995 
           |      7.72      10.72 |      9.96 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Oral anticoagulant
                      |  Treatment Exposure
    Diabetes Severity |   non-use  current u |     Total
----------------------+----------------------+----------
          No diabetes |    15,357     45,902 |    61,259 
                      |     85.39      87.80 |     87.18 
----------------------+----------------------+----------
  Controlled diabetes |     1,803      4,224 |     6,027 
                      |     10.03       8.08 |      8.58 
----------------------+----------------------+----------
Uncontrolled diabetes |       763      2,085 |     2,848 
                      |      4.24       3.99 |      4.05 
----------------------+----------------------+----------
Diabetes, no hba1c me |        61         71 |       132 
                      |      0.34       0.14 |      0.19 
----------------------+----------------------+----------
                Total |    17,984     52,282 |    70,266 
                      |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
           |  Treatment Exposure
      COPD |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    16,465     47,087 |    63,552 
           |     91.55      90.06 |     90.44 
-----------+----------------------+----------
         1 |     1,519      5,195 |     6,714 
           |      8.45       9.94 |      9.56 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |  Oral anticoagulant
Respirator |  Treatment Exposure
y Diseases |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,250     50,178 |    67,428 
           |     95.92      95.98 |     95.96 
-----------+----------------------+----------
         1 |       734      2,104 |     2,838 
           |      4.08       4.02 |      4.04 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
           |  Treatment Exposure
    Cancer |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    15,224     44,370 |    59,594 
           |     84.65      84.87 |     84.81 
-----------+----------------------+----------
         1 |     2,760      7,912 |    10,672 
           |     15.35      15.13 |     15.19 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Oral anticoagulant
        on |  Treatment Exposure
algorithm) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,727     51,845 |    69,572 
           |     98.57      99.16 |     99.01 
-----------+----------------------+----------
         1 |       257        437 |       694 
           |      1.43       0.84 |      0.99 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Oral anticoagulant
    kidney |  Treatment Exposure
   disease |   non-use  current u |     Total
-----------+----------------------+----------
    No CKD |    15,960     43,876 |    59,836 
           |     88.75      83.92 |     85.16 
-----------+----------------------+----------
       CKD |     2,024      8,406 |    10,430 
           |     11.25      16.08 |     14.84 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
Myocardial |  Treatment Exposure
infarction |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,231     50,676 |    67,907 
           |     95.81      96.93 |     96.64 
-----------+----------------------+----------
         1 |       753      1,606 |     2,359 
           |      4.19       3.07 |      3.36 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Peripheral |  Oral anticoagulant
  arterial |  Treatment Exposure
   disease |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,775     51,858 |    69,633 
           |     98.84      99.19 |     99.10 
-----------+----------------------+----------
         1 |       209        424 |       633 
           |      1.16       0.81 |      0.90 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Stroke/Tra |
    nsient |  Oral anticoagulant
 ischaemic |  Treatment Exposure
    attack |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,651     51,258 |    68,909 
           |     98.15      98.04 |     98.07 
-----------+----------------------+----------
         1 |       333      1,024 |     1,357 
           |      1.85       1.96 |      1.93 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Venous |  Oral anticoagulant
thromboemb |  Treatment Exposure
     olism |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,666     51,735 |    69,401 
           |     98.23      98.95 |     98.77 
-----------+----------------------+----------
         1 |       318        547 |       865 
           |      1.77       1.05 |      1.23 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
       Flu |  Treatment Exposure
   vaccine |   non-use  current u |     Total
-----------+----------------------+----------
         0 |     6,958     12,774 |    19,732 
           |     38.69      24.43 |     28.08 
-----------+----------------------+----------
         1 |    11,026     39,508 |    50,534 
           |     61.31      75.57 |     71.92 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
    Recent |  Treatment Exposure
 Oestrogen |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,738     51,931 |    69,669 
           |     98.63      99.33 |     99.15 
-----------+----------------------+----------
         1 |       246        351 |       597 
           |      1.37       0.67 |      0.85 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |  Oral anticoagulant
antiplatel |  Treatment Exposure
        et |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    14,043     49,999 |    64,042 
           |     78.09      95.63 |     91.14 
-----------+----------------------+----------
         1 |     3,941      2,283 |     6,224 
           |     21.91       4.37 |      8.86 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        GP |
consultati |
on in last |  Oral anticoagulant
      year |  Treatment Exposure
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |     1,368      1,508 |     2,876 
           |      7.61       2.88 |      4.09 
-----------+----------------------+----------
         1 |    16,616     50,774 |    67,390 
           |     92.39      97.12 |     95.91 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       A&E |
attendance |
   rate in |  Oral anticoagulant
 last year |  Treatment Exposure
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    13,666     38,250 |    51,916 
           |     75.99      73.16 |     73.88 
-----------+----------------------+----------
         1 |     4,318     14,032 |    18,350 
           |     24.01      26.84 |     26.12 
-----------+----------------------+----------
     Total |    17,984     52,282 |    70,266 
           |    100.00     100.00 |    100.00 

. 
. bysort exposure: su gp_consult_count, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              17,984
25%            3              0       Sum of Wgt.      17,984

50%            7                      Mean           9.206239
                        Largest       Std. Dev.      9.965302
75%           12            153
90%           20            177       Variance       99.30724
95%           26            198       Skewness       4.179938
99%           46            201       Kurtosis       41.64296

-------------------------------------------------------------------------------
-> exposure = current use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            3              0       Obs              52,282
25%            5              0       Sum of Wgt.      52,282

50%           10                      Mean           12.62748
                        Largest       Std. Dev.      11.54925
75%           16            180
90%           26            184       Variance       133.3852
95%           33            194       Skewness       2.943425
99%           56            198       Kurtosis       20.70153


. bysort exposure: su ae_attendance_count , detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              17,984
25%            0              0       Sum of Wgt.      17,984

50%            0                      Mean           .4184831
                        Largest       Std. Dev.      1.185524
75%            0             29
90%            1             34       Variance       1.405466
95%            2             34       Skewness       10.72698
99%            4             39       Kurtosis       230.5776

-------------------------------------------------------------------------------
-> exposure = current use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              52,282
25%            0              0       Sum of Wgt.      52,282

50%            0                      Mean           .4417199
                        Largest       Std. Dev.      1.029759
75%            1             22
90%            1             25       Variance       1.060403
95%            2             43       Skewness       8.130452
99%            4             54       Kurtosis       234.5235


. bysort exposure: su age, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           40             21
 5%           50             21
10%           55             24       Obs              17,984
25%           63             25       Sum of Wgt.      17,984

50%           69                      Mean           68.69117
                        Largest       Std. Dev.      10.68939
75%           74            102
90%           82            103       Variance        114.263
95%           87            103       Skewness      -.2110652
99%           94            106       Kurtosis       3.793194

-------------------------------------------------------------------------------
-> exposure = current use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           47             18
 5%           55             20
10%           59             23       Obs              52,282
25%           66             23       Sum of Wgt.      52,282

50%           71                      Mean           70.68588
                        Largest       Std. Dev.      9.117893
75%           75            100
90%           83            101       Variance       83.13598
95%           86            101       Skewness      -.2000865
99%           92            101       Kurtosis       3.858329


. bysort exposure: su follow_up_`outcome', detail

-------------------------------------------------------------------------------
-> exposure = non-use

       Number of days (follow-up) for ONS covid death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           45            1.5
 5%          212            1.5
10%          212            1.5       Obs              17,984
25%          212            1.5       Sum of Wgt.      17,984

50%          212                      Mean           207.8353
                        Largest       Std. Dev.      24.75651
75%          212            212
90%          212            212       Variance       612.8846
95%          212            212       Skewness      -6.401696
99%          212            212       Kurtosis       44.36271

-------------------------------------------------------------------------------
-> exposure = current use

       Number of days (follow-up) for ONS covid death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           79            1.5
 5%          212            1.5
10%          212            1.5       Obs              52,282
25%          212            1.5       Sum of Wgt.      52,282

50%          212                      Mean           209.4622
                        Largest       Std. Dev.      19.21589
75%          212            212
90%          212            212       Variance       369.2505
95%          212            212       Skewness      -8.265601
99%          212            212       Kurtosis       73.31035


. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab `outcome', m
14

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  ONS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     70,081       99.74       99.74
          1 |        185        0.26      100.00
------------+-----------------------------------
      Total |     70,266      100.00

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/03_an_checks_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 02:42:53
-------------------------------------------------------------------------------
