-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/03_an_checks_admitcovid.log
  log type:  text
 opened on:   1 Mar 2021, 20:39:03

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_`outcome', clear

. 
. *Duplicate patient check
. sort patient_id

. datacheck _n==1, by(patient_id) nol

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. * Check date ranges for all treatment variables  
. foreach i in warfarin_last_four_months  ///
>              doac_last_four_months      ///
>               {
  2.         
.         summ `i', format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
warfarin_l~s |     12,351   02feb2020    23.50489  01nov2019  28feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
doac_last_~s |     40,447   05feb2020    20.12693  01nov2019  28feb2020

. 
. * Check date ranges for all comorbidities/ medications 
. foreach var of varlist  ckd                                             ///  
>                    
>                                                 hypertension                 
>            ///
>                                                 other_respiratory            
>            ///
>                                                 heart_failure                
>            ///
>                                                 copd                         
>                    ///
>                                                 diabetes                     
>                    ///
>                                                 cancer                       
>            ///
>                                                 myocardial_infarct           
>            ///
>                                                 stroke                       
>                    ///
>                                                 tia                          
>                            ///
>                                                 pad                          
>                            ///
>                                                 vte                          
>                            ///
>                                                 antiplatelet                /
> //
>                                                 oestrogen                   /
> //
>                                                 has_bled_score               
>            ///
>                                                  { 
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    ckd_date |     10,462   25sep2019    594.2503  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |     29,351   14may2004    7112.624  15jan1860  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_resp~e |      2,851   29apr2009    6392.975  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
heart_fai~te |      7,017   09dec2013    4123.694  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   copd_date |      6,739   13aug2009     6500.58  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
diabetes_d~e |      9,047   11sep2010    5715.523  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 cancer_date |     10,709   05apr2010    4608.333  15dec1899  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
myocardial~e |      2,366   23may2012    3011.801  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 stroke_date |        954   14aug2015    3752.356  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    tia_date |        695   31oct2015    2189.633  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    pad_date |        633   02nov2014    2138.028  15aug1969  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    vte_date |        866   10nov2012    3533.553  15jan1900  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
antiplatel~e |      6,247   29jan2020    25.43078  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
oestrogen_~e |        598   18jan2020    31.36423  15nov2019  15feb2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_bled_~te |     26,574   24may2017    577.3022  15may2012  15feb2020

. 
. summ immunodef_any, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
immunodef_~y |     70,464    .0098632    .0988233          0          1

. 
. * Death outcome flag (covid)
. //Underlying Covid-death should be a subset of Any Covid-death
. datacheck !(died_ons_covid_flag_underlying==1 & died_ons_covid_flag_any!=1), 
> nolist

. 
. * Outcome dates
. summ  stime_onscoviddeath stime_onsnoncoviddeath ///
> stime_admitcovid stime_covidtest stime_positivecovidtest,  format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_onsc~h |     70,464   25sep2020    20.75568  01mar2020  28sep2020
stime_onsn~h |     70,464   25sep2020    20.75568  01mar2020  28sep2020
stime_admi~d |     70,464   24sep2020    21.90983  01mar2020  28sep2020
stime_covi~t |     70,464   13sep2020    39.13843  01mar2020  28sep2020
stime_posi~t |     70,464   24sep2020    22.96591  01mar2020  28sep2020

. summ  died_date_ons died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |      2,420   22aug2020    107.2378  01mar2020  14feb2021
died_date_~d |        462   18sep2020    122.2328  18mar2020  12feb2021

. summ  covid_admission_date covid_admission_primary_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
covid~n_date |        695   25jul2020    104.7156  04mar2020  29dec2020
covid~y_date |        406   20jul2020    105.6778  05mar2020  29dec2020

. summ  first_tested_for_covid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_test~d |     23,510   27sep2020    90.27576  01mar2020  25feb2021

. summ  first_positive_test_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
first_posi~e |      2,768   08nov2020    91.84583  12mar2020  25feb2021

. summ  mi_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 mi_date_ons |         78   25aug2020    109.2012  09mar2020  10feb2021

. summ  stroke_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dat~s |          8   20jul2020    107.4137  23mar2020  01jan2021

. summ  vte_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
vte_date_ons |          9   31jul2020    128.7129  03mar2020  09feb2021

. summ  gi_bleed_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gi_bleed_d~s |         11   03oct2020    97.36679  26apr2020  06feb2021

. summ  intracranial_bleed_date_ons, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
intrac~e_ons |         31   15sep2020    109.1122  30mar2020  07feb2021

. 
. * Follow-up for outcomes
. datacheck follow_up_`outcome' > 0, nol

. 
. summ  follow_up_`outcome', detail

        Number of days (follow-up) for covid hospital
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%           55            1.5
 5%          212            1.5
10%          212            1.5       Obs              70,464
25%          212            1.5       Sum of Wgt.      70,464

50%          212                      Mean           208.7578
                        Largest       Std. Dev.      21.90983
75%          212            212
90%          212            212       Variance       480.0407
95%          212            212       Skewness      -7.280588
99%          212            212       Kurtosis       56.85752

. 
. * Outcome date day lags since cohort entry (only ONS dataset)
. * check how the death count tail out
. gen days_died_since_entry = died_date_ons - enter_date
(68,044 missing values generated)

. su days_died_since_entry, detail

                    days_died_since_entry
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2             .5
 5%         16.5             .5
10%           32             .5       Obs               2,420
25%           70             .5       Sum of Wgt.       2,420

50%          176                      Mean           174.1512
                        Largest       Std. Dev.      107.2378
75%          274            347
90%          318            348       Variance       11499.95
95%          331            348       Skewness      -.0148371
99%          344            350       Kurtosis        1.61514

. 
. * check the dates of first positive covid test date and covid first test date
. datacheck first_positive_test_date == first_tested_for_covid, nol

 (20751 contradictions)

. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        769    17.40416    .8583738         15       18.4

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     16,527     22.7019    1.643311       18.5       24.9

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     23,921     27.3907    1.412504         25       29.9

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |     14,381    32.12422    1.423552         30       34.9

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      6,172    37.09788    1.431219         35       39.9

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      3,623    43.58363    2.699895         40         50

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |       769          0          0          0 |       769 
  Normal (18.5-24.9) |    16,527          0          0          0 |    16,527 
Overweight (25-29.9) |    23,921          0          0          0 |    23,921 
   Obese I (30-34.9) |         0     14,381          0          0 |    14,381 
  Obese II (35-39.9) |         0          0      6,172          0 |     6,172 
     Obese III (40+) |         0          0          0      3,623 |     3,623 
        Unknown (.u) |     5,071          0          0          0 |     5,071 
---------------------+--------------------------------------------+----------
               Total |    46,288     14,381      6,172      3,623 |    70,464 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |        295    34.33559    4.418489         18         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,375    46.07782    2.620415         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      7,054    55.61511    2.735052         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     21,943    65.38869    2.752034         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     28,968    73.26457    2.478383         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     10,829    85.10998    4.207493         80        106


. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |    25,910          0          0 |    25,910 
      Former |         0     38,739          0 |    38,739 
     Current |         0          0      5,674 |     5,674 
Unknown (.u) |       141          0          0 |       141 
-------------+---------------------------------+----------
       Total |    26,051     38,739      5,674 |    70,464 

. 
. * Diabetes
. safetab diabcat diabetes, m
17

                      |       Diabetes
    Diabetes Severity |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |    61,417          0 |    61,417 
  Controlled diabetes |         0      6,051 |     6,051 
Uncontrolled diabetes |         0      2,862 |     2,862 
Diabetes, no hba1c me |         0        134 |       134 
----------------------+----------------------+----------
                Total |    61,417      9,047 |    70,464 

. 
. * CKD
. safetab ckd egfr_cat, m
13

   Chronic |
    kidney |                    Calculated eGFR
   disease |         0         15         30         45         60 |     Total
-----------+-------------------------------------------------------+----------
    No CKD |         0          0          0          0     46,923 |    60,002 
       CKD |       118        401      1,939      7,865         42 |    10,462 
-----------+-------------------------------------------------------+----------
     Total |       118        401      1,939      7,865     46,965 |    70,464 


   Chronic | Calculated
    kidney |    eGFR
   disease |         . |     Total
-----------+-----------+----------
    No CKD |    13,079 |    60,002 
       CKD |        97 |    10,462 
-----------+-----------+----------
     Total |    13,176 |    70,464 

. 
. /* RELATIONSHIP WITH EXPOSURE AND COVARIATES (past 4 months)=============*/
. 
. foreach var of varlist  agegroup                    ///
>                         sex                         ///
>                                                 bmicat                      /
> //
>                                                 ethnicity                   /
> //
>                                                 care_home_residence          
>            ///
>                                                 imd                         /
> //
>                                                 smoke_nomiss                /
> //
>                                                 hypertension                 
>            ///
>                                                 heart_failure                
>            ///
>                                                 diabcat                      
>                    ///
>                                                 copd                         
>                    ///                                             
>                                                 other_respiratory            
>            ///
>                                                 cancer                       
>            ///
>                                                 immunodef_any                
>            ///
>                                                 ckd                          
>                    ///
>                                                 myocardial_infarct           
>            ///
>                                                 pad                          
>                            ///
>                                                 stroke_tia                   
>                    ///
>                                                 vte                          
>                            ///
>                                                 flu_vaccine                  
>                    ///                                             
>                                                 oestrogen                    
>                    ///
>                                                 antiplatelet                 
>            ///
>                                                 gp_consult                   
>            ///
>                                                 ae_attendance_last_year     /
> //
>                                               {
  2.                                                         
.         safetab `var' exposure , col m
  3. }
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
   Grouped |  Treatment Exposure
       age |   non-use  current u |     Total
-----------+----------------------+----------
    18-<40 |       169        126 |       295 
           |      0.94       0.24 |      0.42 
-----------+----------------------+----------
    40-<50 |       615        760 |     1,375 
           |      3.41       1.45 |      1.95 
-----------+----------------------+----------
    50-<60 |     2,372      4,682 |     7,054 
           |     13.14       8.93 |     10.01 
-----------+----------------------+----------
    60-<70 |     6,134     15,809 |    21,943 
           |     33.99      30.16 |     31.14 
-----------+----------------------+----------
    70-<80 |     6,233     22,735 |    28,968 
           |     34.54      43.37 |     41.11 
-----------+----------------------+----------
       80+ |     2,525      8,304 |    10,829 
           |     13.99      15.84 |     15.37 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
           |  Treatment Exposure
       Sex |   non-use  current u |     Total
-----------+----------------------+----------
         F |     5,345     10,894 |    16,239 
           |     29.62      20.78 |     23.05 
-----------+----------------------+----------
         M |    12,703     41,522 |    54,225 
           |     70.38      79.22 |     76.95 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Oral anticoagulant
                     |  Treatment Exposure
         Grouped BMI |   non-use  current u |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       267        502 |       769 
                     |      1.48       0.96 |      1.09 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,701     11,826 |    16,527 
                     |     26.05      22.56 |     23.45 
---------------------+----------------------+----------
Overweight (25-29.9) |     5,948     17,973 |    23,921 
                     |     32.96      34.29 |     33.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     3,277     11,104 |    14,381 
                     |     18.16      21.18 |     20.41 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,401      4,771 |     6,172 
                     |      7.76       9.10 |      8.76 
---------------------+----------------------+----------
     Obese III (40+) |       741      2,882 |     3,623 
                     |      4.11       5.50 |      5.14 
---------------------+----------------------+----------
        Unknown (.u) |     1,713      3,358 |     5,071 
                     |      9.49       6.41 |      7.20 
---------------------+----------------------+----------
               Total |    18,048     52,416 |    70,464 
                     |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Oral anticoagulant
                      |  Treatment Exposure
            Ethnicity |   non-use  current u |     Total
----------------------+----------------------+----------
                White |    12,926     38,197 |    51,123 
                      |     71.62      72.87 |     72.55 
----------------------+----------------------+----------
                Mixed |        48        102 |       150 
                      |      0.27       0.19 |      0.21 s
----------------------+----------------------+----------
Asian or Asian Britis |       331        512 |       843 
                      |      1.83       0.98 |      1.20 
----------------------+----------------------+----------
                Black |       125        183 |       308 
                      |      0.69       0.35 |      0.44 
----------------------+----------------------+----------
                Other |        92        217 |       309 
                      |      0.51       0.41 |      0.44 
----------------------+----------------------+----------
              Unknown |     4,526     13,205 |    17,731 
                      |     25.08      25.19 |     25.16 
----------------------+----------------------+----------
                Total |    18,048     52,416 |    70,464 
                      |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
 Care home |  Treatment Exposure
 residence |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,830     52,095 |  [redacted] 
           |         		  |     
-----------+----------------------+----------
         1 |       215        325 |  [redacted]
           |                      |     
-----------+----------------------+----------
         . |        [redacted]    |  [redacted] 
           |                      |       
-----------+----------------------+----------
     Total |        [redacted]    |  [redacted] 
           |                      |    
Figures were corrected to nearest 5

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |  Oral anticoagulant
     Deprivation |  Treatment Exposure
           (IMD) |   non-use  current u |     Total
-----------------+----------------------+----------
1 least deprived |     3,727     11,355 |    15,082 
                 |     20.65      21.66 |     21.40 
-----------------+----------------------+----------
               2 |     3,711     11,030 |    14,741 
                 |     20.56      21.04 |     20.92 
-----------------+----------------------+----------
               3 |     3,624     10,530 |    14,154 
                 |     20.08      20.09 |     20.09 
-----------------+----------------------+----------
               4 |     3,548      9,951 |    13,499 
                 |     19.66      18.98 |     19.16 
-----------------+----------------------+----------
 5 most deprived |     3,438      9,550 |    12,988 
                 |     19.05      18.22 |     18.43 
-----------------+----------------------+----------
           Total |    18,048     52,416 |    70,464 
                 |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |
      status |  Oral anticoagulant
(missing set |  Treatment Exposure
     to non) |   non-use  current u |     Total
-------------+----------------------+----------
       Never |     6,959     19,092 |    26,051 
             |     38.56      36.42 |     36.97 
-------------+----------------------+----------
      Former |     9,309     29,430 |    38,739 
             |     51.58      56.15 |     54.98 
-------------+----------------------+----------
     Current |     1,780      3,894 |     5,674 
             |      9.86       7.43 |      8.05 
-------------+----------------------+----------
       Total |    18,048     52,416 |    70,464 
             |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |  Oral anticoagulant
hypertensi |  Treatment Exposure
        on |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    10,548     30,565 |    41,113 
           |     58.44      58.31 |     58.35 
-----------+----------------------+----------
         1 |     7,500     21,851 |    29,351 
           |     41.56      41.69 |     41.65 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
     Heart |  Treatment Exposure
   Failure |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    16,655     46,792 |    63,447 
           |     92.28      89.27 |     90.04 
-----------+----------------------+----------
         1 |     1,393      5,624 |     7,017 
           |      7.72      10.73 |      9.96 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  Oral anticoagulant
                      |  Treatment Exposure
    Diabetes Severity |   non-use  current u |     Total
----------------------+----------------------+----------
          No diabetes |    15,413     46,004 |    61,417 
                      |     85.40      87.77 |     87.16 
----------------------+----------------------+----------
  Controlled diabetes |     1,805      4,246 |     6,051 
                      |     10.00       8.10 |      8.59 
----------------------+----------------------+----------
Uncontrolled diabetes |       768      2,094 |     2,862 
                      |      4.26       3.99 |      4.06 
----------------------+----------------------+----------
Diabetes, no hba1c me |        62         72 |       134 
                      |      0.34       0.14 |      0.19 
----------------------+----------------------+----------
                Total |    18,048     52,416 |    70,464 
                      |    100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
           |  Treatment Exposure
      COPD |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    16,525     47,200 |    63,725 
           |     91.56      90.05 |     90.44 
-----------+----------------------+----------
         1 |     1,523      5,216 |     6,739 
           |      8.44       9.95 |      9.56 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |  Oral anticoagulant
Respirator |  Treatment Exposure
y Diseases |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,307     50,306 |    67,613 
           |     95.89      95.97 |     95.95 
-----------+----------------------+----------
         1 |       741      2,110 |     2,851 
           |      4.11       4.03 |      4.05 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
           |  Treatment Exposure
    Cancer |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    15,269     44,486 |    59,755 
           |     84.60      84.87 |     84.80 
-----------+----------------------+----------
         1 |     2,779      7,930 |    10,709 
           |     15.40      15.13 |     15.20 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |  Oral anticoagulant
        on |  Treatment Exposure
algorithm) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,791     51,978 |    69,769 
           |     98.58      99.16 |     99.01 
-----------+----------------------+----------
         1 |       257        438 |       695 
           |      1.42       0.84 |      0.99 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |  Oral anticoagulant
    kidney |  Treatment Exposure
   disease |   non-use  current u |     Total
-----------+----------------------+----------
    No CKD |    16,017     43,985 |    60,002 
           |     88.75      83.92 |     85.15 
-----------+----------------------+----------
       CKD |     2,031      8,431 |    10,462 
           |     11.25      16.08 |     14.85 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
Myocardial |  Treatment Exposure
infarction |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,294     50,804 |    68,098 
           |     95.82      96.92 |     96.64 
-----------+----------------------+----------
         1 |       754      1,612 |     2,366 
           |      4.18       3.08 |      3.36 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Peripheral |  Oral anticoagulant
  arterial |  Treatment Exposure
   disease |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,839     51,992 |    69,831 
           |     98.84      99.19 |     99.10 
-----------+----------------------+----------
         1 |       209        424 |       633 
           |      1.16       0.81 |      0.90 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Stroke/Tra |
    nsient |  Oral anticoagulant
 ischaemic |  Treatment Exposure
    attack |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,715     51,387 |    69,102 
           |     98.15      98.04 |     98.07 
-----------+----------------------+----------
         1 |       333      1,029 |     1,362 
           |      1.85       1.96 |      1.93 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Venous |  Oral anticoagulant
thromboemb |  Treatment Exposure
     olism |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,730     51,868 |    69,598 
           |     98.24      98.95 |     98.77 
-----------+----------------------+----------
         1 |       318        548 |       866 
           |      1.76       1.05 |      1.23 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
       Flu |  Treatment Exposure
   vaccine |   non-use  current u |     Total
-----------+----------------------+----------
         0 |     6,984     12,803 |    19,787 
           |     38.70      24.43 |     28.08 
-----------+----------------------+----------
         1 |    11,064     39,613 |    50,677 
           |     61.30      75.57 |     71.92 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Oral anticoagulant
    Recent |  Treatment Exposure
 Oestrogen |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    17,802     52,064 |    69,866 
           |     98.64      99.33 |     99.15 
-----------+----------------------+----------
         1 |       246        352 |       598 
           |      1.36       0.67 |      0.85 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Recent |  Oral anticoagulant
antiplatel |  Treatment Exposure
        et |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    14,097     50,120 |    64,217 
           |     78.11      95.62 |     91.13 
-----------+----------------------+----------
         1 |     3,951      2,296 |     6,247 
           |     21.89       4.38 |      8.87 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        GP |
consultati |
on in last |  Oral anticoagulant
      year |  Treatment Exposure
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |     1,428      1,658 |     3,086 
           |      7.91       3.16 |      4.38 
-----------+----------------------+----------
         1 |    16,620     50,758 |    67,378 
           |     92.09      96.84 |     95.62 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       A&E |
attendance |
   rate in |  Oral anticoagulant
 last year |  Treatment Exposure
  (binary) |   non-use  current u |     Total
-----------+----------------------+----------
         0 |    13,718     38,361 |    52,079 
           |     76.01      73.19 |     73.91 
-----------+----------------------+----------
         1 |     4,330     14,055 |    18,385 
           |     23.99      26.81 |     26.09 
-----------+----------------------+----------
     Total |    18,048     52,416 |    70,464 
           |    100.00     100.00 |    100.00 

. 
. bysort exposure: su gp_consult_count, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              18,048
25%            3              0       Sum of Wgt.      18,048

50%            7                      Mean           9.205286
                        Largest       Std. Dev.      10.12854
75%           12            177
90%           20            198       Variance       102.5873
95%           26            201       Skewness       4.468593
99%           46            202       Kurtosis       47.63719

-------------------------------------------------------------------------------
-> exposure = current use

                    GP consultation count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            3              0       Obs              52,416
25%            5              0       Sum of Wgt.      52,416

50%           10                      Mean           12.60014
                        Largest       Std. Dev.      11.56703
75%           16            180
90%           26            184       Variance       133.7961
95%           33            194       Skewness       2.934061
99%           56            198       Kurtosis       20.57825


. bysort exposure: su has_bled_score_ever, detail

-------------------------------------------------------------------------------
-> exposure = non-use

          Ever record of HAS-BLED score in 10 years
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               5,518
25%            1              0       Sum of Wgt.       5,518

50%            1                      Mean           1.375498
                        Largest       Std. Dev.       1.00045
75%            2              8
90%            3              9       Variance         1.0009
95%            3              9       Skewness       1.140376
99%            4              9       Kurtosis       6.562708

-------------------------------------------------------------------------------
-> exposure = current use

          Ever record of HAS-BLED score in 10 years
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              21,055
25%            1              0       Sum of Wgt.      21,055

50%            1                      Mean           1.313227
                        Largest       Std. Dev.      .8423592
75%            2              9
90%            2              9       Variance        .709569
95%            3              9       Skewness       .9734479
99%            4              9       Kurtosis       6.134015


. bysort exposure: su has_bled_score_recent, detail

-------------------------------------------------------------------------------
-> exposure = non-use

               Recent record of HAS-BLED score
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs                 994
25%            1              0       Sum of Wgt.         994

50%            1                      Mean           1.509054
                        Largest       Std. Dev.      .8517611
75%            2              5
90%            3              5       Variance        .725497
95%            3              5       Skewness       .9891815
99%            4              6       Kurtosis       4.818285

-------------------------------------------------------------------------------
-> exposure = current use

               Recent record of HAS-BLED score
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               4,795
25%            1              0       Sum of Wgt.       4,795

50%            1                      Mean           1.299062
                        Largest       Std. Dev.      .7041722
75%            2              4
90%            2              5       Variance       .4958585
95%            3              5       Skewness       .7928372
99%            3              5       Kurtosis       4.389185


. bysort exposure: su ae_attendance_count , detail

-------------------------------------------------------------------------------
-> exposure = non-use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              18,048
25%            0              0       Sum of Wgt.      18,048

50%            0                      Mean           .4181073
                        Largest       Std. Dev.      1.184928
75%            0             29
90%            1             34       Variance       1.404054
95%            2             34       Skewness       10.71854
99%            4             39       Kurtosis       230.3191

-------------------------------------------------------------------------------
-> exposure = current use

                    A&E attendance count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              52,416
25%            0              0       Sum of Wgt.      52,416

50%            0                      Mean           .4414301
                        Largest       Std. Dev.      1.029547
75%            1             22
90%            1             25       Variance       1.059967
95%            2             43       Skewness       8.123328
99%            4             54       Kurtosis       234.1701


. bysort exposure: su age, detail

-------------------------------------------------------------------------------
-> exposure = non-use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           40             21
 5%           50             21
10%           55             24       Obs              18,048
25%           63             25       Sum of Wgt.      18,048

50%           69                      Mean           68.70174
                        Largest       Std. Dev.       10.6881
75%           74            102
90%           82            103       Variance       114.2356
95%           87            103       Skewness       -.208974
99%           94            106       Kurtosis       3.788295

-------------------------------------------------------------------------------
-> exposure = current use

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           47             18
 5%           55             20
10%           59             23       Obs              52,416
25%           66             23       Sum of Wgt.      52,416

50%           71                      Mean            70.6783
                        Largest       Std. Dev.      9.117338
75%           75            100
90%           83            101       Variance       83.12585
95%           86            101       Skewness      -.1990734
99%           92            101       Kurtosis        3.85578


. bysort exposure: su follow_up_`outcome', detail

-------------------------------------------------------------------------------
-> exposure = non-use

        Number of days (follow-up) for covid hospital
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%           39            1.5
 5%          212            1.5
10%          212            1.5       Obs              18,048
25%          212            1.5       Sum of Wgt.      18,048

50%          212                      Mean           207.5331
                        Largest       Std. Dev.      25.73662
75%          212            212
90%          212            212       Variance       662.3736
95%          212            212       Skewness      -6.162351
99%          212            212       Kurtosis       41.06661

-------------------------------------------------------------------------------
-> exposure = current use

        Number of days (follow-up) for covid hospital
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%           65            1.5
 5%          212            1.5
10%          212            1.5       Obs              52,416
25%          212            1.5       Sum of Wgt.      52,416

50%          212                      Mean           209.1795
                        Largest       Std. Dev.      20.41021
75%          212            212
90%          212            212       Variance       416.5766
95%          212            212       Skewness      -7.816654
99%          212            212       Kurtosis       65.36268


. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab `outcome', m
11

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  SUS covid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     70,234       99.67       99.67
          1 |        230        0.33      100.00
------------+-----------------------------------
      Total |     70,464      100.00

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/03_an_checks_admitcovid.log
  log type:  text
 closed on:   1 Mar 2021, 20:39:15
-------------------------------------------------------------------------------
