-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/05a_an_models_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 02:47:41

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |    outcome: first
  Treatment |  positive covid test
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    17,834        150 |    17,984 
            |     99.17       0.83 |    100.00 
------------+----------------------+----------
current use |    51,951        331 |    52,282 
            |     99.37       0.63 |    100.00 
------------+----------------------+----------
      Total |    69,785        481 |    70,266 
            |     99.32       0.68 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5361.8011
Iteration 1:   log likelihood = -5357.8512
Iteration 2:   log likelihood = -5357.8327
Iteration 3:   log likelihood = -5357.8327
Refining estimates:
Iteration 0:   log likelihood = -5357.8327

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          481
Time at risk    =     14574453
                                                LR chi2(1)       =        7.94
Log likelihood  =   -5357.8327                  Prob > chi2      =      0.0048

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7538308   .0741972    -2.87   0.004     .6215739    .9142289
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_univar.ster not fo
> und)
file /workspace/output/oac_tempdata/positivecovidtest_univar.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5361.8011
Iteration 1:   log likelihood = -5293.6491
Iteration 2:   log likelihood = -5286.3659
Iteration 3:   log likelihood = -5286.2828
Iteration 4:   log likelihood = -5286.2828
Refining estimates:
Iteration 0:   log likelihood = -5286.2828

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          481
Time at risk    =     14574453
                                                LR chi2(5)       =      151.04
Log likelihood  =   -5286.2828                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7829806   .0782616    -2.45   0.014     .6436807    .9524265
      1.male |   1.267738   .1687843     1.78   0.075     .9765667    1.645723
        age1 |   .9635791   .0092866    -3.85   0.000     .9455484    .9819535
        age2 |   1.084416   .0251893     3.49   0.000     1.036153    1.134927
        age3 |   .9715417   .1711802    -0.16   0.870     .6878353    1.372266
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar1.ster not
>  found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -5361.8011
Iteration 1:   log likelihood = -5273.3638
Iteration 2:   log likelihood = -5260.3436
Iteration 3:   log likelihood =  -5260.252
Iteration 4:   log likelihood = -5260.2519
Refining estimates:
Iteration 0:   log likelihood = -5260.2519

Cox regression -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          481
Time at risk    =     14574453
                                                LR chi2(26)      =      203.10
Log likelihood  =   -5260.2519                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .730895   .0770042    -2.98   0.003     .5945328    .8985334
      1.male |   .9716127   .2065477    -0.14   0.892     .6405349    1.473817
        age1 |   .9872045   .0119898    -1.06   0.289     .9639824    1.010986
        age2 |    1.09451   .0331864     2.98   0.003      1.03136    1.161525
        age3 |   .8175506   .1945239    -0.85   0.397     .5128425    1.303303
             |
         imd |
          2  |   1.035349     .15575     0.23   0.817     .7709717    1.390385
          3  |   1.058301   .1590409     0.38   0.706     .7882997    1.420782
          4  |   1.112913    .169904     0.70   0.483     .8251093    1.501104
5 most de..  |   1.824856   .2580134     4.25   0.000      1.38318    2.407568
             |
   obese4cat |
Obese I ..)  |   .9432078   .1229737    -0.45   0.654     .7305153    1.217827
Obese II..)  |   1.035801   .1896842     0.19   0.848      .723432    1.483048
Obese II..)  |   1.468232   .2986216     1.89   0.059     .9855304    2.187355
             |
smoke_nomiss |
     Former  |   1.096584    .109381     0.92   0.355     .9018558    1.333358
    Current  |    .940761   .1780672    -0.32   0.747     .6491782     1.36331
             |
     diabcat |
Controlle..  |   1.388985   .3225952     1.41   0.157     .8810572    2.189734
Uncontrol..  |   1.979596   .5138123     2.63   0.009     1.190265    3.292376
Diabetes,..  |   1.555592   1.581925     0.43   0.664     .2119754    11.41579
             |
1.myocardi~t |   1.561146   .4748852     1.46   0.143     .8600358    2.833809
       1.pad |   1.570878   .7406815     0.96   0.338     .6234391    3.958136
1.hyperten~n |   1.080336   .2110548     0.40   0.692     .7366615    1.584346
1.heart_f~re |   1.188782   .2809775     0.73   0.464     .7480218    1.889253
1.stroke_tia |   3.133561   1.226323     2.92   0.004     1.455189    6.747718
       1.vte |   1.952061   .8942419     1.46   0.144     .7953473    4.791042
 1.oestrogen |   .9849345   .5780464    -0.03   0.979     .3117793    3.111483
1.antiplat~t |   .7355596   .1318267    -1.71   0.087     .5176853    1.045129
1.flu_vac~ne |   .9371324   .0987011    -0.62   0.538     .7623428    1.151998
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar2.ster not
>  found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1678.3874
Iteration 1:   log likelihood =  -1638.721
Iteration 2:   log likelihood = -1559.1218
Iteration 3:   log likelihood = -1558.8218
Iteration 4:   log likelihood = -1558.8218
Refining estimates:
Iteration 0:   log likelihood = -1558.8218

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       70,266                  Number of obs    =      70,266
No. of failures =          481
Time at risk    =     14574453
                                                LR chi2(33)      =      239.13
Log likelihood  =   -1558.8218                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6826908    .076099    -3.42   0.001     .5487079    .8493894
      1.male |   .9449404   .2060501    -0.26   0.795     .6163035    1.448819
        age1 |   .9983176   .0123651    -0.14   0.892     .9743743    1.022849
        age2 |   1.084301   .0346153     2.54   0.011     1.018535    1.154313
        age3 |   .8106861   .2050079    -0.83   0.407     .4938546     1.33078
             |
         imd |
          2  |   1.076912   .1784334     0.45   0.655     .7782956    1.490101
          3  |   1.140975   .1946015     0.77   0.439     .8167658    1.593877
          4  |   1.117171    .201955     0.61   0.540     .7838711    1.592188
5 most de..  |   1.541471   .2822181     2.36   0.018     1.076699    2.206868
             |
   obese4cat |
Obese I ..)  |   .9734712   .1308404    -0.20   0.841     .7480256    1.266863
Obese II..)  |   1.020818   .1925522     0.11   0.913     .7053262    1.477429
Obese II..)  |   1.523397   .3226016     1.99   0.047      1.00591    2.307106
             |
smoke_nomiss |
     Former  |   1.011571   .1072791     0.11   0.914     .8217219    1.245283
    Current  |   .8107704   .1611747    -1.06   0.291     .5491434    1.197044
             |
     diabcat |
Controlle..  |   1.390012   .3378903     1.35   0.176      .863187    2.238373
Uncontrol..  |   1.800654   .4881516     2.17   0.030     1.058454    3.063291
Diabetes,..  |   1.072935   1.127465     0.07   0.947      .136808    8.414637
             |
1.myocardi~t |   1.659491   .5221217     1.61   0.107     .8957013    3.074584
       1.pad |   1.416857   .6912785     0.71   0.475     .5445386     3.68658
1.hyperten~n |     1.1461    .230794     0.68   0.498     .7723488    1.700716
1.heart_f~re |    1.19553   .2904286     0.74   0.462     .7426419    1.924606
1.stroke_tia |   3.851316   1.573718     3.30   0.001     1.728991    8.578782
       1.vte |   2.110177   .9882844     1.59   0.111     .8426854    5.284115
 1.oestrogen |   1.003608   .6065873     0.01   0.995     .3069674    3.281224
1.antiplat~t |    .683521   .1278552    -2.03   0.042     .4737306    .9862165
1.flu_vac~ne |   .8809572   .0984586    -1.13   0.257     .7076554      1.0967
             |
         ckd |
        CKD  |    1.19737     .14928     1.44   0.149     .9377917    1.528799
      1.copd |   1.524777   .2228639     2.89   0.004     1.144968    2.030577
1.other_re~y |   .8951319    .201664    -0.49   0.623     .5755991    1.392047
1.immunode~y |   .6636766   .3936766    -0.69   0.489     .2075127    2.122601
    1.cancer |   .9231641   .1235158    -0.60   0.550     .7102175    1.199959
1.ae_atten~r |    1.95738   .1939208     6.78   0.000     1.611926    2.376868
1.gp_consult |   .9150529   .2486073    -0.33   0.744     .5372624    1.558497
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/oac_tempdata/positivecovidtest_multivar3.ster not
>  found)
file /workspace/output/oac_tempdata/positivecovidtest_multivar3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table2_positivecovidtest.txt not found
> )

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7538308   .0741972    -2.87   0.004     .6215739    .9142289
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7829806   .0782616    -2.45   0.014     .6436807    .9524265
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .730895   .0770042    -2.98   0.003     .5945328    .8985334
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6826908    .076099    -3.42   0.001     .5487079    .8493894
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/05a_an_models_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 02:48:03
-------------------------------------------------------------------------------
