-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/06a_an_models_ethnicity_admitcovid.log
  log type:  text
 opened on:  31 Dec 2020, 02:44:11

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(18,087 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |
anticoagula |   Failure/censoring
         nt |     indicator for
  Treatment |  outcome: SUS covid
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |    13,331         48 |    13,379 
            |     99.64       0.36 |    100.00 
------------+----------------------+----------
current use |    38,680        120 |    38,800 
            |     99.69       0.31 |    100.00 
------------+----------------------+----------
      Total |    52,011        168 |    52,179 
            |     99.68       0.32 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1823.4901
Iteration 1:   log likelihood = -1823.0974
Iteration 2:   log likelihood = -1823.0969
Refining estimates:
Iteration 0:   log likelihood = -1823.0969

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          168
Time at risk    =     10855799
                                                LR chi2(1)       =        0.79
Log likelihood  =   -1823.0969                  Prob > chi2      =      0.3752

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8579841   .1465288    -0.90   0.370     .6139158    1.199084
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/oac_tempdata/admitcovid_univar_ethn.ster not foun
> d)
file /workspace/output/oac_tempdata/admitcovid_univar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1823.4901
Iteration 1:   log likelihood = -1790.3225
Iteration 2:   log likelihood = -1778.2949
Iteration 3:   log likelihood = -1777.8775
Iteration 4:   log likelihood = -1777.8763
Iteration 5:   log likelihood = -1777.8763
Refining estimates:
Iteration 0:   log likelihood = -1777.8763

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          168
Time at risk    =     10855799
                                                LR chi2(5)       =       91.23
Log likelihood  =   -1777.8763                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8415329   .1454975    -1.00   0.318     .5996557    1.180974
      1.male |   3.178828   .9869517     3.72   0.000     1.729772     5.84178
        age1 |    .963729   .0168328    -2.12   0.034     .9312956     .997292
        age2 |   1.102249   .0437946     2.45   0.014     1.019671    1.191516
        age3 |   .8629279   .2526463    -0.50   0.615       .48614    1.531749
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/oac_tempdata/admitcovid_multivar1_ethn.ster not f
> ound)
file /workspace/output/oac_tempdata/admitcovid_multivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity     

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1823.4901
Iteration 1:   log likelihood = -1774.6018
Iteration 2:   log likelihood = -1757.9218
Iteration 3:   log likelihood = -1757.2183
Iteration 4:   log likelihood = -1757.1342
Iteration 5:   log likelihood = -1757.1036
Iteration 6:   log likelihood = -1757.0923
Iteration 7:   log likelihood = -1757.0882
Iteration 8:   log likelihood = -1757.0867
Iteration 9:   log likelihood = -1757.0861
Iteration 10:  log likelihood = -1757.0859
Iteration 11:  log likelihood = -1757.0858
Iteration 12:  log likelihood = -1757.0858
Iteration 13:  log likelihood = -1757.0858
Iteration 14:  log likelihood = -1757.0858
Iteration 15:  log likelihood = -1757.0858
Iteration 16:  log likelihood = -1757.0858
Iteration 17:  log likelihood = -1757.0858
Iteration 18:  log likelihood = -1757.0858
Iteration 19:  log likelihood = -1757.0858
Iteration 20:  log likelihood = -1757.0858
Iteration 21:  log likelihood = -1757.0858
Iteration 22:  log likelihood = -1757.0858
Iteration 23:  log likelihood = -1757.0858
Iteration 24:  log likelihood = -1757.0858
Iteration 25:  log likelihood = -1757.0858
Iteration 26:  log likelihood = -1757.0858
Iteration 27:  log likelihood = -1757.0858
Iteration 28:  log likelihood = -1757.0858
Iteration 29:  log likelihood = -1757.0858
Iteration 30:  log likelihood = -1757.0858
Iteration 31:  log likelihood = -1757.0858
Iteration 32:  log likelihood = -1757.0858
Iteration 33:  log likelihood = -1757.0858
Iteration 34:  log likelihood = -1757.0858
Iteration 35:  log likelihood = -1757.0858
Iteration 36:  log likelihood = -1757.0858
Iteration 37:  log likelihood = -1757.0858
Iteration 38:  log likelihood = -1757.0858
Iteration 39:  log likelihood = -1757.0858
Iteration 40:  log likelihood = -1757.0858
Iteration 41:  log likelihood = -1757.0858
Iteration 42:  log likelihood = -1757.0858
Iteration 43:  log likelihood = -1757.0858
Iteration 44:  log likelihood = -1757.0858
Iteration 45:  log likelihood = -1757.0858
Refining estimates:
Iteration 0:   log likelihood = -1757.0858

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          168
Time at risk    =     10855799
                                                LR chi2(27)      =      132.81
Log likelihood  =   -1757.0858                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7802848   .1436591    -1.35   0.178     .5439231    1.119357
      1.male |   2.035532   .8532723     1.70   0.090     .8950836    4.629052
        age1 |   1.000909   .0230688     0.04   0.969     .9567006    1.047159
        age2 |   1.123578   .0589111     2.22   0.026     1.013849    1.245182
        age3 |   .6464934   .2587569    -1.09   0.276     .2950349    1.416625
             |
         imd |
          2  |   .8867668    .229689    -0.46   0.643     .5337433    1.473284
          3  |   .8783355   .2280747    -0.50   0.617      .527997    1.461132
          4  |   1.195353   .2931352     0.73   0.467     .7391909    1.933016
5 most de..  |   1.439846   .3446805     1.52   0.128      .900636     2.30188
             |
   obese4cat |
Obese I ..)  |   1.199374   .2537779     0.86   0.390     .7922222    1.815775
Obese II..)  |   1.311877   .4085107     0.87   0.383     .7125807    2.415195
Obese II..)  |   2.233838   .7463104     2.41   0.016     1.160569    4.299643
             |
smoke_nomiss |
     Former  |   1.529292   .2865747     2.27   0.023     1.059213    2.207991
    Current  |   2.208487   .6290064     2.78   0.005     1.263751    3.859476
             |
     diabcat |
Controlle..  |   1.762722   .6670753     1.50   0.134     .8395752    3.700906
Uncontrol..  |   1.939727   .8607547     1.49   0.135     .8128667    4.628728
Diabetes,..  |   4.98e-19          .        .       .            .           .
             |
1.myocardi~t |       2.16   .9899464     1.68   0.093     .8797126     5.30355
       1.pad |   1.578385   1.177845     0.61   0.541     .3656092    6.814105
1.hyperten~n |   1.090615   .3614805     0.26   0.794     .5695653     2.08833
1.heart_f~re |   1.640478   .6316742     1.29   0.199     .7712779    3.489232
1.stroke_tia |   3.187975   2.097523     1.76   0.078     .8779467    11.57608
       1.vte |    3.99286    2.77782     1.99   0.047     1.021188    15.61214
 1.oestrogen |   1.969817   2.019249     0.66   0.508     .2641581    14.68886
1.antiplat~t |   .8372097   .2345811    -0.63   0.526      .483429    1.449892
1.flu_vac~ne |   1.178231   .2273314     0.85   0.395     .8072299    1.719744
             |
   ethnicity |
      Mixed  |   1.36e-19          .        .       .            .           .
Asian or ..  |   2.522334   1.181917     1.97   0.048     1.006807    6.319158
      Black  |   5.48e-20          .        .       .            .           .
      Other  |   2.705053   1.939607     1.39   0.165     .6634954    11.02843
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/oac_tempdata/admitcovid_multivar2_ethn.ster not f
> ound)
file /workspace/output/oac_tempdata/admitcovid_multivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist      

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1823.4901
Iteration 1:   log likelihood = -1776.9717
Iteration 2:   log likelihood = -1761.0617
Iteration 3:   log likelihood = -1760.5582
Iteration 4:   log likelihood = -1760.5443
Iteration 5:   log likelihood = -1760.5395
Iteration 6:   log likelihood = -1760.5378
Iteration 7:   log likelihood = -1760.5371
Iteration 8:   log likelihood = -1760.5369
Iteration 9:   log likelihood = -1760.5368
Iteration 10:  log likelihood = -1760.5368
Iteration 11:  log likelihood = -1760.5368
Iteration 12:  log likelihood = -1760.5368
Iteration 13:  log likelihood = -1760.5368
Iteration 14:  log likelihood = -1760.5368
Iteration 15:  log likelihood = -1760.5368
Iteration 16:  log likelihood = -1760.5368
Iteration 17:  log likelihood = -1760.5368
Iteration 18:  log likelihood = -1760.5368
Iteration 19:  log likelihood = -1760.5368
Iteration 20:  log likelihood = -1760.5368
Iteration 21:  log likelihood = -1760.5368
Iteration 22:  log likelihood = -1760.5368
Iteration 23:  log likelihood = -1760.5368
Iteration 24:  log likelihood = -1760.5368
Iteration 25:  log likelihood = -1760.5368
Iteration 26:  log likelihood = -1760.5368
Iteration 27:  log likelihood = -1760.5368
Iteration 28:  log likelihood = -1760.5368
Iteration 29:  log likelihood = -1760.5368
Iteration 30:  log likelihood = -1760.5368
Iteration 31:  log likelihood = -1760.5368
Iteration 32:  log likelihood = -1760.5368
Iteration 33:  log likelihood = -1760.5368
Iteration 34:  log likelihood = -1760.5368
Iteration 35:  log likelihood = -1760.5368
Iteration 36:  log likelihood = -1760.5368
Iteration 37:  log likelihood = -1760.5368
Iteration 38:  log likelihood = -1760.5368
Iteration 39:  log likelihood = -1760.5368
Iteration 40:  log likelihood = -1760.5368
Iteration 41:  log likelihood = -1760.5368
Iteration 42:  log likelihood = -1760.5368
Iteration 43:  log likelihood = -1760.5368
Refining estimates:
Iteration 0:   log likelihood = -1760.5368

Cox regression -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          168
Time at risk    =     10855799
                                                LR chi2(25)      =      125.91
Log likelihood  =   -1760.5368                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7783334   .1432666    -1.36   0.173     .5426081    1.116465
      1.male |   2.002712   .8406197     1.65   0.098     .8797001    4.559345
        age1 |    .998381   .0229219    -0.07   0.944     .9544508    1.044333
        age2 |   1.127182   .0591257     2.28   0.022     1.017056    1.249233
        age3 |   .6361894    .254893    -1.13   0.259     .2900999    1.395164
             |
         imd |
          2  |   .8886648   .2301712    -0.46   0.649     .5348969    1.476406
          3  |   .8814624   .2288153    -0.49   0.627     .5299609    1.466101
          4  |   1.207841   .2959288     0.77   0.441     .7472399    1.952359
5 most de..  |   1.458644   .3486121     1.58   0.114     .9130916    2.330152
             |
   obese4cat |
Obese I ..)  |    1.18799   .2514272     0.81   0.416     .7846276    1.798712
Obese II..)  |   1.279096   .3981463     0.79   0.429     .6949411    2.354279
Obese II..)  |   2.153835   .7188874     2.30   0.022     1.119711    4.143036
             |
smoke_nomiss |
     Former  |   1.509156   .2821328     2.20   0.028     1.046175    2.177029
    Current  |   2.175201   .6186843     2.73   0.006     1.245648    3.798425
             |
     diabcat |
Controlle..  |   1.839306    .694794     1.61   0.107     .8772322    3.856503
Uncontrol..  |   2.013121   .8930674     1.58   0.115     .8438338    4.802669
Diabetes,..  |   5.11e-19          .        .       .            .           .
             |
1.myocardi~t |   2.175071    .998016     1.69   0.090     .8849233    5.346152
       1.pad |    1.54038   1.149692     0.58   0.563     .3567114    6.651792
1.hyperten~n |   1.101264   .3655283     0.29   0.771     .5745971    2.110668
1.heart_f~re |   1.633171    .629901     1.27   0.203     .7668849     3.47803
1.stroke_tia |   3.227866   2.136643     1.77   0.077      .882011    11.81291
       1.vte |   4.002755   2.803618     1.98   0.048     1.014282    15.79645
 1.oestrogen |   1.899717   1.947753     0.63   0.531     .2546618    14.17143
1.antiplat~t |   .8585955   .2403285    -0.54   0.586     .4960549    1.486098
1.flu_vac~ne |   1.183314   .2285409     0.87   0.383     .8104049    1.727818
------------------------------------------------------------------------------

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/admitcovid_multivar2_withoutethn.ste
> r not found)
file /workspace/output/oac_tempdata/admitcovid_multivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -548.16275
Iteration 1:   log likelihood = -517.99191
Iteration 2:   log likelihood = -474.00593
Iteration 3:   log likelihood = -464.90085
Iteration 4:   log likelihood = -461.48127
Iteration 5:   log likelihood = -461.40538
Iteration 6:   log likelihood = -461.37939
Iteration 7:   log likelihood = -461.36988
Iteration 8:   log likelihood = -461.36639
Iteration 9:   log likelihood =  -461.3651
Iteration 10:  log likelihood = -461.36463
Iteration 11:  log likelihood = -461.36446
Iteration 12:  log likelihood = -461.36439
Iteration 13:  log likelihood = -461.36437
Iteration 14:  log likelihood = -461.36436
Iteration 15:  log likelihood = -461.36436
Iteration 16:  log likelihood = -461.36436
Iteration 17:  log likelihood = -461.36436
Iteration 18:  log likelihood = -461.36436
Iteration 19:  log likelihood = -461.36436
Iteration 20:  log likelihood = -461.36436
Iteration 21:  log likelihood = -461.36436
Iteration 22:  log likelihood = -461.36436
Iteration 23:  log likelihood = -461.36436
Iteration 24:  log likelihood = -461.36436
Iteration 25:  log likelihood = -461.36436
Iteration 26:  log likelihood = -461.36436
Iteration 27:  log likelihood = -461.36436
Iteration 28:  log likelihood = -461.36436
Iteration 29:  log likelihood = -461.36436
Iteration 30:  log likelihood = -461.36436
Iteration 31:  log likelihood = -461.36436
Iteration 32:  log likelihood = -461.36436
Refining estimates:
Iteration 0:   log likelihood = -461.36436
Iteration 1:   log likelihood = -461.36436
Iteration 2:   log likelihood = -461.36436
Iteration 3:   log likelihood = -461.36436
Iteration 4:   log likelihood = -461.36436
Iteration 5:   log likelihood = -461.36436

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          168
Time at risk    =     10855799
                                                LR chi2(37)      =      173.60
Log likelihood  =   -461.36436                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6564515   .1320184    -2.09   0.036      .442607    .9736144
      1.male |   1.985922   .8714998     1.56   0.118     .8402756    4.693562
        age1 |   1.004437   .0242905     0.18   0.855     .9579391    1.053192
        age2 |   1.104681   .0620724     1.77   0.076     .9894811    1.233292
        age3 |   .7742347   .3336367    -0.59   0.553     .3327124    1.801674
             |
         imd |
          2  |   .7892209   .2368864    -0.79   0.430     .4382364    1.421309
          3  |    .871907   .2647867    -0.45   0.652     .4808078    1.581135
          4  |   .9057541   .2754981    -0.33   0.745     .4990053    1.644052
5 most de..  |   1.012639   .3213139     0.04   0.968     .5437078     1.88601
             |
   obese4cat |
Obese I ..)  |   1.224279    .275492     0.90   0.369      .787662    1.902923
Obese II..)  |   1.305451   .4412429     0.79   0.430     .6730608    2.532019
Obese II..)  |   2.256813    .809466     2.27   0.023     1.117351    4.558287
             |
smoke_nomiss |
     Former  |   1.487087   .3011249     1.96   0.050     .9999402    2.211561
    Current  |    2.09454   .6502581     2.38   0.017     1.139803    3.848996
             |
     diabcat |
Controlle..  |   2.139782   .8741639     1.86   0.063       .96079    4.765521
Uncontrol..  |   2.080642   1.015755     1.50   0.133     .7991835    5.416867
Diabetes,..  |   1.53e-16   4.64e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   2.442424   1.209487     1.80   0.071     .9253505    6.446674
       1.pad |   1.034553   .8018596     0.04   0.965     .2264668    4.726076
1.hyperten~n |   1.201169   .4244599     0.52   0.604     .6009152    2.401017
1.heart_f~re |    1.65583   .6672967     1.25   0.211     .7515934    3.647947
1.stroke_tia |   4.798091   3.401033     2.21   0.027     1.195944     19.2498
       1.vte |   3.613087   2.612809     1.78   0.076     .8756505    14.90823
 1.oestrogen |   2.254393   2.626678     0.70   0.485      .229754    22.12057
1.antiplat~t |   .8337335   .2576093    -0.59   0.556     .4550096    1.527685
1.flu_vac~ne |   1.177166   .2527288     0.76   0.447     .7728425    1.793017
             |
         ckd |
        CKD  |   1.884291   .3690458     3.23   0.001     1.283621    2.766044
      1.copd |   1.963002   .4402119     3.01   0.003     1.264838    3.046537
1.other_re~y |   .6149234   .2526071    -1.18   0.237     .2748857    1.375593
1.immunode~y |   1.503752    .977133     0.63   0.530     .4207931    5.373832
    1.cancer |   1.407637   .2874646     1.67   0.094     .9433226    2.100493
1.ae_atten~r |   1.966255   .3373048     3.94   0.000     1.404814    2.752078
1.gp_consult |   .8788736   .4275757    -0.27   0.791     .3386985     2.28055
             |
   ethnicity |
      Mixed  |   4.76e-17   8.15e-09    -0.00   1.000            0           .
Asian or ..  |   3.832946   2.301049     2.24   0.025     1.181754    12.43192
      Black  |   2.73e-16   1.26e-08    -0.00   1.000            0           .
      Other  |   4.726663   3.949608     1.86   0.063      .918944    24.31197
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/oac_tempdata/admitcovid_multivar3_ethn.ster not f
> ound)
file /workspace/output/oac_tempdata/admitcovid_multivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -548.16275
Iteration 1:   log likelihood =  -524.2474
Iteration 2:   log likelihood = -479.99899
Iteration 3:   log likelihood = -471.97918
Iteration 4:   log likelihood = -466.86778
Iteration 5:   log likelihood = -466.85993
Iteration 6:   log likelihood = -466.85938
Iteration 7:   log likelihood = -466.85918
Iteration 8:   log likelihood = -466.85911
Iteration 9:   log likelihood = -466.85908
Iteration 10:  log likelihood = -466.85907
Iteration 11:  log likelihood = -466.85907
Iteration 12:  log likelihood = -466.85907
Iteration 13:  log likelihood = -466.85907
Iteration 14:  log likelihood = -466.85907
Iteration 15:  log likelihood = -466.85907
Iteration 16:  log likelihood = -466.85907
Iteration 17:  log likelihood = -466.85907
Iteration 18:  log likelihood = -466.85907
Iteration 19:  log likelihood = -466.85907
Iteration 20:  log likelihood = -466.85907
Iteration 21:  log likelihood = -466.85907
Iteration 22:  log likelihood = -466.85907
Iteration 23:  log likelihood = -466.85907
Iteration 24:  log likelihood = -466.85907
Iteration 25:  log likelihood = -466.85907
Iteration 26:  log likelihood = -466.85907
Iteration 27:  log likelihood = -466.85907
Iteration 28:  log likelihood = -466.85907
Iteration 29:  log likelihood = -466.85907
Iteration 30:  log likelihood = -466.85907
Iteration 31:  log likelihood = -466.85907
Refining estimates:
Iteration 0:   log likelihood = -466.85907
Iteration 1:   log likelihood = -466.85907

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,179                  Number of obs    =      52,179
No. of failures =          168
Time at risk    =     10855799
                                                LR chi2(33)      =      162.61
Log likelihood  =   -466.85907                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |    .679561   .1361911    -1.93   0.054     .4588163     1.00651
      1.male |   2.000729   .8748715     1.59   0.113     .8491378    4.714098
        age1 |   .9966193   .0236804    -0.14   0.887     .9512708     1.04413
        age2 |   1.107214   .0623812     1.81   0.071     .9914577    1.236485
        age3 |   .7741175    .334205    -0.59   0.553     .3321413    1.804226
             |
         imd |
          2  |   .7699615   .2290384    -0.88   0.380      .429798    1.379348
          3  |   .8379166    .251644    -0.59   0.556     .4651221    1.509505
          4  |   .8458373   .2546031    -0.56   0.578     .4688879    1.525825
5 most de..  |   .9539763   .3007904    -0.15   0.881     .5142238    1.769795
             |
   obese4cat |
Obese I ..)  |   1.208589   .2710053     0.84   0.398     .7787734    1.875624
Obese II..)  |   1.189498   .4032764     0.51   0.609      .612041    2.311784
Obese II..)  |   2.139072       .763     2.13   0.033     1.063175    4.303742
             |
smoke_nomiss |
     Former  |   1.469346   .2960891     1.91   0.056     .9899142    2.180973
    Current  |   2.114379   .6529744     2.42   0.015     1.154277    3.873073
             |
     diabcat |
Controlle..  |   2.104262   .8518408     1.84   0.066     .9517418    4.652438
Uncontrol..  |   2.058176   .9952049     1.49   0.135     .7978017    5.309703
Diabetes,..  |   2.10e-14   5.22e-07    -0.00   1.000            0           .
             |
1.myocardi~t |   2.317856    1.15125     1.69   0.091     .8755994    6.135748
       1.pad |   1.011364   .7864361     0.01   0.988     .2202996    4.643028
1.hyperten~n |   1.165552   .4108257     0.43   0.664     .5841254    2.325719
1.heart_f~re |   1.522321   .6106294     1.05   0.295     .6935447    3.341473
1.stroke_tia |   4.054868   2.875978     1.97   0.048     1.009831    16.28188
       1.vte |   3.219432    2.32786     1.62   0.106     .7803776     13.2817
 1.oestrogen |   2.001452   2.332343     0.60   0.552     .2039007    19.64589
1.antiplat~t |   .8516622   .2631154    -0.52   0.603     .4648302    1.560416
1.flu_vac~ne |    1.15731   .2457833     0.69   0.491     .7632664    1.754783
             |
         ckd |
        CKD  |   1.904949    .371579     3.30   0.001     1.299715    2.792021
      1.copd |   1.974098   .4405672     3.05   0.002     1.274685    3.057277
1.other_re~y |   .6096491   .2495309    -1.21   0.227      .273326    1.359812
1.immunode~y |   1.548849   .9795633     0.69   0.489     .4484048    5.349929
    1.cancer |   1.368715   .2779497     1.55   0.122     .9192981    2.037837
1.ae_atten~r |   1.988071   .3383923     4.04   0.000     1.424123    2.775339
1.gp_consult |   .8772215   .4249644    -0.27   0.787     .3394299    2.267088
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/oac_tempdata/admitcovid_multivar3_withoutethn.ste
> r not found)
file /workspace/output/oac_tempdata/admitcovid_multivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table3_admitcovid.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,379     2767688           0    2767688    2767688

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _tab _tab ///
>         ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     38,800     8088112           0    8088112    8088112

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8579841   .1465288    -0.90   0.370     .6139158    1.199084
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8415329   .1454975    -1.00   0.318     .5996557    1.180974
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7802848   .1436591    -1.35   0.178     .5439231    1.119357
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7783334   .1432666    -1.36   0.173     .5426081    1.116465
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6564515   .1320184    -2.09   0.036      .442607    .9736144
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .679561   .1361911    -1.93   0.054     .4588163     1.00651
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/06a_an_models_ethnicity_admitcovid.log
  log type:  text
 closed on:  31 Dec 2020, 02:45:44
-------------------------------------------------------------------------------
