-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/08a_an_model_checks_admitcovid.log
  log type:  text
 opened on:   1 Mar 2021, 20:43:32

. 
. /*===========================================================================
> ===*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* In full cohort*/
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.05968         0.82        1         0.3654
      ------------+---------------------------------------------------
      global test |                      0.82        1         0.3654
      ----------------------------------------------------------------

. local univar_p = round(r(p),0.001)

. di `univar_p'
.365

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot1.svg not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot1.svg written in SVG fo
> rmat)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2565.3697
Iteration 1:   log likelihood = -2524.4349
Iteration 2:   log likelihood = -2516.4124
Iteration 3:   log likelihood = -2516.2357
Iteration 4:   log likelihood = -2516.2354
Refining estimates:
Iteration 0:   log likelihood = -2516.2354

Cox regression -- Breslow method for ties

No. of subjects =       70,464                  Number of obs    =      70,464
No. of failures =          230
Time at risk    =     14639448
                                                LR chi2(5)       =       98.27
Log likelihood  =   -2516.2354                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .9164064   .1377799    -0.58   0.561     .6825141    1.230452
      1.male |   2.572884   .6423739     3.79   0.000     1.577248    4.197013
        age1 |   .9660854   .0148922    -2.24   0.025     .9373337     .995719
        age2 |   1.095529   .0378611     2.64   0.008      1.02378    1.172306
        age3 |   .8518646   .2171649    -0.63   0.529     .5168621    1.403998
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.05919         0.82        1         0.3659
      0b.male     |            .            .        1             .
      1.male      |      0.00630         0.01        1         0.9234
      age1        |      0.02758         0.17        1         0.6767
      age2        |     -0.03307         0.26        1         0.6120
      age3        |      0.03639         0.32        1         0.5726
      ------------+---------------------------------------------------
      global test |                      1.28        5         0.9371
      ----------------------------------------------------------------

. local multivar1_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot2.svg not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot2.svg written in SVG fo
> rmat)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -2565.3697
Iteration 1:   log likelihood = -2514.6841
Iteration 2:   log likelihood = -2502.8221
Iteration 3:   log likelihood = -2502.5672
Iteration 4:   log likelihood = -2502.5468
Iteration 5:   log likelihood = -2502.5395
Iteration 6:   log likelihood = -2502.5368
Iteration 7:   log likelihood = -2502.5358
Iteration 8:   log likelihood = -2502.5355
Iteration 9:   log likelihood = -2502.5353
Iteration 10:  log likelihood = -2502.5353
Iteration 11:  log likelihood = -2502.5353
Iteration 12:  log likelihood = -2502.5353
Iteration 13:  log likelihood = -2502.5353
Iteration 14:  log likelihood = -2502.5353
Iteration 15:  log likelihood = -2502.5353
Iteration 16:  log likelihood = -2502.5353
Iteration 17:  log likelihood = -2502.5353
Iteration 18:  log likelihood = -2502.5353
Iteration 19:  log likelihood = -2502.5353
Iteration 20:  log likelihood = -2502.5353
Iteration 21:  log likelihood = -2502.5353
Iteration 22:  log likelihood = -2502.5353
Iteration 23:  log likelihood = -2502.5353
Iteration 24:  log likelihood = -2502.5353
Iteration 25:  log likelihood = -2502.5353
Iteration 26:  log likelihood = -2502.5353
Iteration 27:  log likelihood = -2502.5353
Iteration 28:  log likelihood = -2502.5353
Iteration 29:  log likelihood = -2502.5353
Iteration 30:  log likelihood = -2502.5353
Iteration 31:  log likelihood = -2502.5353
Iteration 32:  log likelihood = -2502.5353
Iteration 33:  log likelihood = -2502.5353
Iteration 34:  log likelihood = -2502.5353
Iteration 35:  log likelihood = -2502.5353
Iteration 36:  log likelihood = -2502.5353
Iteration 37:  log likelihood = -2502.5353
Iteration 38:  log likelihood = -2502.5353
Iteration 39:  log likelihood = -2502.5353
Iteration 40:  log likelihood = -2502.5353
Iteration 41:  log likelihood = -2502.5353
Iteration 42:  log likelihood = -2502.5353
Iteration 43:  log likelihood = -2502.5353
Iteration 44:  log likelihood = -2502.5353
Refining estimates:
Iteration 0:   log likelihood = -2502.5353

Cox regression -- Breslow method for ties

No. of subjects =       70,464                  Number of obs    =      70,464
No. of failures =          230
Time at risk    =     14639448
                                                LR chi2(25)      =      125.67
Log likelihood  =   -2502.5353                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8581665   .1365852    -0.96   0.337     .6281955    1.172326
      1.male |   2.033067   .7178507     2.01   0.044      1.01766     4.06163
        age1 |   .9916148   .0197283    -0.42   0.672     .9536923    1.031045
        age2 |    1.10228   .0492388     2.18   0.029     1.009877    1.203137
        age3 |   .7349513   .2536337    -0.89   0.372     .3736859    1.445475
             |
         imd |
          2  |   .8678346   .1798379    -0.68   0.494     .5781571    1.302651
          3  |   .8133779   .1735108    -0.97   0.333     .5354427    1.235582
          4  |    1.07369   .2178228     0.35   0.726     .7214282    1.597956
5 most de..  |     1.1518   .2373883     0.69   0.493     .7690287    1.725088
             |
   obese4cat |
Obese I ..)  |   1.072401   .1996689     0.38   0.707     .7445142     1.54469
Obese II..)  |   1.234115   .3263213     0.80   0.426     .7349934    2.072183
Obese II..)  |    1.88759   .5571815     2.15   0.031     1.058398    3.366407
             |
smoke_nomiss |
     Former  |   1.231481   .1850378     1.39   0.166      .917338    1.653203
    Current  |   1.682447    .414474     2.11   0.035     1.038117    2.726695
             |
     diabcat |
Controlle..  |     1.7358   .5653179     1.69   0.090     .9168095    3.286399
Uncontrol..  |   1.666763   .6613304     1.29   0.198     .7658404    3.627519
Diabetes,..  |   1.77e-19          .        .       .            .           .
             |
1.myocardi~t |   2.012945   .7944463     1.77   0.076     .9287298    4.362892
       1.pad |   1.653839   1.015214     0.82   0.412     .4965704     5.50815
1.hyperten~n |   .9421962   .2722665    -0.21   0.837     .5347731    1.660019
1.heart_f~re |   1.396528   .4670705     1.00   0.318     .7250438    2.689893
1.stroke_tia |   1.869755   1.185334     0.99   0.324     .5397149    6.477467
       1.vte |   2.262372   1.533857     1.20   0.229     .5990468    8.544115
 1.oestrogen |   2.474004   1.806722     1.24   0.215     .5912658    10.35185
1.antiplat~t |   .8162685   .2034403    -0.81   0.415     .5008254    1.330392
1.flu_vac~ne |   1.098478   .1763962     0.58   0.559     .8018688    1.504802
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.00800         0.01        1         0.9038
      0b.male     |            .            .        1             .
      1.male      |     -0.06084         1.04        1         0.3082
      age1        |      0.04325         0.60        1         0.4396
      age2        |      0.02183         0.12        1         0.7256
      age3        |     -0.02666         0.19        1         0.6618
      1b.imd      |            .            .        1             .
      2.imd       |      0.01844         0.08        1         0.7794
      3.imd       |     -0.01750         0.07        1         0.7897
      4.imd       |      0.07608         1.31        1         0.2529
      5.imd       |      0.12589         3.73        1         0.0534
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.18363         7.96        1         0.0048
      3.obese4cat |     -0.11651         3.08        1         0.0795
      4.obese4cat |     -0.12036         3.41        1         0.0649
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.11985         3.22        1         0.0729
      3.smoke_no~s|      0.10567         2.70        1         0.1001
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.03634         0.40        1         0.5271
      3.diabcat   |      0.05853         0.99        1         0.3191
      4.diabcat   |            .            .        1             .
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.02567         0.17        1         0.6836
      0b.pad      |            .            .        1             .
      1.pad       |     -0.04212         0.39        1         0.5311
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.11361         3.99        1         0.0459
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.06346         1.25        1         0.2645
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.05813         1.07        1         0.3013
      0b.vte      |            .            .        1             .
      1.vte       |      0.00218         0.00        1         0.9665
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.04815         0.52        1         0.4720
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.12008         2.99        1         0.0837
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.10598         2.73        1         0.0986
      ------------+---------------------------------------------------
      global test |                     34.64       25         0.0950
      ----------------------------------------------------------------

. local multivar2_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot3.svg not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot3.svg written in SVG fo
> rmat)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -814.43344
Iteration 1:   log likelihood = -781.75758
Iteration 2:   log likelihood = -730.14327
Iteration 3:   log likelihood = -729.23083
Iteration 4:   log likelihood = -729.22352
Iteration 5:   log likelihood = -729.22095
Iteration 6:   log likelihood =    -729.22
Iteration 7:   log likelihood = -729.21966
Iteration 8:   log likelihood = -729.21953
Iteration 9:   log likelihood = -729.21948
Iteration 10:  log likelihood = -729.21946
Iteration 11:  log likelihood = -729.21946
Iteration 12:  log likelihood = -729.21945
Iteration 13:  log likelihood = -729.21945
Iteration 14:  log likelihood = -729.21945
Iteration 15:  log likelihood = -729.21945
Iteration 16:  log likelihood = -729.21945
Iteration 17:  log likelihood = -729.21945
Iteration 18:  log likelihood = -729.21945
Iteration 19:  log likelihood = -729.21945
Iteration 20:  log likelihood = -729.21945
Iteration 21:  log likelihood = -729.21945
Iteration 22:  log likelihood = -729.21945
Iteration 23:  log likelihood = -729.21945
Iteration 24:  log likelihood = -729.21945
Iteration 25:  log likelihood = -729.21945
Iteration 26:  log likelihood = -729.21945
Iteration 27:  log likelihood = -729.21945
Iteration 28:  log likelihood = -729.21945
Iteration 29:  log likelihood = -729.21945
Refining estimates:
Iteration 0:   log likelihood = -729.21945
Iteration 1:   log likelihood = -729.21945

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       70,464                  Number of obs    =      70,464
No. of failures =          230
Time at risk    =     14639448
                                                LR chi2(33)      =      170.43
Log likelihood  =   -729.21945                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7627822    .127927    -1.61   0.106     .5490914    1.059636
      1.male |   2.147389   .7779766     2.11   0.035     1.055673    4.368096
        age1 |   .9901095   .0195504    -0.50   0.615     .9525235    1.029179
        age2 |   1.085163   .0508691     1.74   0.081     .9899048    1.189589
        age3 |     .81497   .2983634    -0.56   0.576     .3976617    1.670204
             |
         imd |
          2  |   .8814725   .2022547    -0.55   0.582     .5622116    1.382031
          3  |   .8500693   .2052911    -0.67   0.501     .5295291    1.364642
          4  |   .9919289   .2406094    -0.03   0.973     .6166049    1.595711
5 most de..  |    .950975   .2479549    -0.19   0.847     .5704648    1.585292
             |
   obese4cat |
Obese I ..)  |   1.076836   .2066958     0.39   0.700     .7392031    1.568684
Obese II..)  |   1.137331    .314756     0.46   0.642     .6611763    1.956396
Obese II..)  |   1.949834   .6034305     2.16   0.031     1.063089    3.576232
             |
smoke_nomiss |
     Former  |   1.172543   .1883902     0.99   0.322     .8557915    1.606533
    Current  |   1.532396   .4015517     1.63   0.103     .9168974    2.561069
             |
     diabcat |
Controlle..  |   1.623597   .5503704     1.43   0.153     .8354802    3.155153
Uncontrol..  |   1.572101   .6490375     1.10   0.273     .6999457    3.530991
Diabetes,..  |   9.57e-14   6.64e-07    -0.00   1.000            0           .
             |
1.myocardi~t |   1.929172   .7980483     1.59   0.112     .8575332    4.340012
       1.pad |   1.210845   .7759161     0.30   0.765     .3448531    4.251509
1.hyperten~n |    .921773   .2748129    -0.27   0.785     .5138672    1.653473
1.heart_f~re |   1.266475   .4348457     0.69   0.491     .6461532     2.48232
1.stroke_tia |   1.924532   1.251037     1.01   0.314     .5382745    6.880922
       1.vte |   1.627204   1.104107     0.72   0.473     .4304036    6.151882
 1.oestrogen |   2.705628    2.15805     1.25   0.212     .5666785    12.91812
1.antiplat~t |   .7975471    .211305    -0.85   0.393     .4744998    1.340531
1.flu_vac~ne |   1.043624   .1795604     0.25   0.804     .7448881    1.462168
             |
         ckd |
        CKD  |   1.640059   .2730814     2.97   0.003     1.183391    2.272953
      1.copd |   1.793046   .3599506     2.91   0.004     1.209802    2.657471
1.other_re~y |   .6177322   .2130866    -1.40   0.163     .3141799    1.214569
1.immunode~y |    1.17375   .7125135     0.26   0.792     .3571592    3.857351
    1.cancer |   1.098822   .1960068     0.53   0.597     .7746237    1.558705
1.ae_atten~r |   2.176547   .3099295     5.46   0.000     1.646498    2.877233
1.gp_consult |   1.064697   .4478567     0.15   0.882     .4668473    2.428161
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.03377         0.26        1         0.6126
      0b.male     |            .            .        1             .
      1.male      |     -0.06806         1.15        1         0.2845
      age1        |      0.05537         0.76        1         0.3836
      age2        |      0.03513         0.30        1         0.5849
      age3        |     -0.03913         0.38        1         0.5382
      1b.imd      |            .            .        1             .
      2.imd       |     -0.02714         0.17        1         0.6764
      3.imd       |     -0.06078         0.87        1         0.3509
      4.imd       |      0.00272         0.00        1         0.9672
      5.imd       |      0.04363         0.41        1         0.5228
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.16596         6.47        1         0.0110
      3.obese4cat |     -0.11517         2.87        1         0.0905
      4.obese4cat |     -0.12486         4.00        1         0.0456
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.15440         5.37        1         0.0204
      3.smoke_no~s|      0.13334         4.33        1         0.0374
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.04542         0.56        1         0.4526
      3.diabcat   |      0.05171         0.73        1         0.3934
      4.diabcat   |     -0.04272         0.00        1         1.0000
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.03270         0.25        1         0.6179
      0b.pad      |            .            .        1             .
      1.pad       |     -0.02852         0.20        1         0.6544
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.12325         4.33        1         0.0374
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.09513         2.43        1         0.1192
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.07402         1.46        1         0.2263
      0b.vte      |            .            .        1             .
      1.vte       |      0.02649         0.21        1         0.6471
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.10451         3.29        1         0.0697
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.15093         5.26        1         0.0218
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.10469         2.70        1         0.1000
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.07833         1.61        1         0.2049
      0b.copd     |            .            .        1             .
      1.copd      |     -0.04801         0.57        1         0.4513
      0b.other_r~y|            .            .        1             .
      1.other_re~y|     -0.00507         0.01        1         0.9360
      0b.immunod~y|            .            .        1             .
      1.immunode~y|      0.01229         0.04        1         0.8490
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.03334         0.26        1         0.6092
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.06544         0.98        1         0.3227
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|      0.00825         0.01        1         0.9055
      ------------+---------------------------------------------------
      global test |                     40.72       33         0.1671
      ----------------------------------------------------------------

. local multivar3_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot4.svg not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot4.svg written in SVG fo
> rmat)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table5_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table5_admitcovid.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 5: Testing the PH assumption - `outcome' - $p
> opulation Population in Full cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted") _tab ("Fully
>  Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_p'") _tab ("`multivar1_p'") ///
>  _tab ("`multivar2_p'") _tab ("`multivar3_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * ===========================================================================
> ==*/       
. /* In complete case cohort - restrict to people with known ethnicity*/
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. drop if ethnicity == .u
(17,731 observations deleted)

. 
. /* Quietly run models, perform test and store results in local macro=========
> =*/
. qui stcox i.exposure 

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.10269         1.80        1         0.1793
      ------------+---------------------------------------------------
      global test |                      1.80        1         0.1793
      ----------------------------------------------------------------

. local univar_completecase_p = round(r(p),0.001)

. di `univar_p'
.365

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, univaria
> ble", position(11) size(medsmall)) 

. 
. graph export "$tabfigdir/`outcome'_schoenplot1_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot1_completecase.sv
> g not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot1_completecase.svg writ
> ten in SVG format)

. 
. * Close window 
. graph close  

.                           
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1857.8661
Iteration 1:   log likelihood = -1823.8109
Iteration 2:   log likelihood = -1812.2228
Iteration 3:   log likelihood = -1811.8382
Iteration 4:   log likelihood = -1811.8372
Refining estimates:
Iteration 0:   log likelihood = -1811.8372

Cox regression -- Breslow method for ties

No. of subjects =       52,733                  Number of obs    =      52,733
No. of failures =          171
Time at risk    =     10971997
                                                LR chi2(5)       =       92.06
Log likelihood  =   -1811.8372                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .8359323   .1430759    -1.05   0.295     .5976979    1.169124
      1.male |   3.223453   .9994898     3.77   0.000      1.75546    5.919046
        age1 |   .9647405   .0168637    -2.05   0.040     .9322479    .9983655
        age2 |   1.102326   .0436157     2.46   0.014     1.020071    1.191213
        age3 |   .8511557   .2480934    -0.55   0.580     .4807311    1.507009
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.10278         1.85        1         0.1741
      0b.male     |            .            .        1             .
      1.male      |      0.03794         0.25        1         0.6167
      age1        |      0.04275         0.35        1         0.5561
      age2        |     -0.05904         0.65        1         0.4207
      age3        |      0.06020         0.67        1         0.4113
      ------------+---------------------------------------------------
      global test |                      2.75        5         0.7383
      ----------------------------------------------------------------

. local multivar1_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, age and 
> sex adjusted", position(11) size(medsmall))                          

. 
. graph export "$tabfigdir/`outcome'_schoenplot2_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot2_completecase.sv
> g not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot2_completecase.svg writ
> ten in SVG format)

. 
. * Close window 
. graph close

.                   
. stcox i.exposure i.male age1 age2 age3 $dagvarlist i.ethnicity

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1857.8661
Iteration 1:   log likelihood = -1808.5475
Iteration 2:   log likelihood = -1792.1142
Iteration 3:   log likelihood = -1791.4413
Iteration 4:   log likelihood = -1791.3552
Iteration 5:   log likelihood = -1791.3239
Iteration 6:   log likelihood = -1791.3124
Iteration 7:   log likelihood = -1791.3082
Iteration 8:   log likelihood = -1791.3066
Iteration 9:   log likelihood =  -1791.306
Iteration 10:  log likelihood = -1791.3058
Iteration 11:  log likelihood = -1791.3057
Iteration 12:  log likelihood = -1791.3057
Iteration 13:  log likelihood = -1791.3057
Iteration 14:  log likelihood = -1791.3057
Iteration 15:  log likelihood = -1791.3057
Iteration 16:  log likelihood = -1791.3057
Iteration 17:  log likelihood = -1791.3057
Iteration 18:  log likelihood = -1791.3057
Iteration 19:  log likelihood = -1791.3057
Iteration 20:  log likelihood = -1791.3057
Iteration 21:  log likelihood = -1791.3057
Iteration 22:  log likelihood = -1791.3057
Iteration 23:  log likelihood = -1791.3057
Iteration 24:  log likelihood = -1791.3057
Iteration 25:  log likelihood = -1791.3057
Iteration 26:  log likelihood = -1791.3057
Iteration 27:  log likelihood = -1791.3057
Iteration 28:  log likelihood = -1791.3057
Iteration 29:  log likelihood = -1791.3057
Iteration 30:  log likelihood = -1791.3057
Iteration 31:  log likelihood = -1791.3057
Iteration 32:  log likelihood = -1791.3057
Iteration 33:  log likelihood = -1791.3057
Iteration 34:  log likelihood = -1791.3057
Iteration 35:  log likelihood = -1791.3057
Iteration 36:  log likelihood = -1791.3057
Iteration 37:  log likelihood = -1791.3057
Iteration 38:  log likelihood = -1791.3057
Iteration 39:  log likelihood = -1791.3057
Iteration 40:  log likelihood = -1791.3057
Iteration 41:  log likelihood = -1791.3057
Iteration 42:  log likelihood = -1791.3057
Iteration 43:  log likelihood = -1791.3057
Iteration 44:  log likelihood = -1791.3057
Iteration 45:  log likelihood = -1791.3057
Refining estimates:
Iteration 0:   log likelihood = -1791.3057

Cox regression -- Breslow method for ties

No. of subjects =       52,733                  Number of obs    =      52,733
No. of failures =          171
Time at risk    =     10971997
                                                LR chi2(27)      =      133.12
Log likelihood  =   -1791.3057                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |     .77745   .1416219    -1.38   0.167     .5440212    1.111039
      1.male |   2.168917   .9055059     1.85   0.064     .9569141    4.916012
        age1 |   1.000395   .0230197     0.02   0.986     .9562794    1.046545
        age2 |   1.118316   .0581402     2.15   0.031     1.009977    1.238277
        age3 |   .6649869   .2642353    -1.03   0.305        .3052    1.448911
             |
         imd |
          2  |   .8996426   .2272038    -0.42   0.675     .5484032    1.475843
          3  |   .8330293   .2168842    -0.70   0.483     .5000862    1.387637
          4  |   1.187173   .2869274     0.71   0.478     .7392432    1.906517
5 most de..  |   1.396908   .3312912     1.41   0.159     .8775996     2.22351
             |
   obese4cat |
Obese I ..)  |   1.228554   .2563807     0.99   0.324     .8161337    1.849384
Obese II..)  |   1.294449   .4023374     0.83   0.406     .7039092    2.380418
Obese II..)  |   2.246014   .7485846     2.43   0.015     1.168722    4.316318
             |
smoke_nomiss |
     Former  |   1.576501   .2942499     2.44   0.015     1.093502     2.27284
    Current  |   2.227966   .6338029     2.82   0.005      1.27574    3.890944
             |
     diabcat |
Controlle..  |   1.667636   .6284587     1.36   0.175     .7967473    3.490452
Uncontrol..  |   1.851121   .8181274     1.39   0.164     .7784574    4.401843
Diabetes,..  |   4.80e-19          .        .       .            .           .
             |
1.myocardi~t |   2.053626   .9388294     1.57   0.115     .8382795    5.030997
       1.pad |   1.537894   1.146982     0.58   0.564     .3565242    6.633826
1.hyperten~n |   1.044785   .3437591     0.13   0.894     .5482282    1.991097
1.heart_f~re |    1.54355   .5922323     1.13   0.258     .7276624    3.274246
1.stroke_tia |   2.919404   1.925696     1.62   0.104     .8013551    10.63563
       1.vte |   3.607725   2.514284     1.84   0.066     .9204855    14.14002
 1.oestrogen |   1.964296   2.013058     0.66   0.510     .2635573    14.63992
1.antiplat~t |   .8248684   .2305641    -0.69   0.491      .476936    1.426623
1.flu_vac~ne |   1.118478   .2113676     0.59   0.554     .7722704    1.619891
             |
   ethnicity |
      Mixed  |   1.38e-19          .        .       .            .           .
Asian or ..  |   2.510729   1.175256     1.97   0.049     1.003132    6.284081
      Black  |   5.50e-20          .        .       .            .           .
      Other  |   2.683451   1.923109     1.38   0.168     .6586821     10.9323
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.04391         0.31        1         0.5757
      0b.male     |            .            .        1             .
      1.male      |     -0.01886         0.08        1         0.7817
      age1        |      0.04776         0.64        1         0.4231
      age2        |     -0.01176         0.03        1         0.8661
      age3        |      0.00446         0.00        1         0.9487
      1b.imd      |            .            .        1             .
      2.imd       |      0.04181         0.30        1         0.5834
      3.imd       |     -0.00884         0.01        1         0.9076
      4.imd       |      0.05750         0.57        1         0.4522
      5.imd       |      0.11771         2.44        1         0.1185
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.15596         4.28        1         0.0385
      3.obese4cat |     -0.12828         2.91        1         0.0881
      4.obese4cat |     -0.10094         1.79        1         0.1814
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.05287         0.46        1         0.4991
      3.smoke_no~s|      0.10258         1.95        1         0.1625
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00180         0.00        1         0.9781
      3.diabcat   |      0.03667         0.31        1         0.5770
      4.diabcat   |            .            .        1             .
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01921         0.08        1         0.7814
      0b.pad      |            .            .        1             .
      1.pad       |     -0.07183         0.83        1         0.3629
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.10209         2.53        1         0.1114
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.04393         0.46        1         0.4993
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.04535         0.48        1         0.4878
      0b.vte      |            .            .        1             .
      1.vte       |     -0.01659         0.08        1         0.7811
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.03019         0.15        1         0.6960
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.12636         2.39        1         0.1223
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.09133         1.53        1         0.2165
      1b.ethnicity|            .            .        1             .
      2.ethnicity |            .            .        1             .
      3.ethnicity |      0.11177         2.03        1         0.1540
      4.ethnicity |            .            .        1             .
      5.ethnicity |     -0.07462         0.92        1         0.3374
      ------------+---------------------------------------------------
      global test |                     28.35       27         0.3929
      ----------------------------------------------------------------

. local multivar2_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot3_completecase_et
> hn.svg not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot3_completecase_ethn.svg
>  written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $dagvarlist

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1857.8661
Iteration 1:   log likelihood = -1810.8755
Iteration 2:   log likelihood = -1795.2377
Iteration 3:   log likelihood = -1794.7689
Iteration 4:   log likelihood = -1794.7543
Iteration 5:   log likelihood = -1794.7492
Iteration 6:   log likelihood = -1794.7474
Iteration 7:   log likelihood = -1794.7467
Iteration 8:   log likelihood = -1794.7464
Iteration 9:   log likelihood = -1794.7463
Iteration 10:  log likelihood = -1794.7463
Iteration 11:  log likelihood = -1794.7463
Iteration 12:  log likelihood = -1794.7463
Iteration 13:  log likelihood = -1794.7463
Iteration 14:  log likelihood = -1794.7463
Iteration 15:  log likelihood = -1794.7463
Iteration 16:  log likelihood = -1794.7463
Iteration 17:  log likelihood = -1794.7463
Iteration 18:  log likelihood = -1794.7463
Iteration 19:  log likelihood = -1794.7463
Iteration 20:  log likelihood = -1794.7463
Iteration 21:  log likelihood = -1794.7463
Iteration 22:  log likelihood = -1794.7463
Iteration 23:  log likelihood = -1794.7463
Iteration 24:  log likelihood = -1794.7463
Iteration 25:  log likelihood = -1794.7463
Iteration 26:  log likelihood = -1794.7463
Iteration 27:  log likelihood = -1794.7463
Iteration 28:  log likelihood = -1794.7463
Iteration 29:  log likelihood = -1794.7463
Iteration 30:  log likelihood = -1794.7463
Iteration 31:  log likelihood = -1794.7463
Iteration 32:  log likelihood = -1794.7463
Iteration 33:  log likelihood = -1794.7463
Iteration 34:  log likelihood = -1794.7463
Iteration 35:  log likelihood = -1794.7463
Iteration 36:  log likelihood = -1794.7463
Iteration 37:  log likelihood = -1794.7463
Iteration 38:  log likelihood = -1794.7463
Iteration 39:  log likelihood = -1794.7463
Iteration 40:  log likelihood = -1794.7463
Iteration 41:  log likelihood = -1794.7463
Iteration 42:  log likelihood = -1794.7463
Iteration 43:  log likelihood = -1794.7463
Refining estimates:
Iteration 0:   log likelihood = -1794.7463

Cox regression -- Breslow method for ties

No. of subjects =       52,733                  Number of obs    =      52,733
No. of failures =          171
Time at risk    =     10971997
                                                LR chi2(25)      =      126.24
Log likelihood  =   -1794.7463                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .7751648   .1411678    -1.40   0.162     .5424741    1.107667
      1.male |   2.137353   .8935936     1.82   0.069     .9418948    4.850095
        age1 |   .9978972   .0228805    -0.09   0.927     .9540449    1.043765
        age2 |   1.121658   .0583415     2.21   0.027     1.012946    1.242037
        age3 |   .6554716   .2607153    -1.06   0.288     .3005983    1.429293
             |
         imd |
          2  |   .9028179   .2279797    -0.40   0.686     .5503698    1.480968
          3  |   .8352264   .2174063    -0.69   0.489     .5014638    1.391134
          4  |   1.198947   .2895142     0.75   0.452     .7468909     1.92461
5 most de..  |   1.412993   .3346147     1.46   0.144     .8883101    2.247581
             |
   obese4cat |
Obese I ..)  |   1.217554   .2541594     0.94   0.346     .8087296    1.833045
Obese II..)  |   1.261199   .3918189     0.75   0.455     .6860237    2.318611
Obese II..)  |   2.171057   .7230735     2.33   0.020     1.130257    4.170279
             |
smoke_nomiss |
     Former  |   1.556522   .2898644     2.38   0.018     1.080537    2.242182
    Current  |   2.195572    .623823     2.77   0.006     1.258049    3.831754
             |
     diabcat |
Controlle..  |   1.735324   .6529821     1.46   0.143       .83001    3.628088
Uncontrol..  |   1.919418   .8480879     1.48   0.140     .8073639    4.563204
Diabetes,..  |   4.91e-19          .        .       .            .           .
             |
1.myocardi~t |   2.068479   .9467159     1.59   0.112     .8434656    5.072651
       1.pad |   1.500042   1.118954     0.54   0.587     .3476567    6.472262
1.hyperten~n |   1.054129    .347361     0.16   0.873     .5525892    2.010876
1.heart_f~re |    1.53506    .589934     1.12   0.265     .7227744    3.260227
1.stroke_tia |   2.946452   1.955838     1.63   0.104      .802189    10.82236
       1.vte |    3.61212   2.535357     1.83   0.067     .9126444    14.29627
 1.oestrogen |    1.89669   1.944153     0.62   0.532     .2543866    14.14159
1.antiplat~t |   .8449577   .2359411    -0.60   0.546     .4888216    1.460561
1.flu_vac~ne |   1.122962   .2124121     0.61   0.540     .7750993    1.626944
------------------------------------------------------------------------------

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.04633         0.35        1         0.5544
      0b.male     |            .            .        1             .
      1.male      |     -0.01998         0.09        1         0.7682
      age1        |      0.04060         0.47        1         0.4930
      age2        |     -0.00676         0.01        1         0.9231
      age3        |      0.00136         0.00        1         0.9844
      1b.imd      |            .            .        1             .
      2.imd       |      0.04362         0.33        1         0.5674
      3.imd       |     -0.00664         0.01        1         0.9306
      4.imd       |      0.06254         0.67        1         0.4136
      5.imd       |      0.12331         2.66        1         0.1026
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.15785         4.42        1         0.0356
      3.obese4cat |     -0.13104         3.08        1         0.0794
      4.obese4cat |     -0.10690         2.02        1         0.1551
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.04486         0.33        1         0.5637
      3.smoke_no~s|      0.09422         1.66        1         0.1982
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00701         0.01        1         0.9147
      3.diabcat   |      0.04205         0.41        1         0.5209
      4.diabcat   |            .            .        1             .
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01742         0.06        1         0.8009
      0b.pad      |            .            .        1             .
      1.pad       |     -0.07380         0.88        1         0.3488
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.10322         2.62        1         0.1056
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.04237         0.43        1         0.5117
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.04254         0.44        1         0.5093
      0b.vte      |            .            .        1             .
      1.vte       |     -0.01590         0.07        1         0.7870
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.03190         0.17        1         0.6796
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.13064         2.61        1         0.1060
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.09012         1.49        1         0.2218
      ------------+---------------------------------------------------
      global test |                     25.32       25         0.4447
      ----------------------------------------------------------------

. local multivar2_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, DAG adju
> sted", position(11) size(medsmall))                  

.                           
. graph export "$tabfigdir/`outcome'_schoenplot3_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot3_completecase.sv
> g not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot3_completecase.svg writ
> ten in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist i.ethnicity, strata(pract
> ice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -558.50132
Iteration 1:   log likelihood = -528.46387
Iteration 2:   log likelihood = -484.14935
Iteration 3:   log likelihood = -475.60373
Iteration 4:   log likelihood = -473.34772
Iteration 5:   log likelihood = -473.27646
Iteration 6:   log likelihood = -473.25162
Iteration 7:   log likelihood = -473.24253
Iteration 8:   log likelihood = -473.23919
Iteration 9:   log likelihood = -473.23796
Iteration 10:  log likelihood = -473.23751
Iteration 11:  log likelihood = -473.23734
Iteration 12:  log likelihood = -473.23728
Iteration 13:  log likelihood = -473.23726
Iteration 14:  log likelihood = -473.23725
Iteration 15:  log likelihood = -473.23725
Iteration 16:  log likelihood = -473.23725
Iteration 17:  log likelihood = -473.23725
Iteration 18:  log likelihood = -473.23725
Iteration 19:  log likelihood = -473.23725
Iteration 20:  log likelihood = -473.23725
Iteration 21:  log likelihood = -473.23725
Iteration 22:  log likelihood = -473.23725
Iteration 23:  log likelihood = -473.23725
Iteration 24:  log likelihood = -473.23725
Iteration 25:  log likelihood = -473.23725
Iteration 26:  log likelihood = -473.23725
Iteration 27:  log likelihood = -473.23725
Iteration 28:  log likelihood = -473.23725
Iteration 29:  log likelihood = -473.23725
Iteration 30:  log likelihood = -473.23725
Iteration 31:  log likelihood = -473.23725
Iteration 32:  log likelihood = -473.23725
Iteration 33:  log likelihood = -473.23725
Refining estimates:
Iteration 0:   log likelihood = -473.23725
Iteration 1:   log likelihood = -473.23725
Iteration 2:   log likelihood = -473.23725
Iteration 3:   log likelihood = -473.23725

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,733                  Number of obs    =      52,733
No. of failures =          171
Time at risk    =     10971997
                                                LR chi2(37)      =      170.53
Log likelihood  =   -473.23725                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6741241   .1333109    -1.99   0.046     .4575211    .9932729
      1.male |   2.133379   .9296491     1.74   0.082     .9081243    5.011765
        age1 |   1.006374     .02404     0.27   0.790     .9603419    1.054612
        age2 |    1.09094   .0605622     1.57   0.117     .9784702    1.216338
        age3 |   .8374059   .3581111    -0.41   0.678     .3621807    1.936185
             |
         imd |
          2  |   .7903397   .2315032    -0.80   0.422     .4451262     1.40328
          3  |   .8000425   .2420502    -0.74   0.461     .4421655    1.447576
          4  |   .9182211   .2748548    -0.29   0.776     .5106856    1.650976
5 most de..  |   .9693829   .3019957    -0.10   0.920     .5264016    1.785145
             |
   obese4cat |
Obese I ..)  |   1.218772   .2695271     0.89   0.371     .7901006    1.880021
Obese II..)  |   1.249547   .4233313     0.66   0.511     .6432442    2.427333
Obese II..)  |   2.274757   .8160204     2.29   0.022      1.12612    4.594998
             |
smoke_nomiss |
     Former  |   1.564805   .3145854     2.23   0.026     1.055203    2.320513
    Current  |   2.189857   .6776852     2.53   0.011     1.193983    4.016366
             |
     diabcat |
Controlle..  |   1.962054    .792838     1.67   0.095     .8886946    4.331809
Uncontrol..  |   1.997992   .9688343     1.43   0.153      .772401    5.168265
Diabetes,..  |   3.89e-16   6.92e-08    -0.00   1.000            0           .
             |
1.myocardi~t |   2.291611   1.131872     1.68   0.093     .8703936    6.033454
       1.pad |   .9815404   .7605632    -0.02   0.981     .2149514    4.482044
1.hyperten~n |   1.136754   .3978872     0.37   0.714      .572438    2.257379
1.heart_f~re |   1.538084   .6145298     1.08   0.281     .7028927    3.365668
1.stroke_tia |   4.305147   3.037851     2.07   0.039     1.079823    17.16419
       1.vte |   3.288599   2.369839     1.65   0.099     .8009691    13.50225
 1.oestrogen |   2.206318   2.564089     0.68   0.496     .2261714    21.52278
1.antiplat~t |   .8491086   .2606017    -0.53   0.594     .4652851    1.549556
1.flu_vac~ne |   1.092057   .2286558     0.42   0.674     .7244696    1.646155
             |
         ckd |
        CKD  |   1.845323   .3583782     3.15   0.002     1.261134    2.700122
      1.copd |   1.792349   .4025553     2.60   0.009     1.154106    2.783553
1.other_re~y |   .6140141   .2514967    -1.19   0.234     .2751256    1.370332
1.immunode~y |   1.548176   .9963413     0.68   0.497     .4385538    5.465351
    1.cancer |   1.369703   .2785693     1.55   0.122     .9194104    2.040531
1.ae_atten~r |    2.01001   .3408362     4.12   0.000     1.441652    2.802438
1.gp_consult |   .9459192   .4589342    -0.11   0.909     .3654889    2.448126
             |
   ethnicity |
      Mixed  |   1.34e-16   1.36e-08    -0.00   1.000            0           .
Asian or ..  |   3.331661   1.968112     2.04   0.042      1.04672    10.60452
      Black  |   7.35e-16   2.11e-08    -0.00   1.000            0           .
      Other  |     4.0626   3.330422     1.71   0.087     .8147222    20.25809
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.06981         0.83        1         0.3627
      0b.male     |            .            .        1             .
      1.male      |     -0.03844         0.28        1         0.5935
      age1        |      0.11469         2.84        1         0.0921
      age2        |     -0.03073         0.18        1         0.6713
      age3        |      0.01927         0.07        1         0.7945
      1b.imd      |            .            .        1             .
      2.imd       |      0.00184         0.00        1         0.9805
      3.imd       |     -0.05384         0.48        1         0.4881
      4.imd       |      0.01911         0.06        1         0.8087
      5.imd       |      0.06725         0.75        1         0.3861
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.13446         3.28        1         0.0701
      3.obese4cat |     -0.12354         2.62        1         0.1057
      4.obese4cat |     -0.09479         1.61        1         0.2049
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.08955         1.31        1         0.2532
      3.smoke_no~s|      0.12295         2.92        1         0.0877
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.02208         0.10        1         0.7543
      3.diabcat   |      0.04040         0.36        1         0.5460
      4.diabcat   |      0.05063         0.00        1         1.0000
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|      0.00350         0.00        1         0.9618
      0b.pad      |            .            .        1             .
      1.pad       |     -0.05744         0.58        1         0.4476
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.11554         3.06        1         0.0803
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.10219         2.11        1         0.1461
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.11085         2.18        1         0.1396
      0b.vte      |            .            .        1             .
      1.vte       |      0.02933         0.17        1         0.6804
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.08404         1.75        1         0.1856
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.15847         4.28        1         0.0385
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.09002         1.48        1         0.2242
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.07031         0.94        1         0.3335
      0b.copd     |            .            .        1             .
      1.copd      |     -0.03549         0.24        1         0.6257
      0b.other_r~y|            .            .        1             .
      1.other_re~y|      0.03432         0.25        1         0.6201
      0b.immunod~y|            .            .        1             .
      1.immunode~y|      0.02304         0.09        1         0.7696
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.04610         0.37        1         0.5442
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.10309         1.88        1         0.1698
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02425         0.10        1         0.7545
      1b.ethnicity|            .            .        1             .
      2.ethnicity |     -0.11604         0.00        1         1.0000
      3.ethnicity |      0.04424         0.46        1         0.4965
      4.ethnicity |     -0.04674         0.00        1         1.0000
      5.ethnicity |     -0.05477         0.54        1         0.4637
      ------------+---------------------------------------------------
      global test |                     35.57       37         0.5361
      ----------------------------------------------------------------

. local multivar3_completecase_ethn_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase_ethn.svg", as(svg
> ) replace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot4_completecase_et
> hn.svg not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot4_completecase_ethn.svg
>  written in SVG format)

. 
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  admitcovid
   analysis time _t:  (stime_admitcovid-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -558.50132
Iteration 1:   log likelihood = -533.99295
Iteration 2:   log likelihood = -489.25488
Iteration 3:   log likelihood = -481.31107
Iteration 4:   log likelihood = -478.15658
Iteration 5:   log likelihood = -478.15063
Iteration 6:   log likelihood = -478.15005
Iteration 7:   log likelihood = -478.14984
Iteration 8:   log likelihood = -478.14976
Iteration 9:   log likelihood = -478.14973
Iteration 10:  log likelihood = -478.14972
Iteration 11:  log likelihood = -478.14971
Iteration 12:  log likelihood = -478.14971
Iteration 13:  log likelihood = -478.14971
Iteration 14:  log likelihood = -478.14971
Iteration 15:  log likelihood = -478.14971
Iteration 16:  log likelihood = -478.14971
Iteration 17:  log likelihood = -478.14971
Iteration 18:  log likelihood = -478.14971
Iteration 19:  log likelihood = -478.14971
Iteration 20:  log likelihood = -478.14971
Iteration 21:  log likelihood = -478.14971
Iteration 22:  log likelihood = -478.14971
Iteration 23:  log likelihood = -478.14971
Iteration 24:  log likelihood = -478.14971
Iteration 25:  log likelihood = -478.14971
Iteration 26:  log likelihood = -478.14971
Iteration 27:  log likelihood = -478.14971
Iteration 28:  log likelihood = -478.14971
Iteration 29:  log likelihood = -478.14971
Refining estimates:
Iteration 0:   log likelihood = -478.14971
Iteration 1:   log likelihood = -478.14971
Iteration 2:   log likelihood = -478.14971
Iteration 3:   log likelihood = -478.14971
Iteration 4:   log likelihood = -478.14971

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       52,733                  Number of obs    =      52,733
No. of failures =          171
Time at risk    =     10971997
                                                LR chi2(33)      =      160.70
Log likelihood  =   -478.14971                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   .6958759   .1373269    -1.84   0.066     .4726638    1.024498
      1.male |   2.168471   .9429825     1.78   0.075     .9246974    5.085195
        age1 |   1.000037    .023554     0.00   0.999     .9549217    1.047284
        age2 |   1.091406   .0607043     1.57   0.116     .9786835    1.217111
        age3 |   .8441742   .3612582    -0.40   0.692     .3648939    1.952979
             |
         imd |
          2  |   .7804875    .226329    -0.85   0.393     .4421107    1.377847
          3  |   .7776406    .232847    -0.84   0.401     .4324199    1.398467
          4  |   .8674383   .2572222    -0.48   0.632     .4850998    1.551122
5 most de..  |   .9227869   .2858152    -0.26   0.795     .5028731    1.693341
             |
   obese4cat |
Obese I ..)  |   1.209209   .2664351     0.86   0.389     .7851435    1.862317
Obese II..)  |   1.139646   .3869847     0.38   0.700      .585775     2.21722
Obese II..)  |     2.1643   .7723598     2.16   0.030     1.075362    4.355924
             |
smoke_nomiss |
     Former  |   1.553358   .3111191     2.20   0.028     1.049026    2.300155
    Current  |   2.236565   .6889113     2.61   0.009     1.222905    4.090443
             |
     diabcat |
Controlle..  |   1.943323   .7804946     1.65   0.098     .8844592    4.269845
Uncontrol..  |   1.966864    .945042     1.41   0.159     .7669866    5.043837
Diabetes,..  |   7.29e-15   2.89e-07    -0.00   1.000            0           .
             |
1.myocardi~t |   2.177691   1.078552     1.57   0.116     .8249332    5.748752
       1.pad |   .9569169    .743959    -0.06   0.955     .2084991    4.391818
1.hyperten~n |   1.096245   .3827791     0.26   0.792     .5529569    2.173323
1.heart_f~re |   1.416655   .5636036     0.88   0.381     .6495626    3.089634
1.stroke_tia |   3.710425     2.6201     1.86   0.063     .9297186    14.80798
       1.vte |   2.941791   2.120915     1.50   0.134     .7160264    12.08633
 1.oestrogen |    2.00137   2.326278     0.60   0.551     .2050875     19.5306
1.antiplat~t |   .8651461   .2655976    -0.47   0.637     .4739939    1.579087
1.flu_vac~ne |   1.072982    .222468     0.34   0.734     .7146731    1.610932
             |
         ckd |
        CKD  |   1.857295   .3593567     3.20   0.001     1.271122    2.713781
      1.copd |   1.800907   .4025078     2.63   0.008     1.162105    2.790855
1.other_re~y |   .6214279   .2533581    -1.17   0.243     .2794816    1.381746
1.immunode~y |   1.557837   .9834653     0.70   0.483     .4520195    5.368921
    1.cancer |   1.332251   .2693471     1.42   0.156     .8963852    1.980054
1.ae_atten~r |   2.036963   .3423707     4.23   0.000     1.465258    2.831733
1.gp_consult |   .9497694   .4595071    -0.11   0.915     .3679588     2.45153
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estat phtest, detail

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.exposure |            .            .        1             .
      1.exposure  |     -0.06376         0.68        1         0.4089
      0b.male     |            .            .        1             .
      1.male      |     -0.02400         0.11        1         0.7363
      age1        |      0.09525         2.00        1         0.1573
      age2        |     -0.03025         0.18        1         0.6712
      age3        |      0.02242         0.10        1         0.7560
      1b.imd      |            .            .        1             .
      2.imd       |      0.01282         0.03        1         0.8651
      3.imd       |     -0.04153         0.29        1         0.5913
      4.imd       |      0.03451         0.19        1         0.6603
      5.imd       |      0.07648         0.97        1         0.3247
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.12594         2.86        1         0.0908
      3.obese4cat |     -0.14360         3.69        1         0.0549
      4.obese4cat |     -0.10292         1.96        1         0.1610
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.09271         1.40        1         0.2364
      3.smoke_no~s|      0.12999         3.17        1         0.0750
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01075         0.02        1         0.8798
      3.diabcat   |      0.03255         0.24        1         0.6244
      4.diabcat   |      0.03777         0.00        1         1.0000
      0b.myocard~t|            .            .        1             .
      1.myocardi~t|     -0.01149         0.03        1         0.8735
      0b.pad      |            .            .        1             .
      1.pad       |     -0.06193         0.67        1         0.4130
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.10404         2.50        1         0.1139
      0b.heart_~re|            .            .        1             .
      1.heart_f~re|      0.08908         1.64        1         0.1997
      0b.stroke_~a|            .            .        1             .
      1.stroke_tia|      0.09070         1.55        1         0.2125
      0b.vte      |            .            .        1             .
      1.vte       |      0.01512         0.05        1         0.8275
      0b.oestrogen|            .            .        1             .
      1.oestrogen |     -0.07562         1.45        1         0.2288
      0b.antipla~t|            .            .        1             .
      1.antiplat~t|      0.15789         4.43        1         0.0352
      0b.flu_va~ne|            .            .        1             .
      1.flu_vac~ne|     -0.09407         1.60        1         0.2055
      0b.ckd      |            .            .        1             .
      1.ckd       |     -0.07469         1.04        1         0.3072
      0b.copd     |            .            .        1             .
      1.copd      |     -0.03777         0.27        1         0.6048
      0b.other_r~y|            .            .        1             .
      1.other_re~y|      0.03176         0.21        1         0.6494
      0b.immunod~y|            .            .        1             .
      1.immunode~y|      0.00560         0.01        1         0.9383
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.04468         0.34        1         0.5578
      0b.ae_atte~r|            .            .        1             .
      1.ae_atten~r|     -0.09278         1.50        1         0.2200
      0b.gp_con~lt|            .            .        1             .
      1.gp_consult|     -0.02351         0.09        1         0.7589
      ------------+---------------------------------------------------
      global test |                     33.79       33         0.4293
      ----------------------------------------------------------------

. local multivar3_completecase_p = round(r(phtest)[2,4],0.001)

.  
. estat phtest, plot(1.exposure) ///
>                           graphregion(fcolor(white)) ///
>                           ylabel(, nogrid labsize(small)) ///
>                           xlabel(, labsize(small)) ///
>                           xtitle("Time", size(small)) ///
>                           ytitle("Scaled Schoenfeld Residuals", size(small)) 
> ///
>                           msize(small) ///
>                           mcolor(gs6) ///
>                           msymbol(circle_hollow) ///
>                           scheme(s1mono) ///
>                           title ("Schoenfeld residuals against time, fully ad
> justed", position(11) size(medsmall))                

.                           
. graph export "$tabfigdir/`outcome'_schoenplot4_completecase.svg", as(svg) rep
> lace
(note: file /workspace/output/oac_tabfig/admitcovid_schoenplot4_completecase.sv
> g not found)
(file /workspace/output/oac_tabfig/admitcovid_schoenplot4_completecase.svg writ
> ten in SVG format)

. 
. * Close window 
. graph close

. 
. * Print table of results=====================================================
> =*/        
. 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table6_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/oac_tabfig/table6_admitcovid.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 6: Testing the PH assumption - `outcome' - $p
> opulation Population in complete case cohort") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab /
> //
>                                                 ("DAG Adjusted with ethnicity
> ") _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _t
> ab ///
>  ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. * Row heading and content  
. file write tablecontent ("Treatment Exposure") _tab

. file write tablecontent ("`univar_completecase_p'") _tab ("`multivar1_complet
> ecase_p'") ///
>  _tab ("`multivar2_completecase_ethn_p'") _tab ("`multivar2_completecase_p'")
>  ///
>  _tab ("`multivar3_completecase_ethn_p'") _tab ("`multivar3_completecase_p'")

. 
. file write tablecontent _n

. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/08a_an_model_checks_admitcovid.log
  log type:  text
 closed on:   1 Mar 2021, 20:49:15
-------------------------------------------------------------------------------
