-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_covidtest.log
  log type:  text
 opened on:   1 Mar 2021, 20:45:38

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -34978.273                     Number of obs     =     70,464

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .9719983   .0225856    -1.22   0.222     .9287243    1.017289
    _Imale_1 |   .9245473   .0379339    -1.91   0.056     .8531091    1.001968
     _Iimd_2 |   1.016025   .0302115     0.53   0.593     .9585042    1.076998
     _Iimd_3 |     1.0574   .0315576     1.87   0.061     .9973228    1.121097
     _Iimd_4 |   1.066807   .0321909     2.14   0.032     1.005543    1.131803
     _Iimd_5 |   1.028088   .0319607     0.89   0.373     .9673167    1.092678
_Iobese4ca~2 |   .9486829   .0240621    -2.08   0.038     .9026751    .9970357
_Iobese4ca~3 |   .9965652   .0353364    -0.10   0.923      .929659    1.068287
_Iobese4ca~4 |   1.015964   .0448914     0.36   0.720     .9316812    1.107872
_Ismoke_no~2 |   1.065068   .0223769     3.00   0.003     1.022101    1.109841
_Ismoke_no~3 |    1.10639   .0411712     2.72   0.007     1.028568    1.190099
 _Idiabcat_2 |   1.069364   .0496459     1.44   0.149     .9763558    1.171233
 _Idiabcat_3 |   1.178083   .0659378     2.93   0.003     1.055684    1.314674
 _Idiabcat_4 |   1.240102   .2574093     1.04   0.300      .825606    1.862697
_Imyocardi~1 |    .966163   .0603238    -0.55   0.581     .8548784    1.091934
     _Ipad_1 |   1.359504    .125899     3.32   0.001     1.133845    1.630074
_Ihyperten~1 |   1.091859   .0420582     2.28   0.023     1.012461    1.177483
_Iheart_fa~1 |   1.067083   .0488289     1.42   0.156     .9755461    1.167209
_Istroke_t~1 |   1.239612   .1106871     2.41   0.016     1.040593    1.476696
     _Ivte_1 |   1.159656   .1180436     1.46   0.146     .9499128    1.415711
_Ioestroge~1 |   1.300436   .1196298     2.86   0.004     1.085889    1.557374
_Iantiplat~1 |      1.074   .0371662     2.06   0.039     1.003571    1.149372
_Iflu_vacc~1 |   1.013438   .0227342     0.60   0.552      .969845     1.05899
     _Ickd_1 |    1.12402   .0296654     4.43   0.000     1.067355    1.183693
    _Icopd_1 |   1.265726   .0396961     7.51   0.000     1.190266     1.34597
_Iother_re~1 |     1.2964   .0558451     6.03   0.000     1.191439    1.410608
_Iimmunode~1 |   1.276908   .1033084     3.02   0.003     1.089665    1.496326
  _Icancer_1 |   1.370186   .0338236    12.76   0.000     1.305471    1.438109
_Iae_atten~1 |   1.693094   .0336881    26.46   0.000     1.628338    1.760426
_Igp_consu~1 |   1.131591   .0581992     2.40   0.016     1.023084    1.251607
        age1 |   .9815567   .0024217    -7.55   0.000     .9768217    .9863147
        age2 |   1.028758   .0067361     4.33   0.000      1.01564    1.042045
        age3 |   1.072894    .059597     1.27   0.205     .9622202    1.196298
       _rcs1 |    2.14654   .0255409    64.20   0.000      2.09706    2.197187
       _rcs2 |   1.110449   .0144009     8.08   0.000     1.082579    1.139035
       _rcs3 |   1.012226   .0025294     4.86   0.000      1.00728    1.017195
       _cons |   .2730415   .0465653    -7.61   0.000     .1954619    .3814126
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     70,464    196.2007    39.13843         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(70,252 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .16438692   .15879949   .17017095 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .16023764   .15708426   .16345431 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00414929         -.01083958          .00254101 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_covidtest.gph not found)
(file adj_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/adj_curves_covidtest.svg not found)
(file /workspace/output/oac_tabfig/adj_curves_covidtest.svg written in SVG form
> at)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_covidtest.gph not found)
(file diff_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/diff_curves_covidtest.svg not found)
(file /workspace/output/oac_tabfig/diff_curves_covidtest.svg written in SVG for
> mat)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_covidtest.log
  log type:  text
 closed on:   1 Mar 2021, 20:48:25
-------------------------------------------------------------------------------
