-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_onscoviddeath.log
  log type:  text
 opened on:  31 Dec 2020, 13:07:59

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -1248.5289                     Number of obs     =     70,266

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .6888336   .1181698    -2.17   0.030     .4921418    .9641364
    _Imale_1 |   1.214621   .5476224     0.43   0.666     .5019604    2.939086
     _Iimd_2 |   .8648518   .1921034    -0.65   0.513     .5595905    1.336636
     _Iimd_3 |   .6957543   .1646305    -1.53   0.125     .4375656    1.106289
     _Iimd_4 |   .7654951   .1837207    -1.11   0.266     .4782467    1.225273
     _Iimd_5 |   1.263673   .2766888     1.07   0.285     .8227333    1.940933
_Iobese4ca~2 |   .9242308   .2157833    -0.34   0.736     .5848541     1.46054
_Iobese4ca~3 |   1.394222   .4634385     1.00   0.317      .726763    2.674673
_Iobese4ca~4 |    1.57442   .7019871     1.02   0.309     .6570447    3.772646
_Ismoke_no~2 |   1.237691   .2120222     1.24   0.213     .8847029    1.731518
_Ismoke_no~3 |   1.058855   .3687868     0.16   0.870     .5350238     2.09556
 _Idiabcat_2 |   1.188204   .6373809     0.32   0.748     .4152274    3.400132
 _Idiabcat_3 |     2.5602   1.397017     1.72   0.085     .8786202    7.460132
 _Idiabcat_4 |   4.83e-06   .0069219    -0.01   0.993            0           .
_Imyocardi~1 |   2.348107   1.329834     1.51   0.132       .77383    7.125085
     _Ipad_1 |   1.233173   1.281505     0.20   0.840     .1608649    9.453371
_Ihyperten~1 |   1.007648   .3977185     0.02   0.985     .4648787    2.184127
_Iheart_fa~1 |   2.001512   .8978252     1.55   0.122     .8308671    4.821527
_Istroke_t~1 |   4.81e-06   .0026137    -0.02   0.982            0           .
     _Ivte_1 |   2.246447   2.775466     0.66   0.512     .1994546    25.30163
_Ioestroge~1 |   4.86e-06   .0029885    -0.02   0.984            0           .
_Iantiplat~1 |   .5976277    .182078    -1.69   0.091      .328925    1.085837
_Iflu_vacc~1 |   1.043296   .1948009     0.23   0.820     .7235585    1.504323
     _Ickd_1 |   1.325312   .2226707     1.68   0.094     .9534643    1.842179
    _Icopd_1 |   1.664844    .338657     2.51   0.012     1.117442    2.480402
_Iother_re~1 |   1.504615   .3863558     1.59   0.112     .9096058    2.488842
_Iimmunode~1 |   1.346246   .9627004     0.42   0.678     .3314594    5.467875
  _Icancer_1 |   1.076843   .1920754     0.42   0.678     .7591445    1.527497
_Iae_atten~1 |   2.470999   .3713667     6.02   0.000     1.840541    3.317415
_Igp_consu~1 |   .5360566   .1584411    -2.11   0.035     .3003467    .9567498
        age1 |   1.029263   .0374462     0.79   0.428     .9584252    1.105336
        age2 |   1.156034   .0677259     2.47   0.013     1.030631    1.296695
        age3 |   .4342274   .1765157    -2.05   0.040     .1957489    .9632412
       _rcs1 |   1.892504   .1426506     8.46   0.000     1.632586    2.193802
       _rcs2 |   1.463884   .0824381     6.77   0.000     1.310906    1.634714
       _rcs3 |   .9628386    .010382    -3.51   0.000     .9427037    .9834036
       _cons |   .0001032    .000253    -3.74   0.000     8.42e-07    .0126339
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     70,266    208.0458    20.78708         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(70,054 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00355512   .00269563   .00468864 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00245527   .00206501   .00291929 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00109985         -.00219106         -8.638e-06 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_onscoviddeath.gph not found)
(file adj_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/adj_curves_onscoviddeath.svg not found
> )
(file /workspace/output/oac_tabfig/adj_curves_onscoviddeath.svg written in SVG 
> format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_onscoviddeath.gph not found)
(file diff_curves_onscoviddeath.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/diff_curves_onscoviddeath.svg not foun
> d)
(file /workspace/output/oac_tabfig/diff_curves_onscoviddeath.svg written in SVG
>  format)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_onscoviddeath.log
  log type:  text
 closed on:  31 Dec 2020, 13:09:13
-------------------------------------------------------------------------------
