-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_admitcovid.log
  log type:  text
 opened on:   1 Mar 2021, 20:43:55

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -1671.2069                     Number of obs     =     70,464

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .8157151   .1299359    -1.28   0.201     .5969665     1.11462
    _Imale_1 |   2.180466   .7703872     2.21   0.027      1.09096    4.358028
     _Iimd_2 |   .8466185   .1754693    -0.80   0.422     .5639863    1.270887
     _Iimd_3 |   .7810817   .1668511    -1.16   0.247     .5138859    1.187206
     _Iimd_4 |   1.002425   .2039701     0.01   0.991     .6727477    1.493659
     _Iimd_5 |   1.022558   .2121991     0.11   0.914     .6808451    1.535775
_Iobese4ca~2 |   1.065841   .1981703     0.34   0.732     .7403377    1.534459
_Iobese4ca~3 |   1.227031    .324681     0.77   0.439      .730502    2.061054
_Iobese4ca~4 |   1.826077   .5385251     2.04   0.041     1.024454    3.254958
_Ismoke_no~2 |   1.141453   .1744377     0.87   0.387     .8460124    1.540066
_Ismoke_no~3 |   1.422764   .3614289     1.39   0.165     .8647683     2.34081
 _Idiabcat_2 |   1.691318   .5518048     1.61   0.107      .892308    3.205797
 _Idiabcat_3 |   1.601634   .6351503     1.19   0.235     .7362196    3.484329
 _Idiabcat_4 |   7.79e-06   .0053051    -0.02   0.986            0           .
_Imyocardi~1 |   1.897681   .7487572     1.62   0.104     .8757288    4.112226
     _Ipad_1 |    1.52886   .9390254     0.69   0.489     .4587329    5.095367
_Ihyperten~1 |   .9138318   .2642365    -0.31   0.755     .5184889     1.61062
_Iheart_fa~1 |   1.253588   .4192769     0.68   0.499     .6508196    2.414621
_Istroke_t~1 |   1.720472   1.094258     0.85   0.394     .4946122    5.984537
     _Ivte_1 |   1.974873   1.341302     1.00   0.316     .5216954    7.475864
_Ioestroge~1 |   2.533653   1.851569     1.27   0.203     .6049193    10.61199
_Iantiplat~1 |   .7586055   .1888771    -1.11   0.267     .4656766    1.235798
_Iflu_vacc~1 |   1.064874   .1724319     0.39   0.698     .7752924    1.462617
     _Ickd_1 |   1.689129   .2632654     3.36   0.001     1.244502    2.292609
    _Icopd_1 |   1.682369   .3176298     2.76   0.006     1.162024     2.43572
_Iother_re~1 |   .7330384    .235973    -0.96   0.335     .3900459    1.377646
_Iimmunode~1 |   1.169439   .6871945     0.27   0.790      .369648    3.699704
  _Icancer_1 |   1.128102   .1910973     0.71   0.477     .8093889    1.572315
_Iae_atten~1 |   2.082591   .2814654     5.43   0.000     1.597948    2.714221
_Igp_consu~1 |   .8223831   .2585653    -0.62   0.534     .4440665    1.523001
        age1 |   .9902806   .0195302    -0.50   0.620     .9527325    1.029309
        age2 |   1.084696   .0487518     1.81   0.070     .9932318    1.184583
        age3 |   .7805875   .2714568    -0.71   0.476     .3948281    1.543246
       _rcs1 |   1.405955   .0330727    14.48   0.000     1.342606    1.472294
       _rcs2 |   1.208569   .0181059    12.64   0.000     1.173598    1.244582
       _cons |   .0013488   .0018169    -4.91   0.000     .0000962    .0189047
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     70,464    207.7578    21.90983         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(70,252 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .00387358   .00298022   .00503476 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at2    _at2_lci    _at2_uci |
  |-----------------------------------|
  | .00316229   .00271361   .00368515 |
  +-----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |    -.0007113         -.00186056          .00043797 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_admitcovid.gph not found)
(file adj_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/adj_curves_admitcovid.svg not found)
(file /workspace/output/oac_tabfig/adj_curves_admitcovid.svg written in SVG for
> mat)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_admitcovid.gph not found)
(file diff_curves_admitcovid.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/diff_curves_admitcovid.svg not found)
(file /workspace/output/oac_tabfig/diff_curves_admitcovid.svg written in SVG fo
> rmat)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_admitcovid.log
  log type:  text
 closed on:   1 Mar 2021, 20:46:18
-------------------------------------------------------------------------------
