-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_covidtest.log
  log type:  text
 opened on:  31 Dec 2020, 13:09:21

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /*===========================================================================
> ===*/
. * Fit the stpm2 model 
. xi i.exposure i.male $fullvarlist
i.exposure        _Iexposure_0-1      (naturally coded; _Iexposure_0 omitted)
i.male            _Imale_0-1          (naturally coded; _Imale_0 omitted)
i.imd             _Iimd_1-5           (naturally coded; _Iimd_1 omitted)
i.obese4cat       _Iobese4cat_1-4     (naturally coded; _Iobese4cat_1 omitted)
i.smoke_nomiss    _Ismoke_nom_1-3     (naturally coded; _Ismoke_nom_1 omitted)
i.diabcat         _Idiabcat_1-4       (naturally coded; _Idiabcat_1 omitted)
i.myocardial_~t   _Imyocardia_0-1     (naturally coded; _Imyocardia_0 omitted)
i.pad             _Ipad_0-1           (naturally coded; _Ipad_0 omitted)
i.hypertension    _Ihypertens_0-1     (naturally coded; _Ihypertens_0 omitted)
i.heart_failure   _Iheart_fai_0-1     (naturally coded; _Iheart_fai_0 omitted)
i.stroke_tia      _Istroke_ti_0-1     (naturally coded; _Istroke_ti_0 omitted)
i.vte             _Ivte_0-1           (naturally coded; _Ivte_0 omitted)
i.oestrogen       _Ioestrogen_0-1     (naturally coded; _Ioestrogen_0 omitted)
i.antiplatelet    _Iantiplate_0-1     (naturally coded; _Iantiplate_0 omitted)
i.flu_vaccine     _Iflu_vacci_0-1     (naturally coded; _Iflu_vacci_0 omitted)
i.ckd             _Ickd_0-1           (naturally coded; _Ickd_0 omitted)
i.copd            _Icopd_0-1          (naturally coded; _Icopd_0 omitted)
i.other_respi~y   _Iother_res_0-1     (naturally coded; _Iother_res_0 omitted)
i.immunodef_any   _Iimmunodef_0-1     (naturally coded; _Iimmunodef_0 omitted)
i.cancer          _Icancer_0-1        (naturally coded; _Icancer_0 omitted)
i.ae_attendan~r   _Iae_attend_0-1     (naturally coded; _Iae_attend_0 omitted)
i.gp_consult      _Igp_consul_0-1     (naturally coded; _Igp_consul_0 omitted)

.     
. stpm2 _I* age1 age2 age3, scale(hazard) df(`df') eform nolog

Log likelihood = -18711.914                     Number of obs     =     70,266

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
_Iexposure_1 |   .9699155   .0358369    -0.83   0.408     .9021595     1.04276
    _Imale_1 |   .9580208   .0631295    -0.65   0.515     .8419462    1.090098
     _Iimd_2 |   1.013718   .0490204     0.28   0.778     .9220527    1.114497
     _Iimd_3 |   1.025834   .0497113     0.53   0.599     .9328855    1.128043
     _Iimd_4 |   1.179922   .0563835     3.46   0.001     1.074429    1.295772
     _Iimd_5 |   1.204108    .058736     3.81   0.000      1.09432    1.324912
_Iobese4ca~2 |   .9411572   .0382723    -1.49   0.136     .8690563     1.01924
_Iobese4ca~3 |   .9706305   .0559267    -0.52   0.605      .866979    1.086674
_Iobese4ca~4 |   1.002214   .0717073     0.03   0.975     .8710793    1.153089
_Ismoke_no~2 |   1.036471   .0345979     1.07   0.283      .970831    1.106549
_Ismoke_no~3 |   1.081952   .0639316     1.33   0.183     .9636326      1.2148
 _Idiabcat_2 |   1.090132   .0810426     1.16   0.246     .9423212    1.261128
 _Idiabcat_3 |   1.247578   .1108035     2.49   0.013     1.048259    1.484797
 _Idiabcat_4 |    .915951   .3504389    -0.23   0.819     .4327192    1.938824
_Imyocardi~1 |   1.081675   .1053585     0.81   0.420     .8936904    1.309201
     _Ipad_1 |   1.403423   .2014846     2.36   0.018     1.059216    1.859485
_Ihyperten~1 |   .9914114   .0611556    -0.14   0.889      .878511    1.118821
_Iheart_fa~1 |   1.059035    .077445     0.78   0.433     .9176218    1.222241
_Istroke_t~1 |   1.204584   .1723661     1.30   0.193     .9099906    1.594545
     _Ivte_1 |   1.285481   .2032851     1.59   0.112     .9428817    1.752565
_Ioestroge~1 |    1.10058   .1774674     0.59   0.552      .802354    1.509652
_Iantiplat~1 |    .968656   .0544895    -0.57   0.571     .8675354    1.081563
_Iflu_vacc~1 |   .9948081   .0354116    -0.15   0.884     .9277684    1.066692
     _Ickd_1 |   1.248681   .0502071     5.52   0.000     1.154055    1.351067
    _Icopd_1 |   1.228259   .0607436     4.16   0.000     1.114791    1.353275
_Iother_re~1 |   1.253582   .0848724     3.34   0.001     1.097799     1.43147
_Iimmunode~1 |   1.288883   .1632023     2.00   0.045     1.005615    1.651944
  _Icancer_1 |   1.343348   .0521935     7.60   0.000     1.244849    1.449642
_Iae_atten~1 |   1.683917   .0529729    16.57   0.000     1.583228    1.791009
_Igp_consu~1 |   1.107448   .0927109     1.22   0.223     .9398627    1.304916
        age1 |   .9867994   .0039609    -3.31   0.001     .9790666    .9945933
        age2 |   1.023981   .0105272     2.31   0.021     1.003555    1.044824
        age3 |   1.119319   .0957066     1.32   0.187     .9466129    1.323534
       _rcs1 |   1.862186   .0295944    39.12   0.000     1.805076    1.921103
       _rcs2 |   1.158277   .0181217     9.39   0.000     1.123298    1.194345
       _rcs3 |    .995728   .0025828    -1.65   0.099     .9906787    1.000803
       _cons |   .0804263   .0223354    -9.08   0.000     .0466669    .1386079
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation.

. 
. * set timevar for time points to be plotted
. summ _t

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     70,266    203.0799    31.21329         .5        211

. local tmax=r(max)

. local tmaxplus1=r(max)+1

. 
. range timevar 0 `tmax' `tmaxplus1'
(70,054 missing values generated)

. 
. * Run stpm2 
. stpm2_standsurv, at1(_Iexposure 0) at2(_Iexposure 1) timevar(timevar) ci cont
> rast(difference) fail

. 
. * list the standardized curves for longest follow-up, followed by their diffe
> rence.
. list _at1* if timevar==`tmax', noobs

  +-----------------------------------+
  |      _at1    _at1_lci    _at1_uci |
  |-----------------------------------|
  | .06575054   .06199577   .06973271 |
  +-----------------------------------+

. list _at2* if timevar==`tmax', noobs

  +----------------------------------+
  |      _at2    _at2_lci   _at2_uci |
  |----------------------------------|
  | .06385109   .06174736   .0660265 |
  +----------------------------------+

. list _contrast* if timevar==`tmax', noobs ab(16)

  +----------------------------------------------------+
  | _contrast2_1   _contrast2_1_lci   _contrast2_1_uci |
  |----------------------------------------------------|
  |   -.00189945         -.00643378          .00263489 |
  +----------------------------------------------------+

. 
. * Convert them to be expressed in %
. for var _at1 _at2 _at1_lci _at1_uci _at2_lci _at2_uci ///
> _contrast2_1 _contrast2_1_lci _contrast2_1_uci: replace X=100*X

->  replace _at1=100*_at1
(211 real changes made)

->  replace _at2=100*_at2
(211 real changes made)

->  replace _at1_lci=100*_at1_lci
(211 real changes made)

->  replace _at1_uci=100*_at1_uci
(211 real changes made)

->  replace _at2_lci=100*_at2_lci
(211 real changes made)

->  replace _at2_uci=100*_at2_uci
(211 real changes made)

->  replace _contrast2_1=100*_contrast2_1
(211 real changes made)

->  replace _contrast2_1_lci=100*_contrast2_1_lci
(211 real changes made)

->  replace _contrast2_1_uci=100*_contrast2_1_uci
(211 real changes made)

. 
. * Plot the survival curves
. twoway  (rarea _at1_lci _at1_uci timevar, color(blue%25)) ///
>                 (rarea _at2_lci _at2_uci timevar, color(red%25)) ///
>                  (line _at1 timevar, sort lcolor(blue)) ///
>                  (line _at2  timevar, sort lcolor(red)) ///
>                  , legend(order(1 "Non-current anticoagulant use" 2 "Current 
> anticoagulant use") ///
>                                  ring(0) cols(1) pos(4)) ///
>                  ylabel(0 (`yscale') `cum_ymax' ,angle(h) format(%4.2f)) ///
>                  ytitle("Cumulative incidence (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(adj_curves_`outcome' , replace)
(note: file adj_curves_covidtest.gph not found)
(file adj_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/adj_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/adj_curves_covidtest.svg not found)
(file /workspace/output/oac_tabfig/adj_curves_covidtest.svg written in SVG form
> at)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase adj_curves_`outcome'.gph

. 
. * Plot the difference in curves
. twoway  (rarea _contrast2_1_lci _contrast2_1_uci timevar, color(red%25)) ///
>                  (line _contrast2_1 timevar, sort lcolor(red)) ///
>                  , legend(off) ///
>                  ylabel(,angle(h) format(%4.2f)) ///
>                  ytitle("Difference in curves (%)") ///
>                  xtitle("Days from 1 March 2020") ///
>                                  saving(diff_curves_`outcome' , replace)
(note: file diff_curves_covidtest.gph not found)
(file diff_curves_covidtest.gph saved)

.                                  
. graph export "$tabfigdir/diff_curves_`outcome'.svg", as(svg) replace
(note: file /workspace/output/oac_tabfig/diff_curves_covidtest.svg not found)
(file /workspace/output/oac_tabfig/diff_curves_covidtest.svg written in SVG for
> mat)

. 
. * Close window 
. graph close

. 
. * Delete unneeded graphs
. erase diff_curves_`outcome'.gph          

.          
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/09a_an_models_plot_covidtest.log
  log type:  text
 closed on:  31 Dec 2020, 13:13:28
-------------------------------------------------------------------------------
