-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/oac_log/flow_chart_af_population.log
  log type:  text
 opened on:  31 Dec 2020, 02:39:11

. 
. /*
> # AF population
> registration_history AND
> af AND
> (age >=18 AND age <= 110) AND
> imd >0
> */
. safecount
  30,920,353

. drop if registration_history!=1
(9,042,521 observations deleted)

. safecount
  21,877,832

. keep if !missing(af)
(21,350,348 observations deleted)

. safecount
  527,484

. drop if age < 18 | age > 110
(167 observations deleted)

. safecount
  527,317

. keep if imd>0
(8,113 observations deleted)

. safecount
  519,204

. 
. log close
      name:  <unnamed>
       log:  /workspace/output/oac_log/flow_chart_af_population.log
  log type:  text
 closed on:  31 Dec 2020, 02:39:17
-------------------------------------------------------------------------------
