-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/post_hoc_3_af_oac_log/posthoc3_11a_an_models_ons
> coviddeath.log
  log type:  text
 opened on:  28 Jul 2021, 13:42:09

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Oral |   Failure/censoring
anticoagula |     indicator for
         nt |  outcome: ONS covid
  Treatment |         death
   Exposure |         0          1 |     Total
------------+----------------------+----------
    non-use |       116         34 |       150 
            |     77.33      22.67 |    100.00 
------------+----------------------+----------
current use |       239         92 |       331 
            |     72.21      27.79 |    100.00 
------------+----------------------+----------
      Total |       355        126 |       481 
            |     73.80      26.20 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. * Create new diabetes variable, group Diabetes, no hba1c with uncontrolled di
> abetes
. clonevar diab_control = diabcat

. recode diab_control 4=3
(diab_control: 1 changes made)

. 
. * DAG adjusted model (removed PAD, stroke/TIA, oestrogen because these parame
> ters cannot converge)
. stcox i.exposure i.male age1 age2 age3 i.imd ///        
>                                   i.obese4cat                       ///
>                                   i.smoke_nomiss                    ///
>                                   i.diab_control                        ///
>                                   i.myocardial_infarct          ///
>                                   i.hypertension                        ///  
>            
>                                   i.heart_failure                       ///  
>            
>                                   i.vte                     ///
>                                   i.antiplatelet            ///
>                                   i.flu_vaccine                         

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time first_positive_test_date
  enter on or after:  time first_positive_test_date
                 id:  patient_id

Iteration 0:   log likelihood =  -713.3138
Iteration 1:   log likelihood = -683.16409
Iteration 2:   log likelihood = -681.20657
Iteration 3:   log likelihood =  -681.0858
Iteration 4:   log likelihood = -681.08423
Iteration 5:   log likelihood = -681.08423
Refining estimates:
Iteration 0:   log likelihood = -681.08423

Cox regression -- Breslow method for ties

No. of subjects =          467                  Number of obs    =         467
No. of failures =          120
Time at risk    =        44161
                                                LR chi2(22)      =       64.46
Log likelihood  =   -681.08423                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
current use  |   1.219943   .2751386     0.88   0.378     .7840879     1.89808
      1.male |   1.127328   .5694638     0.24   0.812     .4188617    3.034103
        age1 |    1.06618   .0535843     1.28   0.202     .9661637     1.17655
        age2 |   1.064385   .0841307     0.79   0.430     .9116291    1.242736
        age3 |   .5325076   .2638232    -1.27   0.203     .2016556    1.406181
             |
         imd |
          2  |   1.034276   .3025854     0.12   0.908     .5829229     1.83511
          3  |   1.181905   .3481271     0.57   0.570     .6635341    2.105241
          4  |   .8105061   .2662899    -0.64   0.523     .4256925     1.54318
5 most de..  |   1.174101   .3300967     0.57   0.568     .6766924    2.037133
             |
   obese4cat |
Obese I ..)  |   1.517833   .4299748     1.47   0.141     .8711515    2.644564
Obese II..)  |   .7387344    .455243    -0.49   0.623     .2207688    2.471945
Obese II..)  |   2.154354   1.159641     1.43   0.154     .7501256    6.187283
             |
smoke_nomiss |
     Former  |   1.071273   .2289753     0.32   0.747     .7046336    1.628685
    Current  |   1.156523   .4645082     0.36   0.717     .5263519    2.541163
             |
diab_control |
Controlle..  |   1.536442   .8247096     0.80   0.424     .5365626    4.399589
Uncontrol..  |   1.270628   .8923497     0.34   0.733      .320795    5.032793
             |
1.myocardi~t |    1.31176   1.046078     0.34   0.734     .2748238    6.261156
1.hyperten~n |   .9205157   .4021039    -0.19   0.850     .3910258     2.16699
1.heart_f~re |   1.898596   .8869317     1.37   0.170     .7599633    4.743212
       1.vte |   1.533153   1.848685     0.35   0.723     .1442786     16.2918
1.antiplat~t |   .7574821   .3171691    -0.66   0.507     .3333969    1.721009
1.flu_vac~ne |   1.052001   .2374943     0.22   0.822     .6758547    1.637491
------------------------------------------------------------------------------

.                                   
. estimates save $tempdir/`outcome'_multivar2_correct, replace    
(note: file /workspace/output/post_hoc_3_af_oac_tempdata/onscoviddeath_multivar
> 2_correct.ster not found)
file /workspace/output/post_hoc_3_af_oac_tempdata/onscoviddeath_multivar2_corre
> ct.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_correct_parameter_`outcome'.tx
> t, write text replace
(note: file /workspace/output/post_hoc_3_af_oac_tabfig/table2_correct_parameter
> _onscoviddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab      ("DAG Adjusted") _tab _tab _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_multivar2_correct 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.219943   .2751386     0.88   0.378     .7840879     1.89808
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/post_hoc_3_af_oac_log/posthoc3_11a_an_models_ons
> coviddeath.log
  log type:  text
 closed on:  28 Jul 2021, 13:42:10
-------------------------------------------------------------------------------
