-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_covid
> test.log
  log type:  text
 opened on:  31 Dec 2020, 03:13:07

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             | outcome: first covid
 warfarin vs |         test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   236,786     23,750 |   260,536 
             |     90.88       9.12 |    100.00 
-------------+----------------------+----------
warfarin use |    81,493      6,506 |    87,999 
             |     92.61       7.39 |    100.00 
-------------+----------------------+----------
       Total |   318,279     30,256 |   348,535 
             |     91.32       8.68 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -384035.51
Iteration 1:   log likelihood = -383897.79
Iteration 2:   log likelihood = -383897.37
Iteration 3:   log likelihood = -383897.37
Refining estimates:
Iteration 0:   log likelihood = -383897.37

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =       30,256
Time at risk    =     69109173
                                                LR chi2(1)       =      276.30
Log likelihood  =   -383897.37                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7963289   .0111432   -16.28   0.000     .7747853    .8184715
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_univa
> r.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_univar.ster 
> saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -384035.51
Iteration 1:   log likelihood = -382537.38
Iteration 2:   log likelihood = -382425.99
Iteration 3:   log likelihood = -382425.44
Iteration 4:   log likelihood = -382425.44
Refining estimates:
Iteration 0:   log likelihood = -382425.44

Cox regression -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =       30,256
Time at risk    =     69109173
                                                LR chi2(5)       =     3220.15
Log likelihood  =   -382425.44                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7776682   .0109327   -17.89   0.000      .756533    .7993938
      1.male |   1.005421   .0118627     0.46   0.647     .9824374    1.028943
        age1 |   .9864673   .0020833    -6.45   0.000     .9823926     .990559
        age2 |   1.047754   .0040139    12.18   0.000     1.039916     1.05565
        age3 |   .9082084   .0223284    -3.92   0.000     .8654833    .9530427
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_multi
> var1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_multivar1.st
> er saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -155201.73
Iteration 1:   log likelihood =  -151571.4
Iteration 2:   log likelihood = -151113.31
Iteration 3:   log likelihood = -151112.54
Iteration 4:   log likelihood = -151112.54
Refining estimates:
Iteration 0:   log likelihood = -151112.54

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =       30,256
Time at risk    =     69109173
                                                LR chi2(26)      =     8178.38
Log likelihood  =   -151112.54                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7882414   .0114009   -16.45   0.000     .7662098    .8109064
      1.male |    1.00993   .0125116     0.80   0.425     .9857026    1.034752
        age1 |   .9863688   .0021352    -6.34   0.000     .9821927    .9905626
        age2 |   1.046296   .0040622    11.66   0.000     1.038365    1.054288
        age3 |   .8600714   .0213769    -6.06   0.000     .8191776    .9030066
             |
         imd |
          2  |   1.021933   .0209301     1.06   0.289     .9817236     1.06379
          3  |   1.052023    .021943     2.43   0.015     1.009883    1.095922
          4  |   1.077762   .0235278     3.43   0.001     1.032621    1.124877
5 most de..  |   1.186874   .0269834     7.54   0.000     1.135149    1.240957
             |
   obese4cat |
Obese I ..)  |   .9132021   .0142232    -5.83   0.000     .8857463     .941509
Obese II..)  |   .9888288   .0221619    -0.50   0.616     .9463325    1.033233
Obese II..)  |   1.015929   .0306072     0.52   0.600     .9576771    1.077725
             |
smoke_nomiss |
     Former  |   1.108969   .0142612     8.04   0.000     1.081367    1.137276
    Current  |   1.192521   .0322722     6.51   0.000     1.130917    1.257481
             |
     diabcat |
Controlle..  |   1.125072   .0161271     8.22   0.000     1.093903    1.157129
Uncontrol..  |   1.297092    .026552    12.71   0.000     1.246081    1.350191
Diabetes,..  |   1.005149   .1150863     0.04   0.964     .8031017    1.258028
             |
1.myocardi~t |   1.174057    .021382     8.81   0.000     1.132888    1.216722
       1.pad |   1.314779    .030256    11.89   0.000     1.256796    1.375438
1.hyperten~n |   1.013486   .0137232     0.99   0.323     .9869424    1.040743
1.heart_f~re |   1.271536   .0162658    18.78   0.000     1.240052     1.30382
1.stroke_tia |   1.165911   .0157138    11.39   0.000     1.135515     1.19712
       1.vte |   1.252577   .0247749    11.39   0.000     1.204949    1.302089
 1.oestrogen |   1.197968   .0951231     2.27   0.023     1.025314    1.399697
1.flu_vac~ne |   .9716862   .0147911    -1.89   0.059     .9431244    1.001113
1.care_ho~ce |   4.060937   .0901753    63.11   0.000     3.887988     4.24158
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_multi
> var2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_multivar2.st
> er saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  covidtest
   analysis time _t:  (stime_covidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -155201.73
Iteration 1:   log likelihood = -150354.83
Iteration 2:   log likelihood = -149602.74
Iteration 3:   log likelihood = -149601.55
Iteration 4:   log likelihood = -149601.55
Refining estimates:
Iteration 0:   log likelihood = -149601.55

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      348,530                  Number of obs    =     348,530
No. of failures =       30,256
Time at risk    =     69109173
                                                LR chi2(33)      =    11200.37
Log likelihood  =   -149601.55                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8439316   .0122568   -11.68   0.000     .8202475    .8682996
      1.male |   1.027987   .0127417     2.23   0.026     1.003314    1.053266
        age1 |   .9877092   .0021328    -5.73   0.000     .9835378    .9918982
        age2 |    1.03445    .004018     8.72   0.000     1.026605    1.042355
        age3 |   .9218836   .0229454    -3.27   0.001     .8779907    .9679708
             |
         imd |
          2  |   1.020065   .0209029     0.97   0.332      .979908    1.061868
          3  |   1.041315   .0217296     1.94   0.052     .9995851    1.084787
          4  |   1.059387   .0231529     2.64   0.008     1.014966    1.105752
5 most de..  |    1.14731   .0261413     6.03   0.000     1.097201    1.199707
             |
   obese4cat |
Obese I ..)  |    .920755   .0143575    -5.29   0.000     .8930405    .9493295
Obese II..)  |   .9906876   .0222293    -0.42   0.677     .9480631    1.035228
Obese II..)  |   1.012207   .0305221     0.40   0.687     .9541185    1.073832
             |
smoke_nomiss |
     Former  |   1.056803   .0138254     4.22   0.000      1.03005    1.084251
    Current  |    1.09425   .0302389     3.26   0.001     1.036559    1.155151
             |
     diabcat |
Controlle..  |   1.106001   .0158935     7.01   0.000     1.075285    1.137594
Uncontrol..  |   1.253923   .0257727    11.01   0.000     1.204413    1.305468
Diabetes,..  |   1.007191   .1152451     0.06   0.950     .8048507    1.260399
             |
1.myocardi~t |   1.141286   .0208108     7.25   0.000     1.101218    1.182812
       1.pad |    1.26329   .0291211    10.14   0.000     1.207484    1.321675
1.hyperten~n |   1.013592   .0137644     0.99   0.320     .9869704    1.040932
1.heart_f~re |   1.194297   .0155336    13.65   0.000     1.164237    1.225134
1.stroke_tia |   1.132207   .0152812     9.20   0.000     1.102649    1.162557
       1.vte |   1.169689   .0232201     7.90   0.000     1.125052    1.216096
 1.oestrogen |   1.117953   .0889713     1.40   0.161     .9564921    1.306669
1.flu_vac~ne |    .963209    .014729    -2.45   0.014     .9347689    .9925143
             |
         ckd |
        CKD  |   1.090253   .0141478     6.66   0.000     1.062873    1.118337
      1.copd |   1.225697   .0213506    11.68   0.000     1.184557    1.268266
1.other_re~y |   1.258496   .0283587    10.20   0.000     1.204124    1.315324
1.immunode~y |    1.26112   .0825622     3.54   0.000     1.109252    1.433779
    1.cancer |   1.241091   .0177509    15.10   0.000     1.206783    1.276375
1.ae_atten~r |   1.802433    .022313    47.59   0.000     1.759226      1.8467
1.gp_consult |   .8138302   .0318455    -5.26   0.000     .7537476     .878702
1.care_ho~ce |   3.847371   .0863925    60.00   0.000     3.681716    4.020478
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_multi
> var3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/covidtest_multivar3.st
> er saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table2_covidtest.
> txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7963289   .0111432   -16.28   0.000     .7747853    .8184715
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7776682   .0109327   -17.89   0.000      .756533    .7993938
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7882414   .0114009   -16.45   0.000     .7662098    .8109064
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8439316   .0122568   -11.68   0.000     .8202475    .8682996
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_covid
> test.log
  log type:  text
 closed on:  31 Dec 2020, 03:15:05
-------------------------------------------------------------------------------
