-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 opened on:   1 Mar 2021, 21:39:46

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ONS
 warfarin vs |    non-covid death
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   251,046     10,331 |   261,377 
             |     96.05       3.95 |    100.00 
-------------+----------------------+----------
warfarin use |    85,410      2,821 |    88,231 
             |     96.80       3.20 |    100.00 
-------------+----------------------+----------
       Total |   336,456     13,152 |   349,608 
             |     96.24       3.76 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -167523.68
Iteration 1:   log likelihood = -167468.19
Iteration 2:   log likelihood = -167468.03
Iteration 3:   log likelihood = -167468.03
Refining estimates:
Iteration 0:   log likelihood = -167468.03

Cox regression -- Breslow method for ties

No. of subjects =      349,603                  Number of obs    =     349,603
No. of failures =       13,152
Time at risk    =     71688452
                                                LR chi2(1)       =      111.31
Log likelihood  =   -167468.03                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8028402    .017055   -10.34   0.000     .7700993    .8369731
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_univar.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_univa
> r.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -167523.68
Iteration 1:   log likelihood = -165351.15
Iteration 2:   log likelihood = -163342.23
Iteration 3:   log likelihood = -163282.09
Iteration 4:   log likelihood = -163281.91
Iteration 5:   log likelihood = -163281.91
Refining estimates:
Iteration 0:   log likelihood = -163281.91

Cox regression -- Breslow method for ties

No. of subjects =      349,603                  Number of obs    =     349,603
No. of failures =       13,152
Time at risk    =     71688452
                                                LR chi2(5)       =     8483.54
Log likelihood  =   -163281.91                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7505394   .0160028   -13.46   0.000     .7198209     .782569
      1.male |   1.214328   .0216712    10.88   0.000     1.172588    1.257555
        age1 |   1.034688   .0067786     5.20   0.000     1.021487    1.048059
        age2 |   1.065074   .0100617     6.67   0.000     1.045535    1.084978
        age3 |   .8248729   .0410709    -3.87   0.000     .7481785    .9094291
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar1.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var1.ster saved

. 
. * DAG adjusted model
. stcox i.exposure i.male age1 age2 age3 $dagvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -68460.478
Iteration 1:   log likelihood = -63529.638
Iteration 2:   log likelihood = -62461.322
Iteration 3:   log likelihood = -62439.025
Iteration 4:   log likelihood = -62438.445
Iteration 5:   log likelihood = -62438.444
Refining estimates:
Iteration 0:   log likelihood = -62438.444

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      349,603                  Number of obs    =     349,603
No. of failures =       13,152
Time at risk    =     71688452
                                                LR chi2(26)      =    12044.07
Log likelihood  =   -62438.444                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7812647   .0172201   -11.20   0.000     .7482325    .8157551
      1.male |   1.204773   .0228274     9.83   0.000     1.160852    1.250355
        age1 |   1.044928   .0070108     6.55   0.000     1.031277     1.05876
        age2 |   1.052196   .0101507     5.27   0.000     1.032488    1.072281
        age3 |   .8160267    .041468    -4.00   0.000     .7386674    .9014878
             |
         imd |
          2  |   1.008598   .0317622     0.27   0.786     .9482275    1.072812
          3  |   1.059927   .0339658     1.82   0.069     .9954028    1.128634
          4  |   1.129726   .0377396     3.65   0.000     1.058127    1.206169
5 most de..  |   1.310812   .0459819     7.72   0.000     1.223717    1.404105
             |
   obese4cat |
Obese I ..)  |   .7760164   .0202656    -9.71   0.000      .737296    .8167703
Obese II..)  |   .8979686   .0353012    -2.74   0.006     .8313779     .969893
Obese II..)  |   1.202916   .0625995     3.55   0.000     1.086273    1.332084
             |
smoke_nomiss |
     Former  |    1.22929   .0246156    10.31   0.000     1.181979    1.278495
    Current  |   2.018008    .080287    17.65   0.000     1.866628    2.181666
             |
     diabcat |
Controlle..  |   1.184661   .0254843     7.88   0.000     1.135751    1.235677
Uncontrol..  |   1.431495   .0445583    11.52   0.000     1.346773    1.521547
Diabetes,..  |   1.101971   .1630343     0.66   0.512     .8245878    1.472664
             |
1.myocardi~t |   1.170447   .0302467     6.09   0.000      1.11264    1.231256
       1.pad |   1.411247   .0443337    10.97   0.000     1.326976    1.500871
1.hyperten~n |   1.088485   .0234007     3.94   0.000     1.043573    1.135329
1.heart_f~re |   1.681945   .0311165    28.10   0.000      1.62205    1.744051
1.stroke_tia |   1.208192   .0236988     9.64   0.000     1.162625    1.255546
       1.vte |   1.278169   .0368885     8.50   0.000     1.207876    1.352553
 1.oestrogen |   1.316395   .1650087     2.19   0.028     1.029648    1.682997
1.flu_vac~ne |   .7737461   .0173127   -11.46   0.000     .7405472    .8084335
1.care_ho~ce |    3.20382    .093043    40.09   0.000     3.026552    3.391471
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar2, replace    
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar2.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var2.ster saved

. 
. * Fully adjusted model
. stcox i.exposure i.male age1 age2 age3 $fullvarlist, strata(practice_id)

         failure _d:  onsnoncoviddeath
   analysis time _t:  (stime_onsnoncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -68460.478
Iteration 1:   log likelihood = -62374.921
Iteration 2:   log likelihood = -61106.998
Iteration 3:   log likelihood = -61085.423
Iteration 4:   log likelihood = -61084.925
Iteration 5:   log likelihood = -61084.924
Refining estimates:
Iteration 0:   log likelihood = -61084.924

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      349,603                  Number of obs    =     349,603
No. of failures =       13,152
Time at risk    =     71688452
                                                LR chi2(33)      =    14751.11
Log likelihood  =   -61084.924                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8651228   .0191864    -6.53   0.000     .8283238    .9035567
      1.male |   1.193944   .0226245     9.35   0.000     1.150414    1.239121
        age1 |    1.04282   .0069587     6.28   0.000      1.02927    1.056548
        age2 |   1.038082   .0099817     3.89   0.000     1.018702    1.057831
        age3 |    .898561   .0456163    -2.11   0.035     .8134587    .9925666
             |
         imd |
          2  |   1.005594   .0317402     0.18   0.860       .94527    1.069769
          3  |   1.045068   .0335572     1.37   0.170     .9813242    1.112953
          4  |   1.102748   .0369014     2.92   0.003     1.032744    1.177498
5 most de..  |   1.256015   .0442545     6.47   0.000     1.172205    1.345817
             |
   obese4cat |
Obese I ..)  |    .788619   .0206369    -9.07   0.000     .7491912    .8301219
Obese II..)  |   .9029496   .0355506    -2.59   0.010     .8358922    .9753865
Obese II..)  |   1.187165   .0618958     3.29   0.001     1.071844    1.314894
             |
smoke_nomiss |
     Former  |   1.142334    .023298     6.52   0.000     1.097571    1.188922
    Current  |   1.785349   .0728019    14.21   0.000     1.648213    1.933895
             |
     diabcat |
Controlle..  |   1.154941   .0249395     6.67   0.000     1.107081    1.204871
Uncontrol..  |   1.360994   .0425941     9.85   0.000      1.28002    1.447091
Diabetes,..  |   1.093669   .1617471     0.61   0.545     .8184616    1.461415
             |
1.myocardi~t |   1.129888   .0292637     4.72   0.000     1.073964    1.188725
       1.pad |    1.33682   .0421346     9.21   0.000     1.256737    1.422006
1.hyperten~n |   1.088948   .0234859     3.95   0.000     1.043876    1.135966
1.heart_f~re |   1.542921    .029062    23.02   0.000     1.486999    1.600946
1.stroke_tia |   1.160441   .0228326     7.56   0.000     1.116542    1.206066
       1.vte |   1.156512   .0335357     5.01   0.000     1.092617    1.224145
 1.oestrogen |   1.065677   .1341874     0.51   0.613     .8326153    1.363976
1.flu_vac~ne |   .7646978   .0172061   -11.92   0.000     .7317074    .7991757
             |
         ckd |
        CKD  |    1.11465   .0214286     5.65   0.000     1.073432    1.157451
      1.copd |   1.319807   .0333212    10.99   0.000     1.256088    1.386758
1.other_re~y |   1.449927   .0443718    12.14   0.000     1.365517    1.539555
1.immunode~y |   1.597335   .1478907     5.06   0.000     1.332253    1.915161
    1.cancer |   1.606902   .0319492    23.86   0.000     1.545487    1.670758
1.ae_atten~r |   2.077885   .0391457    38.82   0.000      2.00256    2.156043
1.gp_consult |   .7609924   .0396067    -5.25   0.000     .6871927    .8427177
1.care_ho~ce |   3.005994   .0884507    37.40   0.000     2.837538    3.184451
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. estimates save $tempdir/`outcome'_multivar3, replace
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeat
> h_multivar3.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/onsnoncoviddeath_multi
> var3.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table2_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table2_onsnoncovi
> ddeath.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 2: Association between current anticoagulant 
> use and `outcome' - $population Population") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted") _tab _tab //
> /
>                                                 ("Fully adjusted") _tab _tab 
> _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. /* Counts */
.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         qui su total_follow_up if exposure == 0

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         qui su total_follow_up if exposure == 1

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8028402    .017055   -10.34   0.000     .7700993    .8369731
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7505394   .0160028   -13.46   0.000     .7198209     .782569
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2  

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7812647   .0172201   -11.20   0.000     .7482325    .8157551
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8651228   .0191864    -6.53   0.000     .8283238    .9035567
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/05b_an_models_onsno
> ncoviddeath.log
  log type:  text
 closed on:   1 Mar 2021, 21:41:50
-------------------------------------------------------------------------------
