-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/06b_an_models_ethni
> city_positivecovidtest.log
  log type:  text
 opened on:  31 Dec 2020, 03:18:09

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset_STSET_`outcome', clear

. 
. /* Restrict population=======================================================
> =*/ 
. 
. preserve 

. drop if ethnicity == .u
(91,960 observations deleted)

. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. safetab exposure `outcome', missing row
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Failure/censoring
             |     indicator for
             |    outcome: first
 warfarin vs |  positive covid test
       DOACs |         0          1 |     Total
-------------+----------------------+----------
    DOAC use |   189,308      2,723 |   192,031 
             |     98.58       1.42 |    100.00 
-------------+----------------------+----------
warfarin use |    63,890        654 |    64,544 
             |     98.99       1.01 |    100.00 
-------------+----------------------+----------
       Total |   253,198      3,377 |   256,575 
             |     98.68       1.32 |    100.00 

. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.exposure 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -41984.945
Iteration 1:   log likelihood = -41951.893
Iteration 2:   log likelihood = -41951.659
Iteration 3:   log likelihood = -41951.659
Refining estimates:
Iteration 0:   log likelihood = -41951.659

Cox regression -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        3,377
Time at risk    =   52379298.5
                                                LR chi2(1)       =       66.57
Log likelihood  =   -41951.659                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7093359   .0308891    -7.89   0.000      .651306    .7725361
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_univar_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_univar_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_univ
> ar_ethn.ster saved

. 
. /* Multivariable models */ 
. 
. * Age and Gender 
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.exposure i.male age1 age2 age3 

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -41984.945
Iteration 1:   log likelihood = -41474.591
Iteration 2:   log likelihood = -41377.724
Iteration 3:   log likelihood = -41375.854
Iteration 4:   log likelihood = -41375.853
Refining estimates:
Iteration 0:   log likelihood = -41375.853

Cox regression -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        3,377
Time at risk    =   52379298.5
                                                LR chi2(5)       =     1218.18
Log likelihood  =   -41375.853                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |      .6665    .029142    -9.28   0.000     .6117617     .726136
      1.male |   1.192971   .0421842     4.99   0.000     1.113092    1.278583
        age1 |   .9645295   .0064026    -5.44   0.000     .9520618    .9771604
        age2 |   1.145732   .0138324    11.27   0.000     1.118939    1.173166
        age3 |   .5526558   .0416284    -7.87   0.000     .4768026    .6405762
------------------------------------------------------------------------------

. estimates save $tempdir/`outcome'_multivar1_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar1_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar1_ethn.ster saved

. 
. * DAG adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3  $dagvarlist   ///
>                                                                              
>    i.ethnicity, strata(practice_id)        

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16300.874
Iteration 1:   log likelihood = -15286.982
Iteration 2:   log likelihood = -14931.652
Iteration 3:   log likelihood = -14930.219
Iteration 4:   log likelihood = -14930.219
Refining estimates:
Iteration 0:   log likelihood = -14930.219

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        3,377
Time at risk    =   52379298.5
                                                LR chi2(30)      =     2741.31
Log likelihood  =   -14930.219                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |    .750398   .0341059    -6.32   0.000     .6864425    .8203122
      1.male |    1.27782   .0483048     6.49   0.000     1.186566    1.376091
        age1 |   .9700593   .0067557    -4.36   0.000     .9569083     .983391
        age2 |   1.139921   .0142348    10.49   0.000      1.11236    1.168165
        age3 |   .5041057   .0390097    -8.85   0.000     .4331638    .5866661
             |
         imd |
          2  |   1.091712   .0738886     1.30   0.195     .9560878    1.246576
          3  |   1.242606   .0834656     3.23   0.001     1.089328    1.417453
          4  |   1.292082   .0905899     3.65   0.000     1.126188    1.482413
5 most de..  |   1.439607   .1018824     5.15   0.000     1.253152    1.653805
             |
   obese4cat |
Obese I ..)  |   1.009597   .0475452     0.20   0.839     .9205814     1.10722
Obese II..)  |   1.275142   .0838961     3.69   0.000     1.120869    1.450648
Obese II..)  |   1.360479   .1241435     3.37   0.001     1.137679    1.626911
             |
smoke_nomiss |
     Former  |   1.189134   .0468597     4.40   0.000     1.100748    1.284618
    Current  |   1.021342   .0941971     0.23   0.819     .8524438    1.223704
             |
     diabcat |
Controlle..  |   1.180691   .0498838     3.93   0.000     1.086859    1.282623
Uncontrol..  |   1.494528    .087434     6.87   0.000      1.33262    1.676107
Diabetes,..  |   .9412227   .3036577    -0.19   0.851     .5001236    1.771363
             |
1.myocardi~t |   1.158604   .0606247     2.81   0.005     1.045672    1.283733
       1.pad |   1.427248   .0920752     5.51   0.000     1.257727    1.619618
1.hyperten~n |   1.020894   .0436649     0.48   0.629     .9388009    1.110165
1.heart_f~re |    1.23521   .0468861     5.57   0.000      1.14665     1.33061
1.stroke_tia |   1.184269   .0467487     4.28   0.000     1.096098    1.279532
       1.vte |   1.373419    .076681     5.68   0.000     1.231058    1.532243
 1.oestrogen |   1.041265   .2843251     0.15   0.882     .6097252    1.778231
1.flu_vac~ne |   .8299307   .0374233    -4.13   0.000     .7597302     .906618
1.care_ho~ce |   6.970937   .3586425    37.74   0.000     6.302289    7.710526
             |
   ethnicity |
      Mixed  |   1.027661   .3237189     0.09   0.931     .5542642    1.905387
Asian or ..  |   1.349181   .1802796     2.24   0.025      1.03832     1.75311
      Black  |   1.390824   .2568836     1.79   0.074     .9684028    1.997506
      Other  |   1.330121   .3052339     1.24   0.214     .8483186    2.085564
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar2_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar2_ethn.ster saved

. 
. * DAG adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $dagvarlist , strata(practice_id)     
>    

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16300.874
Iteration 1:   log likelihood = -15289.737
Iteration 2:   log likelihood = -14935.655
Iteration 3:   log likelihood = -14934.237
Iteration 4:   log likelihood = -14934.237
Refining estimates:
Iteration 0:   log likelihood = -14934.237

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        3,377
Time at risk    =   52379298.5
                                                LR chi2(26)      =     2733.28
Log likelihood  =   -14934.237                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .7488513   .0340288    -6.36   0.000     .6850399    .8186068
      1.male |   1.276461   .0482438     6.46   0.000     1.185322    1.374607
        age1 |   .9693017     .00675    -4.48   0.000     .9561617    .9826222
        age2 |   1.140972   .0142501    10.56   0.000     1.113381    1.169246
        age3 |    .501721   .0388306    -8.91   0.000     .4311056    .5839033
             |
         imd |
          2  |   1.091765   .0738826     1.30   0.195       .95615    1.246614
          3  |   1.243268   .0834895     3.24   0.001     1.089943    1.418162
          4  |   1.292975   .0906329     3.67   0.000     1.127001    1.483394
5 most de..  |   1.444032   .1021511     5.19   0.000     1.257079    1.658789
             |
   obese4cat |
Obese I ..)  |    1.00919   .0475215     0.19   0.846     .9202187    1.106764
Obese II..)  |   1.271916   .0836698     3.66   0.000     1.118058    1.446947
Obese II..)  |   1.351175   .1232468     3.30   0.001     1.129977    1.615674
             |
smoke_nomiss |
     Former  |   1.179601   .0462869     4.21   0.000     1.092281    1.273901
    Current  |   1.010538   .0930933     0.11   0.909     .8436021    1.210507
             |
     diabcat |
Controlle..  |   1.188693   .0501131     4.10   0.000     1.094421    1.291084
Uncontrol..  |   1.509361   .0880742     7.06   0.000     1.346244    1.692241
Diabetes,..  |   .9489229    .306162    -0.16   0.871     .5041942    1.785928
             |
1.myocardi~t |   1.162999    .060782     2.89   0.004     1.049767    1.288445
       1.pad |   1.426122   .0919902     5.50   0.000     1.256756    1.618313
1.hyperten~n |   1.022731   .0437314     0.53   0.599      .940512    1.112137
1.heart_f~re |   1.236159   .0469123     5.59   0.000     1.147549    1.331612
1.stroke_tia |   1.186243   .0468249     4.33   0.000     1.097928    1.281661
       1.vte |   1.371976   .0765817     5.67   0.000     1.229798    1.530592
 1.oestrogen |   1.036563   .2830242     0.13   0.895     .6069915    1.770144
1.flu_vac~ne |    .829343   .0373785    -4.15   0.000     .7592251    .9059366
1.care_ho~ce |   6.937397   .3567311    37.67   0.000     6.272295    7.673024
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar2_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar2_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar2_withoutethn.ster saved

. 
. * Fully adjusted WITH ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist   ///
>                                                                            i.
> ethnicity, strata(practice_id)             

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16300.874
Iteration 1:   log likelihood = -15078.783
Iteration 2:   log likelihood = -14674.586
Iteration 3:   log likelihood = -14672.989
Iteration 4:   log likelihood = -14672.989
Refining estimates:
Iteration 0:   log likelihood = -14672.989

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        3,377
Time at risk    =   52379298.5
                                                LR chi2(37)      =     3255.77
Log likelihood  =   -14672.989                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8201836   .0374596    -4.34   0.000     .7499542    .8969895
      1.male |   1.304485   .0493526     7.03   0.000     1.211255    1.404891
        age1 |   .9726875   .0067668    -3.98   0.000     .9595147    .9860411
        age2 |   1.122701   .0140508     9.25   0.000     1.095497    1.150581
        age3 |   .5482045   .0425876    -7.74   0.000     .4707784    .6383644
             |
         imd |
          2  |   1.081464   .0733331     1.15   0.248     .9468752    1.235183
          3  |   1.221519   .0821142     2.98   0.003      1.07073    1.393544
          4  |   1.251082   .0879055     3.19   0.001     1.090127    1.435801
5 most de..  |   1.365204   .0968688     4.39   0.000     1.187955    1.568899
             |
   obese4cat |
Obese I ..)  |   1.012762   .0478436     0.27   0.788     .9232006    1.111012
Obese II..)  |   1.271235   .0838704     3.64   0.000     1.117037     1.44672
Obese II..)  |   1.324416   .1210014     3.08   0.002     1.107279    1.584134
             |
smoke_nomiss |
     Former  |   1.121145   .0450528     2.85   0.004     1.036231    1.213018
    Current  |   .9066822   .0850719    -1.04   0.296     .7543776    1.089736
             |
     diabcat |
Controlle..  |   1.166304   .0495067     3.62   0.000     1.073199    1.267486
Uncontrol..  |   1.423085   .0838293     5.99   0.000     1.267913    1.597248
Diabetes,..  |   .9455981   .3049096    -0.17   0.862     .5026148    1.779008
             |
1.myocardi~t |   1.110076   .0581969     1.99   0.046     1.001677    1.230206
       1.pad |   1.362356   .0879366     4.79   0.000      1.20046    1.546085
1.hyperten~n |   1.015686   .0436702     0.36   0.717     .9336014    1.104988
1.heart_f~re |    1.12843   .0436248     3.13   0.002     1.046086    1.217256
1.stroke_tia |   1.134392    .044837     3.19   0.001     1.049831    1.225765
       1.vte |   1.272174   .0714035     4.29   0.000     1.139649     1.42011
 1.oestrogen |   1.014691   .2780621     0.05   0.958     .5930255    1.736176
1.flu_vac~ne |   .8366056   .0379776    -3.93   0.000      .765386    .9144522
             |
         ckd |
        CKD  |   1.159285   .0446701     3.84   0.000     1.074958    1.250228
      1.copd |   1.298588   .0655602     5.18   0.000     1.176245    1.433656
1.other_re~y |   1.209218   .0767745     2.99   0.003     1.067728    1.369456
1.immunode~y |    1.07184   .2399434     0.31   0.757     .6911605    1.662191
    1.cancer |   1.040521   .0465513     0.89   0.375      .953168     1.13588
1.ae_atten~r |   2.130201   .0795343    20.25   0.000     1.979884    2.291931
1.gp_consult |   .6538186   .0630339    -4.41   0.000     .5412449    .7898064
1.care_ho~ce |   6.320917   .3311133    35.20   0.000     5.704151    7.004372
             |
   ethnicity |
      Mixed  |   1.050292   .3303552     0.16   0.876     .5669906    1.945557
Asian or ..  |   1.330443   .1788058     2.12   0.034     1.022347    1.731387
      Black  |   1.397009    .258002     1.81   0.070      .972742    2.006321
      Other  |   1.287362   .2967795     1.10   0.273     .8193518    2.022696
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_ethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar3_ethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar3_ethn.ster saved

. 
. * Fully adjusted WITHOUT ETHNICITY
. stcox i.exposure i.male age1 age2 age3 $fullvarlist , strata(practice_id)    
>            

         failure _d:  positivecovidtest
   analysis time _t:  (stime_positivecovidtest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -16300.874
Iteration 1:   log likelihood = -15081.261
Iteration 2:   log likelihood = -14678.298
Iteration 3:   log likelihood =  -14676.72
Iteration 4:   log likelihood =  -14676.72
Refining estimates:
Iteration 0:   log likelihood =  -14676.72

Stratified Cox regr. -- Breslow method for ties

No. of subjects =      256,571                  Number of obs    =     256,571
No. of failures =        3,377
Time at risk    =   52379298.5
                                                LR chi2(33)      =     3248.31
Log likelihood  =    -14676.72                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    exposure |
warfarin ..  |   .8186493   .0373832    -4.38   0.000     .7485628    .8952978
      1.male |    1.30381   .0493197     7.01   0.000     1.210642    1.404148
        age1 |   .9719549   .0067614    -4.09   0.000     .9587927    .9852977
        age2 |   1.123669   .0140658     9.31   0.000     1.096436    1.151579
        age3 |   .5457638   .0424045    -7.79   0.000     .4686713    .6355373
             |
         imd |
          2  |   1.081113   .0732978     1.15   0.250     .9465877    1.234756
          3  |    1.22195   .0821215     2.98   0.003     1.071145    1.393987
          4  |   1.251437   .0879145     3.19   0.001     1.090464    1.436173
5 most de..  |   1.368833   .0970864     4.43   0.000     1.191181    1.572979
             |
   obese4cat |
Obese I ..)  |   1.012527    .047827     0.26   0.792      .922996    1.110742
Obese II..)  |   1.267912   .0836373     3.60   0.000      1.11414    1.442906
Obese II..)  |   1.316416   .1202214     3.01   0.003      1.10067     1.57445
             |
smoke_nomiss |
     Former  |   1.112394   .0445225     2.66   0.008     1.028467    1.203171
    Current  |   .8972377   .0841011    -1.16   0.247     .7466577    1.078185
             |
     diabcat |
Controlle..  |   1.173668   .0497214     3.78   0.000     1.080151     1.27528
Uncontrol..  |   1.436609   .0844098     6.17   0.000     1.280339    1.611951
Diabetes,..  |   .9509248   .3066781    -0.16   0.876     .5053932    1.789217
             |
1.myocardi~t |   1.113565   .0583165     2.05   0.040     1.004937    1.233936
       1.pad |   1.361664   .0878734     4.78   0.000     1.199882    1.545258
1.hyperten~n |    1.01749   .0437366     0.40   0.687     .9352796    1.106927
1.heart_f~re |   1.129244    .043644     3.14   0.002     1.046863    1.218108
1.stroke_tia |   1.136181    .044905     3.23   0.001     1.051491    1.227691
       1.vte |   1.271397   .0713398     4.28   0.000     1.138988    1.419199
 1.oestrogen |   1.010709   .2769587     0.04   0.969     .5907128    1.729322
1.flu_vac~ne |   .8358495   .0379208    -3.95   0.000     .7647347    .9135774
             |
         ckd |
        CKD  |   1.160453   .0447185     3.86   0.000     1.076034    1.251494
      1.copd |   1.297033   .0654747     5.15   0.000     1.174849    1.431924
1.other_re~y |   1.208547   .0767223     2.98   0.003     1.067153    1.368676
1.immunode~y |   1.067613   .2390827     0.29   0.770     .6883264    1.655896
    1.cancer |   1.037852   .0464136     0.83   0.406     .9507555    1.132927
1.ae_atten~r |   2.132651   .0796227    20.29   0.000     1.982166     2.29456
1.gp_consult |   .6557874   .0632516    -4.37   0.000     .5428296    .7922507
1.care_ho~ce |   6.292029   .3294389    35.13   0.000     5.678366     6.97201
------------------------------------------------------------------------------
                                                     Stratified by practice_id

.                                                                              
>    
. estimates save $tempdir/`outcome'_multivar3_withoutethn, replace 
(note: file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidte
> st_multivar3_withoutethn.ster not found)
file /workspace/output/warfarin_tempdata/sens_analysis_1/positivecovidtest_mult
> ivar3_withoutethn.ster saved

. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. cap file close tablecontent

. file open tablecontent using $tabfigdir/table3_`outcome'.txt, write text repl
> ace
(note: file /workspace/output/warfarin_tabfig/sens_analysis_1/table3_positiveco
> vidtest.txt not found)

. 
. * Column headings 
. file write tablecontent ("Table 3: Association between current anticoagulant 
> use and `outcome' - $population Population, restrict to known ethnicity") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Univariable") _tab _tab ("Age/Sex Adjusted") 
> _tab _tab ///
>                                                 ("DAG Adjusted with ethnicity
> ") _tab _tab ///
>                                                 ("DAG Adjusted without ethnic
> ity") _tab _tab ///
>                                                 ("Fully Adjusted with ethnici
> ty") _tab _tab ///
>                                                 ("Fully Adjusted without ethn
> icity") _tab _tab ///
>                                                 _n

. file write tablecontent _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab ("HR"
> ) _tab ///
>                                                 ("95% CI") _tab ("HR") _tab (
> "95% CI") _tab ///
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _tab /
> //
>                                                 ("HR") _tab ("95% CI") _n

. file write tablecontent ("Main Analysis") _n                                 
>    

. 
. * Row headings 
. local lab0: label exposure 0

. local lab1: label exposure 1

.  
. * First row, exposure = 0 (reference)
. 
.         qui safecount if exposure == 0 & `outcome' == 1

.         local event = r(N)

.     bysort exposure: egen total_follow_up = total(_t)

.         su total_follow_up if exposure == 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    192,031    3.91e+07           0   3.91e+07   3.91e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         
.         file write tablecontent ("`lab0'") _tab

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") ///
>         _tab _tab ("1.00 (ref)") _tab _tab ("1.00 (ref)") _n

.         
. * Second row, exposure = 1 
. 
. file write tablecontent ("`lab1'") _tab  

. 
.         qui safecount if exposure == 1 & `outcome' == 1

.         local event = r(N)

.         su total_follow_up if exposure == 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     64,544    1.33e+07           0   1.33e+07   1.33e+07

.         local person_week = r(mean)/7

.         local rate = 1000*(`event'/`person_week')

.         file write tablecontent (`event') _tab %10.0f (`person_week') _tab %3
> .2f (`rate') _tab

. 
. /* Main Model */ 
. estimates use $tempdir/`outcome'_univar_ethn 

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7093359   .0308891    -7.89   0.000      .651306    .7725361
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar1_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |      .6665    .029142    -9.28   0.000     .6117617     .726136
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar2_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .750398   .0341059    -6.32   0.000     .6864425    .8203122
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar2_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7488513   .0340288    -6.36   0.000     .6850399    .8186068
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab

. 
. estimates use $tempdir/`outcome'_multivar3_ethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8201836   .0374596    -4.34   0.000     .7499542    .8969895
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _tab 

. 
. estimates use $tempdir/`outcome'_multivar3_withoutethn

. lincom 1.exposure, eform

 ( 1)  1.exposure = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8186493   .0373832    -4.38   0.000     .7485628    .8952978
------------------------------------------------------------------------------

. file write tablecontent %4.2f (r(estimate)) _tab %4.2f (r(lb)) (" - ") %4.2f 
> (r(ub)) _n 

. 
. file write tablecontent _n

. file close tablecontent

. 
. restore 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/output/warfarin_log/sens_analysis_1/06b_an_models_ethni
> city_positivecovidtest.log
  log type:  text
 closed on:  31 Dec 2020, 03:20:32
-------------------------------------------------------------------------------
